{
  "local_path": "C:\\Users\\salmo\\Documents\\GitHub\\AlbumExplore\\ProgArchives Data\\Website\\ProgArchives\\www.progarchives.com\\artist373c.html",
  "name": "RETURN TO FOREVER",
  "genre": "Jazz Rock/Fusion",
  "country": "United States",
  "biography": "Founded in NYC, USA in 1972 - Disbanded in 1978 - Reformed  briefly in 1983 & 2008 - Active Live since 2012\n\nRETURN TO FOREVER was jazz keyboard player\n\nChick COREA\n\n's jazz-rock fusion band of the 1970s. Like WEATHER REPORT and the MAHAVISHNU ORCHESTRA, it was a group formed by an alumnus of Miles Davis' late-'60s bands with the intention of furthering the jazz-rock hybrid Davis had explored on albums like Bitches Brew. At the time, this was seen as a means of creativity, a new direction for jazz, and as a way of attracting the kinds of large audiences enjoyed by rock musicians. RETURN TO FOREVER started out as more of a Latin-tinged jazz ensemble, but COREA, influenced by the MAHAVISHNU ORCHESTRA of John McLaughlin and some of the progressive rock bands coming out of Great Britain, notably YES and EMERSON, LAKE & PALMER, moved the group more toward rock, achieving considerable commercial success. A later re-orientation of the band gave it more of a big band style before COREA folded the unit, retaining the RETURN TO FOREVER name for occasional other projects. COREA formed RETURN TO FOREVER in the fall of 1971 while he was working in STAN GETZ's band, and the two groups shared some members. In addition to COREA on keyboards, the initial lineup featured\n\nStanley CLARKE\n\non bass, Joe Farrell on reeds, and the Brazilian husband-and-wife team of percussionist Airto Moreira and singer Flora Purim. \"Return to Forever\" was the name of the first tune COREA wrote for the outfit, and he then adapted it as the group's name. The band made its debut at the Village Vanguard nightclub in New York City in November 1971.\n\nIn February 1972, they recorded their first self-titled album, though it was not released on ECM in Europe until the following year and did not appear in the U.S. until 1975. COREA, Clarke, and Moreira, all of whom had been playing with GETZ, left his band to concentrate on RETURN TO FOREVER.\n\nThe band toured Japan and recorded a second album, \"Light as a Feather\", in London, using some of the songs COREA had written and recorded with GETZ, such as \"500 Miles High\" and \"Spain.\" It was released on Polydor Records. Up to this point, RETURN TO FOREVER was more notable for its Latin sound than for fusion, but when Farrell left in the spring of 1973, COREA replaced him with a rock guitarist,\n\nBill CONNORS\n\nfrom SPIRAL STAIRCASE. Moreira and Purim also left to form their own group, and COREA brought in drummer Steve Gadd and percussionist Mingo Lewis, unveiling the new lineup at the New York City nightclub the Bitter End in April. They then cut a new album, but when it became apparent that Gadd, a successful session musician, wasn't interested in touring, COREA replaced him with Lenny White of the rock band AZTECA, who changed the sound sufficiently that the band went back into the studio in August 1973 and rebut the album, which was released in October under the title \"Hymn of the Seventh Galaxy\". Here, RETURN TO FOREVER turned decisively towards progressive rock and fusion, with COREA employing an extensive set of synthesizers. The result was crossover commercial success; the album spent several months in the pop charts.\n\nIn 1974, Connors left the group and was replaced initially by Earl Klugh, though only for a tour. The permanent replacement was 19-year-old Al DiMeola, who left the Berklee School of Music to join the band. That summer, RETURN TO FOREVER recorded its fourth album, \"Where Have I Known You Before\", which was released in September. Backed by an extensive tour that ran through December and closed at Carnegie Hall, the album reached the pop Top 40 and remained in the charts more than five months. The band went back into the studio in January 1975 and quickly cut its fifth album, \"No Mystery\", which was released in February. It too made the Top 40, though it charted for only three months. It also won the 1975 Grammy Award for Best Jazz Performance by a Group. COREA signed RETURN TO FOREVER to Columbia Records, while remaining at Polydor as a solo artist. \"Romantic Warrior\", a concept album on medieval themes, was the first RETURN TO FOREVER album not to be co-billed to COREA on the original LP. Released in March 1976, it became the band's third consecutive Top 40 hit and went on to become its biggest seller, eventually earning a gold record. But with its completion, COREA again changed stylistic direction and disbanded the lineup.\n\nRetaining Clarke as always, COREA immediately reformed RETURN TO FOREVER, adding his wife, Gayle Moran, formerly of the MAHAVISHNU ORCHESTRA, on vocals and keyboards returning member Joe Farrell, and drummer Gerry Brown, along with a horn section consisting of trumpeters John Thomas and James Tinsley, and trombonists Jim Pugh and Harold Garrett. With this personnel, RETURN TO FOREVER recorded its seventh album, \"Musicmagic\", which was released in March 1977. It became the band's fourth consecutive Top 40 album, spending more than four months in the charts. A third trombonist, Ron Moss, was added for the tour. On May 20-21, 1977, Return to Forever recorded a live album at the Palladium theater in New York City, but COREA disbanded the group permanently after the tour.\n\n\"Return to Forever Live\" was released in February 1979, when it spent a month in the charts. (This was the single LP version; the show was also released as a triple LP, Live: The Complete Concert, which was later reissued as a double CD, Live.) In 1983, COREA reassembled Clarke, DiMeola, and White for a tour.\n\nCOREA Clarke, DiMeola and White agreed to a reunion as RETURN TO FOREVER at the end of 2007, and then toured the world in 2008 mostly greeted by large audiences. A double live CD \"Return\" and two live DVDs were released in 2009. The latest news is that COREA, CLARKE and White are joining forces wth Bill Connors (and Chaka Khan), with at least one gig planned to be staged in Hollywood, September 2009 - apparently this line-up will use the RETURN TO FOREVER name.\n\nRETURN TO FOREVER ultimately came to be viewed as a chapter in the career of Chick COREA who was sometimes given sole credit on CD reissues of its albums. In its time, it rose and fell according to the popular and critical response to jazz fusion in general, gaining accolades and healthy sales early on, but suffering from the backlash that all progressive jazz endured after the 1970s, when musical trends turned conservative and the remnants of jazz-rock mutated into smooth contemporary jazz. Also, it has fallen between stools in terms of music criticism, with hidebound jazz critics dismissing it as too much like rock music, while rock critics think of it as a jazz group. As such, there is a tendency to undervalue the band's real musical accomplishments, which however, remain available to be heard on the records.\n\n: : : David Afonso, PORTUGAL : : :",
  "albums": [
    {
      "title": "No Mystery",
      "local_path": "albumd5fd.html",
      "year": 1975,
      "rating": 3.84,
      "type": "Studio Album"
    },
    {
      "title": "Romantic Warrior",
      "local_path": "albume6f7.html",
      "year": 1976,
      "rating": 4.29,
      "type": "Studio Album"
    },
    {
      "title": "Music Magic",
      "local_path": "albumc0cb.html",
      "year": 1977,
      "rating": 2.87,
      "type": "Studio Album"
    },
    {
      "title": "The Mothership Returns",
      "local_path": "album4606.html",
      "year": 2012,
      "rating": 4.53,
      "type": "Live Album"
    },
    {
      "title": "Live at Montreux 2008",
      "local_path": "album0cb6.html",
      "year": 2008,
      "rating": 4.6,
      "type": "Video/DVD"
    },
    {
      "title": "The Definitive Collection",
      "local_path": "album038e.html",
      "year": 2008,
      "rating": 3.0,
      "type": "Compilation"
    }
  ],
  "scraped_at": "2025-05-18T00:26:54.417599"
}