{
  "album_title": "BANCO DEL MUTUO SOCCORSO",
  "artist_name": "Banco Del Mutuo Soccorso",
  "artist_page_link_local": "artistf62c.html?id=36",
  "year": 1972,
  "rating_value": 4.31,
  "rating_count": null,
  "review_count": null,
  "genre": "Rock Progressivo Italiano",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/36/cover_696652016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "In Volo",
      "duration": "2:13",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "R.I.P. (Requiescant In Pace)",
      "duration": "6:40",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Passaggio",
      "duration": "1:19",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Metamorfosi",
      "duration": "10:52",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Il Giardino Del Mago",
      "duration": "18:26",
      "is_sub_track": false
    },
    {
      "number": "a",
      "title": ") ... Passo Dopo Passo ...",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "b",
      "title": ") ... Chi Ride E Chi Geme ...",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "c",
      "title": ") ... Coi Capelli Sciolti Al Vento ...",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "d",
      "title": ") Compenetrazione",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 6,
      "title": "Traccia",
      "duration": "2:10",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "loserboy",
      "date": "Posted Sunday, March 21, 2004",
      "rating": 5,
      "text": "BANCO's first album would clearly be in my opinion one of the finest releases from the 70's. BANCO play a highly expressive and soulful classical progressive rock with great sophistication and romanticism. I would have to say that the opening track \"R.I.P (Requiescant In Pace)\" would be one of the most brilliant tracks in my collection. What always stands out for me on this album is the clearly accentuated piano/keyboards which seems to bring so much to the album. Although the album does have its more laid back sections, in classic BANCO style they still do break out into some pretty wild progressive rock moments. One of the other small things which I have always loved about this album is their rare but clever use of sound effects. For those who may be unfamiliar with the Italian progressive rock scene may want to consider starting here."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Thursday, April 1, 2004",
      "rating": 4,
      "text": "Another classic, containing their most popular track \"R.I.P\", but above all the fantastic \"Il Giardino del Mago\" and \"Metamorfosi\", which are regarded as classic \"prog-gems\" within the 70's Progressive scene in Italy.Recommended!!"
    },
    {
      "reviewer": "Fitzcarraldo",
      "date": "Posted Friday, May 7, 2004",
      "rating": 3,
      "text": "A very good debut album from an Italian band with an unusual, slightly avant-garde, sound. The album introduces the extremely competent keyboard skills of the two Nocenzi brothers.The most melodic and exciting track is 'RIP', a real foot-tapper at the beginning and then turning into a rich wave of sound, with Francesco Di Giacomo belting out the vocals. He does sound like he should be singing opera instead of rock though.'Passaggio' is a short dabble on what sounds like a harpsichord or spinet (instruments not mentioned on the CD liner notes).'Metamorfosi' is also very good, with electric organ 'metamorphosing' into some very competent piano playing, and back into some great Progressive Rock.'Il Giardino Del Mago' (the wizard's garden) is very long and has distinct parts with different tempos and feel, some of it very frenetic keyboard playing of staccato, repetitive note sequences that are not particularly musically sophisticated in my opinion (somewhat of a BANCO trait).The final track 'Traccia' is very good: starting off with fast, repetitive piano but picking up percussion and other instruments along the way and turning into bombastic medieval-sounding music to which I can picture a big public procession marching.Possibly less interesting than later BANCO albums, this is nonetheless very good and, although I'm being hard in giving it 3 stars (Good, but non-essential), I wouldn't dream of not having it in my collection. But if you want only one or two examples of BANCO, you could do better than this."
    },
    {
      "reviewer": "Proghead",
      "date": "Posted Saturday, July 17, 2004",
      "rating": 4,
      "text": "Debut by one of the great Italian prog rock bands. Unfortunately I find this debut a bit overrated. For one thing the production is pretty lousy, and Franco di Giacomo's singing seems a bit overbearing, but the album isn't bad, although some of the material here was greatly improved when re-recorded for their 1975 album just called \"Banco\" (which was their first international release). \"In Volo\" is a nice, medieval-influenced piece dominated by recorders and some strange sound effects. \"R.I.P. (Requiescant in Pace)\" is regarded as one of the album's high points. Lots of piano and even some synthesizer (the synths here are nothing to write home about, compared to their next releases). \"Passagio\" is a short harpsichord interlude before coming to \"Metamorfosi\", which is largely instrumental, dominated by the organ of Vittorio Nocenzi and piano of his brother Gianni. Then you have the 18 minute \"Il Giardino del Mago\" which has some really intense moments, although there are some slow parts that needed to be thrown out. Then the album ends with \"Traccia\" complete with \"la la\" choruses. In my opinion, this album has excellent material, but their next two albums, \"Darwin!\" and \"Io Sono Nato Libero\" are the albums to get first."
    },
    {
      "reviewer": "belz",
      "date": "Posted Sunday, February 6, 2005",
      "rating": 4,
      "text": "4.3/5.0This album is rather strange... and beautiful. Somehow harmonious and fluid, somehow just too weird and exploded to understand even after many listening. Banco's first album is definitely an Italian progressive classic. This album is complicated, but any prog fan must have it cause it's simply good!"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Wednesday, July 6, 2005",
      "rating": 4,
      "text": "If you ask me the best singing language that fit prog music despite English, it's probably Italian and the second one is Spain. And Banco has blended the Italian speaking lyrics with classical music, jazz and rock in perfect way through this excellent debut album which I consider one of the seventies prog icons. No one would argue about this, I think. This album delivers beautiful compositions with varieties of styles from soft to loud, and from classical outfit to rock with some nuance of opera especially through the album opener \"In Volo\" (2:13) which involves monologues and orchestration. It moves into more uplifting mood with guitar rhythm accompanying excellent vocal delivery under \"R.I.P. (Requiescant in Pace)\" (6:40). This second track offers jazzy style keyboard work augmented with nice insertions of guitar fills. I really enjoy the electric piano exploration in the middle of the track - it's stunning. Structure-wise it's relatively simple and the beauty of this track on the arrangement with instrument solos combined with good singing style. The combination of piano and vocal right after the middle of the track is also another point of attraction about this track - especially when piccolo inserts its sound beautifully. An excellent track.The bridge \"Passaggio\" (1:19) that contains a very nice keyboard / organ work with non-lyrical singing brings us to the fourth track 4 \"Metamorfosi\" (10:52) in elegant way: a combination of guitar, drum, and piano work in upbeat tempo. The organ fills the transition to nice piano solo. It's a memorable segment, I would say. For me, this classic music influenced piano solo has created an excellent enjoyment pleasure. Brilliant. Drums enter the music combined with nice organ fills as the track builds into a crescendo. Suddenly the track goes through a silent break continued wonderfully with organ solo. What an excellent break man! What follow is a fabulous exploration of organ work augmented in alternate with simple guitar fills as the music moves into various forms in smooth way. At the ending part the track offers great guitar solo followed with floating voice line in Italian accent. Awesome composition.The album offers an epic \"Il Giardino del Mago\" (18:26) that comprises four parts: a) ...passo dopo passo... b) ...chi ride e chi geme... c) ...coi capelli sciolti al vento... d) Compenetrazione . The epic starts of with a soft piano opening with nice melody augmented with some drum work especially at every end of the bars. The music flows with organ that brings all instruments work together to form a cohesive epic. The combination of vocal and keyboard / organ has created beautiful harmony. The epic moves to relatively complex arrangement in a faster tempo demonstrating excellent keyboard work in high energy. There are also excellent mellotron sounds. The epic concludes with an uplifting mood with complex arrangement and dynamic delivery that reminds me to ELP kind of music. It's an excellent epic. The concluding track of the album \"Traccia\" (2:10) serves like an epilogue with ELP like music augmented with non- lyrics singing, guitar and dynamic drumming.It's an excellent addition to any prog music collection that you should not miss.Keep on proggin' ..!Progressively yours,GW"
    },
    {
      "reviewer": "andrea",
      "date": "Posted Sunday, July 16, 2006",
      "rating": 5,
      "text": "\"Present and yet remote, a living vision of that which has already been left far behind by the flowing streams of Time\". Well, Tolkien wrote these words to describe Lady Galadriel in \"The Lord Of The Rings\", but I think that the same words could be used to describe the debut album of BMS. This work is a melting pot of classical influences and progressive sounds where the musicians try to find a personal way to express their ideas with music and suggestive lyrics hanging above past and present, fantasy and reality.\"Loose your hippogriff's bridles, Astolfo / And fly wildly where man's work is more brisk / But don't deceive me with false images / And let me see the truth / So that I can touch what's fair\". The short opener \"In volo\" features sounds effects, choirs and flute giving it a kind of \"Middle-age flavour\" while the melody and the recitative vocals seem to come out from the \"streams of time\". Well, actually the lyrics are vaguely inspired by the work of the Italian poet Lodovico Ariosto and not by Tolkien, but in my opinion it doesn't matter very much whether they come from the \"Middle-age\" or from the \"Middle- earth\". \"From here, sir, we overlook the valley / What you can see is real / But if the picture is thin to your eyes / Let's go down to look at it from a lower point / And we'll glide down in a winged gallop / Into the crater where time gurgles\". An amazing prelude for the following track!With \"R.I.P. (Requiescant In Pace)\" rhythm goes up bringing echoes of war, while the lyrics and the peculiar vocals of Francesco Di Giacomo draw the gloomy landscape of a battle field. \"Horses, bodies and broken spears are getting red / Laments of dying people without a Christ nearby / Huge pupils turned up to the sun / Dust and thirst / In every moment you can feel the death's breath on you / But you'll never know why. Rest in peace!\". The music is powerful with keyboards and piano in the forefront. \"On heaps of dead corpses you built up your glory / But the blood you spilt has felt back on you / Your war has came to an end, old soldier\". Then the storm calm down giving way to a delicate piano part that leads to a struggling and melodic elegy. \"Now the wind sit down / Your glance is still hanging from the sky / Your eyes lay in the sun / In your chest there's still a dagger / And you'll never shoot your spear anymore, trying to wound the horizon / To push yourself further / To discover what God only knows / Nothing will be left of you but the pain and the cry that you gave / To push yourself further / To discover what God only knows\". \"A living vision\", a bitter reflection about the inhumanity and uselessness of war and glory, \"present and yet remote\".A sound of steps, a man approaching an old harpsichord, the sound of the instrument and the voice of the man drawing a melody. This is \"Passaggio\", just a short bridge that leads to \"Metamorfosi\", a long track, almost completely instrumental, with many changes of rhythm and mood melting in the short conclusive singing part where \"opera like\" vocals seem to claim the need of a never ending change. \"Man, I don't know if I resemble to you / I don't know, nevertheless I feel that I wouldn't like / To mark my days with yours\".\"Il giardino del mago\" (The wizard's garden) is a long and complex suite, dark and dreamy. \"When I was a child I used to ride the horse with the head bent down / I used to gallop without a noise / The wooden hoofs that flew over the flowers didn't waste the colours\". Lyrics are about the contrast between dreams and reality and the music seems to underline this contrast. Who is the wizard? Well, maybe the wizard is Atlante, another Ariosto's character but that doesn't really matter; here the wizard's garden is just a place in your mind where reality has no room and where you can find a shelter. \"With my hair blowing in the wind / I rule the time, my time / There, in the spaces where death has no power / Where love crosses the borders / And the servant dances with the king / Crown without vanity / The road that goes is never-ending\". The final track \"Traccia\" is clearly classical inspired. Hints of Bach and Beethoven blended with progressive rock with an astounding result.\"Present and yet remote, a living vision of that which has already been left far behind by the flowing streams of Time\". One of the milestones of Italian-prog and a must- have for every prog collector."
    },
    {
      "reviewer": "NJprogfan",
      "date": "Posted Thursday, July 19, 2007",
      "rating": 5,
      "text": "I look at Banco and PFM as companions of Yes and Genesis. PFM have a pastoral side similair to Genesis and Banco has a more aggressive side ala Yes. With Banco's first album they almost hit a home run right out of the gate. The album starts with some choral work with female singers and the legend talk singing something, (sorry, I don't know Italian). Then BAM! Track two is one of their alltime classics, \"R.I.P. (Requiescant In Pace)\" is a fast paced, scorching Itailian prog song as good as any made on any continenent, plus it has one of the world's greatest singers belting it out keeping up the pace of the song. Excellent guitar work, fast drum play and keyboards that punctuate the song perfectly. \"Passaggio\" slows it down with some pretty harpsicord. Then BAM #2! \"Metamorphosi\" is another alltime classic, mostly instrumental it has an unforgettable melody with Francesco singing towards the tail end of the song. Bravissimo! <--(did I spell it correctly?). Side two begins with their very first epic, \"Il Giardino Del Mago\". You have to have guts to have an 18 minute song on your very first album. Not as memorable as the two classics on side one, nevertheless it has fantastic instrumentation with Fransesco's best singing but a lull 3/4's of the way through drags it down. The album ends with a sorta recap type song. I believe for a first time album it is remarkable. Banco right from the start are tight as a unit with great melodies and a legendary singer. Other then the lull inside the epic it would garner a 5 star rating easily. I rate it 4.5 nudging it to 5."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Saturday, September 8, 2007",
      "rating": 3,
      "text": "First opus of this legendary Italian band.\"Requiescant In Pace\" is a very catchy song : it combines Italian prog, with jazz and classical music. It is a \"Banco\" standard. Vocals are extremely emotive and the last portion of this song is just brilliant. It truely holds all the ingredients that a symph fan could be looking for. A highlight of course.Middle ages mood for the short \"Passagio\". Just a passage, a transition track to get to \"Metamorphosi\". This is of course another story. Again, we will be touched by the grandeur of this song. Nice Emerson-like piano work to start (\"Take A Pebble\" oriented to give you the picture) it will evolve into some frenetic keyboards sounds and finally emerge to a vibrant guitar part which is turely emotional. Extraordinary vocals and crazy finale. Another highlight.Now, \"Il Giardino...\". The epic track of this debut album. Its atmosphere is pretty strange. It takes quite a while to effectively start (five minutes). We'll be transported into ELP again, but more on the powerful side this time. Strong and bombastic keyboard part. A sort of distraction from their traditional sound which will come back pretty soon. Delicate acoustic guitar as a backup for beautiful vocals again.There will several movements or parts in this song. Not really related which makes it complex to apprehend.I like how the vocals sound in this album. This is an interesting entry point in Italian prog although I prefer more modern bands of this genre (\"La Maschera\" for instance). This is a good debut one. Three stars."
    },
    {
      "reviewer": "apps79",
      "date": "Posted Tuesday, October 16, 2007",
      "rating": 5,
      "text": "Formed in 1969 in Rome,Italy, BANCO DEL MUTUO SOCCORSO are one of the top examples of the 70's Italian prog rock wave's bands.Founding members were brother/keyboardists Gianni and Vittorio Nocenzi.After some early line-up changes,the band had finally a 6-member secure column to fully develop their ideas on a LP.This would be released in 1972 carrying the band's name as a title.The magnificance,brilliance and majesty of this album goes beyond simple words.''Banco del mutuo soccorso'' is built around the double keyboard interplays of Nocenzi brothers and the crystalline operatic voice of singer Francesco Di Giacomo,featuring unbelievable grandiose organ-dominated parts and classical/crying piano themes accompanied by the expressive/emotional vocal lines of Di Giacomo.But there are also some really amazing rockin' parts,led by aggresive guitars and pounding bass with slight jazzy influences.Balanced between emotions/sensitivity and complexity/aggresiveness this work is an absolute killer of the legendary Italian symphonic rock scene of the 70's,that should appeal to all lovers of demanding musicianship and deep expressions!"
    },
    {
      "reviewer": "Guillermo",
      "date": "Posted Friday, January 25, 2008",
      "rating": 4,
      "text": "I only have listened to three albums released by BANCO: \"Di Terra\", \"Darwin!\" and this, their first album. After listening to \"Di Terra\", which I consider a very good album, I expected more of the same very good music. Unfortunately, in my case, after \"Di Terra\" the other albums that I have listened from this band, which is a very good band, are not in the list of my favourite albums. But I recognize that this band has talented musicians and they also make good music with good arrangements. It is, in my opinion, a band very influenced by Classical Music, and I think that most of their members are trained musicians in Classical Music schools. As I wrote in my review for \"Darwin!\", I think that lead singer Francesco DiGiacomo has a good voice. Maybe he was trained as an Opera singer, so his voice is not very common to be found in Prog Rock bands. I think that liking his voice takes time, several listenings. Also the music from this band is complex, and it also takes several listenings to really like it. In comparison to \"Di Terra\" and \"Darwin!\", I think that \"Di Terra\" is the best I have listened from this band, but this first album is more accessible than \"Darwin!\" but not as accessible as \"Di Terra\". Anyway, this album has more interesting things than \"Darwin!\" so I prefer it more than \"Darwin!\". One of the highlights in this album is the very long song called \"Il Giardino Del Mago\". Di Giacomo`s vocals are very expressive and dramatic in some places. It was until recently that I was listening to some Italian Opera Arias (sung by Giusepe Di Stefano; I`m not a Fan of Operas, but now I`m trying to learn how to appreciate them) that I really appreciated how good Di Giacomo is as a singer. So, despite this band is not one of my favourites, I think that this album has some interesting things to be listened by every Fan of Prog Rock music."
    },
    {
      "reviewer": "LinusW",
      "date": "Posted Thursday, May 8, 2008",
      "rating": 4,
      "text": "Not at all as immediately pleasuring as Io Sono Nato Libero, this first album from Banco Del Mutuo Soccorso is a big time grower. Like many other debuts, this album has an unmistakable hunger, almost na�ve at times, but ultimately a rewarding asset according to me. Passion has a way of making rough edges seem smooth again and a reviewer turn soft and forgiving.So. After being a little put off by the lack of structure and direction in the beginning, some clear advantages rise from the mist of Banco Del Mutuo Soccorso. First, it feels less polished and more experimental than any RPI I've heard to this date. Second, the shorter 'narrative' bits here (In Volo, Passagio and Traccia) adds an extra dimension to the album with their foreboding words (no idea what anything means though, and thus just based on the feelings they evoke), choirs and instrumentation. And third, that touch of early Deep Purple influence I for some strange reason found on PFM's Storia Di Un Minuto as well. A trace of harder, edgier rock and a pleasant surprise amongst the generally smoother Italian stylings. Both Hammond-wise and guitar-wise.The three really real songs are all very good. R.I.P is a dense rocker, slightly repetitive at times, but never in a disturbing way. Piano, bass and guitar forms the heavy backbone with nuances provided by keys in the background. Nice laid-back and warm solo part by the guitar after a couple of minutes. As a twist, R.I.P turns soft and easy after a while, with nothing but tasteful piano, flute and the impressive operatic vocals of Francesco DiGiacomo. It then gradually builds up, adding more and more instruments (including a soaring organ) right to the abrupt end. Piano parts are really one of Banco's strengths, or rather the use of different sorts of keyboards. Metamorfosi is full of them, often alone and very gracious, and the song feels more like a classical work on some occasions during the eleven minutes it's got to its disposal. Being the highlight of the album, transforming back and forth between the lonely ringing piano and rich, more orchestrated parts where the rest of the band gets some time in the spotlight, this is where Banco does what Banco does best, in adding drama to their music. Epic in proportions, Il Giardino Del Mago isn't really as magic as the title suggests. It's one of the main reasons for this album not being the masterpiece I wish it was. This is the band's first album after all, and generally it suffers from a little underdeveloped composition. Part after part, often very different from one another in structure and style, interchange in sometimes very hopeful ways. Ideas are thrown around, sometimes developed, sometimes dropped, and leaving a lasting impression that perhaps this one had made a better impression as a bunch of shorter songs instead. The outstanding musicianship nevertheless keeps it interesting.Intense and short, the dark and compulsive Traccia ends this strange album with a boom. Literally.Bancos self-titled album has some flaws, perhaps inevitably, and it's not as immediate as the following two either. A great start it is, however, even with negative points considered.3.5 stars, but going for a weak 4.//LinusW"
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Wednesday, July 30, 2008",
      "rating": 4,
      "text": "4.5 stars. This debut from BANCO is maybe not as polished or complex as \"Darwin !\" yet it is a must for RPI fans.\"In Volo\" is haunting to begin with until spoken words come in with flute. This contrast continues. \"R.I.P. (Requiescant In Pace)\" is uptempo right out of the gate. Vocals join in quickly, and they are amazing as usual. It gets jazzy 1 1/2 minutes in. Excellent piano after 2 minutes. Vocals are back before 3 1/2 minutes. A calm before 4 minutes as piano plays on. Great sound when drums and vocals join in. The most emotional part of the record is 6 minutes in. An uptempo melody ends it. \"Passaggio\" opens with the sound of someone walking along, then he sits down and starts to play the harsichord and sing. He then stops, gets up and walks away. Cool.\"Metamorfosi\" opens with pounding drums and guitar.This rocks ! Piano joins in. Great sound. It then calms down as organ comes in powerfully. Piano then takes over. So beautifully played. Drums and a full sound before 3 minutes. Organ is back 4 minutes in. The guitar and organ trade solos and check out the drumming ! It settles down again before some passionate guitar and drumming come in around 8 1/2 minutes. Vocals follow. Nice. Piano and organ create some magic as the drums pound. Some filthy organ joins in as well.\"Il Giardino Del Mago\" opens with a dark mood. Drums and organ join in briefly and then vocal melodies. Guitar, organ and drums lead the way 2 1/2 minutes in. It stops as that dark mood returns with piano and vocals quietly playing. It's 5 1/2 minutes in when the tempo picks up with vocals. This is such a great melody that stops 7 1/2 minutes in as it gets dark again with piano. Vocals return 10 minutes in. It's uptempo again before 11 1/2 minutes. Amazing sound. A calm 13 minutes in. It's sinister sounding 16 minutes in.The tempo picks up again to end it. \"Traccia\" opens with some incredible piano as drums join in then vocal melodies. A fuller and faster melody 1 1/2 minutes in.The Nocenzi brothers on the dual keyboards are the stars of this album. \"Metamorfosi\" is my favourite track."
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Friday, October 3, 2008",
      "rating": 3,
      "text": "3.5 stars really!!I'm wondering if it's not pointless to review such a widely known album this late in the creation of the site, as there must be between 50 and 150 reviews of all kinds, which means that almost everything to be said and its exact opposite have been said at least a few times. I must say that I avoided these Italian bands (especially the big three) early on, because I was not a major fan, and thought I'd better wait some day, where I'll have time to... And it never came until.. now. So I'll start with a few generalities, like BMS is the one I respect most of the big 3 Italian band, even if PFM hits higher chords in my brains. And from what I gather among the big three, BMS remained the most constant, avoiding constant line-up changes, which might be salutary for some, but destructive for others.BMS's debut album comes in one of the ugliest gimmick artwork ever, an ugly orange tit-piggybank complete with cut-outs to make it fragile and hard to store in its vinyl form. But this side issue shouldn't distract us from taking a look at the keyboard-driven quintet with the Nocenzi brothers acting like twin barrels carburetors each one keyboards and sometimes on wind instruments. This piano-organ attack is nothing new in prog and was pioneered by Procol Harum in 67, so 5 years later BMS uses it flawlessly in their 72 debut album. This twin kb is not overpowering either, even allowing their Todaro guitarist some very large moments to Shine On Brightly, even if he's no Robin. Of course let's not forget Di Giacomo's unusual vocals, often called operatic, which I find a bit abusive as this was also said of Freddy Mercury, but next to Montserat Cabale in Barcelona in 92, the latter was nowhere.The album consist of two short tracks bookending the album, the narrative and cosmic In Volo and the Bach-inspired Traccia and the un-announced (on the cover antyway) Renaissance harpsichord Passagio provide some sort of glue between and around the three \"pi�ces de r�sistance\". Whether these three interludes are meant to encapsulate the album into a \"concept\", there is no clear evidence for or against, but probably that BMS needed more time and mastery to achieve it. This concept mastery would come to them soon. The opening piece is an okay prologue, while Traccia is a fitting epilogue, while the baroque Passagio seems a useless transition piece, serving like a shot of grappa between the courses.The with the \"In Volo\" zakouskis (that is amuse-gueule in Russian) gone, the antipasti of RIP come out firing on all cylinders with the guitar and organ and vocals up front, while the piano comes in when the flute is resting. RIP is the textbook case of an overblown Italian rock track with all of the usual Italian excesses that goes down well (if not extremely well) with progheads, but would sound completely cheesy if done by any other non-Italian group. Onto the primi piatti, the almost instrumental Metamorphosi, a very keyboard-dominated track where the organ and the piano duel each on their own channel of the stereo. This track depends maybe a bit too much on XVIIIth century classical music for my tastes, often borderline Emersonian fonduesque (I'm up on cheese humour here), but again it's fairly successful, only because it's Italian-styled overblown. A rather weaker course, leaving us a bit hungry, really! The secundi piatti Giardino is not as magic as it would lead you to believe (while it doesn't pretend to be sliced raw-milk Mozzarella Di Buffala either), but it quenches whatever hunger you might still have with its four ingredients. However the succession of all four ingredients is not quite a fine-tuned recipe, as the sauce lacks the necessary binds to make smooth transitions between the ingredients, although you can hear the opening theme brought back later once or twice after its overlong development early on in Passo dopo. From far the most interesting movement is the very vocal second and uptempoed Chi Ride e Chi Geme.Hardly perfect, yet quite impressive debut album, BMS is one of those albums setting the Italian legend and certainly a healthy base to set your second effort upon its foundations. Hopefully I've brought in my review something slightly different than my fellow reviewer's, and hopefully its digestion will go down mascarpone in a tiramisu, should you ever venture down the page so far as to reach it."
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Wednesday, October 8, 2008",
      "rating": 5,
      "text": "One of the best debuts I know belongs to Banco Del Mutuo Soccorso! The album begins with something like intro - In volo,followed by excellent song called - R.I.P. (Requiescant in pace),which contains hard rock,rock&roll and some pop moments. The structure of the composition of the album is teared into pieces again with the third song in classical style with renaissance organ style - Passaggio,before the epic compositions - Metamorfosi and Il giardino del mago - begin... They are the creative peak of the album that makes it true masterpiece of progressive music. They hint at what a giant album of music is going to come later (Darwin)!!! Surely solid 5 stars masterpiece and a must debut release by Banco Del Mutuo Soccorso!!!"
    },
    {
      "reviewer": "memowakeman",
      "date": "Posted Monday, April 20, 2009",
      "rating": 5,
      "text": "Wonderful, bellissimo!!One of my personal musical mutations happened when i discovered prog rock, but not just that, but when i discovered Italian prog rock, i was amazed by their different and beautiful style and one of the finest examples of what Rock Progressivo Italiano is, has to be this legendary band that created several masterpieces, called Banco del Mutuo Soccorso.And what a band, that appeared in the early 70s and in 1972 let the world know about their music, a giant was born with this debut and self-titled album that every time I listen to it, I feel the same excitement I felt the time I discovered it, and believe me it does not happen that often, so I think you understand why my enthusiasm with these bands or albums, it's a love at first sight, it is a complete crush with their music.The album features only 6 songs and a total time of 41 minutes of beautiful, elaborated and complex progressive rock with a different flavor, there are 3 long songs and 3 shorter ones.It opens with \"In Volo\" which is a kind of introduction to their music, it is a short song with spoken word, the use of a flute that puts the folkish side of prog to their music, and some female chorus over there, besides some synth as background.Then in a fast and sudden change we will find the second song entitled \"R.I.P. (Reqcuiesant in Pace) where you will listen for the first time the extraordinary, unique and amazing voice of Francesco di Giacomo, I am sure that one of the main features of their music has to be the voice, with his voice he can provoke several things on you, no matter if you speak or not Italian. This is a longer song, with almost 7 minutes and a jazzy mood due to the piano sound, some kind of funky guitar and of course an obvious symphonic element, after some 3 minutes the song slows down and becomes like the music of a beautiful fairytale, it is so peaceful and beautiful, the piano is simply outstanding.Next one is another shorter track, the prelude of the next 2 longer ones, \"Passagio\" contains just a piano sound for one minute. Then the next one is \"Metamorfosi\" that is one of their finest compositions and the second longer track of the album, the introduction is awesome with guitar and keyboards along with excellent drumming that calms down after one minute, then it is a noticeable change where just the piano stays making some classical music, then the next minutes are totally crazy, instrumental music that will make you think in what is next, I mean, there is not a musical standard on this song, you don't really know how the next few seconds will sound, what is sure that the keyboards predominate here, there is a constant drumming a also constant bass lines, at the middle of the song, you will listen again to the beginning of it, and then it changes again and again, the mood is in a moment darker and at the same time beautiful, strange isn't it? The last minutes are very melodic, cool guitar tunes and also the piano over there, and also the vocals appear as well, but wait, there is one moment left, which is the very end with a powerful sound like if you were in a maze and don't know what to do, the music gives you the feeling of a desperate moment, awesome.Next we have the mighty \"Il Giardino del Mago\" which is my personal favourite, my most loved Banco del Mutuo Soccorso song, and the longest track of this album with almost 20 minutes. Since the first minute you will feel hypnotized by it's sound, some soft piano and drums, then it is developing and progressing of course, there are some backing vocals over there and then a powerful guitar sound which makes the song louder, the music is complete outstanding, the different changes over the song will make you consider this as one of the best epics ever. The complexity and development of it is incredible, the son is building up a masterpiece minute by minute, from slow time with soft vocals and piano, to a fast tempo keyboard based song, quite impressive, at minute 8, there is a mood of complete calm with only some piano notes, but the beauty of it is how the same piano begins to develop into a complex and challenging composition, in order to change the song's mood some moments later, this is a true masterpiece of progressive rock.And finishing the album, after that superb previous song, we have another short track, \"Traccia\" which is like the outro, but again, a wonderful theme whose sound isbecoming louder through the seconds, it is basically a piano based song which has some choral vocals making again a kind of folkish tune, it is a bombastic outro after all.So as you noticed, I love this album and I really consider it as one of the masterpieces of Rock Progressivo Italiano, and of prog rock in general, so I personally recommend it to all of you, who love this wonderful realm of progressive rock.Masterpiece, 5 stars! Enjoy it!!"
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Thursday, March 4, 2010",
      "rating": 5,
      "text": "An RPI giantSeveral times during the play of this album, there are haunting melodies that emerge like a spirit coming down from the hills and walking into town at dusk. Yes indeed. Banco need no introduction. They blow away the nonsense argument that RPI is some pure derivative of English rock. They are the king of the \"big 3\", slightly edging Orme for the crown and blowing away PFM in this writer's opinion. And this is their amazing, unforgettable debut. The album consists of three long epic tracks supported by three short but important supporting pieces. What really makes the album is its adventurous progressive spirit mixed with a few heavenly, calming melodies noted above, creating great contrast and intrigue. Formidable musicianship, good arrangements, decent production(for 1972 Italy), and the commanding vocals of Francesco Di Giacomo only seal the deal. Flutes, brilliantly plucked acoustic guitars, violin, lovely choruses, experimental noise, heavy grooves, tight merciless drumming, orgasmic but controlled guitar playing, pure Italian passion, and oh my, the keyboards and especially my dear love the piano, are all over this thing.Within the prog-manic jams and movements of the main three songs, eventually are birthed the loveliest melodies as only the Italians can do it....sentimental, warm, homey, like a summer evening on the Villa. These moments of pure emotional warmth often contrast with the sometimes edgy rock occurring around them, but they never sound contrived or ill conceived. It all flows so well. For possibly the first time in my 700 reviews I find that Wiki perhaps sums it up better than anyone: \"A careful balance of electronic and acoustic instruments, plus the use of reeds, made the sound of Banco increasingly original and innovative, with a blend of rock, jazz and classical music which did not however forsake the Italian melodic tradition.\" The first three Banco albums are essential for RPI fans and I recommend getting them in chronological order to chart the progression. There is no consensus on which of the three are the finest, each has its own personality and each its own devotees."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Sunday, April 18, 2010",
      "rating": 5,
      "text": "Banco del Mutuo Soccorso produces one of the best debut albums in history.Banco del Mutuo Soccorso is the debut from one of the most influential Italian prog bands in history. The iconic cover is familiar to prog fans and signifies how important this album has become. Its main power stems from an unprecedented conviction to producing some of the most inventive and complex music, pure innovation on every track and some incredible virtuoso musicianship. The album spawned a plethora of other Italian prog artists hoping to do as well as Banco but succumbing to their sheer progressive spirit. PFM (Photos of Ghosts and Per Un Amico) and Le Orme (Felona E Serona and Uomo Di Pezza) were as influential among others but Banco del Mutuo Soccorso is one of the pioneering Italian Prog bands and their 1972 debut is an incredible triumph. The band perform astounding unified music but one of the main drawcards to Banco is the accomplished vocal prowess of Francesco Di Giacomo. When he sings in Italian it transcends barriers of language as the tone is always upbeat and hopeful. Another drawcard is the astounding keyboard wizardry of Vitorio Nocenzi and Giani Nocenzi who seem to trade off one another on every track to produce a refined beauty that soars and dives across the musicscape.The opening track is \"In Volo\" that announces their arrival with flute, spoken word and female choral sections with synthesizer. It is only a taster of what is to come.\"R.I.P. (Reqcuiesant in Pace) is a huge change in direction as the pace quickens and the band go into full flight. Francesco di Giacomo has an incredible vocal range and really shines on this track. There is funked up guitar and some piano fortissimo in this jazz fusion triumph. The symphonic influence is prevalent and the track grinds to a halt and creates an ambience of beauty and serenity. At times the sound is similar to Mahavishnu Orchestra.\"Passagio\" features a prelude of piano and is really a transition to the next track.\"Metamorfosi\" is next on the menu and is a lengthy progressive masterpiece. The guitar and keyboards are accompanied with some sporadic drumming and there is a frenetic section of electrifying jazz. It soon peters out to a slow droning classical piece that focuses on piano. The peace does not last long as a huge wall of sound is created with chaotic iambic pentameter, arhythmical structures that elicit an alternative anti music sound. All boundaries are broken and the band go into extreme time signature changes. The bass lines and drumming metrical patterns are off the scale. This passage is the band at their best. Then it is bookended by another slow low key ambient section with strong melodies and tonal phrases. This is an incredible track and one of the best you will hear.Can it get better? It does.... \"Il Giardino del Mago\" is the opus, and this track has a stamp of authority sending out a signal to all others, declaring the sheer power of Banco del Soccorso Mutuo. The track almost has a running time of 20 minutes. But you will not notice this. It begins with gentle piano that transfixes you and the drums are a constant companion. It takes a series of rapid detours that will astound. It is difficult to know which direction the band will take next on this prog journey. There is an intricacy to the music that is compelling and the song tends to build to a crescendo with a freak out section of keyboards and crazy drumming. This track is worth a listen to the album alone, but there is more to come.The final hurrah is the outstanding \"Traccia\" which builds in depth and volume from slow beginnings to prog blasts of staccato piano. The vocals are more choral on this and it kind of says farewell to the album and ends the journey in style.I think the only thing I can add is that this is the best I have heard from the big three of the band; their first three albums. It is a definitive masterpiece hands down and Rock Progressivo Italiano would be all the poorer without it. Banco became RPI giants after these albums. Their debut is an important album, a quintessential album, a masterpiece."
    },
    {
      "reviewer": "EatThatPhonebook",
      "date": "Posted Sunday, April 25, 2010",
      "rating": 4,
      "text": "8/10\"Banco Del Mutuo Soccorso\" is an essential Italian Prog album.I live in Italy, so I'm very proud to know that this country had many many bands that completely revolutionized prog. One of the most important ones is Banco Del Mutuo Soccorso, one of the most significant examples is this album, Banco's debut. A supreme masterpiece of prog, one of the best works made in Italy. Musically the album has many eclectic prog influences, such as King Crimson and Gentle Giant, but they have an evidently huge personality in their music.After the Great intro, \"In Volo\", \"R.I.P\" kicks in. Di Giacomo's vocals are sublime, and also the general technical preparation of the band. It's a very catchy song, very rockish, unlike some other songs in the album.\"Metamorfosi\", followed by the brief interlude, is, like the title itself says, a huge metamorphosis of themes, so many moments are connected to each other, always in an extremely elegant way.\"Il Giardino del Mago\" is an amazing 18 minute piece, so original and creative, with a fantastic main riff that comes up a lot during the whole song. One of the best Italian songs ever.An absolute masterpiece of progressive, and essential for those who love it."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Wednesday, April 28, 2010",
      "rating": 5,
      "text": "In 1972 Banco Del Mutuo Soccorso released no less then 2 albums. And both are masterpieces. The debut is such a fascinating album, sounding like an Italian sunshine mixed with the kind of dramatic dynamics that are only topped by VDGG and keyboard acrobatics that must have perplexed Keith Emerson. He sure must have asked himself why this Italian band was blessed with such a generous muse, one sharing all her best tunes with them and not with ELP. I guess muses prefer the Mediterranean over the North Sea!I've been quite lengthy in my 5 star review for Banco's second albumDarwin!, so I'll keep this one down to the bare essence. This album is a dazzling display of musical creativity, passion and adventure. This is what I want to hear in prog! Even with a slight preference forDarwin!, there is no other option for me but to hand out another 5 stars. Besides, I don't feel like analyzing what's going on here. Or should I say I've found myself incapable of it. I've tried many times but each time that I put this album on and sit down to review it, the words seem to fail me. This music simply absorbs me and makes it impossible to do anything else but sit still, listen and enjoy.Banco Del Mutuo Soccorsois a classic album that should satisfy everybody that regrets VDGG called it quits in 1971 and didn't follow upH to HeorPawn Heartswith another album of such lyrical power and imagination. Banco Del Mutuo Soccorso is where you'll find the logical continuation. In my book, BDMS are one of the best of the classic Prog generation. Too bad it took me so long to discover them."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Thursday, June 10, 2010",
      "rating": 4,
      "text": "Musically I might be inclined to view this album as a 3-star, but given the year (1972) and the fact that it's a debut, I'll slide the scale up a bit. This album is much more raw than later releases and certainly not overly produced, but I think this adds a different dimension to the band and really helps things to rock hard in places. I love the creative lineup, starting with the Nocenzis on dueling keyboards--they really do compliment each other quite nicely.Unsurprisingly, the longer tracks (Metamorfosi and Il Giardino del Mago) generally contain most of the album highlights for me, though Traccia and RIP are anything but throwaway songs. Metamorphosi goes through many moods, but not in a way that seems too jarring or distracting. I love the dueling keyboard section toward the beginning with the Nocenzis battling in triplets and the band kicking in some staccato punches.If I start to think I'm listening to a quasi-traditional rock band, Il Giardino quickly sets me straight, with an absolutely classic Italian prog flair. It's certainly not a great epic, with its stops and starts and general rawness, but always enjoy it nonetheless--probably mostly because of the interesting contrasts between the delicate clarinet bits and the harder rocking sections.It's always fun to listen a great band's early attempts (assuming there is some good raw musical material to work with, of course) to determine their identity. Banco's would become more symphonic, peaking with Lo Sono in my opinion, but the roots of that album are certainly evident here, just with more punch and less subtlety."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Wednesday, April 6, 2011",
      "rating": 4,
      "text": "Time to review the few RPI standards in my collection. I've hesitated over this, as it's a difficult genre for me: the shape of the compositions aren't easy for my Anglophilic ear to follow, but this debut album from one of the most respected of Italian prog bands, BANCO DEL MUTUO SOCCORSO, is tremendous stuff in anyone's language.What makes it noteworthy, as other reviewers have pointed out, are the outstanding keyboards from the Nocenzi brothers. And, paradoxically, the over-reliance on this instrument means for me this excellent album falls short of true greatness. A bit like EMERSON, LAKE AND PALMER who, for me, suffer from the same problem: the pianos get all the best bits, though this band is better by far than what ELP became after their debut. Despite this the blend of classical, piano-driven melodies and rock rhythms works well, especially in 'R.I.P' and the end of 'Metamorphosi'. There's the odd misstep, such as the drawn-out beginning to the epic 'Il Giardino del Mago', but otherwise listening to this album is a delight. Moreover, despite what I have read, I have no complaints about the sound quality of the recording I procured through iTunes. The instruments are nicely separated, with vocals, subtle bass, splendid rhythm guitar and keyboards all occupying a separate part of the sound spectrum. This may owe more to the excellence of the compositions than to the mixing.Special mention must be made of the vocalist. DiGiacomi's singing is a little overwrought for my taste but I can recognise his excellence, marvel at his control and the opera-like discipline in his voice. Underpinning this discipline is an often playful, sometimes edgy set of compositions owing much more to classical sensibilities than to anything from the UK (though the influences can be heard). The very best thing about this music is that it has its own distinct voice, one which is gradually winning me over. I hear the brilliance, but I have yet to fully experience the emotion, curse my narrow-minded ears.Heartland prog, this. And if it wasn't for the brilliant follow-up album, this album would be essential. As it is, this is merely excellent."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Thursday, August 4, 2011",
      "rating": 5,
      "text": "1972 was truly the year the RPI scene launched into the stratosphere, with the debut of PFM, Le Orme's excellent Uomo di Pezza, and this first opus by Banco all being fantastic releases. But my favourite of the three is this one by Banco, simply because whilst all three albums show the hallmarks of the bands' influences, Banco's debut does the best job of creating a unique sound. Simply put, every moment on this album - from the frenetic keyboard work, to the gentle piano interludes, to the operatic vocals, to the delicate guitar - is steeped in the band's unique personality.Yes, there's a bit of ELP in the keyboards and synths and a touch of Martin Barre or Steve Hackett in some of the guitar playing, but these influences are subsumed so totally into Banco's sound that they should be regarded as one of the true originals of the progressive rock scene, with a sound that is simply... Banco. If this doesn't deserve five stars, nothing does."
    },
    {
      "reviewer": "Einsetumadur",
      "date": "Posted Wednesday, August 17, 2011",
      "rating": 4,
      "text": "11/15P.:an acquired taste: spectacular, unique, exhausting, but sadly under-producedThis album's quite difficult to digest in my book. Usually, when you think of Italian prog music you are reminded of pastoral folk sounds, of \"Trespass\" and \"In The Court of the Crimson King\" revisited in a more Mediterranean manner. But when you think it over, the Italian music scene is more radical and more avant-garde than many of their English fellows; for instance, listen to Area'sArbeit macht frei, Osanna'sPalepoliand Il Balletto di Bronzo'sYsin succession. The only popular Italian bands I know on the softer side of progressive rock are actually PFM (partially) and Celeste - even the works of the two famous Italian songwriters Angelo Branduardi and Fabrizio de Andre (with his awesome recordRimini) are not as simple as they might seem to be!Banco, in their best years, have been one of the more eclectic groups from Italy, fusioning Italian folk, free jazz (listen to the live album \"Seguendo le Tracce\"), neo-classical music and avant-garde soundscapes with rapid and unpredictable rock rhythms, led by Francesco di Giacomo's plaintive voice, the frequent shrieking clarinet interludes and the dueling of the piano and the Hammond organ.On this record the band is still searching their definitive style - and their definitive sound. And this is the big criticism which this recording draws: the drums and the electric guitar are mixed awfully. I mean,reallyawfully. I think they didn't record the guitar by playing it through an amp and recording the amp with microphones, but by directly inserting the amp signal into the soundboard. The guitar covers pretty much everything, but sounds much too flat. The drums sound hollow and boring as well, which makes the parts of the album where Hammond organ, piano or acoustic guitar are in the spotlight become most spine-tingling and enjoyable.Ironically, the three short pieces (ranging from one to two minutes) leave the listener more perplexed than the three longtracks. The album starts off withIn Volo, in which a deep Italian voice recites a poem or something like that to the backing of swirling Hammond organs (full V3 vibrato) mixed with acoustic guitars and flutes, sounding like a Medieval Italian madrigal revisited in the psychedelic age of the 1970s.Passagio, the second of the three short songs on this album, is similar in its nostalgic feeling, but is played on a Renaissance-like sounding harpsichord accompanying sombre wordless scatting. Strangely, more than one half of this piece consists of the sounds of the harpsichord player going to the instrument and leaving the room afterwards.Tracciais the most frantic piece on this recording as it dashes through a high-speed 6/8 with complex harmony vocals and unisono piano-organ-runs which leave your finger muscles aching. Think of the 2:38 part of Focus'Questions Answers Questionswhich sounds completely different, but which is as manic and which has the same instrumentation (organ, bass, guitar, drums).When Deep Purple used their classical influences rather sparingly in favor of more blues soloing, Banco recorded their ownHighway StarwithRequiescant in Pace. Don't worry, Banco maintain their 100% individual sound on this piece, but the rapid drum rhythm and the roaring Hammond organ share the energy and strength with Deep Purple's work. Again, there is a great mixture of different genres here. The stanzas, for example, sung forcefully by Francesco di Giacomo, sound vaguely like church music (with towering Hammond organs in the second stanza) while the middle of the song features outstanding jazz improvisation on Hammond organ and electric guitar, accompanied by Bartok-like percussive piano riffs. After 3 1/2 minutes stuffed to the gills with great ideas the song continues, but in quite a different manner. The speed slows down, and the electric instrumentation makes way for a ballad which can only be composed by Italians: sparkling piano runs, lamenting vocals, a restrained flute setting counterpoints and well-dosed bombast which gradually enters the piece until the end when Hammond organ and harmony vocals join in.Metamorfosiis the piece which would in its structure be later rearranged asLa Conquista della posizione eretta. It is, indeed, a rather unorthodox structure which in spite of this works out very well: eight minutes of instrumental tour de force with several more or less distinct parts leading into a 2 minute vocal finale. It's in this track where some of the most beautiful solos appear. Gianni Nocenzi, the band's pianist brings in a gorgeous neo-classical composition at 0:50 after an intense, swingingtuttibeginning. This part offers enough substance to be varied in the next minutes, in different metres, with different instruments and different phrasings. Inventive work which is a sheer pleasure to listen to, especially the part at 4:20 where the motif is taken over by Hammond organ and guitar which echo each other's melodies on a really mean bass ostinato. A film-music-like part with creeping Hammond organs leads into the big finale, in a way a sequel toRIP Pt.2, but more on the majestic than on the balladesque side.Il Giardino del Magois Banco's longest studio track they have ever recorded and the time is used very economically. It's impossible to sum this piece up because so much happens here, but the big advantage of it is that the different themes that enter, i.e. the creepy opening theme, the melody of the first stanzas (in part one,...passo dopo passo...) or the emotional melodies around 7:30 are related with each other or are combined with other themes during the track. The really emotive parts are especially the moments in which Marcello Todaro uses the acoustic guitar. Here, the Italian flavour appears again in a stark contrast to the heavy moments of the piece where the electric guitar cuts through the riffs like a saw.All in all, this album is hard to rate. On the plus side there are the great compositions, the beautiful melodies, the raw vigour and strength which dominates this album (and also the fine sound of acoustic guitar, vocals and piano) and the independent, distinctly Italian sound. However, the minus side weighs quite heavily since the nonprofessional production of the electric guitar and the drums, instruments which sound bad although they are performed with virtuosity and are omnipresent on this record. I must admit that by now I prefer listening toDarwin!, but Banco's debut album has always inspired me as a keyboarder and the material is top-notch.So, a weak 4 star rating from my side, which could well be a good 4 star rating if the production was better."
    },
    {
      "reviewer": "Aussie-Byrd-Brother",
      "date": "Posted Thursday, November 22, 2012",
      "rating": 5,
      "text": "As I've immersed myself in the RPI progressive genre over the years, I've snapped up several of the landmark albums that have a high status among the Italian progressive ranks, as well as actively seeking out the more obscure and unappreciated lost gems. Then once in a while I catch up on a well known and defining Italian prog album that makes such an impression on me I wonder how I've avoided it for so long and regret not having had it all this time! Case in point - Banco's self titled album 1972 album that, for a 41 minute album, crams in so many wildly original and inventive musical ideas that this one album leaves more of an impression than some bands do in their entire discographies.`Banco Del Mutuo Soccorso' is a daringly original blend of acoustic and electric playing full of sinister snaps, delicate reflective movements and trademark Italian prog sophistication. A mix of dark classical, jazz, progressive rock, operatic bombast and even psychedelic touches. It jumps back and forth between frantic aggressive playing and restrained subtlety over and over, with long inventive instrumental sections that race in endless directions. The unpredictable nature of the album is one of it's most exciting characteristics.The uptempo `R.I.P' has some maddening repetitive dizzying bass, aggressive jazzy guitar licks backed up with piano attacks and a truly bent, slightly off organ solo that is quite sickening and totally addictive! The emotive and passionate near-operatic vocals of Francesco DiGiacomo fall between mournful and hostile throughout this piece. `Passigio' is a brief eerie harpsichord lullaby with sighing vocals.`Metamorfosi' is a mostly instrumental hurricane of forceful piano, dominating drumming, loopy keyboard solos and wild swirling tuneless guitar string-scrapping like early 70's Pink Floyd. Organ bounces back and forth between booming gothic menace and twinkling mystery. Some of the bass sections have a very interesting murky recording quality, while the electric solos and themes have an uplifting and powerful sound.The 4 part 18 minute epic `Il Giardino...' moves constantly between down-tempo and upbeat passages, and is quite schizophrenic in nature! It opens with lovely menacing organ and piano, nasty guitar riffs with rattling drums marching around sighed group harmonies. It creates quite a dizzying nightmare atmosphere. Francesco's vocals leap from weary, then forceful to downright manic as the music becomes panicked with blinding fast violent keyboard runs and rapid-fire drumming. The middle section is a psychedelic wash of early 70's David Gilmour fragile shimmering guitar emotion, gentle piano and calling clarinet with a pleading vocal and stunning plucked acoustic guitar playing. The piece wraps on a tornado of crazy instrumental explosions, full of dirty slow hard-rock riffs, drifting sax, cracking drum-work and loopy organ runs racing to the finish line.Although the album has many frequent angry and noisy sections, it's the haunting and dark classical somber piano moments that leave a real and lasting impression. Listen to the spectral creeping tip-toeing piano footsteps after the intro of `Metamorfosi', or the middle section of `Il Giardino...' for some beautifully delicate playing.The album also has an odd sense of humour in little moments throughout, like the brief finale `Traccia' containing quirky vocals and a hazy hallucinogenic mood, which ends the album on a slightly uneasy note. I love the varied production which gives some patches of the album an effectively dramatic suffocating sound that is quite maddening! It's probably accidental, but it gives the album an occasional rough charm all the same.`Banco Del Mutuo Soccorso' is exactly the sort of album that comes out of nowhere and really kicks you up the backside, reminding you of the time you first heard one of your favourite and most beloved Progressive classics. When you discover a stunning piece of progressive work like this, it reaffirms just how exciting and imaginative the genre is. An essential album.Five stars."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Sunday, February 24, 2013",
      "rating": 5,
      "text": "Classic example of progressive rock from the 1970's, and this isn't an English band. The RPI movement is a special niche in prog rock for taking what the English bands like Genesis and Gentle Giant were doing and throwing in more classical understanding to the mix, or at least that's my limited understanding of the genre. I've been slow at acquiring and appreciating this specific sub- genre, and I feel that Banco del Mutuo Soccorso can help change my mind.First off, there are only three ''full-length tracks'' as ''In Volo'', ''Passaggio'' and ''Traccia'' are all no more than 2 and a half minutes long. So you're probably thinking that these are fillers, and they could be to an extent, but they all try to achieve something musically whether to set up the next epic, or, in the case of ''Traccia'', be great in their own right. I find them similar to the short pieces of Caravan's IF I COULD DO IT' album or Yes's FRAGILE in that the short tracks aren't that distracting.With that out of the way, most viewers probably want to know how the three longer pieces function, and I think taking the big pieces track by track is the best way to look at this album.''R.I.P'' is really the reason why this album first caught my attention. It's divided into two distinct sections, the first being very in-your-face aggressive and high-energy. The pianos are probably the heaviest you will ever hear in music, period. But then halfway in, the song smoothly segues into a poignant ballad emphasizing DiGiacomo's vocal talents as well as the delicate piano lines.''Metamorfosi'' is pretty much what you're thinking of; even if you don't speak a lick of Italian (as is my case), you can expect a wild ride. The opening theme (that's reprised halfway in) continues the neckbreak pace of ''R.I.P.'', but swirls around the dynamic levels with the theme immediately thereafter. The band does a fantastic job of toying with the dynamic levels in the first five minutes to keep the listener on the edge of their seat the whole time. BdMS pulls about the same trick they did for ''R.I.P'' in completely pulling the mood down into ballad mode (and the lone vocal spot on the song despite the 11 minute roller coaster), but here, the group goes hard rock at the end for a thrilling climax.The big epic ''Il Giardino del Mago'' opts to start on a more gentle note with a crawling ballad that can crescendo at the right time. The moments of intensity that BdMS had been babying the listener with throughout the album are still here with Hammond organs that sound like if Keith Emerson was a member of Magma (there's an interesting visual image for the progsters out there). The themes switch off fluidly for the most part, but what makes the epic special is the smart placements of any recapitulation. BdMS does this here whenever you feel like you've forgotten about that softer point halfway through the song because there was another dramatic theme that sucked you in before, or at the very end in getting a summary of what was played in about a 40 second span.A quick comment on the Nocenzi keyboard brothers. It's simply amazing how front-and-center the two are in the scope of the band, and yet they build a unique sound for BdMS nevertheless. They both are like the Italian Kerry Minnear in that they can really make their keyboards sound perfect for the song. And like I've stated earlier, they can make a grand piano in hard rock music sound plausible. That alone should give them a medal.Banco del Mutuo Soccorso's debut album is probably that album that the symphonic progster fantasizes about being that epic masterpiece album they've always dreamed of. There's no fantasy here; it's a real deal masterwork."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Monday, March 16, 2015",
      "rating": 5,
      "text": "Much like Gentle Giant who were an inspiration, the Italian group BANCO DEL MUTUO SOCCORSO (Bank Of Mutual Rescue) was founded by musical brothers, in this case Vittorio and Gianni Nocenzi. In the early 70s at the peak of the first golden age of progressive rock but unlike many contemporaries who needed an album or two to get their feet wet, these guys hit a major home run on their eponymous debut album in 1972, which has become one of the most revered albums in all of progressive rock and for good reason. This album is absolutely BRILLIANT!!!Although they had already formed in 1969 they found no reason to revisit the psychedelic 60s and instead channeled their energies into a highly artful form of symphonic prog that not only borrowed some of the lightness from Genesis, but also included energetic keyboard outbursts like ELP as well as the folk inspired sounds from their homeland inspired by Jethro Tull as heard on clarinet and a kind of trumpet called the clarino. BANCO adeptly blended acoustic and electric instruments with daring vocals in Italian and mastered the art of lulling you into an addictive melody that simultaneously hooked you in while stunning with sophisticated musical wizardry. This album delivers the absolute perfect ratchet effect and never lets me drift away for a second.This is a highly complex album delivering classically derived compositions put entirely into a rock context. Massive sprawling tracks like \"Metamorfosi\" and \"Il Giardino Del Mago\" are so stuffed with musical ideas that they never let the listener's attention stray from their path. While BANCO does let loose on occasion and really rock out, they are much more adept at spending long periods of time with subtleties and delicate passages that take their time to make the journey an interesting one before coming to a conclusion.This era of Italian prog is notorious for poor production and i highly advise getting one of the newer remastered versions of this release, for even on these it is not perfect but a huge improvement over some of the weaknesses of the original, however it is the music that overpowers any production complaints. This is one of those few touched-by-God albums where unearthly energies conspired to make something magnanimous beyond the sum of the parts. I have tried and failed to find any flaws in this music. It is a timeless as a Mozart symphony, as daring as \"Dark Side Of The Moon\" in a totally different way and although many a prog band would borrow from this style, BANCO DEL MUTUO SOCCORSO was revolutionary when it was released easily separating itself from contemporaries like PFM.Wending from sophisticated piano runs to complex guitar runs, BANCO delivered an outstanding debut album that is one of those albums i can really put on replay and never tire of. If you're new to this band, this is the perfect place to start but don't expect to be able to take this in quickly because the true beauty of this album is how it unfolds slowly and demands that you put it on again and again. Don't waste your time on all those fraudulent derivatives and mortgage scams, put your money in an investment of greatness that delivers musical satisfaction time and time again."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Saturday, February 27, 2016",
      "rating": 5,
      "text": "Ever since re-entering the music scene in 2008 after an absence of nearly twenty years I was overwhelmed by many international music scenes of which I had previously been relatively unaware. Rock progressivo Italiano is one of these. And with my enthusiastic interest drawn to the amazing number of modern artists contributing to what has proved to be quite an exciting revival of my once-beloved progressive rock music, I have not always given older albums the time and attention necessary to truly familiarize myself with them much less appreciate them. Still, I have slowly acquired the much revered \"classics.\" (This one has 663 ratings/reviews on PA alone!) Banco has impressed me from my initial listens. The maturity and sophistication of songmaking is astounding. And to put into the formula the fact that this album and Darwin! (both 1972 releases) predate many of the most cherished masterpieces of the Golden Age only increases my appreciation and awe. The dynamic range, confidence to be quiet and subtle and then be bold and loud, all the while using thoughtful not-whimsical constructs and virtuosic command of all instruments is a wonder to behold. While the sound of lead vocalist Francesco Di Giacomo's voice is one that has still not grown comfortable or favorable to me, I find nothing but musical excellence throughout Banco's first album. It's display of musical and instrumental mastery is undeniable. Where it may lack slightly is in memorability. After several years of owning this and occasionally spinning it through my brain I still find little or no connection with the music--it has not penetrated my soul in the way that many of the 'less sophisticated' masterpieces of the era have. Not the way Darwin! and especially Io sono nato libero have done. Hence, a rating is very difficult for me to render as I do not rate this one on the same par as the two aforementioned classics, yet it is such an amazing collection of constructs it is difficult for me to give it anything less than the five stars it truly deserves. To me, it is an excellent addition to any prog rock music collection but in terms of its contribution to music history I cannot deny that it is probably essential and is definitely a masterpiece of progressive rock music . . . just not as great as either Darwin! or Io sono nato libero."
    },
    {
      "reviewer": "Modrigue",
      "date": "Posted Monday, May 30, 2016",
      "rating": 3,
      "text": "Rock Progressivo e Classico3.5 starsFirst album of BANCO DEL MUTUO SUCCURSO, this self-titled opus combines the majesty of classical music and the power of early 70's hard rock, with a touching proper Italian sensibility. The disc is strangely structured, as it features three long songs with different durations and three short passages.Beginning in a mysterious atmosphere, \"In Volo\" is in fact a pleasant medieval theme played at the flute, introducing the best song of the record, \"R.I.P.\". Lifely and catchy, the track presents a good balance nervous guitar and piano, with a beautiful melancholic interlude. One of the best compositions from the RPI genre! \"Passaggio\" is a short transition simply consisting in keyboardist Vittorio Nocenzi entering the room, playing harpsichord, and leaving the room by slamming the door!The mini-epic \"Metamorfosi\" is quite interesting. Its first half is instrumental and features a powerful combination of seventies' hard rock and classical keyboards. This part surely shares similitudes with ELP. The second half is softer and more delicate, and the finale is haunting. This song has some weaknesses, but is overall pretty cool. Unfortunately, although it mixes the same musical elements, the same cannot be said for the 18 minutes uneven \"Il Giardino Del Mago\". Not as convincing, the longest track of the disc contains a few nice moments, however these can get a bit repetitive at times. \"Traccia\" concludes the record with a baroque hard rock theme.At first sight, by looking at the instruments, \"Banco del Mutuo Succurso\" may look similar to symphonic prog acts. Nevertheless, the approach is very different from English bands such as ELP or GENESIS, and the sensibility is typically Italian. Some passages are powerful whereas others are touching. Despite lengthy moments on \"Il Giardino Del Mago\", this debut album remains my favorite from the band, maybe because this is their rock-iest effort from their \"classical\" prog period.Recommended if you want to discover the Rock Progressivo Italiano, and a good entry point to the genre for 70's hard rock fans."
    },
    {
      "reviewer": "Kempokid",
      "date": "Posted Sunday, March 24, 2019",
      "rating": 4,
      "text": "While I haven't listened to much RPI at this point in time, mainly only listening to some of the big bands such as Le Orme and PFM, the debut album of Banco Del Mutuo Soccorso easily stands out to me, having a more energetic, experimental sound to it, making it stand out from the others I've hears which stuck to a more beautiful approach. That's not to say I necessarily like it more than those others, it's just that this one is quite interesting to me, further due to the odd album structure, only having 3 real songs, 2 over 10 minutes, and then a few interludes. The album most reminds me of Emerson, Lake and Palmer but with a strong Italian identity and a vocalist more suited to opera.The first proper song on the album is also the one I consider far and away the best here, as it still impresses me just how much harder this song rocks compared to the rest of the Italian prog I've heard, being wonderfully energetic with the guitar and piano playing off each other excellently, while Pier Luigi Calderoni bashes away at the drums. This song is so incredibly catchy, with a superb vocal melody from Francesco Di Giacomo, who I think has an excellent voice all around. Further adding to this song's greatness are the solos in the first half, which are a perfect mix of bombastic and enjoyable. The final nail in the coffin that secures this song as being absolutely brilliant is its complete change at the halfway mark, leaning much harder on classical influences as it slows down considerably, making way for lush, breathtaking piano lines and flutes, the vocal absolutely stealing the show. This all culminates with the drumming becoming progressivly becoming faster until everything bursts into a much more grandiose sound produced by the organ. Metamorfosi is a far more experimental, wild piece, being predominantly instrumental, with hints of frenetic jamming amongst sometimes jazzy, melodic lines and solos. The song never really sits still, as even during the quieter sections, there's always some sort of instrument playing very energetically until just past the halfway mark, where just like the previous song, it shifts considerably into much slower, more emotive sounding music. The song picks up again near the end, being much darker sounding. I find this track quite good in general, but definitely feel like it could have been shortened by a couple of minutes. Il Giardano Del Mago is definitely the most free flowing of the songs, being an 18 minute multipart suite that has a fairly consistent tone to it, but definitely goes from dark and isolated, especially when the vocals are backed up by some unsettling harmonies, which transitions excellently into what almost sounds like chanting as the song picks up considerably into an instrumental breakdown that sounds quite similar to certain sections of Tarkus. The song continues progressing, with a really pleasant, softer section further accentuating the vocal talent present here, before picking right back up again, complete with an excellent section with the clarinet. Overall, I find this to be another excellent song, despite once again feeling as if it could have been cut by a couple of minutes. The short interludes on the album are all quite nice sounding, but are just interludes, so I really don't pay too much attention to them in all honesty.While occasionally carrying on for too long during certain sections of the 2 longer songs, this album nonetheless is one that I find highly enjoyable, perfectly balancing between energy and beauty in a highly appealing way. In terms of quality, I'd recommend this album to newcomers of the genre, as it both contains the accessible, fun song of R.I.P, while also having some more challenging, ambitious stuff on here in the form of the two epics, providing depth while also being all around fun.Best songs: R.I.P, MetamorfosiWeakest songs: noneVerdict: A fun album filled with bursts of energy and sweeping sections of beauty making it quite nicely balanced. The longer tracks probably each could have been cut down a bit, but it doesn't really hurt the album's quality all that much."
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Friday, December 18, 2020",
      "rating": 5,
      "text": "Here's to you the Banco's debut. One of the most important record in history of Italian prog.Side A:There are four songs but in the reality just two true songs and two fragments of songs. These fragments are the introduction to a mini-suite.The first fragment, \"In Volo\" is a recited song, with a Renaissance style, worthy of Genesis, or Gentle Giant as a mood, but overall today it is dated. It serves to create the atmosphere, it is understood immediately that Banco wanted to be prog. Their debut, in fact, is among the most prog Italian record: more prog than Storia di un Minuto by Pfm or Collage by Le Orme.In volo opens to \"RIP\", which is one of the absolute masterpieces of all Italian prog. Here we meet, summarized in 7 minutes without frills, all the art of Banco: an excellent melody created by the keyboards of the Nocenzi brothers accompanied by the tenor operatic voice of Francesco Di Giacomo, aggressive instrumental progressions led by drums (Calderoni) and electric guitar (Todaro), Baroque instrumental solos alternating with pauses. We are in full symphonic rock, but what makes this music unique is the beauty of the melodies, punctuated by Di Giacomo's vocals. Masterpiece. Vote 9.After the second fragment, a ballad on the harpsichord, comes the second song, \"Metamorfofi\", which starts with a rhythmic progression, moves on to a classical piano piece, returns to the rhythmic progression, and only in the end comes the vocals, preceded by phrases on the guitar that trace its melody. Daring theatrical finale. It looks like a minisuite but in reality it is a melodic verse/chorus song, like all the other two songs, reworked, dilated to make it sound like a suite, which obsessively fights over some piano phrases. It is an excellent song always thanks to the beautiful melody and the excellent arrangements that are able to deepen a musical motif, to create variations around it without tiring. It's not love at first sight like the first song but it's a remarkable piece without flaws. Rating 8,5.SIDE B.And on the second side the same goes for the suite \"Il giardino del mago\" which .... is not a suite! Again the group insists spasmodically, almost paranoidly on a banal piano phrase but manages to create rock music, alternating with classical and jazz, reworking that little musical content, then the rhythmic progressions and the voice of Di Giacomo, protagonist here, arrive to do the rest, that is to make listening always interesting, only at times close to the cacophony and anguish of the Van der Graafs. And in all this the piano composition prevails, not the virtuosity a la Keith Emerson. It's another perfect song, 8.5 rating.The final fragment takes up the frenzied rhythm with which the suite (which is not a suite) had closed, adding Mediterranean choirs to make the ending even more pompous.In my opinion this album would have been slightly better without the three fragments. It remains a masterpiece, however thanks to three wonderful melodic songs that many bands would not be able to write even in 20 years.Rating album: 9+. Masterpiece. Five stars."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Monday, September 25, 2023",
      "rating": 4,
      "text": "In a flourishing and golden 1972 for the genre, another of the fundamental actors of Italian progressive rock appeared on the scene, Banco del Mutuo Socorsso. While sharing the influences of the indispensable E,L&P and similar mastodons of the time, Banco ventured to combine dense structures with baroque and classical elements, unlike their more melodic and gentle compatriots, Premiata Forneria Marconi.And Banco's eponymous debut album reflects that, where generous and at times mysterious instrumental developments contrasted with intermittent but decisive and overwhelming vocal interventions, mould a work of remarkable pieces. Such as the moribund \"R.I.P. (Requiescant In Pace)\", of epic character and framed towards its epilogue by the enormous and dramatic vocal register of Francesco Di Giacomo, one of the best of the album, or the Kafkaesque \"Metamorfosi\", of clear Emersonian influences, a demonstration of the virtuosity of Vittorio Nocenzi and his brother Gianni on keyboards, going back and forth between passages charged with intensity in a counterpoint with Marcello Todaro's guitars and the restraint of Pier Luigi Calderoni's lighthearted percussion, or also the extensive and mysterious suite \"Il Giardino Del Mago\", unravelled between sombre atmospheric passages and deep sonorous lucubrations again guided by Vittorio Nocenzi on keyboards, the lyrical brushstrokes of the incommensurable Di Giacomo, and the correct bass of Renato D'Angelo.At the initial and final extremes of the album, both the brief \"In Volo\" with its spacey aroma and pastoral flutes, and the unhinged \"Traccia\" with its schizoid choruses and rushed development, add a tinge of immediacy and versatility, complementing the stupendous musical proposal.With their first work, Banco begins to write their history and make a prominent place for themselves in the Olympus of the Italian vein of the genre, sharing the podium with PFM and Le Orme.Excellent.4/4.5 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album14f0.html",
  "last_parsed": "2025-05-18T00:11:12.945753"
}