{
  "local_path": "C:\\Users\\salmo\\Documents\\GitHub\\AlbumExplore\\ProgArchives Data\\Website\\ProgArchives\\www.progarchives.com\\artist3dd2.html",
  "name": "PINK FLOYD",
  "genre": "Psychedelic/Space Rock",
  "country": "United Kingdom",
  "biography": "Formed in 1965 in London, UK - Disbanded in 1994 - Reunited with different formation on several ocasions\n\nOne of the biggest bands of all time\n\nOf all the bands who come under the progressive rock banner, Pink Floyd are, arguably, the act most recognisable in the wider music community to music lovers of all genres. Yet, as revealed famously by Nick Mason in an old interview, even at the height of their fame, they could walk down any street, and passers-by would not have recognised a member of one of the most commercially successful acts in music history.\n\nThe band were formed in London in 1965, the original members being\n\nRoger (known as Syd) BARRETT\n\non vocals and lead guitar,\n\nNick MASON\n\non drums,\n\nRoger WATERS\n\non bass guitar and vocals, and\n\nRick WRIGHT\n\non keyboards.\n\nThe London of the late 1960's was a melting pot of live acts and varying musical genres, and the band gained a cult following amongst the underground psychedelic crowd of the time. This expanded into a more public consciousness with a residency at the famous UFO Club, with a hypnotic light show and pulsating, often indescribable, sounds. This led to television appearances, most famously an interview and live performance on BBC The Look of the Week, with a rather bemused classical performer Hans Keller in tow. Waters was famously asked just why everything had to be so loud?!\n\nThis popularity led to the band signing to EMI, who in 1967 released two hit singles, Arnold Layne, which attracted controversy regarding its cross-dressing themes, and See Emily Play. They charted in the UK at 20 and 6 respectively.\n\nThe debut album which followed, Piper At The Gates Of Dawn, is universally recognised as being hugely influential in rock music, beyond the narrow confines of psychedelia. It peaked at number 6 in the UK album charts in 1967, and the band continued to play not only their residency, but also increasing numbers of national gigs and festivals.\n\nThe strain, however, was beginning to tell on Barrett, and a fragile mental state, exacerbated by LSD, led to him becoming almost semi-detached from the band and wider reality. The situation became such that the band, at the end of 1967, drafted in\n\nDavid GILMOUR\n\nto play alongside, or instead of, Barrett at gigs. By early 1968, matters came to a head, with the band famously waiting for Barrett to arrive for transportation to a gig, not turning up, and, when asked if they should pick him up, an unnamed band member saying not to bother. It was the end of the band leader's tenure, and, as he would famously state in later years, Waters took up the mantle \"because no one else would\".\n\nThe period between Barrett leaving and the release of Meddle in 1971 saw the band continuing to experiment with varying musical forms, and varying degrees of success. The side long epic from Meddle, Echoes, became a soundtrack for several filmed projects, and the album can, in retrospect, be seen as the end to a transitional period, prior to world dominance.\n\nThat dominance came in 1973 with the release of Dark Side Of The Moon. Many critics and fans alike have wondered why this album came to be so hugely popular. Nobody had ever really heard anything like it before, with its live recordings of workers at, or passing by, Abbey Road studios ruminating on life, death, the universe, and everything, its use of terrific sound effects, massive themes, operatic solos, interspersed with a huge hit single in Money. Certainly, the album is a landmark of progressive excellence, but it was also lucky in its success. As with Oldfield's Tubular Bells, the album was released just as cheap high street credit enabled music lovers to own the modern hi-fi systems which brought the exceptional sound engineering of Alan Parsons to vivid life. The album was both a product and symbol of its time.\n\nDark Side charted for years, and, to this day, sells in its millions.\n\nThe 1975 follow-up, Wish You Were Here, more grandiose in scope than its predecessor, also topped the charts worldwide. The Floyd bestrode the world as its undisputed commercial rock leaders.\n\nThe success, though, took its toll. Barrett, who had mysteriously turned up at the recording of Wish You Were Here, in an abject state, not even recognisable at first sight, had become mentally ill and detached from the wider world. Waters became detached from the band he led, perhaps because of the mental tensions of a communist having to deal with such vast sums of money and fame. He certainly felt that, when the band reconvened for the recording of the successor album, his bandmates, and Wright in particular, were not pulling their weight, and the resultant Animals, released in 1977, was, a Gilmour collaboration on one track aside, entirely his work. The band were becoming a Waters backing outfit, and the invective in this album, described by more than a few as the finest punk rock album of all time, was quite shocking. The album was also famous for the publicity stunt of a giant inflatable pig leaving its moorings at Battersea Park, London, and disrupting flights into and out of the city.\n\nThe resultant tour became famous for the inspiration behind the music and lyrics which would eventually be recorded as The Wall, when Waters spat on a fan screaming a little bit too enthusiastically in a musical passage, thus cementing, to him, the disconnect which had arisen between band and fans in the large stadia they were playing (although this did not prevent, in later years, Waters touring in such venues as a solo artist).\n\nThe Animals tour was not the only reason for The Wall coming to life. In 1978, financial investment firm Norton-Warburg crashed, with much of The Floyd's money crashing with it. Suddenly, the band found themselves on the verge of financial ruin, and a new album and tour became not so much a musical necessity, as an exercise in sheer survival.\n\nThe Wall was released in 1979, and, again, topped the charts worldwide. The theatrical tour, with Waters and the band hidden literally by a wall built during the show, prior to being torn down revealing the author's innermost fears and prejudices, was ground-breaking and breath-taking in its scope. The band, though, were falling apart. First to go was Richard Wright, who was fired by Waters, with, he has always insisted, the full participation of Mason & Gilmour. Wright did, though, take full part in the world tour, although on a salary (Gilmour later said that Wright, as a result, was the only member who made money out of an incredibly expensive tour). The band, by now, were barely speaking to each other.\n\nWaters, Gilmour, and Mason (although the latter not on all the album) did reconvene for one last recording, the aptly titled The Final Cut, released in 1983. The album sold well, but nowhere near as much as previous works, and was described by Mason as the shining example of how not to make an album. It was, in effect, a Waters solo album in all but name. Waters subsequently left the band, with Mason, again, wryly observing that if he had really wanted to call a halt to proceedings, he would have been better remaining inside, and merely not bothering to do anything.\n\nThe band had now lost two hugely influential leaders over time in Barrett and Waters, but Gilmour and Mason, doggedly, refused to give up, and, with a rehired Richard Wright (on a salary), they proceeded to delight the rock music world with the announcement and recording of a new album, A Momentary Lapse of Reason, in 1987. The album was musically the work of Gilmour, with lyrics penned by a variety of contributors. The decision, which was a risk financially for Gilmour & Mason, was more than justified in terms of commercial success. It was more of a mainstream Floyd rock album than its immediate predecessors, and the subsequent, huge, world tours which resulted utilised, to incredible effect, the massive advancements which had arisen in digital technology. Pink Floyd were, once again, at the top of the tree in terms of critical and commercial success.\n\nThe band were to release one more album, The Division Bell, in 1994, with Wright returning to co and sole song writing duties for the first time in some 19 years, and Gilmour's wife, Polly Samson, writing the bulk of the lyrics to Gilmour's music. The album, single High Hopes, and tour were a massive commercial success again.\n\nThe album would prove to be the band's recording swansong, although both Waters and Gilmour continued to release solo albums. In 2005, at the insistence of the inimitable Bob Geldof, the classic line-up reconvened for a live performance one last time, with a short set of classics from Dark Side, Wish, and The Wall. In 2006, Barrett died from cancer, and, in 2008, Wright died of the same condition, the latter demise putting paid to any hope the music world might have had of more Floyd, although both surviving members have played together on Waters solo tour of The Wall.\n\nPink Floyd are listed on the Prog Archives site as belonging to the Psychedelic/Space Rock sub-genre. In reality, that period ended in the early 1970's, and they became so much more than that. For anyone wishing to explore the era of 1970's musical behemoths bestriding the rock world, The Pink Floyd are simply an essential part of that musical journey.\n\nSteve Lazenby (Lazland) - 2017\n\nSee also:\n\nZabriskie Point - Original Soundtrack",
  "albums": [
    {
      "title": "Atom Heart Mother",
      "local_path": "album543b-2.html",
      "year": 1970,
      "rating": 3.91,
      "type": "Studio Album"
    },
    {
      "title": "Meddle",
      "local_path": "album5aa1.html",
      "year": 1971,
      "rating": 4.3,
      "type": "Studio Album"
    },
    {
      "title": "Obscured by Clouds",
      "local_path": "albuma0a5.html",
      "year": 1972,
      "rating": 3.38,
      "type": "Studio Album"
    },
    {
      "title": "The Dark Side of the Moon",
      "local_path": "album643a.html",
      "year": 1973,
      "rating": 4.62,
      "type": "Studio Album"
    },
    {
      "title": "Wish You Were Here",
      "local_path": "albumb9d0.html",
      "year": 1975,
      "rating": 4.64,
      "type": "Studio Album"
    },
    {
      "title": "Animals",
      "local_path": "album1cdb.html",
      "year": 1977,
      "rating": 4.53,
      "type": "Studio Album"
    },
    {
      "title": "The Wall",
      "local_path": "album8ab4.html",
      "year": 1979,
      "rating": 4.09,
      "type": "Studio Album"
    },
    {
      "title": "The Final Cut",
      "local_path": "albuma34d.html",
      "year": 1983,
      "rating": 3.18,
      "type": "Studio Album"
    },
    {
      "title": "A Momentary Lapse of Reason",
      "local_path": "album9780.html",
      "year": 1979,
      "rating": 3.07,
      "type": "Studio Album"
    },
    {
      "title": "The Division Bell",
      "local_path": "album9d32.html",
      "year": 1994,
      "rating": 3.74,
      "type": "Studio Album"
    },
    {
      "title": "The Endless River",
      "local_path": "albume3c1.html",
      "year": 2014,
      "rating": 3.19,
      "type": "Studio Album"
    },
    {
      "title": "Live in Venice",
      "local_path": "albumf671.html",
      "year": 2021,
      "rating": 3.86,
      "type": "Live Album"
    },
    {
      "title": "The Dark Side of the Moon Live at Wembley 1974",
      "local_path": "albumbb48.html",
      "year": 1974,
      "rating": 4.02,
      "type": "Live Album"
    },
    {
      "title": "Pink Floyd at Pompeii - MCMLXXII (2025 Mix)",
      "local_path": "album094c.html",
      "year": 2025,
      "rating": 4.77,
      "type": "Live Album"
    },
    {
      "title": "P-U-L-S-E",
      "local_path": "albuma811.html",
      "year": 1995,
      "rating": 4.45,
      "type": "Video/DVD"
    },
    {
      "title": "London - Live 66-67",
      "local_path": "album73fb.html",
      "year": 1999,
      "rating": 3.15,
      "type": "Video/DVD"
    },
    {
      "title": "Live at Pompeii (The Director's Cut)",
      "local_path": "albumb254-2.html",
      "year": 2003,
      "rating": 4.59,
      "type": "Video/DVD"
    },
    {
      "title": "Classic Albums: The Dark Side Of The Moon",
      "local_path": "albumc2f6.html",
      "year": 2003,
      "rating": 4.09,
      "type": "Video/DVD"
    },
    {
      "title": "Inside Pink Floyd",
      "local_path": "albumaae4.html",
      "year": 2003,
      "rating": 2.9,
      "type": "Video/DVD"
    },
    {
      "title": "The Pink Floyd & Syd Barrett Story",
      "local_path": "albumb4ba.html",
      "year": 2003,
      "rating": 3.3,
      "type": "Video/DVD"
    },
    {
      "title": "Inside Pink Floyd Volume 2 - A Critical Review 1975 - 1996",
      "local_path": "album6416.html",
      "year": 1975,
      "rating": 2.38,
      "type": "Video/DVD"
    },
    {
      "title": "The Ultimate Review",
      "local_path": "album503d.html",
      "year": 2005,
      "rating": 2.2,
      "type": "Video/DVD"
    },
    {
      "title": "The World's Greatest Albums - Atom Heart Mother",
      "local_path": "album0058.html",
      "year": 2005,
      "rating": 2.27,
      "type": "Video/DVD"
    },
    {
      "title": "Rock Milestones Pink Floyd's Wish You Were Here",
      "local_path": "album72a6.html",
      "year": 2005,
      "rating": 2.7,
      "type": "Video/DVD"
    },
    {
      "title": "Reflections And Echoes",
      "local_path": "album1ef6.html",
      "year": 2006,
      "rating": 2.24,
      "type": "Video/DVD"
    },
    {
      "title": "Rock Milestones Pink Floyd's The Piper At The Gates of Dawn",
      "local_path": "album19f1.html",
      "year": 2006,
      "rating": 2.91,
      "type": "Video/DVD"
    },
    {
      "title": "Rock Milestones: Ummagumma",
      "local_path": "album66c5.html",
      "year": 2006,
      "rating": 1.64,
      "type": "Video/DVD"
    },
    {
      "title": "Music Box Biographical Collection",
      "local_path": "albumec90.html",
      "year": 2006,
      "rating": 2.11,
      "type": "Video/DVD"
    },
    {
      "title": "The Dark Side - Interviews",
      "local_path": "albumbbc8.html",
      "year": 2006,
      "rating": 2.22,
      "type": "Video/DVD"
    },
    {
      "title": "Total Rock Review",
      "local_path": "albumeb2a.html",
      "year": 2006,
      "rating": 2.17,
      "type": "Video/DVD"
    },
    {
      "title": "Meddle: A Classic Album Under Review",
      "local_path": "albumd687.html",
      "year": 2007,
      "rating": 2.69,
      "type": "Video/DVD"
    },
    {
      "title": "Retrospectives",
      "local_path": "album8026.html",
      "year": 2007,
      "rating": 3.04,
      "type": "Video/DVD"
    },
    {
      "title": "The Early Pink Floyd - A Review And Critique",
      "local_path": "albumce0a.html",
      "year": 2008,
      "rating": 1.96,
      "type": "Video/DVD"
    },
    {
      "title": "Comfortably Numb",
      "local_path": "album9d2b.html",
      "year": 2008,
      "rating": 2.21,
      "type": "Video/DVD"
    },
    {
      "title": "A Technicolor Dream",
      "local_path": "album5881.html",
      "year": 2008,
      "rating": 2.93,
      "type": "Video/DVD"
    },
    {
      "title": "Live Anthology",
      "local_path": "album6675.html",
      "year": 2008,
      "rating": 3.62,
      "type": "Video/DVD"
    },
    {
      "title": "The Great Gig In The Sky: The Album By Album Guide",
      "local_path": "album1696.html",
      "year": 2008,
      "rating": 2.06,
      "type": "Video/DVD"
    },
    {
      "title": "The Story of Wish You Were Here",
      "local_path": "album9305-2.html",
      "year": 2012,
      "rating": 3.98,
      "type": "Video/DVD"
    },
    {
      "title": "A Collection of Great Dance Songs",
      "local_path": "album8d2f.html",
      "year": 1981,
      "rating": 2.24,
      "type": "Compilation"
    },
    {
      "title": "Works",
      "local_path": "albumf94e-2.html",
      "year": 1983,
      "rating": 2.2,
      "type": "Compilation"
    },
    {
      "title": "Hits",
      "local_path": "album052f.html",
      "year": 1983,
      "rating": 3.15,
      "type": "Compilation"
    },
    {
      "title": "Shine On",
      "local_path": "album8b3c.html",
      "year": 1992,
      "rating": 3.53,
      "type": "Compilation"
    },
    {
      "title": "The Early Singles",
      "local_path": "album6427.html",
      "year": 1992,
      "rating": 3.67,
      "type": "Compilation"
    },
    {
      "title": "1967: The First Three Singles",
      "local_path": "albumc9e3-2.html",
      "year": 1967,
      "rating": 3.12,
      "type": "Compilation"
    },
    {
      "title": "Echoes - The Best of Pink Floyd",
      "local_path": "album92be.html",
      "year": 2001,
      "rating": 3.46,
      "type": "Compilation"
    },
    {
      "title": "Oh By The Way...",
      "local_path": "album75cd-2.html",
      "year": 2007,
      "rating": 4.09,
      "type": "Compilation"
    },
    {
      "title": "A Foot In The Door: The Best Of Pink Floyd",
      "local_path": "album1fed.html",
      "year": 2011,
      "rating": 2.93,
      "type": "Compilation"
    },
    {
      "title": "Discovery",
      "local_path": "album0c68.html",
      "year": 2011,
      "rating": 4.36,
      "type": "Compilation"
    },
    {
      "title": "The Dark Side of the Moon - Experience Edition",
      "local_path": "album7dda.html",
      "year": 2011,
      "rating": 4.79,
      "type": "Compilation"
    },
    {
      "title": "The Dark Side Of The Moon - Immersion Edition",
      "local_path": "album7fe4.html",
      "year": 2011,
      "rating": 4.66,
      "type": "Compilation"
    },
    {
      "title": "Wish You Were Here - Experience Edition",
      "local_path": "albumc6c8.html",
      "year": 2011,
      "rating": 4.75,
      "type": "Compilation"
    },
    {
      "title": "Wish You Were Here - Immersion Edition",
      "local_path": "albumfbf3.html",
      "year": 2011,
      "rating": 4.54,
      "type": "Compilation"
    },
    {
      "title": "The Wall - Experience Edition",
      "local_path": "album5f12.html",
      "year": 2011,
      "rating": 4.31,
      "type": "Compilation"
    },
    {
      "title": "The Wall Singles",
      "local_path": "album4cec.html",
      "year": 2011,
      "rating": 2.01,
      "type": "Compilation"
    },
    {
      "title": "The Wall - Immersion Edition",
      "local_path": "album6f12.html",
      "year": 2012,
      "rating": 3.93,
      "type": "Compilation"
    },
    {
      "title": "The Division Bell (20th Anniversary Deluxe Box)",
      "local_path": "albumbf13-2.html",
      "year": 2014,
      "rating": 4.19,
      "type": "Compilation"
    },
    {
      "title": "The Early Years 1967-1972 Creation",
      "local_path": "albumefaf.html",
      "year": 1967,
      "rating": 3.97,
      "type": "Compilation"
    },
    {
      "title": "The Early Years Continu/ation 1967-1974 Sessions",
      "local_path": "albumea68.html",
      "year": 1967,
      "rating": 3.49,
      "type": "Compilation"
    },
    {
      "title": "The Early Years 1965-1967 Cambridge St/ation",
      "local_path": "album058b.html",
      "year": 1965,
      "rating": 4.45,
      "type": "Compilation"
    },
    {
      "title": "The Early Years 1968 Germin/Ation",
      "local_path": "album9343.html",
      "year": 1968,
      "rating": 4.06,
      "type": "Compilation"
    },
    {
      "title": "The Early Years 1969 Dramatis/ation",
      "local_path": "album6a2f.html",
      "year": 1969,
      "rating": 3.63,
      "type": "Compilation"
    },
    {
      "title": "The Early Years 1970 Devi/ation",
      "local_path": "album074b.html",
      "year": 1970,
      "rating": 4.36,
      "type": "Compilation"
    },
    {
      "title": "The Early Years 1971 Reverber/ation",
      "local_path": "album6c2c.html",
      "year": 1971,
      "rating": 3.68,
      "type": "Compilation"
    },
    {
      "title": "The Early Years 1972 Obfusc/ation",
      "local_path": "albumfbf9-2.html",
      "year": 1972,
      "rating": 3.92,
      "type": "Compilation"
    },
    {
      "title": "The Later Years 1987 - 2019",
      "local_path": "album57ae-2.html",
      "year": 1987,
      "rating": 3.77,
      "type": "Compilation"
    },
    {
      "title": "The Later Years 1987-2019 (Highlights)",
      "local_path": "albumcca4.html",
      "year": 1987,
      "rating": 3.64,
      "type": "Compilation"
    },
    {
      "title": "Animals (2018 Remix)",
      "local_path": "album7c1a.html",
      "year": 2018,
      "rating": 4.29,
      "type": "Compilation"
    },
    {
      "title": "Flaming",
      "local_path": "albuma811-3.html",
      "year": 1967,
      "rating": 3.74,
      "type": "EP/Single"
    },
    {
      "title": "It Would Be So Nice",
      "local_path": "album5770-2.html",
      "year": 1968,
      "rating": 3.4,
      "type": "EP/Single"
    },
    {
      "title": "Point Me at the Sky",
      "local_path": "album4c9b.html",
      "year": 1968,
      "rating": 3.71,
      "type": "EP/Single"
    },
    {
      "title": "The Nile Song",
      "local_path": "album0c91.html",
      "year": 1969,
      "rating": 3.02,
      "type": "EP/Single"
    },
    {
      "title": "One Of These Days",
      "local_path": "album26b2.html",
      "year": 1971,
      "rating": 3.88,
      "type": "EP/Single"
    },
    {
      "title": "Free Four",
      "local_path": "albuma6eb.html",
      "year": 1972,
      "rating": 4.03,
      "type": "EP/Single"
    },
    {
      "title": "Free Four / Absolutely Curtains",
      "local_path": "album4bd8.html",
      "year": 1972,
      "rating": 4.0,
      "type": "EP/Single"
    },
    {
      "title": "Money",
      "local_path": "album3c0e-2.html",
      "year": 1973,
      "rating": 3.81,
      "type": "EP/Single"
    },
    {
      "title": "Time",
      "local_path": "album0c43.html",
      "year": 1973,
      "rating": 3.66,
      "type": "EP/Single"
    },
    {
      "title": "Have a Cigar",
      "local_path": "album3ac6.html",
      "year": 1975,
      "rating": 3.69,
      "type": "EP/Single"
    },
    {
      "title": "Pigs on the Wing / Sheep",
      "local_path": "album513f.html",
      "year": 1977,
      "rating": 3.82,
      "type": "EP/Single"
    },
    {
      "title": "Pigs (Three Different Ones)",
      "local_path": "album9d5f-2.html",
      "year": 1977,
      "rating": 4.6,
      "type": "EP/Single"
    },
    {
      "title": "Comfortably Numb",
      "local_path": "albumfcca.html",
      "year": 1979,
      "rating": 3.89,
      "type": "EP/Single"
    },
    {
      "title": "Another Brick In The Wall",
      "local_path": "album88dd.html",
      "year": 1979,
      "rating": 3.7,
      "type": "EP/Single"
    },
    {
      "title": "Run Like Hell",
      "local_path": "album0ca4-2.html",
      "year": 1980,
      "rating": 3.47,
      "type": "EP/Single"
    },
    {
      "title": "When the Tigers Broke Free",
      "local_path": "album857d.html",
      "year": 1982,
      "rating": 3.32,
      "type": "EP/Single"
    },
    {
      "title": "Not Now John/The Hero's Return (Part 2)",
      "local_path": "albumddfc.html",
      "year": 1983,
      "rating": 2.01,
      "type": "EP/Single"
    },
    {
      "title": "Learning To Fly (promo single)",
      "local_path": "albumd083.html",
      "year": 1987,
      "rating": 2.54,
      "type": "EP/Single"
    },
    {
      "title": "On the Turning Away",
      "local_path": "albumd3bb.html",
      "year": 1987,
      "rating": 3.11,
      "type": "EP/Single"
    },
    {
      "title": "One Slip",
      "local_path": "album0a51.html",
      "year": 1988,
      "rating": 3.02,
      "type": "EP/Single"
    },
    {
      "title": "A Momentary Lapse Of Reason Official Tour CD",
      "local_path": "album17c5.html",
      "year": 1988,
      "rating": 3.04,
      "type": "EP/Single"
    },
    {
      "title": "Shine On - Selections From The Box",
      "local_path": "albumeb33.html",
      "year": 1992,
      "rating": 2.88,
      "type": "EP/Single"
    },
    {
      "title": "High Hopes/ Keep Talking (single)",
      "local_path": "album4205.html",
      "year": 1994,
      "rating": 3.29,
      "type": "EP/Single"
    },
    {
      "title": "Take It Back",
      "local_path": "albumd17f.html",
      "year": 1994,
      "rating": 3.37,
      "type": "EP/Single"
    },
    {
      "title": "Interview Disc",
      "local_path": "albumc49f.html",
      "year": 1995,
      "rating": 3.15,
      "type": "EP/Single"
    },
    {
      "title": "London '66-'67",
      "local_path": "albuma1fc.html",
      "year": 1999,
      "rating": 2.9,
      "type": "EP/Single"
    },
    {
      "title": "Louder Than Words",
      "local_path": "albumff8f.html",
      "year": 2014,
      "rating": 4.08,
      "type": "EP/Single"
    },
    {
      "title": "Pink Floyd 1965 - Their First Recordings",
      "local_path": "album6506.html",
      "year": 1965,
      "rating": 2.88,
      "type": "EP/Single"
    },
    {
      "title": "Hey Hey Rise Up (feat. Andriy Khlyvnyuk)",
      "local_path": "album28f4.html",
      "year": 2022,
      "rating": 2.96,
      "type": "EP/Single"
    }
  ],
  "scraped_at": "2025-05-18T11:05:52.240285"
}