{
  "album_title": "MOVING PICTURES",
  "artist_name": "Rush",
  "artist_page_link_local": "artistfb6c.html?id=609",
  "year": 1981,
  "rating_value": 4.39,
  "rating_count": null,
  "review_count": null,
  "genre": "Heavy Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/609/cover_15116552016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Tom Sawyer",
      "duration": "4:34",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Red Barchetta",
      "duration": "6:08",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "YYZ",
      "duration": "4:24",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Limelight",
      "duration": "4:21",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "The Camera Eye",
      "duration": "10:57",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Witch Hunt (Part III of Fear)",
      "duration": "4:44",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Vital Signs",
      "duration": "4:47",
      "is_sub_track": false
    }
  ],
  "lineup": [
    {
      "musician": "Alex Lifeson",
      "instruments": "6- & 12-string electric & acoustic guitars, Taurus bass pedals"
    },
    {
      "musician": "Geddy Lee",
      "instruments": "basses, bass pedals, synthesizers (Oberheim polyphonic, OB-X, Minimoog), vocals"
    },
    {
      "musician": "Neil Peart",
      "instruments": "drums, timbales, orchestra bells, glockenspiel, wind chimes, crotales, percussion"
    },
    {
      "musician": "Hugh Syme",
      "instruments": "synthesizers (6)"
    },
    {
      "musician": "Terry Brown",
      "instruments": "co-arranger & co-producer"
    }
  ],
  "reviews": [
    {
      "reviewer": "Marc Baum",
      "date": "Posted Wednesday, December 24, 2003",
      "rating": 5,
      "text": "Ahh, yes, this was the album that got me seriously listening to the loveable Canuckleheads known as Rush. Every aspect of this album is perfect, and critics be damned for calling them pretentious, less discriminating fans can blow me for calling them humorless and boring.Terry Brown's production was sterling for the time, every instrument laid out nice and clean for all to hear, yet rich, full, and possessed of the depth that analog recording can give best. And it shows that Rush had really hit their stride as musicians and songwriters, streamlining their approach from the sometimes unwieldy epics of their beginnings to more accessible songs that still maintained their superior musicianship. While the songs here are more radio-friendly, the playing still is as good as it gets in rock or metal without becoming self-indulgent masturbation. The songs are perfect in their construction too, always catchy, always involving, always mesmerizing.Neil Peart's brilliant wordsmithing and death defying drum work are top notch as always, and it bears mentioning that Alex Lifeson is a criminally underrated guitarist too. He shreds, crunches, and lays down all manner of textures all over this album, complimenting always the other players while he's at it. Geddy Lee is one of the all time rock bass gods, and it always amazes me how me manages to pull off sometimes doing three things at once onstage (singing, bass guitar or bass pedals, and keyboards!). His tone is thick, gritty and growling, a constant punchy undercurrent beneath the guitars and riffing right along with delicious complexity--no droning pedal tones for Mr. Lee, never. Those eldritch wails of his are unique, to say the least, too. \"Moving Pictures\" delivers the goods and how.My favorite songs on here...well, OK, I do like \"Tom Sawyer\", great album opener, but I really dig \"The Camera Eye\" for its relentless driving feel and its slow buildup to that uptempo verse. I also really like \"Witch Hunt\" for its eerie intro and timely lyrics that remain true today, and chalk up another brilliant instrumental victory for \"YYZ\"--that main riff after the intro is bloody impossible! \"Limelight\" is a great song with intelligent (of course) lyrics about fame and its price, and the drumming is superhuman from start to finish. And \"Red Barchetta\" really shines too. Aw, hell, I love the whole album, but those are my personal picks, the best of a beautiful lot.They grew steadily more ambient and textural, not to mention more accessible after this album, during the 80s, but I'm glad that they seem to have gone back more to the sound they had on albums like this in their current direction. And can it be ever said that Rush have ever released a crappy album? I think not, myself. \"Moving Pictures\" is a flawless meisterwerk, a product of a band confident and assured in and of their writing and playing.album rating: 10/10 points = 100 % on MPV scale = 5/5 starspoint-system: 0 - 3 points = 1 star / 3.5 - 5.5 points = 2 stars / 6 - 7 points = 3 stars / 7.5 - 8.5 points = 4 stars / 9 - 10 points = 5 stars"
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Tuesday, February 3, 2004",
      "rating": 3,
      "text": "3,5 stars really!!The newer fans gave more reason to go in the direction they did but I (and most of my friends) was quickly losing interest. This is the last real album I bought with my eyes closed not even hearing it before buying it. With retrospect , this is one of the more accomplished new Rush of the 80's. But it was hard to swallow for early fans , but as this was the logical successor of Waves: there was even less emphasis on suite-style prog music than before and the shorter song format was settling in, Both of these elements were making us anxious at what lay ahead.Tracks like Tom Sawyer, Limelight are clearly the tracks that got more airplay but not all that representative of the album. Red Barchetta also got attention and was about red coloured Italian sport cars. YYZ is the only instrumental track (clearly a highlight on this album) and is named after the Toronto International Airport code.Side 2 start with the major track Camera Eye . I was wondering at the time what all this stuff about Camera as Yes's Drama album had a track called that and Renaissance's Camera, Camera album was also from those early 80's soon to be dominated by video-clips with regular rotation of then-new MTV and Canadian-equivalent MuchMusic - image was to take over music as the message for teen-agers. Witch Hunt is another worthy track very much in the mould of the album, but Vital Signs ends it in a relatively poor fashion.As this is the pivotal album for a band destined to a long second career, to me , fan of the first hour , this album pretty spelled the end of my absolute fanhood. Of course I would go on listening to futuire albums, but I was unconditional anymore."
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Saturday, March 13, 2004",
      "rating": 5,
      "text": "\"Moving Pictures\" remains one of my all time favorite prog rock albums. In contrast to \"Signals\", RUSH rely very little on synths here, only to help paste the introductions and conclusions of the songs, not lead them. Instead guitar and bass dominate each song and the album has a very strong sonic innocence to it and does not feel over produced at all."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Friday, March 19, 2004",
      "rating": 5,
      "text": "Okay, I admit that I'm doing like everybody else, I'm reviewing this killer album. What do you want? Okay it's not true progressive rock, but it's still too prog to be rock. I dare anybody not to like Limelight. This song is one of the best I've heard in my whole life. It's almost an anthem. There's something so positive and rejoycing about that song. But, to be honest, I think it's the feel of the whole album that's really gripping. It's not too dark, but it feels like the little gap between heavy, black clouds and the time it's actually raining. You know the time when the air is warm and the wind is getting stronger. It's an album for cloudy days and it makes those days so rewarding."
    },
    {
      "reviewer": "chessman",
      "date": "Posted Friday, March 26, 2004",
      "rating": 5,
      "text": "Just when you thought they were running out of ideas with the previous album...This is the next contender for greatest Rush album. From the opener, with its thunderous power chords, through the flowing Red Barchetta, past the interesting and intelligent YYZ instrumental, on to the next gem, Limelight. (Pause for breath) Then on to the epic Camera Eye, gasp at the amazing Witch Hunt, (maybe my favourite song on the album, but hard to be sure!) and finally on to Vital Signs, with its tremendous ending, this album has everything. The definitive Rush and the one I would recommend anyone interested in the band to buy first. A brilliant album."
    },
    {
      "reviewer": "greenback",
      "date": "Posted Wednesday, April 14, 2004",
      "rating": 5,
      "text": "With \"Hemispheres\", this is the best record from RUSH. The bass reaches its peak here, no doubt: its exaggerated Rickenbaker sound, its complexity and its technical performance are speechless. The electric guitar is slightly different from \"Permanent Waves\": the guitar sound here is much more mature, a bit cleaner, more refined, modern and not always sounding conventional hard rock. Neil Peart really masters his drums here: the miscellaneous complex, fast and rhythm changing parts reach a never attained level here, even higher than on \"Hemispheres\"! The keyboards are, like on the preceding albums, not very elaborated, but there are some very good parts, like on \"Witch Hunt\" and \"YYZ\". Side one is ABSOLUTELY OUTSTANDING: \"Tom Sawyer\", with its killer bass, guitars and drums; \"Red Barchetta\", a very catchy song, will amaze you by the perfect synchronization of the instruments. YYZ is a pure technical performance track, VERY addictive. Finally, \"Limelight\", the most accessible one, will just move you with its outstanding finale. Side 2 has one bad point: the last 2 tracks \"Witch Hunt\" and \"Vital Signs\". Well, it is not that those tracks are bad, but the other tracks are so good that these ones sound almost irrelevant, especially the last one. \"Witch Hunt\" is quite better than \"Vital Signs\". \"Camera Eye\" is a very pleasant progressive rhythmic track, among the best tracks by RUSH.EXTREMELY RECOMMENDED!"
    },
    {
      "reviewer": "daveconn",
      "date": "Posted Monday, May 3, 2004",
      "rating": 5,
      "text": "The teenage science fantasies of \"2112\" came full circle on \"Moving Pictures\". \"Tom Sawyer\", \"Red Barchetta\", \"Limelight\" and \"Vital Signs\" resonated with the band's core audience (young people listening on headphones and elevating from the norm) even more than the philosophical \"Permanent Waves\". Both albums contain great music, both vie for the upper hand in any discussion of the band's best work, and both are must-owns for progressive rock fans. GEDDY LEE was slowly introducing synthesizers into the mix, usually to ease listeners into the song and underscore spacier passages, but \"Moving Pictures\" is still analog RUSH: the superlative rhythms and fiery guitar work are in full force. A sign of things to come appears on the closing \"Vital Signs\", where ALEX LIFESON's guitar favors ANDY SUMMERS-like textures (in fact, THE POLICE's \"Synchronicity\" and \"Tom Sawyer\" are more than a little similar) and the concept of \"signals\" is introduced. But more typical of the album is the instrumental \"YYZ\", a three-man workout so full of chops that it sounds like FRANK ZAPPA (without FZ's wandering noodle of an eye, of course). Like \"Permanent Waves\", \"Moving Pictures\" puts its best features up front; as good as the first side of music is (with \"Limelight\" providing the knockout punch this time), the second side falters slightly. \"The Camera Eye\" never seizes on a compelling melody but just sort of plugs along, \"Witch Hunt\" starts out promising and then seems to hold something back.They're not rough patches, only average songs on an inspired album. And when the band is at the height of their inspiration, as they are here, their music is a wonderful thing to behold. \"Tom Sawyer\" and \"Limelight\" were so powerful, they permeated the collective consciousness of teenagers around the world. Not bad for a little piece of plastic."
    },
    {
      "reviewer": "James Lee",
      "date": "Posted Wednesday, June 9, 2004",
      "rating": 5,
      "text": "Here's an idea: take the first side of both \"Moving Pictures\" and \"Permanent Waves\" and make the single best AOR album ever released, and then put the two second sides together to make a good, conceptually interesting and thoroughly up-to-date (for 1981) heavy progressive album. While it may seem that they are sticking to a format that works, RUSH has found their perfect niche with these two recordings and nothing like them will ever be done again. The bands that started the progressive genre have either died out or gone soft on us, but this upstart trio of Canadians make the necessary strides to keep prog interesting- and fun. The presence of \"Tom Sawyer\" and \"Limelight\" guarantees any real hard rock fan's vote, and \"YYZ\" demonstrates indisputably that the band has reached new heights of musical skill. Only the most extreme anti-rock (or anti-synth) fanatics will have any real difficulty enjoying \"Moving Pictures\"; for my part, \"Red Barchetta\" is my favorite RUSH song of all time- and achieves in six minutes what it used to take them an entire album side to do. A whole new crop of progressive fans will emerge from the wake of these albums, forming the core fanbase for DREAM THEATER, MARILLION, and so on; however, those who stuck with the band for the last several years can still proudly claim that RUSH has neither 'sold out' nor 'moved on'. You (and I) may have a personal attachment to other (most likely earlier) albums, but objectively it is all but impossible to deny that this is the band's culmination. I wish I could give it 4 1/2 stars, as the second side does lose some focus- but not enough to sacrifice its masterpiece status."
    },
    {
      "reviewer": "richardh",
      "date": "Posted Friday, July 16, 2004",
      "rating": 5,
      "text": "After the likes of ELP,Yes and Genesis left town Canadians Rush 'moved' in.(The album cover couldn't be more perfect!).Prog died in the late seventies and eighties right? No wrong! While ELP were donning their designer beachwear,Yes were being 'Buggled' and Genesis were widening their appeal to teenage girls thankfully there was still one band that kept their eye on the ball.Here Rush adopted a more techno approach than before with keyboards taking a much more prominent role in the music.'Tom Sawyer' to this day is still my all time favourite Rush track with Neil Peart majestic on the drums.I love the 'switched on' lyrics as Rush tackle modern issues intellegently.In truth this band were so far ahead of anything going on at the time."
    },
    {
      "reviewer": "Blacksword",
      "date": "Posted Thursday, August 19, 2004",
      "rating": 5,
      "text": "This was the peak of Rush perfection for me. As songwriters and musicians, they had matured and evolved to such a degree, that I can not actually find any fault with this album. Ok, so if you dont like Rush, you're not likely to get on with any of their work, but for those who do recognise the positive Rush trademarks, MP should strike a resounding chord. Many prog bands who survived punk, went on to evolve their sound in ways that sometimes worked and sometimes didn't. Genesis, for example decided to turn their back on rock and go all out pop by 1983. In the case of Rush the evolution from Hemisperes to the present has been a smooth one, and not an evolution that has led to them comprimising their art, in other words 'selling out'!Moving Pictures combines the tradtional Rush elements, the Rickenbecker bass guitar, Neil Pearts click perfect drumming, and Alex Lifesons unique guitar playing, with brighter, crisper production than on previous albums. Their producer Terry Brown had always been rather erratic, but clearly hit the jackpot with MP, as he did with Hemispheres. The songs are more concise than on the previous three albums. Infact MP only has one 'epic' 'The camera eye' clocking up 10 minutes, quite modest by prog standards. The driving force behind MP is the positivity and confidence that oozes from the music. The philosophies of self confidence and empowerent present in songs like 'Tom Sawyer' and 'Red Barchetta' and pleasantly offset by 'Witch Hunt' which deals with the perils of prejudice, and 'Limelight' where Peart writes, eleoquently as ever of the surreal nature of being a performer forever in the 'camera eye'This is Rush at their most powerful and consistent best, and for those who could not get on with their synth soaked albums of the mid to late 80's, or the Zeppy sounding early albums, Moving Pictures rests perfectly somewhere in the middle of their brilliant catalogue, combining everything that was good about Rush in one excellent work. Highly reccomended!"
    },
    {
      "reviewer": "Chris S",
      "date": "Posted Tuesday, September 7, 2004",
      "rating": 5,
      "text": "Incredible the majority of opinions do not lie! This is without question the best album put out by Rush. Most reviewers have said everything but one thing I will say is that you will never hear them play this tightly on any other Rush album. From the brilliant ' Tom Sawyer', ' Red Barchetta'......oh what the heck the whole album is essential."
    },
    {
      "reviewer": "penguindf12",
      "date": "Posted Friday, September 10, 2004",
      "rating": 2,
      "text": "This is not a very good album - but then, I'm not a huge Rush fan. I LOVE \"2112,\" and bits from their albums before this one (especially \"Hemispheres\"), but \"Moving Pictures\" honestly bores me.\"Tom Sawyer\" is a good song - a good condensed \"prog rock lite\" hard-rock number. It's impossible not to dig the 7/8 midsection.\"Red Barchetta\" is just plain boring.\"YYZ\" is a cool instrumental track that gets more attention than it really deserves. Nice bass licks, but it mostly leaves me cold.\"Limelight.\" I used to really dig the lyrics, but now they seem pretty hackneyed. Nifty 7/4 riffs though.\"The Camera Eye\" crawls along in an uninteresting fashion - it's quite overlong & synth-heavy.I honestly can't recall most of \"Witch Hunt\" and \"Vital Signs\" - they're pretty bland. The whole album reeks a little bit of corpo-rock. I know I liked it a lot more when I was a kid, but that's no excuse - albums like \"The Wall\" stand up well even now. \"Moving Pictures\" simply doesn't stand up. The few tracks that are worthwhile - \"Tom Sawyer\", \"YYZ\", \"Limelight\" - you will hear anyway from Guitar Hero, radio, or friends. There's no need to buy this album unless you just really like Rush."
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Monday, October 25, 2004",
      "rating": 4,
      "text": "Following in the footsteps of the predecessor \"Permanent Waves\", \"Moving Pictures\" contains a more solid and varied repertoire, as well as a more aggressive sound in the rockier moments. So what Rush delivers here is yet another prog master opus from their golden era. The opener 'Tom Sawyer' starts in a somewhat AOR-ish pompous manner (not unlike their Toronto neighbors Saga, who by then were starting to achieve some worldwide fame), mostly on a 7/8 pattern, which gives the rhythm section a chance to display a touch of funky under the song's rocky surface, while the synth parts play a starring role: somewhere in the middle, Lifeson states an amazing solo full of attitude and some effective dissonance. This catchy opening track is followed by one of the gems of this album: 'Red Barchetta' is a magical rocky number that conveys a mesmerized air of contemplation in both the lyrics and the melodic lines, with a well adjusted instrumentation that flows between the harsh and the subtle. The neckbreaking instrumental 'YYZ' couldn't be a more proper follow up, with its unmerciful fire fed by the fuel of heavy metal and the flame of jazz rock, not unlike 'La Villa Strangiato' - another showstopper in Rush's repertoire -, but with less epic proportions. From the first time I ever heard 'YYZ' I had the feeling that this was one of the most explosive instrumentals in rock history, and now, many years later, I've come to turn that initial feeling into a matured conviction. No wonder this one and 'Tom Sawyer' are the most recurrent pieces from this album in concert tracklists. The fire doesn't decree in 'Limelight', the ode that Rush sing to themselves as \"performers and portrayers\", caught in a limbo between the joy of giving their art to the audience and the need of keeping apart from that same audience in order to preserve their intimacy and integrity. While the lyrics reflect that dilemma with genuine concern, the music written is pure exultation designed to catch the listener's eye: what a clever way to combine reservations and interconnection in one single song. The only epic in this album is 'The Camera Eye', a 10-minute suite lyrically focused on the dialectic tension between human emotion and the structure of modern cities. The grandiosity of this number is based on the alternation of synth-dominant orchestrated sections and the sung parts, in which the rock aspect prevails in order to allow Lifeson display his tight riffs and occasional electrifying solos - together with 'YYZ' and 'Red Barchetta', here are the highlights of Lee's bass playing in this album. 'Witch Hunt' is a chilling, almost-Gothic number that exposes the dangers and potential destructiveness of intolerance: being much shorter than 'The Camera Eye', 'Witch Hunt' conveys a more pronounced epic colorfulness, so dramatic and with such an amount of intensity, that all you have left to do is drown yourself into the doom of the oppressed and ignored, underthe ultra-somber synth layers that are poured all over the guitar riffs. Awesome! It almost makes you forget the powerful excitement of the previous tracks: by now you are simply overwhelmed by the darkest of human scenarios. 'Vital Signs' ends the album with the poppiest attitude in this album, anticipating what would be to come in their next two studio efforts (\"Signals\" and \"Grace Under Pressure\" - something like The Police meets Saga): Lee's voice reminds us that sometimes \"everybody has to deviate from the norm\". In this track, Rush retakes the energy of 'Tom Sawyer' and draws it closer to average early 80s new wave. That's a nice way to end an album after such an oppressive number as 'Witch Hunt'."
    },
    {
      "reviewer": "Tony R",
      "date": "Posted Thursday, March 3, 2005",
      "rating": 5,
      "text": "The greatest Heavy-Progressive album of all time.Picture the scene:Prog has died,Genesis are stumbling into the 80's like someone's brain-addled grandad,Yes are changing personel more times than Rainbow, and ELP have pomped themselves into an early grave.So what do you do? You reinvent Prog Rock and stick two drumsticks up at the nay-sayers,that's what! Moving Pictures? Moving mountains to Mohammed more like.All over North America the kids were forsaking Prog Rock for Heavy metal, yet Rush managed to bring them all back,with a Top 3 Multi-Platinum best-seller.Tom Sawyer has been plundered many times for charting Hip-Hop acts,its catchy rhythm section,imaginative lyrics and 7/8 beat giving a two-fingered salute to the Tolkien- esque imagery of yore.Red Barchetta,briefly returns to the SciFi roots of earlier albums, but manages to be both an engaging tale and a musical tour-de-force.Particularly effective is the way the band magically evoke the movements of pistons and air and the beautiful guitar solo.YYZ-wow!Can three human beings really play like this together? Sure it is flash, but is such a show-stealer that dozens of bands have tried and failed to match its magnificence,indeed Jazz Rock never sounded this much fun.Limelight follows, it is another catchy song,poignant lyrics about the problems of fame and an absolutely amazing gutar solo.Rush's last true epic,The Camera Eye is next up and brings to mind the portentious opening minutes of \"Xanadu\" fused with the thick guitar brushstrokes of \"Jacob's Ladder\".Using Dos Passos's epic \"USA\" as a starting point we meander through modern landscapes,then the piece throbs with the passage of people along city streets. Certainly the most obviously \"progressive\" track on the album and a testament to the trios ensemble playing.Witch Hunt follows-what a scary song! Alluding to the ever-present bible-bashing fraternity in modern America and back to the McCarthy Witch-Hunt days it is a plee for more tolerance of different ideas.Wonderfully evocative crowd intro and portentious guitar lead into a crushing riff,crashing drums and lush synths.I never grow tired of this track.Final track,Vital Signs is a strange hard rock,white reggae hybrid (ok - The Police!) very catchy and not too serious methinks.I have no doubts about awarding the full 5 star masterpiece status to this album.Best Album Ever? Maybe...."
    },
    {
      "reviewer": "Eetu Pellonpaa",
      "date": "Posted Friday, April 1, 2005",
      "rating": 4,
      "text": "A really fine album! Only the two last songs are bit poorer, and the restrain me from giving this the five stars it nearly deserves. I think that the new kind of approach to music which was started in their previous album has matured here very well. Though some of the tracks are radio friendly, they are still interesting, unique and done with good style in my opinion. \"The Camera Eye\" is the best song of the album, a good mini epic with fine instrumental passages and composition. It's fun to find out that there were also good music done at the 80's too! Recommended warmly!"
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Monday, May 30, 2005",
      "rating": 5,
      "text": "I was 18 when I witnessed my first Rush gig, it was at the known Dutch Pinkpop Festival in '79. I was not only impressed by the great music from Rush but also the amount of Rush die-hards that joined Rush during their first European tour. Soon I became a Rush die- hard, my favorite Rush album (painful choice, like you have to say who's your favorite child .. or does this sound too emotional?!) is \"Moving Pictures\" because it contains seven excellent songs, so varied and alternating, in my opinion this was Rush at their creative peak. \"Tom Sawyer\" and \" Red Barchetta\" are powerful and catchy 'power-sympho' songs with the touch of class of a timeless rock classic like \"Black Night\" from Deep Purple. \"YYZ\" is an incredible composition, perhaps the best Rush ever composed, what an exciting and virtuosic climate, the interplay between the three musicians is breathtaking. \"Limelight\" has one of the most moving soli from Alex Lifeson, \"The Camera Eye\" shows the great ideas from Rush to sound symphonic, \"Witch Hunt\" is a mindblowing effort to create an ominous sound that evokes a real witch hunt and \"Vital Signs\" prooves that Neil Peart is one of the best drummers. For me this was the last 'true-progressive' studio-album from Rush, from \"Signals\" they mixed every album more trendy elements. This unsatisfying visiont led to my desision to stop buying Rush records from the album \"Presto\" but I still visit the concerts because Rush wants to please all their fans, mr. Collins!"
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Wednesday, June 22, 2005",
      "rating": 4,
      "text": "One half masterpiece, the other half above average work. This is Rush's highlight album, their crowning achievement in music. With such a strong first side, one would like to believe that the 2nd is just as strong. The 2nd side, while very good, is not up to par with the 1st. At this point, the band were on the borderline between Prog and Synth rock, the line being very blurred at times. The riffs, the drums, the bass, the album is full of untouchable moments that take you to another place.The album opens with Tom Sawyer, the quintessential Rush song. A very strong riff carries the track throughout, Lifeson giving an incredible performance. The keyboard solo, while very simple, is very enjoyable in its own right. Finally, the drumming is superb. Peart plays with incredible precision in and out of fills. This is a great Rush track, the one they will always be remembered for.The second track is my personal favorite on the album, Red Barchetta. Inspired by the short story, \"A Nice Morning Drive\" by Richard S. Foster, the music takes the forefront during this track. The harmonics in the beginning, the impeccable riff structure, the incredible guitar solo, this track is flat out perfect. Add a small bass solo in the end, and you have a masterpiece of a track.The next song, the instrumental YYZ, is another very memorable Rush track. Beginning with Peart on percussion, the exquisitely evil sounding intro is superb. Add incredible playing by Lifeson, top-notch playing by Peart, and a stand out performance from Geddy, whose creative runs and fills are so superbly difficult to play, and yet he plays with perfect acurracy.The final song on the first side, Limelight, is another Rush masterpiece, with an incredible riff, an awesome structure, and a great solo, this song rocks with the best of them. The lyrics on this song are also superb.The 2nd half of the album is good as well, just not as good as the tracks above. The opening for the second half, The Camera Eye, is the last 10 minute epic Rush would do. I particulary don't care for the lyrics, it's the music that is great, again with incredible riffs by Lifeson. Witch Hunt and Vital Signs are both very good, but still aren't up to par with the first half.Overall, this album is a very good one. It's one of the best Rush albums. If only the 2nd half was as good as the first, it would have gotten 5 stars if it had. 4.5/5"
    },
    {
      "reviewer": "Zac M",
      "date": "Posted Monday, August 8, 2005",
      "rating": 5,
      "text": "What can be said about this album that has not been said before; it is an essential masterpiece. This was my first introduction to Rush, as it was for many people. I remember hearing tracks like Limelight, Red Barchetta, and, of course, the album's biggest hit, Tom Sawyer on classic radio. The album has much more to offer than just these hits however. YYZ, an instrumental, is quite possibly one of the best loved prog instrumentals; it is not too long or pretentious, which IMO leads to its likeability.The second half of the album includes the mini-epic, The Camera Eye, which is good, although it starts out a little slow. Next is the mystical Witchhunt; it is one of my favorite tracks on the album. The last song, Vital Signs,although it is good, is probably my least favorite on this album.When I first purchased this disk, I was still just learning what progressive rock really was, so it holds a special place in my journey through this incredible genre of music. This album is highly recommended because it is very easy to listen to. Geddy Lee, Alex Lifeson, and Neil Peart create a album that is great for prog neophytes or people interested in the perdect mix of prog and hard rock. After this album, Rush started using more synths, and their music became less interesting, although Signals is still quite good. I really enjoyed taking the time to enjoy this album again. If you love Rush, you probably already have it, if you wanna get into Rush, this is definitely the perfect album to start out with."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Monday, September 12, 2005",
      "rating": 5,
      "text": "JRENG! - dhug dhug thak ..\"A modern day warrior mean mean stride, today's Tom Sawyer mean mean pride!\" JRENG .!Well well well . I guess many of you have ever heard that energetic and dazzling opening part especially for those of you who were there when punk and new wave movements wept out music industry in the early eighties? Rush came out with a ground breaking album \"Moving Picture\" that cast the light of hard rock music. Yeah, I thought the music was straight forward like any hard rock music but when you try play the chords, it's not that easy. But again, Rush was one of very few bands that carry the torch of the seventies music amidst new wave and punk attack. The release of the album of course made any rocker and proghead happy as this album has demonstrated their musical maturity.I don't think that I need to write a novel-long review about this masterpiece as I am sure that most of you have already known the album and owned a copy of the CD. What I need to share is how this album is so energetic and so motivating; which really helps me to cheer up my day anytime I find any problems or woke me up in the morning. It makes my pulse is racing rapidly and my adrenalin is exploding. I like the riffs, the guitar solo, the dynamic drum work as well as solid bass lines. All tracks are excellent. \"Red Barchetta\" (6:08) has a very neat composition and powerful riffs. \"YYZ\" (4:24) is really a masterpiece rock instrumental with all musicians contribute wonderfully: great guitar augmented with inventive bass lines and machine gun drumming. WOW! Bravo Peart, Lee and Lifeson! It's really greaaaattttt ..!!!! I always repeat this track - including this time while I'm writing this review (uhm . it's not a review actually, it's a sharing.).I have a specific memorable event which always clicks me whenever I listen to \"Vital Sign\". Yup, you might say it's a simple arrangement - but look at the combination of lyrics and a sort of reggae rhythm the band has composed! It's a terrific composition which I especially enjoy when the long sustain keyboard sound enters in the middle of the track - augmented wonderfully with bass guitar solo and firm drumbeats. \"Everybody got mixed feelings 2x. Everybody got to deviate from the norm .\" oh man . what a memorable ending part, I tell you!Highly recommended! Not only for progheads but for those who love rock music, this one is a masterpiece!Peace on earth and mercy mild - GW"
    },
    {
      "reviewer": "horza",
      "date": "Posted Saturday, September 24, 2005",
      "rating": 5,
      "text": "The best album by Rush by far.Tom Sawyer and Red Barchetta set the early pace and are classics.Its impossible to pick a weak track on this album,even the quieter,moody moments like The Camera Eye and Witchhunt are superb.If you decide to give this band a hearing then this is the album for you.Three musicians at the peak of their playing and creativity.Make a note,give it a listen soon,you won't regret it.And if you already have it,dust it off and play it loud.Now."
    },
    {
      "reviewer": "AtLossForWords",
      "date": "Posted Saturday, November 12, 2005",
      "rating": 4,
      "text": "It's about time i reviewed a Rush album, so i thought i would do a more popular and synth influenced album, Moving Pictures.Moving Pictures is a Rush with more vocals. Of course there are still some insturmental favorites like YYZ, but this is much more vocal than the old Rush so many fans knew from the '70s. This album also exhibits a more metal edge. The guitar playing from Alex Lifeson is top class, his work on the insturmental YYZ is nothing short of brilliant. Lifeson's tone is really a big part of this album, his tone is not overdistorted, not overpowering, and clear. Lifeson is a guitarist who does not get in the way of the rest of the band. The other musicans do a fantastic job as well. Geddy Lee has his hands full doing bass, vocals, and synths. I wouldn't be reviewing Rush without giving not to Neil Peart. Peart's drumming is absolutely incredible. The trades of solos with bassist Geddy Lee in YYZ is so intense and so musical. Peart's drumming is also phoenomenal in the opening track Tom Sawyer and the epic of this album, The Camera eye. My one complaint about this album is that there is quite a bit of cheese, mostly from very lyrical songs like Limelight.The production is excellent. Pearts drums cut through as always with exceptional tone. Lifeson's guitar is amazing as i noted earlier. The synths though not virtuosic add a nice touch of resolution to the album following solos. I do have a problem with Lee's bass. The tone is just too distorted and lacks punch. Lee's tone sounds more like something from a dead pre-amp than a studio album."
    },
    {
      "reviewer": "Andrea Cortese",
      "date": "Posted Wednesday, November 30, 2005",
      "rating": 4,
      "text": "\"A modern warrior mean mean stride, today's Tom Sawyer mean mean pride.\"Moving Pictures is one of my favourite 80s' albums! All it's been already said about it. There's nothing I could originally add: I can only express now the pleasure to listen to such a pure and precise performance, all the instrument being played by master hands! I remember the day I went to my town's cds- store and bought it.I was \"trembling\" with excitement for without such an album my personal prog-rock cd archive seemed to be uncomplete!After a couple of years and many listenings I'm still not sure it's a masterpiece, yet! An excellent effort, especially for the instrumental YYZ and the opener track Tom Sawyer: two classics!A must have and a good one to introduce yourselves into the Rush' fantastic repertoire! Vocals are good, in my opinion, even if I personally prefer deeper and warmer voices: a right combining with the catching strong and polite arrengements!"
    },
    {
      "reviewer": "slipperman",
      "date": "Posted Thursday, December 29, 2005",
      "rating": 5,
      "text": "More than the amazing playing, more than the career-topping production by Terry Brown, more than the strength of character each song holds, 'Moving Pictures' is my favorite album of all time due to its overall atmosphere. There's a pervading comfort in each moment of the experience. It is dark and warm and welcoming. It achieves perfect balance between the technical and emotional. It does not have a weak moment. 'Moving Pictures' is arguably Rush's apex as a songwriting and performing entity, bridging the shores of their complex and adventurous early material and the refinement that would take place on successive albums.I find this to be the most natural-sounding Rush album. It doesn't seem they were self-consciously trying to write multi-faceted epics, nor were they snipping off all but the most bare essentials in a less-is-more effort. Yet it achives both aims to some degree, and meets in the middle more often. Everything flows wonderfully, each instrument, including the gorgeous synths, captured absolutely PERFECTLY. If prog purists call this one \"the beginning of the end\", I suggest giving another listen to the immaculate intricacy of \"YYZ\", the absorbing storytelling of \"Red Barchetta\" (words AND music), the dread of \"Witch Hunt\", the peculiar ideas and engaging aura of \"Tom Sawyer\", the unique elongation of themes and moods in \"The Camera Eye\". If they don't, I will for them. Again. For the 1027th time. A great piece of music can be gone back to a million times with something to offer each time. Each listen can offer something new and/or take you back to a place of familiarity and peace. This one still does all that for me. 7 perfect songs making 1 perfect album. A masterpiece of the often at-odds approaches of streamlined focus and technical complexity."
    },
    {
      "reviewer": "belz",
      "date": "Posted Sunday, January 29, 2006",
      "rating": 3,
      "text": "3,4/5.0This is really not a bad album, far from it. This is still Rush, with great guitar and keyboards, however I just don't enjoy that much the 80s sound. \"XYZ\" is probably the best sound on the album, but somehow I would rather consider this album as one of the first neo-progressive album as opposed to a 'late-bloomer' real prog disc. I think the right description could in fact be 'neo-rock-prog'. All that said, this is still a good (but not essential) album, very enjoyable and imaginative."
    },
    {
      "reviewer": "E-Dub",
      "date": "Posted Sunday, March 19, 2006",
      "rating": 5,
      "text": "I feel every band has their masterpiece. Their \"Sgt. Pepper\" or \"Dark Side Of The Moon\". Moving Pictures is Rush's masterpiece. It's not only the quintessential Rush album, but the quintessential album. Period. Moving Pictures has such a wide variety of moods and textures that play upon your emotions. I'm not sure if Alex, Neil, and Geddy knew that when they waltzed into the studio they were creating music for the ages.Moving Pictures charges right out of the gate with \"Tom Sawyer\", which has almost become bigger than the band themselves. Low, growling synthesizers mingling with Peart's rapid hi-hat work, and Alex's steady guitar gives it an almost sinister sound.Song #2 is \"Red Barchetta\", which begins very innocently with Lifeson chiming on the guitar, until the onslaught is underway with the band simply explodes. One of Rush's most brilliant songs, it changes time effortlessly and flows from beginning to it's subtle and gentle end. Brilliant!Strap yourself in and experience the instrumental \"YYZ\". Here the band loosens up, and cuts loose all at the same time. It really showcases how in sync this band is from the beginning with the powerful first half minute or so. It's almost too much for the senses; yet, so pleasant and astonishing. Of course it wouldn't be right not to mention the drum/bass duel in the middle. It's pure musiciaship that should be added to school music curriculum all over the world.\"Limelight\" should have been a hit for the band, if they were overly concerned with making it. That unmistakeable beginning riff by Lifeson is one of the best openers I've ever heard. Geddy's vocals are crystal clear, but still cuts you like a razor. \"Limelight\", however, is pure Lifeson at his finest. Peart gathers so much of the spotlight that we tend to forget how gifted the other 2/3 of Rush are. Arguably one of Lifeson's best solos, he simply punishes the Stratocaster, but is professional enough to overdo it. I once read that this solo is one of his personal favorites....and it should be.Probably my favorite track that never seems to get mentioned is \"The Camera Eye\". I really wish they'd work this back into their setlist because it really is brilliant. It starts off very innocently with various and sundry city noise until the band comes together and the journey begins. Peart paints a picture of modern day life in both Manhattan and London, but one wonders if it's a lament more than anything. The song is fast paced like the subject matter, which ends with another classic Lifeson solo. Clocking in a shade under 11 minutes, it's one of their proggiest tunes. Love it!!Another favorite is \"Witch Hunt\". This song just digs it's way in and makes you feel uncomfortable with haunting lyrics with this low tone throughout. Even Peart's drums sound differently...which may explain why he opted to play his electronic kit for this song during their concerts. A very different Rush song altogether, but it still works.\"Vital Signs\" brings Moving Pictures to a close. This song is very stripped and raw, but still carries a lot of weight. Some parts even have a choppy, reggae sound to it. Not my favorite song on the disc, but it's not enough to assign anything less than 5 stars to Moving Pictures.It's almost odd to think there are CD towers out there without Moving Pictures in them. It's THE album that that propelled them to superstardom, and in all reality should be even higher on the top 100 (But, when bands like Riverside are included, while Kansas doesn't have any mention makes my eyebrows raise a little bit regarding the list). Moving Pictures is Rush at their greatest, and although many, many albums have been released since, nothing has captured it's magic. As great as they are, they haven't even come close."
    },
    {
      "reviewer": "Raff",
      "date": "Posted Tuesday, March 21, 2006",
      "rating": 5,
      "text": "Rush's finest hour indeed - from the intriguing, red-and-black cover (nice pun on the title, too) to the magnificent music within, an essential piece of that rare phenomenon, high-quality '80s prog. With \"Moving Pictures\" the mighty Canadians manage to produce a record which is at the same time complex and accessible, richly textured and never predictable. The more metallic leanings of its predecessor, the excellent \"Permanent Waves\", are here replaced by a more typically prog feel, with rich layers of keyboards, intricate rythms and a guitar sound that is more atmospheric than biting.The seven tracks on the album are so well-known that it would almost seem pointless to mention any of them. Anyway, MP can boasts one of the best opening tracks ever, the intense, multilayered \"Tom Sawyer\". Introduced by simple but elegant synth playing courtesy of the incomparable Geddy Lee (very busy on this album in his triple role as singer, bassist and keyboardist), the song is bolstered by Lee and Peart's stellar interplay. The following \"Red Barchetta\", though an excellent track with intriguing, sci-fi lyrics set in a world where cars have been banned, has never been a favourite of mine. Then the first part gets to a close with the double whammy of the magnificent (if a trifle overplayed) instrumental \"YYZ\" and Rush's take on the joys and pains of fame, the deceptively catchy \"Limelight\".The remaining three tracks do not feature in live albums and collections as often as the others, which is a pity, as they are every bit as good and even (strictly speaking) more typically 'progressive' . The 10-minute-plus \"The Camera Eye\" is a streamlined prog epic about city life which showcases Lifeson's brilliant guitar work and Lee's vastly improved vocal abilities. In fact, this is probably the first Rush album in which Geddy shows unbelievers he can actually SING. The following song, \"Witch Hunt\", starts off with a brooding atmosphere punctuated by angry voices and ominous tolling of bells. Its lyrics are among my all-time favourites from the band, with its marvellous, all too true closing lines: \"Quick to judge, quick to anger/ Slow to understand/ Ignorance and prejudice and fear/ Walk hand in hand\". Here keyboards, drums and guitar complement each other perfectly, and Geddy's lower-register vocals add to the sense of menace. Finally, in the closing track, \"Vital Signs\", we see the shape of things to come - that is, the reggae influence that would come to the fore in the two following Rush albums, \"Signals\" and \"Grace Under Pressure\". Even though some people may turn up their noses at finding reggae rythms in a prog album, The Police were without a doubt one of the best and most influential bands of the '80s, and Rush proved their skill and intelligence when they chose to integrate those rythms in their sound.MP definitely deserves its place as one of the top prog albums. It also stands to prove that the Eighties were a far better decade for music than they are given credit for. Highly recommended."
    },
    {
      "reviewer": "Rivertree",
      "date": "Posted Monday, May 29, 2006",
      "rating": 5,
      "text": "Tom Sawyer is still alive ...I sometimes heard 'Tom Sawyer' on the radio. First of all I was very impressed by the powerful drum playing of Neil Peart. So I couldn't sleep until I found out that a band named RUSH was responsible for this.'Tom Sawyer' is until today one of my personal RUSH highlights. 'Limelight' is nearly in the same vein - the songs don't have a simple structure and are also interesting for more mainstream orientated rock fans. Maybe you can say this are the most commercial songs of this production. 'Red Barchetta' convinces with an excellent guitar work by Alex Lifeson. 'YYZ' is a furious fusion/jazz rock trip - excellently arranged. 'The camera eye' is another highlight - 'Witch Hunt' and 'Vital Signs' are a little bit weaker.'Moving pictures' is a masterpiece and after more than 20 years already alive ..."
    },
    {
      "reviewer": "Melomaniac",
      "date": "Posted Friday, June 9, 2006",
      "rating": 5,
      "text": "A perfect album, if there is such a thing. Came out at the right time. Rush reoriented themselves with the other magnum opus that is Permanent Waves. They still had that great prog rock thing going on from outputs like A Farewell to Kings and Hemispheres, but with a more arena rock radio friendly vibe. Geddy Lee stated in Martin Popoff's book \"Contents Under Pressure - 30 years of Rush\" that Moving Pictures was this close to never see the light of day, as Rush almost came out with what would have been Exit... Stage Left right after Permanent Waves. At almost the last moment, however, they decided they were not through exploiting the new direction they found with Permanent Waves, and decided to go back in the studio to write new material in the same vein. Looking back, Mr. Lee feels it was probably THE best move of their entire career, and I agree with him a 100 %.Every song here is fabulous, and I cannot think of a single weak moment in this album. You just have to think about all the classics this album gave us, like Tom Sawyer, Red Barchetta, Limelight, and, of course, their classic exercice in self-indulgence that is YYZ. The production was top notch for the era, the musical execution of every member of the greatest power trio ever is flawless, the lyrics are, as always, masterfully written by drummer Neil Peart, and Geddy's voice reached its perfect range, abandoning the sometimes annoying shrieks from past albums.This album is not only a classic in prog rock music, it is a cornerstone of music, period. The testimony of three dedicated and talented individuals forming the living, breathing entity that is Rush.Mandatory purchase for everyone..."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Wednesday, August 2, 2006",
      "rating": 4,
      "text": "One of the most overrated albums on this site. I love Rush, but this album, like DSOTM, has bit off more than it could chew, substance wise.We have the classics, Tom Sawyer and YYZ. Two incredible songs unfortunately, especially as short as they are, does not make the entire album a masterpiece. Red Barchetta is a good song as well, but the rest of the album is shrouded in mediocrity.Add some other impressive songs and no doubt this album would deserve the praise it receives.Unfortunately for me, the first 3 songs can't justify this being a masterpiece, although those first 3 songs are masterpieces in themselves."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Wednesday, September 20, 2006",
      "rating": 5,
      "text": "Living in the limelightBeing my favorite band this review may seem a bit one sided or biased. However, it is this bands amazing music that puts them in this position, and this album being likely their best to date deserves a good review. Actually, it deserves all the great reviews it has. The band evolved it sound over the course of the 70s and seemed to be perfect with 1980's \"permanent Waves\", of course they just had to top it off with this one. Better commercially as well as with the fans.This album opens with the always amazingTom Sawyer, which starts off with a nice little bit of synth until the rest of the band explodes in with the sound. This is, in every sense, a perfect song. It's topic is universal as with may other Rush songs, dealing with the \"Everyman\". This song is everywhere, so if you haven't heard it I think you've been living in a hole.Next is the calmRed Barchetta, which is a nice little story piece about a boy and his car. Set, I guess, semi-in the future kind of thing, but not as scary as their epic2112. All in all I don't think this is the high point of the album, but it certainly is a good song and nice to zone out to.YYZ, the Rush instrumental tribute to the Toronto Airport. (YYZ being the code number for the luggage, I'm proud to say I have a baggage tag with YYZ printed on it.) This is a fast, awesome instrumental, and it honestly doesn't get much better than this. Not evenKing Crimsoncould do better than this, in my mind anyways. Every member of the band plays his part to the fullest, showcasing their talents, even though the song doesn't even sound self obsessed! However, I must admit, this song is at it's best live.One of the band's biggest anthem's,Limelight, is the next song up on the list. The opening riff to this one is again very familiar, asSpirit Of Radiois. This particular song is about the bands feelings towards commercial success, ironically being one of their biggest radio hits. I like this song a lot, but am currently suffering from an overdose from it.The Camera Eye, the \"mini-epic\" of the album, and their last longer outing (spare their 80s epicFear) for a long time. Of course, entering the 80s it starts with a nice little synthesized overture, until it gets into the soothing guitar piece that leads into the main riff and into the song. This song is one of the main focuses of this album, and it deserves it. It may not be2112, Cygnus X-1orThe Fountain Of Lamneth, but that's only because we're in the 80s now. However, musically, it's just as strong.The third, but first recorded, part of the eventually 4-song-long epicFear(spanning from 1981-2002) is the eerieWitch Hunt. This song is basically about how fear and prejudice cause hate, but the lyrics are much deeper than that because Neal Peart is a genius. This song caught on with me really quickly, and stays with me just because it is a great piece of music, and likely the most overlooked of this album. Now that I think of it, most of side 2 is overlooked.Coda for this album comes in the form of the quirky, almost reggae, beatarificVital Signs. This is almost a combination of Limelight and Witch Hunt, because it creeps you out but you can dance to it kind of thing. I'm really lost for words on this one, all I can say is that it rocks.All in all this is an amazing album, and if you don't have it you should go to the store right now and buy it. Even if you're one of those Geddy-voice haters, just the sheer musical geneous of this album should entice you enough to purchase it."
    },
    {
      "reviewer": "NJprogfan",
      "date": "Posted Monday, September 25, 2006",
      "rating": 5,
      "text": "Ahh \"The Camera's Eye\", the last GREAT epic by RUSH. I can listen to this song ad neaseum, especially in the car with the speakers blasting. When the song hits the 3 minute mark, or so, Lifeson's guitar hits that spine chilling wail that is pure art rock heaven which then segways into the main beat of the song. This song alone, for me, garners this album it's 5 stars, but of course there's more. All one needs to read is the numerous reviews written before mine. I really just wanted to gush about The Camera's Eye, but if you're a fan I'm sure this one is already in your collection. If you are thinking about buying something by RUSH, you can't go wrong with one of the most important album prog-wise from the 80's. An all out classic of the highest order."
    },
    {
      "reviewer": "Australian",
      "date": "Posted Tuesday, October 3, 2006",
      "rating": 4,
      "text": "\"Moving Pictures\" represents Rush at their very best in the eyes of many fans and along with '2112' remains one of the most popular and time enduring hard rock albums ever. Moving Pictures is a more radio friendly album than usual from Rush and it features many songs around the four-minute mark. There is still a Rush mini-epic to be found here though in \"The Camera Eye.\" Rush is as popular now as they have ever been as people are beginning to miss quality music and look back to the 70's and early 80's for real music. By 1981 punk music was at an all-time high as was pop/rock music, there were few bands who dared to be different. For this very reason Rush have turned out to be one of the most ensuring bands from the period.\"Moving Pictures\" goes down as one of the greatest hard rock albums ever and it has an undeniable progressive rock flavour. The band of Geddy Lee, Alex Lifeson and Neil Pert is undoubtedly one of the most influential prog bands, the quality and driving intensity of the music is hard to over look. Several classics emerged from this album such as \"Tom Sawyer\", \"Red Barchetta\" and \"Limelight\" which remain among the best in the Rush repertoire. The remaster of the album comes with amazing clarity and sound quality which is most evident on \"Red Barchetta.\" \"Red Barchetta\" is about a guy who burrows his uncle's Ferrari 166 MM Barchetta for a Sunday drive, the song was inspired by a short story called \"A Nice Morning Drive.\"Like most Rush albums the musicianship is extraordinary and the band seems to be able to work together as if they had been playing together their entire lives. Some of the instrumentation in \"Red Barchetta\" and \"The Camera Eye\" is stunning and leaves one wondering. The best stuff for me on this album is \"Limelight\", \"Tom Sawyer\" and \"Red Barchetta\" while others have memorable moments but are unable to equal the others. Also, due to the ability to make a song \"flow\", that is writing a song in a manner which everything melds into each other, makes \"Moving Pictures\" easy and accessible. The instrumental \"YYZ\" was nominated for a Grammy and is a very technically difficult song to play.The album was a great success and like all Rush studio albums achieved gold status (except 'Vapour Trails.') The album then went on to become Quadruple- platinum and has sold over 4 million copies which makes it the most successful Rush album. It was also the highest US charting album reaching number 3 and similar positions round the world. This success was in many ways due mostly to the singles \"Tom Sawyer\" and \"Limelight\" which are now trade mark Rush songs.1. Tom Sawyer (4/4) 2. Red Barchetta (5/5) 3. YYZ (4/5) 4. Limelight (5/5) 5. The camera eye (4/5) 6. Witch hunt (Part III of Fear) (4/5) 7. Vital signs (4/5) Total = 30 divided by 7 (number of songs) = 4.28 = 4 stars Excellent addition to any prog music collection\"Moving Pictures\" is a progressive hard rock standard now a days and many modern progressive bands carry heavy influences from Rush. \"Moving Pictures\" is one of the best progressive rock albums, though in my opinion it falls slightly short of \"Hemispheres\" and a five star rating. I'd recommend \"Moving Pictures\" to all prog- metal fans to see where all the popularity started. Great album (bad review)!"
    },
    {
      "reviewer": "The T",
      "date": "Posted Wednesday, November 1, 2006",
      "rating": 4,
      "text": "4.75 STARSRush's most appreciated album, this 1981 release is without a doubt one of their best, if not their best, but I still believe it's not the flawless album these canadians could've given us with the enormous talent they had.Again, this album continues to drift away from 70's Rush sound, with more direct, shorter pieces, much more song-oriented compositions, and more synths. Gone are the 10+ epics of past records like 2112 or CygnusX-1, their place being occupied by 4-5 minute pieces.On thing that needs to be pointed out is in relation to the production department: this album sounds terrific, AMAZING. The production is really top-notch here, and you can hear each instrument with absolute crystalline clarity, and the balance between all of them is perfect. Another detail: Lifeson's guitar at last starts to sound like a good guitar and not the poor chainsaw (not because of his playing, which was every bit as great, but because of the recordings) of the 70's. Geddy Lee's voice continues to develop into a more listenable, melodic style while Peart's drumming stays the same: spectacular, precise, to the point, flashy yet elegant, difficult yet understandable....OUTSTANDING.....And his lyrics were great, too.Tom Sawyer (9/10), an amazing song, one of Rush's most famous tracks, and one vilified by some purists because of its popularity, but don't let that keep you away from this incredible song! The synth sounds resonate strongly here, and they start to become a prominent part in Rush's music. The drum playing is just as perfect as drumming gets: it's not overly impossible (you actually can distinguish every hit of every head and cymbal), yet it's so, so precise, it has a sort of mathematic quality to it, for every accent, every beat gets the exact percussive effect it deserves....I love his hi- hat and ride-cymbal playing patterns...this song is great. Why not 10? Well.... it could be one minute longer, it ends too quickly.Red Barchetta (8/10), a very good song with just regular lyrics, a rock track in full form... halfway down the track there is a section which I'm sure Dream Theater had in mind before writing the end of their track Innocence Faded....XYZ (9/10), a great instrumental but not as marvelous as LA Villa Strangiato from Hemispheres... there's ome excellent playing going around here, but I think the piece lacks variety...it's too straightforward, same tempo and rhythm.Limelight (8/10), another radio-hit, this one is not as good as Tom Sawyer but it works and it makes for a pleasurable listen. The chorus is very catchy...the solo by Lifeson is good if a little short....The Camera Eye (8/10), a very good long track, but in no way near the level of the best of Rush's 10+ minute songs like Cygnus or their best, Xanadu. The slow, quiet introduction makes for a compelling start, but it grows into a rather common rock beat with not much in terms of variety. Let's face it, Rush's best days for long tracks were past history at this point in time.Witch Hunt (8/10), another good-but-not-great track, it's kinda dark, a rather obscure, haunting theme . It's very good, actually, but it just doesn't click for me....I don't know, maybe dark Rush is not what I have in mind.....Vital Signs (8/10), a poppy track with unusual electronic drumming by Peart and a bass- line and synth part in the vein of groups like The Police....but the song is very good!In a few words, a good, great, almost flawless album that stands the test of time with its great songs and unique sound.... for me, it's not perfect because it's not a every- song-is-10/10 kind of cd. But it's a classic, and surely, up to that point in time, Rush's best ever.4.75 STARS (man we need some decimals in here!!!)"
    },
    {
      "reviewer": "1800iareyay",
      "date": "Posted Monday, December 11, 2006",
      "rating": 5,
      "text": "Moving Pictures was a watershed moment for Rush. It stands as the band's highest selling album, though the period that followed it would result in many fans leaving the group. This album is the perfect balance of the heavier albums of the 70s and the synth driven albums that would follow. As always, Lee, Lifeson, and Peart are in top form. This album single-handedly revitalized prog for the 80s and, in my opinion, kept the genre alive long enough for neo-prog to truly cement prog's rebirth.The album opens with \"Tom Sawyer\" the band's most well-known tune. Peart starts strong with this great performance. The beat is insanely catchy with some great lyrics, though I can't link them to the character of Tom Sawyer that well.\"Red Barchetta\" is a good song, though it's not very memorable and after a few spins I started to skip this track. The lyrics are the closest to the sci-fi trips of the last few albums adn the composition is great, it just doesn't stick with me for some reason.\"YYZ\" is Rush's second greatest instrumental (next to La Villa Strangiato). Geddy's bass is arguably the greatest bass performance in rock. Peart's contribution is equally as impressive.\"Limelight\" is where Alex begins to exert his skill with a great riff and break. Geddy continues his top-notch bass work with his catchy bassline. The lyrics are top-notch, dealing with the downside of fame.\"The Camera Eye\" is where things begin to take a turn. The song is too long, and if sounds like parts were added just to increase the length. If those elements were removed, this would be a killer song. EDIT: After a few more listens, this song grew on me, though I still think it's a bit too long.I thought \"Witch Hunt\" was the token Rush filler track until I heard it live when I saw Rush on the Snakes and Arrows tour. This song is haunting and it has very thoughtful lyrics, my second favorite of the album (first being Limelight).\"Vital Signs\" is like Red Barchetta in that you stop listening after a few spins.Moving Pictures is to Rush what In Absentia is to Porcupine Tree: the perfect blend of the sound of old with the new sound that was to come. MP mixes the heavy prog of yore with the catchy synth beats that would define their 80s output. Moving Pictures isn't quite as progressive as Hemispheres, but it's more accessible and more immediately enjoyable. This is where newcomers should start and it stands as the band's second greatest album, next to Hemispheres.Grade: A-"
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Wednesday, March 28, 2007",
      "rating": 5,
      "text": "In my opinion the onlythingcooler than \"Permanent Waves\".\"Moving Pictures\" synthesizes the masterful playing of the trio, the brainy lyrics of Peart, and the group's collective songwriting talents into a artistic tour de force that completely rocks while retaining a sort of intellectual conscience; listening to it makes you feel smarter.Very few albums are this good, start to finish, and every track on \"Moving Pictures\" has something to fall in love with. \"Tom Sawyer\" and \"Limelight\" steal the spotlight, but I find \"Red Barchetta\" to one of the most energetic and virtuosic songs Rush has ever written, while \"Camera Eye\" (the oft forgotten Rush epic) is a terrific capstone to the band's extended output-- while also showing the band dabbling with synthesizers more than every before; a precursor of things to come.This is the one-- I can't imagine anyone who claims to like rock music (progressive or otherwise) not finding something exciting here!Songwriting: 5 Instrumental Performances: 5 Lyrics/Vocals: 5 Style/Emotion/Replay: 5"
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Thursday, March 29, 2007",
      "rating": 5,
      "text": "This is the record that made RUSH famous. I heard Geddy once say he felt this was their best work and it's pretty hard to disagree with that statement even if it's not my favourite RUSH album.The record starts with \"Tom Sawyer\" a song that has been played to death, yet i'm still not tired of it. What an intro though ! Slowly pounding drums and some great synth work from Geddy. Alex follows with a scorching guitar solo, and check out the drumming throughout this song ! \"Red Barchetta\" is simply a great sci-fi story told through a song. It's such an uplifting tune and the chase section is classic. This song flows so well, and like \"Witch Hunt\" and \"The Camera Eye\" RUSH has the ability to bring the story to life, you can visualise what you hear like reading a good book. \"YYZ\" is only second to \"La Villa Strangiata\" as my favourite RUSH instrumental. This is so complex with background synths. Y-Y-Z is a transmitter code for the Toronto International Airport and they open it with a 10/8 rhythm which is actually morse code for those initials. \"Limelight\" is one of their best songs ever and it's about being thrust into the public eye and trying to deal with it. The guitar throughout sort of grinds away until a mournful \"Permanent Waves\"-like solo arrives. Lifeson recently said in an interview that this solo is still his favourite to play live after all these years. \"The Camera Eye\" is about the people of New York and London and how they rush around their cities oblivious to their surroundings. I can't get enough of this amazing song. The drumming is incredible and check out Alex after 9 minutes. \"Witch Hunt (Fear part III)\" has such vivid imagery to open with the sounds of a mob on the hunt. Dark and ominous with lots of synths played by Hugh Syme. \"Vital Signs\" as others have noted has a POLICE flavour to it as the bass and drums lead the way. Great tune. And RUSH were certainly fans of THE POLICE back then. In my opinion this is the last of five straight masterpieces.This period of RUSH is unequaled in prog history. Ok, I guess you could say i'm a fanboy."
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Friday, June 15, 2007",
      "rating": 4,
      "text": "Coherect, considered, carefully constructed and competentResisting the opportunity to exploit the singles chart success of \"The spirit of radio\", with \"Moving Pictures\" Rush produced what is arguably their most coherent and considered album. With Lifeson and Lee providing the music for Peart's lyrics throughout, there is a continuity to the music with each track being carefully constructed and fully developed.The synthesisers are once again present to fill out the sound, but it is Lifeson's guitar work which differentiates the album. On the opening \"Tom Sawyer\", the guitars positively chime, while on the following \"Red Barchetta\" it is the riffs which catch the ear.The instrumental \"YYZ\" offers a welcome relief from the sometimesdifficultvocals of Geddy Lee, the jam like feel of the track being at odds with the rest of the album. \"Limelight\", which closes side one of the LP is one of Rush's most melodic tracks, the chiming guitars once again providing a tasteful background.Side two opens with a 10+ minute epic \"The camera eye\". This is a trulyheavynumber with guitar and bass combining to drive the track forward. Lee's surprisingly sensitive vocals therefore provide an interesting counterpoint especially on part one of the two part track.\"Witch hunt\" is interesting as it is sub-titledPart 3 of \"Fear\". The only minor issue is that parts one and two of \"Fear\" had not yet appeared, but would follow on later albums. Peart's lyrics here are among his most poignant,\"Quick to judge, quick to anger, slow to understand. Ignorance and prejudice and fear walk hand in hand\"(Now why did I think of our forum there?!)Only the closing \"Vital signs\" comes across as superfluous, a decent enough song, but rather anonymous in the company of its peers.In all, probably Rush's strongest offering (of those I have come across). The album succeeds in balancing thoughtful track structures with accessible melodies and competent performances."
    },
    {
      "reviewer": "obiter",
      "date": "Posted Friday, June 22, 2007",
      "rating": 2,
      "text": "this is by a country mile the most polished album to date. very well mixed and produced.but IMHO nothing can save this album from the trappings of commericalism: the profits are now written on the concert walls, to borrow from PW.the end result is for me the least progressive of all rush albums.but, on another vein, would you, dear reader, like this album? almost certainly. to that extent this album is a great success.As some sotr of milestone of prog rock ... get right out of town"
    },
    {
      "reviewer": "Hercules",
      "date": "Posted Wednesday, July 25, 2007",
      "rating": 4,
      "text": "Rush's finest hour (or a bit under). My early enjoyment of Rush was spoiled by some slightly silly lyrics and screechy vocals, but here the writing is more mature and Lee sings far more tunefully. The musicianship is astonishing, especially on the instrumental YYZ; few bands could attempt this with its complex rhythms and dynamic interplay. Every track is thoroughly enjoyable but my favourite is the complex The Camera Eye, comparing life in New York and London. Witch Hunt, with its echoes of Salem, is sinister and dark, whilst Vital Signs is lighter and almost poppy. Not quite a masterpiece overall but a very strong album which frequently features on my playlist and is highly recommended."
    },
    {
      "reviewer": "SoundsofSeasons",
      "date": "Posted Friday, July 27, 2007",
      "rating": 5,
      "text": "edited: 6/13/07... AAAH! Friday the 13th!... oh well ive been fine all day...After carefully considering this albums influence on metal, and rock in general. (Dream Theater, The Mars Volta, Porcupine Tree, Tool, Opeth... yah you all know what im talking about). I've decided this is an essential album, not just the essential RUSH album.I consider this RUSH's last best album, after this one it just wasn't the same. However if your going to go out of one phase and on to another THIS is how you end it. Ill just go ahead and give a quick description and rating of each song.Tom Sawyer- Never one of my favorites, but considering how many people know RUSH just because of this song i suppose i must give it credit. Any fan of Hard Rock will love this one, its slow and strong. The lyrics can be confusing yet they have a charm that you wont soon forgetRed Barchetta- A great song, no matter the occasion. Fast and calm, clean and focused. The lyrics work perfectly and have a fun meaning. Very good song.YYZ- You'll never get tired of it. Well maybe...but only after you've memorized it, hummed it a hundred times, and looked up the meaning of its name. Geddy really shines here, not held back by his keyboard or voice, he goes full out on his bass. Alex sounds great as always. Neil is tight as ever, hitting each beat with absolute precision. Fantastic.Limelight- One of my favorite RUSH songs of all time. The lyrics are great, and really give insight to the life Neil must bear. One of Alex Lifeson's most memorable songs, he plays with real beauty.The Camera Eye- A great song. The one ''epic'' in this album, just long enough not to take away from the shorter and sweeter style they were going for in this album.Witch Hunt- A very haunting and dark song. Actually quite an above average Rush song as well.Vital Signs- I actually kind of like this song. A middle groud RUSH song, not the best but not worst. You can find enjoyment out of it once in a while, i do."
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Thursday, August 30, 2007",
      "rating": 4,
      "text": "\"So light, yet endless, from a leaden sky.\"A long time ago, in a classroom far far away, I was sitting there bored as usual waiting for class to begin. This older kid Matt walks in and takes his seat in front of me and turns around to talk music. The conversation goes something like this: [Matt]> I'm really bummed out. [Me] Why, what's up? [Matt] I got the new Rush album and it just totally sucks, total sell-out radio crap. [Me] Really? (Playing dumb because I also just got the album and loved it, but Matt was a huge Rush devotee and I was a newbie.)The subject of Matt's venomous wrath was indeed Moving Pictures. He explained that Permanent Waves had started the collapse and that Moving Pics proved the band was just another FM radio band. Eventually I got up the nerve to defend the cassette tape that took so much of my hard earned cash from washing dishes at the Mall pizza place. That was sometime around '81, and all these years later I still like Moving Pictures a whole lot. It has a certain personality that some of the others lack.I think it's Rush at the peak of their artistic integrity and creativity, melding together the excitement of the exploration of previous years with the more succinct songwriting of the future. But unlike some of the boring albums that would follow, Moving Pictures is still Rush as a kickass rock band. They are firing on all cylinders here, from songwriting to execution, lyrics to even the album cover. Geddy sounds natural and relaxed vocally, Neil's playing is reaching new heights, and Alex has not yet been neutered.I still feel this batch of songs are some of the best Rush ever did, the difference between then and now for me is that I used to prefer side 1, and now I think side 2 is even better and more interesting. I used to think Tom Sawyer was the best song, now I think it may be the weakest on the album (though still good.) \"The Camera Eye\" is the masterpiece for me here with its very satisfying development and mood. \"Witch Hunt\" would work perfectly as a Sabbath tune, imagine Ozzy singing these lyrics with Bill Ward on the drums and more ominous Tony guitar sound. And then \"Vital Signs\" which sounds like it could have been on Signals and in fact the word signals pops up in the song. It sounded like Rush was prepping the fan base for what was coming: \"everybody got mixed feelings about the function and the form, everybody got to deviate from the norm.\"Goodbye to 2112 and Hemispheres, hello Signals, Grace, and Power Windows. Rush had every right to shake things up, of course, but eventually by PW they ended up boring lots of fans, myself included. Change is good? Sometimes. Frankly it's an overstated euphemism. Change for the sake of change or for being hip or commercial can be dreadful just as often. That's a lesson we would learn over and over in the 80s. Being true to yourself and your art should eclipse commercial concerns and mugging for MTV, lessons lost on 80s Yes and Genesis. Rush would have their own difficulties keeping older fans pumped. But not here. Moving Pictures is an essential Rush album and belongs in any respectable rock collection, sorry Matt. Arguably, they would never make another album this fine."
    },
    {
      "reviewer": "FruMp",
      "date": "Posted Wednesday, October 10, 2007",
      "rating": 4,
      "text": "At the meeting points of the cheesy 80's synth-rock RUSH and the heavy progressive 70's RUSH lies this masterful album.What more can be said about RUSH's most well known album?, in my personal opinion it is a tad overrated, there is a lot of great material here but it just fizzles out at the end.The Alubm starts off with the bands best known work 'Tom Sawyer' a great pop song (Peart is in fine form here playing complicated and fast fills that never detract from the music). 'Red Barchetta' is a great slow paced mellow song and Geddy's bass really shines here taking the lead. 'YYZ' is probably the band's best instrumental aside from 'La Villa strangiato' with a great middle-eastern tinged theme, everyone is working in harmony here. Limelight is a pretty cheesy pop song and lacks a lot of the power that Tom Sawyer possesses. 'The camera eye' is the best track on the album, it's a 10 minute epic about life in the city being watched by cameras and has some of the bands best use of synth in their career.From this point on the album is pretty much finished, the last 2 songs really let things down and don't really contain any substance at all which is the one factor swaying my decision to award this album 4 stars. A very worthwhile album, and absolute must for RUSH fans."
    },
    {
      "reviewer": "progrules",
      "date": "Posted Wednesday, November 7, 2007",
      "rating": 3,
      "text": "This must be one of the most overrated albums on this site. I'm kind of a Rush fan but this is by far not one of my favourite albums. I think it's quite mediocre with two very nice songs (Red Barchetta and Camera Eye) but these two score just about 4 stars in my book. The rest is far less, just Tom Sawyer and YYZ are ok too, the rest is poor.So I can't go any further than 3 stars. (3,25)"
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Wednesday, November 28, 2007",
      "rating": 5,
      "text": "Moving Pictures means a lot to me as it was one of the first prog rock albums I bought. I bought it second hand along with Genesis And then there were three. Both LP�s had had the same owner, and this was visible as both had been through a fire and smelled really bad ( Actually my Pink Floyd Animals must have had the same owner too, as it smells really bad too).Moving Pictures is somewhat odd in the discography of Rush, as it really doesn�t sound like anything else they have made. Well Permanent waves has some of the same things but not quite. The album is very stripped down. Guitar, bas, drums and of course Geddy Lee�s vocal are the most prominent sounds on Moving Pictures. The sometimes excessive use of keyboards on many of Rush�s albums is stripped to a minimum on Moving Pictures. The keyboards are there, but they are pretty subtle, which really helps set this album apart from any other Rush album. Keyboards can be very nice, but I generally think Rush uses them too much in their music. Thankfully not on this one though.The sound quality/ Production on Moving Pictures is on a higher plain. This is one of my favorite productions of all time. Especially the sound on the drums. It�s really impressive and powerful. I like to call it dry, but I�m not sure people understand what I mean. It suits the album perfect anyway.Tom Sawyer starts the album. And what a start it is. Geddy sings with so much power in this song, and Neil Peart�s drums are very commanding. The guitar from Lifeson is also really cool in this song.Neil Peart shows his lyrical talents in Red Barchetta. I just love the nostalgic story about the uncle and his car. Again the music is very powerful and beautiful.YYZ is a genre defining instrumental song. It�s one of the best instrumental songs ever written. The instrumentation is so stripped, that you can clearly hear what everyone is doing and it helps emphasize what a powerful song this is. Lifeson�s solo is amazing and Neil Peart and Geddy Lee plays so well on this track. I can�t praise this song enough. But you get the point, right ?Limelight is really a winner too. Tight instrumentation and a Geddy Lee in good vocal form ( He always is. He has never let me down). The lyrics are clever too.When listening to The camera eye I always get an urban feeling. It�s really a great epic song. Of course it�s pretty stripped down like the rest of the album, but there is still an epic feel about it. This is a great song.Witch hunt (Part III of Fear) is a live favorite and in my eyes probably the weakest track on Moving Pictures. It�s not bad at all though, just the song I like the least. A pretty slow track.Vital signs is a great closer to Moving Pictures. There are some keyboards here that points toward the next album Signals, but they are not as excessive as on that album. The song has got some kind of Ska/ Reggae rythm which sets it apart. Nice move.This is a classic Prog rock album, and a personal favorite of mine. I think this is a masterpiece ( The sole masterpiece they have ever made) and I can give no less than 5 stars. Unfortunately as mentioned, Rush didn�t continue in this style, and already on the next album, their beautiful music drowned in oceans of keyboard and synth. Too bad, I�m sure if they had pursued this path, they would have made more masterpieces."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Friday, January 25, 2008",
      "rating": 4,
      "text": "I feel that both the biggest strength and the biggest weakness of MOVING PICTURES is that it's a classic album. What do I mean?Well, some of the most famous and most beloved songs of Rush's repertoire like ''Tom Sawyer'' and ''Limelight''. Many of the songs have that instant enjoyability to them, meaning despite the underlying complexities of tunes like ''YYZ'', there's that accessibility factor in them that doesn't require months of persistence. This seems to be a trait carried over from their previous effort, PERMANENT WAVES.However, if you're musical styles/interests constantly change as mine do, the old-reliable hits get too old, too fast to the point where the enjoyability factor erodes. I'll be honest, I've only had maybe a mutual like for many of the songs from the first half, but never an overzealous lust (maybe excluding ''YYZ'').I tend to gravitate toward the second half despite its ''new-wave-y'' keyboard soundscapes. Progheads will likely rejoice in the glories of ''The Camera Eye'' with all of it's tricky guitar lines and futuristic keyboard sounds. It basically continues the pace set by ''Natural Science'' from the previous album, just not as strong as ''Science''. The other two bits on the second half are more a sign of what albums like SIGNALS represent.This is ideal for any Rush beginner, essential for any Rush fan, recommended for any prog lover. Just be careful of the wear that MOVING PICTURES may cause."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Wednesday, April 9, 2008",
      "rating": 5,
      "text": "RUSH grow an arm and a leg here and finally produce a seamless album of the highest quality.They do this by discarding their unfortunate progressive excesses of the late 70s and embracing the brevity - and some of the sounds and values - of the 80s. This ought to produce a horrible shiny New Wave record, but the strictures of shorter songs actually focus RUSH's limited compositional talents and, for once, the songs work.Straight into 'Tom Sawyer' and that memorable bass. On earlier albums they would have added an intro of bee-like synths to this song, and stretched it out to nine or twelve minutes. Not here. This track should shout loud and clear to all prog heads that prog is a child of popular music, and that good composition makes a song as long as it needs to be, not automatically twenty minutes.'Red Barchetta' is hardly any less impressive, with a sequence of memorable riffs. Finally GEDDY LEE's voice makes sense, given the context this excellent music provides. Then his voice is gone and we roar through the shining gem of 'YYZ'. This song is the meeting place of compositional genius, virtuoso playing and 80s production values, and justifies the band's existence. Four and a half minutes of perfection, often imitated, never bettered. 'Limelight' continues the fine songwriting, an art rock song with the usual crunchy guitars but compositionally much tighter than similar tracks on previous albums. Ample room here for each member of the band to deliver powerful performances.'The Camera Eye' starts with those dreadful buzzing-bee synths. What a pity they paid no attention to the fine synth work coming from the UK in 1980: this sound was so dated even then. The song is a mini-epic, a pastiche similar to '2112' in form, but far superior in execution. The changes in tempo remind me a little of LED ZEPPELIN's 'Carouselambra'. The final two songs are very good, but perhaps overshadowed by the company they keep on this album. Nevertheless they come into their own after a few listens. I'm personally very fond of 'Witch Hunt', finding it one of the few times RUSH raises my neck hairs.I don't personally see this as one of the very best albums in the history of prog rock. I can think of at least fifty prog albums I prefer. Nevertheless, the value of this album lies in its release date, at a time when the critics had buried prog rock and danced about on its grave. With 'Moving Pictures' RUSH did the seemingly impossible: filled the airwaves with hard rock of the highest quality at a time when rock itself seemed to be on the way out. We all ought to be grateful that, with this album, RUSH helped keep high quality rock alive."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Monday, May 19, 2008",
      "rating": 3,
      "text": "Review 32, Moving Pictures, RushStarStarStarEverybody got to deviate from the norm...Even me. Whenever I put on this album, it's for one reason: I want to listen to Vital Signs, and I feel I should endure the pilgrimage to see my painfully metaphorical Mecca. The lyrics and music feel rather separated, which is fine for the more rocking songs (Tom Sawyer, Limelight) but leaves Red Barchetta and The Camera eye feeling horrifically pretentious and half-hearted. The playing throughout is fine, even if we get a few rather unnecessary-feeling sections (with the pop convention of 'repeat a bar before adding vocals because the audience don't have a big attention span'). The exception to this is some of Lifeson's solos, which feel rather sterile and nonthreatening to me. Geddy Lee's voice has lost a lot of its drama, and is more suited to the rock or quieter numbers than to more narrative or darker things on Red Barchetta and Witch Hunt. Not an incredibly fun or enjoyable Rush album, but a fair effort.From its first Oberheim synth and accompanying blunt drum sound from Peart, Tom Sawyer gives us a very song start to the album. The song moves through a couple of variations on one song part, with comfortably enough variety in the music, vocals and lyrics [which, though not stunning, have a welcome dark resonance and mystique] to survive. We get a very potent gritty bass-driven chorus with a dark vocal from Lee. The instrumental section begins with an excellent combination of synths which are followed with a rather rockless solo from Lifeson. The return to the vocal sections, however, has Peart on top form, with a crashing array of drums and cymbals. A great rock song, with an individual atmosphere and an impressive complexity and mobility for such a successful hit. Memorable as an opener, and an excellent use of the synths.Red Barchetta is a prime example of the problems with the album as a whole. The music holds no relation to the lyrics. The lyrics are poorly phrased, the idea illogical (anything with 'I've got a desperate plan' can't be that great, and I can't understand the exact rationality of the slightly sci-fi concept, which seems another rather weak attempt to revive the freedom against control themes of 2112). The story, desperation and emotions included, bears no relation to the music, which is just repeats of earlier sections with some mostly insignificant variation.On the plus side, a pretty good performance from Lee on vocals, and a decent, grainy solo from Lifeson. A rather wallowing bass-driven section with disastrously blunt guitar is repeated a few times, as are a couple of much improved rocking ones led by Lifeson's guitar. The repeats seem a little blunt, and, especially towards the end, have very little relation to the story or development other than Peart adding a couple more sounds ('I've got a desperate plan' does not even feel remotely desperate'). The concluding part is pretty good with some good bass soloing from Lee, and a gradually descending mix. Basically, it would have been nice to have a song where the lyrics genuinely related to the music, rather than simply telling a story at the same time as the music is playing, with the words tortured to fit the metre.YYZ is a fair instrumental with an excellent bass part from Lee (solos included), even if it drags a little. Peart throws out all sorts of drum parts into the mix, and Lifeson's guitar is used calmly as a controlled rocking factor the background, even if it doesn't impress much when contributing a more solid riff. A good idea, but it goes on longer than it had to to get the point across and I'm not particularly keen on the ending, for some reason.Limelight is another solid rocker, unfortunately dragged down by an occasionally irritating set of lyrics (I've seen it called a full song of lyrical hooks, but I could really have done without the cheap Shakespeare reference). Great Lifeson guitar throughout, with an interesting Peart performance as well, which manages to emphasise the vocals by its absence. Great chorus (especially with regards to the vocals and a rock power not often achieved on the album). The return to a verse is unconvincing, but the song remains powerful and excellent, and manages to decelerate to provide a background for an effective quiet Lifeson solo.The Camera Eye begins with some city sounds, because it can, and then gradually builds up from a synth background, which I like, and a lead synth, which I don't, to a massively overdone element of pompous development with boring drumming, before moving to an almost-completely unrelated rolling drums and guitars to a bit of more conventional, if rather less interesting musically section. Geddy Lee's vocal highlights the extension of musical meh, with some repeats of earlier sections and some plainly bland, rather drum-dominated sections with very tiny variations. The first part of the lyrics ends with little ado and gives way to a desirable instrumental break, even if the repeats of themes from the earlier music simply seem to be repeats rather than proper developments.The second part also features the terrible drumming choices, but has a redeeming bass part from Lee, who manages to stir things up a little. The trio's hideous attempt to add an English feel with an 'alright guv' quietly added is hilarious for all the wrong reasons. Lifeson and Lee give us a suitably impressive example of bass and guitar interplay before the song fades out on a synth rhythm and a Big Ben clanging. I really don't like Peart's drumming on this song, and the piece as a whole feels a bit forced and almost a chore to listen to.Witch Hunt is where the album begins to pick up a gain. A rather blunt example of chimes, inquisitorial voices and rather clich� witch-hunt feel with a couple of wonderfully grainy synths lead us into the superbly rocking main guitar riff. Geddy contributes a dark vocal, which doesn't quite click with me, and confident synths. Peart makes some slightly amusing use of the tin bucket that he's apparently hidden under his orphan-shelter drumkit. Geddy (I swear he's the only musician I think of my the first name. Who knows why?) provides some clever bass additions, including some high playing that rather escapes the mould. Maybe the boys were trying a bit too hard to bring in the atmosphere, but I appreciate the effort, and it's overall a good song.Vital Signs is, in my mind, completely transcendental over the rest of the album. Wonderful atmosphere-developing synths without the effort of The Camera Eye, a quirkiness, constantly-shifting, and a mechanical, yet organic feel. Peart provides some wonderfully bizarre percussion choices, and Lee manages the vocals without feeling strained or drowned out by any of the instruments. Absolutely classic effort, with a perfectly handled atmosphere, great rock moments, an uplifting message, superb playing on all fronts, interesting and effective lyrical choices more reminiscent of Natural Science than The Camera Eye. Finally, a great fade, ending the album on the highest note it has. This is one of my favourite Rush songs, certainly, from those I've heard.For me, this album wasn't a must-have. It doesn't rock as hard as 2112, the lyrics are mixed in quality, and the atmospheres are often forgotten. I think it is, overall, a good album, even if The Camera Eye doesn't convince me and tempts the evil next button. Worth getting for Vital Signs alone, but I think that A Farewell To Kings is a better Rush introduction, by and large.Rating: Three Stars Favourite Track: Vital Signs"
    },
    {
      "reviewer": "ghost_of_morphy",
      "date": "Posted Saturday, May 31, 2008",
      "rating": 4,
      "text": "Permanent Waves (in my humble opinion, Rush's masterpiece) was definitely a transitional album. The progressive excesses of the past were discarded, tasteful synths were given prominence, and everything was focused more towards the mainstream while still retaining the trademark Rush sound.With the album under discussion now, Moving Pictures, the transition is complete. This is the template that Rush will be following for the next two decades, and it is a very appealing template indeed, despite omitting some aspect of their music that we prog fans really loved. Rush has found a way to appeal to fans of heavy metal and arena rock without alienating us.Truly, the production on this album is amazing. Strong songs backed up with a high quality production made this one of the must have albums for extremely diverse fan bases. While this is not one of the masterpieces of prog, this is one of those albums that bring in listeners from across the entire spectrum of music lovers.4 stars. It's an excellent addition to anybody's musical collection, whether they are prog fans or not, but it's not quite a materpiece. This is one of those albums that you share with your friends to bring them into progdom."
    },
    {
      "reviewer": "Moatilliatta",
      "date": "Posted Thursday, June 26, 2008",
      "rating": 3,
      "text": "I love a good pun, and this album delivers one with that cover art. With such a laugh-out-loud pun for cover art, you know this album is going to be a masterpiece. [But why do I get the feeling that 6/7 of this record was given less thought than the cover art? That's not even possible and I still get the feeling!]Rush sure know how to create [the illusion of] a masterpiece. Take a look at \"Tom Sawyer.\" It's got a catchy lead, a reference to a familiar story character that we all love, and heck, and it's topped off with a synth riff in 7/8. Brilliant! And look at Neil Peart's drumming. I can see why he's often cited as one of the greatest drummers of all time. No one keeps a 4/4 beat like this guy. And his 7/8 beats! How cleanly he stresses each beat! And check out that fill 43 seconds into \"Red Barchetta\"! Wow! Amazing! And I just can't get over the man's deft use of high-pitched drums. Mike Portnoy should just throw away his octobans because he can't play like Neil. Oh yea, and only Neil justifies using a drum kit that surrounds him. Go back to a standard 5-6 piece kit Portnoy! Next we have [the only really good track on the record] \"YYZ,\" which spells out those letters with morse code! That is definitely a fun one! I would go as far as to say that it's Rush's best song ever [I really think so]. Ah yes, \"Limelight,\" the original rock hit about being a rock star [I'm not doing any research; that statement stands]. It's my favorite song about fame other than Good Charlotte's \"Lifestyles of the Rich an Famous\" with it's quick-witted paradoxical bashing of their own fortune. Hey! They made a reference to \"The Camera Eye\" in the last song! Brilliant! What an exciting 11-minute song [consisting basically of the same themes over and over!]. Rush surprise us all with the last two tracks; they are quite different from typical Rush songs. First, \"Witch Hunt,\" is a very eerie song [the lyric \"faces are twisted and grotesque\" perfectly describes my reaction to this song (I grow a second face to show my disgust)]. And they finish [poorly] with a reggae-tinged \"Vital Signs\" [there is an easy joke to make here]. Quite different [bad move].Buy this album! [it's a better idea to just get yourself a high-quality mp3 of \"YYZ;\" the first 5 tracks really aren't bad, and are generally even good, but not great by any stretch]."
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Monday, October 6, 2008",
      "rating": 3,
      "text": "Probably one of the best Rush works, but I have little problems even with such a critically acclaimed album. Good album indeed, but obviously the level of depth of the songwriting doesn't please me enought. The flaws can be heard almost at the beginning of the album - in the second song, called Red Barchetta. It's full of static ideas and repetitions. In fact that attends all over the album, except the opening song - Tom Saywer. I think Moving Pictures is so technical example for the fact that the technique is not everything. You need more - the ability to catch the listener. And they definitely miss it with me. This album makes it, very hard! The vocals by Geddy Lee are the other weak section, in my opinion. The mixture between guitar riffs and electro keyboard sound is another motif I have a problem with here. And yet good album.Final conclusion: an overrated album by an overrated band! 3- stars"
    },
    {
      "reviewer": "MovingPictures07",
      "date": "Posted Sunday, November 16, 2008",
      "rating": 5,
      "text": "Not surprised at the 5 star review? Yeah, I'm not either. However, let me explain to you why this is such a masterpiece.1. Tom Sawyer- If you don't know this song, then you must be living under a rock or aren't really familiar with classic rock in any way. This is an extremely well-crafted song and is Rush's most well-known song for a reason. It manages to balance a more accessible rock base with odd time signatures and purposeful artistic structure, and it manages it perfectly. The synthesizers here are wonderful and the band is instrumentally very good. Great track! Try not to sing to it, even if your vocals suck. Flawless. 10+/102. Red Barchetta- This song holds so many memories to me because it is the song that has bonded my father and me several times over the years. The atmosphere set up in this song is ideal, the instrumentation again is wonderful, and Lifeson's solo almost midway through the song is magic. The trio really manage to create a perfect song here. Flawless. 10+/103. YYZ- Now THIS is an instrumental! This song is absurdly amazing with all three musicians really tight and still keeping everything in balance to maintain a relatively shorter song. The emotions bottled in this song so perfectly are kept in check and the interplay among the three of them is superb. If you think that Moving Pictures is a step away from Rush's virtuosity and more prog influences, listen to this. Flawless. 10+/104. Limelight- Lyrics are spot on here, illustrating Peart's views about being in the limelight. They're incredibly intelligent and fitting, as his lyrics are throughout the album, these are just of extremely particular note. Instrumentation is great here as usual, and Lifeson's guitar really makes this a wonderful track. Rush played this track as the opener to the Snakes and Arrows tour and they could not have picked a better track to begin with. This really is a great culmination of a soulful track by the Canadian trio. Flawless. 10+/105. The Camera Eye- Rush's last track that lasts over 10 minutes, and what a last entry it is. The band is once again in top instrumental form here, creating a song that is infinitely expressive, always interesting, and full of plenty of rock and prog elements. Flawless. 10+/106. Witch Hunt- Why is this track so overlooked? Lifeson's crunching, haunting riffs really drive this song once it gets started after an extremely fitting, spoken vocal mob intro that sets the tone for a witch hunt. Peart's drums and Lee's synth/vocal/bass work also complement this song perfectly, climaxing in a burst of emotional rush along with Peart's lyrics. Those who know what's best for us/Must rise and save us from ourselves! Fantastic. Flawless. 10+/107. Vital Signs- Least best track of the album, but I still can't find any fault with it whatsoever! Great experimental track here with interesting vocals by Lee and the sequencer-esque sound throughout. Rush doing what they do best once more and a pretty good closer. 10/10A masterpiece of music."
    },
    {
      "reviewer": "J-Man",
      "date": "Posted Saturday, December 6, 2008",
      "rating": 4,
      "text": "This is another tough hard album to review. This Rush's most successful and critically praised album, but I can't but think that after Permanant Waves the transition of losing their progressiveness was complete, and this album came as a result. Sure there are progressive songs (THE CAMERA EYE), but for the most part songs like TOM SAWYER and RED BARCHETTA are just rock songs with not a ton of things that make it progressive. That's why it's tough to rate this. Everything's great, but is so much different then CARESS OF STEEL or 2112. I love both styles of Rush, but this era is much less progressive and more commercial. For a rock album 5/5 but for a prog album, 4/5."
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Sunday, January 18, 2009",
      "rating": 4,
      "text": "Great, but not verymovingRush made many good and even excellent albums in the 70's and early 80's, but only Hemispheres reaches masterpiece status in my eyes. Moving Pictures was the band's last great album and is, in my opinion, better than Permanent Waves. This album is very strong and features some really amazing instrumental work outs as well as several absolute Rush classics. The material is melodically very strong and all the songs are memorable. In some ways this album shows a more mature Rush and it is one of the best albums of their long career along with Hemispheres, A Farewell To Kings and 2112.However, I feel that something is missing. The acoustic side of Rush is absent on Moving Pictures. There are no songs like The Trees, Closer To The Heart, Cinderella Man, Different Strings, Rivendell etc. - they never slow down the tempo. This is a loss that makes Moving Pictures a bit less varied and less appealing than it otherwise might have been. Still a great album though and definitely an excellent addition to your Prog collection.Highly recommended!"
    },
    {
      "reviewer": "progaardvark",
      "date": "Posted Tuesday, January 20, 2009",
      "rating": 5,
      "text": "Rush's Moving Pictures continues where Permanent Waves left off, extending the trend of more radio-friendly material. But this isn't like the radio-friendly material one would hear from groups like Genesis, Yes, Camel, and others at this time. No, this was some killer stuff that was catchy and accessible, but at the same time fine-tuned prog rock masterpieces.Considered by most Rush fans to be the pinnacle of Rush's career; I am inclined to agree. This is the perfect marriage of the Rush of old and the symphonic progressive rock-inspired keyboards that Geddy Lee incorporated into their new sound. Every detail of their compositional and musicianship skills are at their finest on Moving Pictures, right from the initial punch of Tom Sawyer through the last fading notes of Vital Signs.Not only was Moving Pictures their musical peak, but it became Rush's most popular album, with nearly every song receiving radio time on AOR and classic rock stations of the era. To this day, Tom Sawyer and Limelight still receive heavy rotation on these stations, attracting ever newer generations to their music. Besides their popular songs from this album, Rush also made two of the best songs in their entire catalogue: The Camera Eye and Witch Hunt; the former being the last 10+ minute song the group would compose.One of the best progressive rock albums of all-time and probably the second greatest album of the 1980s (behind Marillion's Script for a Jester's Tear). A must-have masterpiece!"
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Monday, February 9, 2009",
      "rating": 4,
      "text": "Rush stepped into the 1980s with no small measure of grace. Where the band had failed commercially in the 1970s, they achieved superstardom and managed to reach audiences well beyond the horizons of their established fan base. No less than two of the eight tracks here remain present-day radio hits; with few exceptions, I find all of the music here completely satisfying.\"Tom Sawyer\" A powerful opener if there ever was one (and even more so live), this song is perhaps Rush's most commercially recognizable tracks. The lyrics are well-written and catchy at the same time, describing a \"modern-day warrior,\" that of a determined individualist. It introduces that iconic synthesizer lead (a melody Lee made up to test his synthesizers) before Lee takes over on bass, paving the way for one of Alex Lifeson's greatest guitar solos. The synthesizer reappears in the end of the song, which features Neil Peart in one of his best moments.\"Red Barchetta\" An energetic track about a young man and his uncle's well-preserved Italian sports car, it was inspired by the fictional short story, \"A Nice Morning Drive\" by Richard Foster. As is the case with most Rush, the music is accessibly progressive- it maintains a respectable and more complex structure but is charismatic and widely appealing. Lifeson again displays his creativity with six strings, both in his role as a rhythm and lead guitarist. Perhaps the only flaw in the entire song is Geddy Lee's mispronunciation of the second word of the title (which, by the way, means \"little boat\" in Italian). The song remains exciting even as it fades out.\"YYZ\" By far Rush's greatest instrumental, it spells out the title (which is the airport identification code for Toronto Pearson International Airport) in Morse code. The main section of the song is impossibly electrifying. It features Lee at his absolute best, pumping out dozens of notes and indulging in spurts of insanely taut solos, trading moments in the spotlight with Peart, who is always exceptional. After that call-and-response workout from the rhythm section, Lifeson plays a fantastic solo, driving the piece back to the main riff.\"Limelight\" Another of Rush's radio successes, \"Limelight\" stands as one of my favorites from the Canadian trio, featuring some well-written lyrics and a thrilling introductory riff. Structurally, it is probably the simplest thing on the record. As usual for this album, Lifeson is stellar in the driver seat as lead guitarist.\"The Camera Eye\" By this point, Rush was giving up on the extended pieces of yesteryear, focusing instead on shorter, more radio-accessible tracks. Electronic noises dominate this track, which has a steady buildup. An upbeat song, the main riff maintains long notes relative to the tempo. The vocals don't come in until over three-and-a-half minutes have expired. Far more reliant on synthetic sound than any other track here, this song gives a good idea of the direction Rush would be taking on future albums, particularly during the acoustic-based sections. This track really doesn't deserve the length it consumes, since mostly it rehashes the same musical movements (especially the main riff). It would have been stronger if it had been cut down in length.\"Witch Hunt\" Utilizing more electronic sounds before moving into the vocal section with a distant guitar and accents from the bass and drums, this is one song that admittedly takes time to appreciate. Thick pads of synthesizer dominate the last moments of the song.\"Vital Signs\" With a spurts of clean guitar and a spunky bass riff, the slight reggae approach makes this song sound incredibly out of place; take away Lee's vocals, and I would be fooled into believing The Police wrote and recorded this. Along with \"The Camera Eye,\" the last song on the album gives the listener an idea of the style Rush would adopt later on in the decade."
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Tuesday, March 3, 2009",
      "rating": 5,
      "text": "'Moving Pictures' - Rush (10/10)I can still remember years ago, going to the record store, buying Rush's 'Moving Pictures' and listening to 'Red Barchetta' on the car ride home. Little did I know at the time that the album would open up an entire category of music to me that I would soon adopt as my preferred type of music. This album, regardless of my opinion is one of the greatest albums of all time. I am in no discordance with this at all. Each time I listen to 'Moving Pictures,' I'm reminded of why Rush is one of my favourite bands in the world, and why this album had such a profound personal impact on me.From the powerful opening chord of 'Tom Sawyer' to the reggae-influenced vibe of the album closer 'Vital Signs,' there are no filler moments that 'Moving Pictures' has to offer. All the way through, there is demonstration of rock at it's most intelligent, while maintaining some shred of mainstream appeal. For those expecting non stop technical 354/265 time signature shredding and 20 minute solos, this album will certainly dissapoint. The use of actual songwriting is in full swing in this album. Even the epic of the album; 'The Camera Eye' is a tight composition and uses it's extended time with the utmost moderation.There is a fantastic flow on the album. After 'Tom Sawyers' relatively power driven nature, there is the up-tempo, optimistic sounding rocker 'Red Barchetta,' leading into the famous instrumental 'YYZ.''YYZ' might as well be the most loosely composed song on the album. That isn't to say at all it's not brilliant, and 'loose' is not meant in a negative context at all. It essentially functions as a jam for the members of the band to basically strut their stuff and show off their talent. The intense flood of unabided talent shown on this song makes it a joy to listen to time and time again.After 'YYZ,' the listener is introduced to what was meant to be the single on the album, 'Limelight.' This is arguably the lowest point in the album, but it's a beautiful song nontheless. It's a great song to listen to if you need cheering up.'The Camera Eye' is a fantastic composition, but it took me a little while to warm up to it. The contrast of New York to London in the lyrics is a really interesting topic to write about, and there's a really good atmosphere about the song.Next comes 'Witch Hunt.' This is one of the most atmospheric songs Rush ever composed. There is a very precise feeling evoked, and a very 'evil' mood to it. Most black metal bands can't even recreate the feeling of eerieness as well as 'Witch Hunt' does. Very creepy, and possibly the darkest Rush song ever produced.Lastly comes the album closer, 'Vital Signs.' The usage of reggae rhythms melded in with the typical Rush rock comes off as being really cool. It's a fitting end to an amazing album.This is Rush's greatest album, and an everlasting testament to their great cohesion and talent as a band. A must-have for any fan of progressive music."
    },
    {
      "reviewer": "CCVP",
      "date": "Posted Tuesday, April 21, 2009",
      "rating": 3,
      "text": "An essential album with boring music insideI have always heard people saying good things about Moving Pictures: that it is Rush's magnum opus, that it was their best-selling album, that it has their best songs, and so on and so on. After knowing most os Rush's discography I must say that i simply can't agree with that and, unlike the common opinion about this album, I actually think that Moving Pictures is one of Rush's worst albums. It could only be saved from an even worst rating essentially because of Tom Sawyer and YYZ, though The Camera Eye and Red Barchetta are not completely worthless also.Indeed, it is hard fot me to understand why this album is so loved among Rush fans and admirers (at least in ProgArchives), when far superior albums, like Fly by Night, Caress of Steel, 2112 and even their debut are so underrated. One possible reason for that is that, in Moving Pictures, Rush starts to make their music more accessible to broader audiences, as we can see in songs like Limelight, Witch Hunt, The Camera Eye and Vital Signs, though still retaining some progressive rock characteristics, as we can see in YYZ, Red Bachetta and Tom Sawyer.However, I do not have any problem with simpler, more accessible or mainstream music. The problem here is that some songs have that irritating, dated and limited signature sound of the dull 80's pop, which sound dangerously close to Asia or worse, being the biddest example of that the song Vital Signs.Despite disliking a considerable part of the album, it is impossible not to notice its influence in progressive rock, progressive metal, popular culture and music in general. Thus, Moving Pictures is an essential album, due to its importance, with boring music inside.The highlights go to: Tom Sawyer and YYZ. Saddest Moments: Limelight, Witch Hunt and Vital Signs.Grade and Final ThoughtsDespite having a couple of pretty good songs, the whole album is somehow a mixed bag, due to some dull songs. Because of that, 3 stars."
    },
    {
      "reviewer": "The Sleepwalker",
      "date": "Posted Monday, May 11, 2009",
      "rating": 4,
      "text": "Moving Pictures is one of Rush's best known albums. The album combines the heavy rockof Rush with synthesizers, just like they did on Permanent Waves, their previous album. The combination of distorted guitar and synth is very balanced and I really love it.The album starts out with \"Tom Sawyer\", one of Rush's most popular songs. The song has some powerful riffs, great synths and of course amazing drumming of Neil Peart. The song is more accesible than Rush's earlier work, just like most of the songs of Moving Pictures. \"Tom Sawyer\" is a very good song, though not really a prog song.Next is \"Red Barchetta\", a song about a red sports car. The songs starts out with a nice harmonics intro and turns into a song that's just as Tom Sawyer, pretty accesible. \"Red Barchetta\" is faster and more exciting than Tom Sawyer, it is however, even less a prog track than Tom Sawyer. The song is a fairly simple one, but a very enjoyable one.The third track is \"YYZ\", a fantastic instrumental, really, it's amazing. The song starts out with a heavy guitar riff with mysterious sounding synthesizer on the background. After the intro the song goes crazy, a very fast and powerful riff comes in, and all instruments are amazing. Geddy Lee's bass jumps out the most of all, really fast and terribly complicated bass playing, amazing! The song has a very nice guitar solo and some great drum and bass fills, one of the best songs Rush has ever made.\"Limelight\" is next, a song about being famous and being recognized on the streets, something Neil Peart really doesn't enjoy. The song is pretty accesible and is just as Red Barchetta a pretty fast and pretty simple song (for prog rock), it is not bad though. One of the great things about this song is the great guitar solo, a solo that's not about technique, but a solo that show's that Alex is really able to do a very emotional guitar solo like David Gilmour. \"Limelight\" is not the best song of the album, but it's pretty good.The longest and most proggy song is \"The Camera Eye\". The song starts out with a lengthy intro, with some guitar licks and a synth riff. The intro is one of those great synth moments, the synth is very balanced with the other instruments, something I really like. After the intro a powerful riff will be heard and soon after that the singing begins. The song is pretty complicated and has a couple of changes is rythms and tempo, some pretty rocking and some very mellow. Near the end of the song Alex plays a lengthy and very good guitar solo and after a couple more seconds of singing the song ends. This song is very good, one of the most memorable moments of the album.Next is \"Witch Hunt\", a song about judging people. The song starts out with a soft and pretty creepy sounding intro, but after a while it turns into a rocking song, still in a creepy mood though. The song goes on in the same way till the end, actually the song knows only little diversity, which makes it one of my least favorite of the album.\"Vital Signs\" is the last song on the album, and probably the least enjoyable song. The song seems to be pretty reggae influenced, though still having the synths and still being a true Rush song. Apart from the chords that are played, the song has a pretty uninteresting riff. This song is really not the best ending, I can't really enjoy the song.Moving Pictures has some fantastic songs like \"YYZ\" and \"The Camera Eye\", but most songs are not fatastic, though they are good, the album even has some flaws, like \"Vital Signs\". I don't think the album is a masterpiece, just because several songs prevent it from being that, I do like the album very much though, so I give Moving Pictures a four star rating."
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Wednesday, May 27, 2009",
      "rating": 4,
      "text": "Moving picture from 1981 - the famous Rush album that made them cross from heavy prog band with long and chalenging compositions to a giant prog rock band with catchy tunes and mindbowing arrangements, and all because of this album. They already were a known band in the '70's with some classics album and very good musicianship, but with the first album of entering in the '80 Permanent waves something was happening in their career. With Moving pictures is same story somthing tells them that they gonna be giants and nobody stands in their way with this album. To tell you the truth I'm a moderate Rush fan, I like almost all the albums they release over the years, some of them appeal more than others, in this case Moving pictures is one of the album that I'de like to be classified as excellent progressive rock work but not a masterpiece. And another thing I will mention, no matter how great the '70's Rush albums are I can't see any masterpice there, really, the '80's Rush is much better and more intristing, with all that albums like Hemispheres or 2112 are classic Rush albums. Now, this album is a good example of an overrated album in my opinion, the music is great, the musicianship is great, but overall I can't see why people treat this album as one of the best ever done by a prog rock band. Some pieces are real killer like Tom Sawyer, red Barchetta or Yzz, but the rest is just ok, even Witch hunt (Part III of Fear) is totaly unintristing to my ears. An excellent addition to any prog rock music collection is for sure, but a masterpiece not, and is not my fav Rush album. 4 stars for this overrated and in same time great album by this famous band."
    },
    {
      "reviewer": "The Quiet One",
      "date": "Posted Sunday, June 21, 2009",
      "rating": 2,
      "text": "Moving Towards a Softer Band?Sorry if this review will provoke some shock for fellow Prog fans, but I still don't get how this is Rush's most acclaimed effort on the Prog realms. A Farewell to Kings was for me Rush's peak on the creative side of music as well as instrumentally, showing very well-constructed compositions and a fantastic bunch of musicians playing Heavy Prog in the truest sense, while Moving Pictures just seems Rush moving towards a softer sound, somewhat AOR-ish, and by no means progressive.Don't get me wrong, Moving Pictures is by no means a bad album, it's production is top-notch and the songs, while not Prog, are clever and addictive semi-hard rock tunes with some synths here and there adding that 80's vibe we all know about, on the contrary of how they have been doing some records before, which they used the synths for a proggier sound. There is one notable exception, this is the well-known instrumental YYZ, with Alex's now well-defined guitar tone shining everywhere in a quite complex composition I must admit, also having Neil and Geddy doing a tremendous job. Definitely an instrumental that inspired future Prog Metal classics. But really that's the only tune I can found that Rush is still on it's peak like they were in A Farewell to Kings. OK, The Camera Eye does go through ''Prog borders'' but the verses are un-deniably cheesy and AOR-like, that you, well at least I, can't possibly consider it a Prog song, neither really a good rock song even if it does feature good musicianship.On the other hand Tom Sawyer, Red Barchetta, Witch Hunt and Limelight are also pretty well-known tunes from Rush, these are very simple on composition and in musicianship, but simple is not really bad, but I do find bad when they mix hard rock with soft and cheesy 80's stuff. This is definitely not the case of Tom Sawyer nor Witch Hunt, these two are definitely great rockers with an effective use of synths, something Moving Pictures lacks overall. But the other two, even if being heavy every now and then just like The Camera Eye, they delve through bland and soft 80's stuff which is unbearable for me.As a conclusion, not truly a hard rock album neither a prog one, yet it's catchy melodies and grandiose production can make it a pretty fine 80's rock album, but I'm not that fond of 80's rock, so for me it's pretty much the same with the already stated exceptions of Tom Sawyer and YYZ. I really prefer the more raw and rockin' Rush of the mid-70's up to A Farewell to Kings with Geddy's voice being by far more powerful, Neil's drumming more dynamic and Alex's guitar definitely rockin' harder.Really can't say anything else, 2 stars, if you are looking where to start with this highly acclaimed rock band go for 2112, that'll blow up your ears unlike this one."
    },
    {
      "reviewer": "friso",
      "date": "Posted Friday, July 31, 2009",
      "rating": 2,
      "text": "I have owned this lp since I started looking for progressive rock. At first I didn't like at and now, four years later, I still don't. The sound of the guitars is great, the drums are nice and the additional senthizisers seem to survived the test of time, but... The vocals are still totally disgusting, as if it is powermetal. The composition skill are quite low here. While Tom Sawyer has it's moment (though I greatly dislike the vocals on the 'what you say... ' part) other songs don't seem to have any progressive elements, exept for the progressive sound of the recording. Red Barchetta is one of these horrible metalisized popsongs I mention here.Now I do understand that a lot of people are going to be insulted if I give this just two stars, but they will apriciate me being honest (I surely hope so). I can't state that there is just one thing I do find interesting about this record. Maybe the riff of Limelight could be called nice.Two stars."
    },
    {
      "reviewer": "The Crow",
      "date": "Posted Sunday, August 30, 2009",
      "rating": 4,
      "text": "I allways have the same problem every time I listen this album... The first five tracks are just awesome, undoubtly among the best Rush's compositions... But the last two are obviously under the quality of the other songs!Following the more commercial and radio-friendly direction of \"Permanent Waves\", Rush made their most widely known album, and one of their most appreciated ones. They achieved a great balance between progressive and commercial sounds, improving the yet excellent results of their previous album, and forgetting a little the more intrincated ways of albums like \"Hemispheres\", and the long suites of \"2112\" and \"Caress of Steel\".So \"Moving Pictures\" is a funny, catchy, interesting and wonderful trip...Till we get into Witch Hunt. It's not a bad song, and its creepy mood gives even more variety to a yet variated album (I think that every song is one of the pictures of the title...), but It's not so good like the incredible Red Barchetta and the epic The Camera Eye. It's not a real problem... But then, Vital Sings comes.It's a song that I've heard many many times, and every time I'm more convinced that it was a mistake. This reggea oriented flick really don't adds any interest to the album. It could have been a cool B-Side song, or something like that... But after the outstanding quality of the other tracks, adding this mediocre tune at the end is something like a joke. Maybe it's just my personal taste, but I think that Vital Signs one of the little problems that \"Moving Pictures\" has.Best songs: the five first tracks are all awesome... Rush's classics!Conclusion: although Witch Hunt, and specially the average Vital Signs, they leave a bitter taste at the end, \"Moving Pictures\" is a wonderful album... It's one of the peaks of the Rush's long career, and it shows the band polishing the \"Permanent Waves\" formula to build a really catchy and friendly album, althouhg it's still very progressive, and instrumentally incredible. So if you don't want to miss one of the 80's progressive peaks, give \"Moving Pictures\" a listening... And if you are new to this band, this album is maybe the best point of entry!My rating: ****1/2"
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Friday, December 4, 2009",
      "rating": 5,
      "text": "Moving Picturesis a fan favourite and at the same time Rush's most critically acclaimed album. I have a personal preference for the following albumSignalsbut I can't disagree thatMoving Picturesis the best possible entry point into the wonderful world of Rush.Since the precedingPermanent WavesRush had gone through numerous changes. First of all Geddy Lee had adopted a more melodic way of singing which would increase Rush's potential to reach wider audiences. Secondly Geddy must have realized that, even though he was already simultaneously singing and banging away on his bass during concerts, he hadn't been using the full potential of his feet yet! So in came more synths and multiple synth pedals that gradually led to a more prominent presence of keyboards in Rush's sound.By consequence Alex Lifeson's role got less important, or should we say less eye-catching? His guitar playing became less flashy and the sound dryer, almost pushed to the background, and his attention shifted from riffs to more textured guitar work. This versatile nature of his playing, together with his openness to adapt new styles, and his willingness to take up a more modest role as a group member are the main reasons why he is my favourite musician. Next to his amazing solos of course.Neill Peart's drumming is better then it ever was and his lyrics changed from science fiction to more contemporary, personal and psychological matters.Most of the songs, especially the first four, are widely known. I can only stress that the other three are even better in my ears.The Camera Eyeis the last epic track Rush would commit to tape and I think it is only surpassed byXanaduin Rush's catalogue.Actually, the two last songs is where magic really happens for me, and both list among my Rush favourites.Which Huntgets to me for its dark atmosphere and emotionality. Its finale is one of the best moments of the album next toYYZ.Vital Signsannounces the next album, even in its title. This song is the high point of Rush's flirt with new wave and reggae that had started onPermanent Waves. With this track they take a huge leap into the next stage of their career.The album offers a huge variety of music, showcasing every reason why Rush is so outstanding: great song writing, excellent musicianship, originality, and most of all, their unstoppable urge to evolve and grow. Yes, while most fans hoped Rush would continue churning out carbon copies of this album, they choose not to look back but forward and went on doing things in the 80's that would alienate many fans. But not this one!"
    },
    {
      "reviewer": "jampa17",
      "date": "Posted Saturday, January 30, 2010",
      "rating": 5,
      "text": "The perfect album to a non prog fan... just ideal!One of the most beloved progressive albums of all time. To help new fans to start discovering what prog is all about, this the perfect album I can suggest. Moving Pictures is a cohesive group of songs in which these talented musicians brings out all their technical skills, interesting melodies, long arrangements, appealing rhythms and creative songwriting. Everything is well balanced to be complex and simple at the same time. Everyone can \"get it\" right from the start.It's the only album I have hear entirely from Rush so I can't compare to other albums but this is one of the best balanced albums I have heard in all my time as a prog fan. The 80's vibe is there, the 70's moody parts are there, the instrumental twist and turns are all there, the complex arrangement and the groove are all together and the appealing taste to some kind of mainstream access is there as well.Tom Swayer is a great tune to start, entertaining and short. YYZ is a instrumental track very dynamic an accessible as well, with great arrangements, not acrobatic but a composition with a lot of taste. Great. Limelight has a strange vibe in the overall and sounds a little 80's to me, moody and the melody is quite beautiful. I think the sound of the keyboards is what makes a plus, bringing the song to something a lot more fresh. The same to The Camera Eye, in which the keyboards set the mood to the becoming track that maintains an interesting work through it's 11 minutes of great vibe.There are not highlights in the album, because it's quite complete. Every song seems to be in the right position and all the musicians works are for the songs, you know, like every instrument develops just the right things without been self indulgent or trying overshadow the rest of the band. Maybe the only thing that is not brilliant is the singers voice, he is great, but sometimes when he gets too high I don't enjoy it that much, but that's a personal claiming and it's not a fault for the album? is just that I could preferred a different voice but it doesn't hurt the songs in anyway. The album is short, really, but remember it was the time of the Vynil and maybe after hearing this album you will wish more of this band. I know I am and I'm still searching for more music from them.Heavy prog it is and is the best you can get from start. Go, take a look? with 454 reviews already and you still don't give them the shot...? come on!!! 5 stars!"
    },
    {
      "reviewer": "JLocke",
      "date": "Posted Tuesday, March 2, 2010",
      "rating": 4,
      "text": "Moving Pictureswas my second Rush album. It's really tough for me to grade this one, since so many Rush releases are great, but I would say this one is certainly among the very best.''Tom Sawyer'' Is a very cool tune full of complex Lifeson guitar, the signature killer percussion from Neil Peart, and of course the keyboards, bass guitar and singing of multi-talented frontman Geddy Lee. This is not a very long track (only one song onMoving Picturesreally is), and it is one of the best songs the record has to offer.''Red Barchetta'' starts off with some great, dreamy guitar parts courtesy of Lifeson, and the song itself has an awesome rocker of a beat all the way through. A guitar solo at 3:21 starts out very reminiscent of Steve Howe, but soon leads into signature Lifeson. That section is followed by the mighty recurring main riff. As standalone song as well as a smaller piece of the big picture, ''Red Barchetta'' is amazing.''YYZ''. This is an amazing instrumental full of crazy beats and highly technical playing that was surely an influence on pioneering Prog Metal bands such as Dream Theater and Queensrych.The odd, pounding guitar riffing during the track's opening is obviously a lot of what Tech Metal band Meshuggah are all about. Martin Hagstrom has cited Alex Lifeson as an influence before, and it is at moments like these in Ruch music when I can clearly hear the connection. An all-around great track.''Limelight''. Whenever a non-prog fan talks about Rush music, this song almost always comes up first. It is certainly among the most well-known Rush tunes, and for very good reason. It's beautiful, complex, catchy and heartfelt. I can't see anybody not enjoying this song unless they simply don't have a grasp on what good music actually is. No, this isn't their most progressive or technical song, but it IS a very enjoyable listen, and one of my personal all-time favorite Lifeson solos is featured, here. This song just rocks, without being so pretentious that it alienates certain people. In short, if a person likes music at all, they will enjoy this song, prog rock fan or not.''The Camera Eye'' is the one epic track theMoving Picturesalbum features, and boy, does it deliver! Well . . . sort of. Alright, while I think for the most part, the song is great, it just doesn't feel a tight and together as the other pieces found on the album. That's just my opinion, of course, but it does keep this album from getting a full five from me. There are moments of the vocal melody that sound recycled from ''Limelight'', and the instrumentation itself repeats itself a little too frequently here and there, although Neil Peart's drumming always keeps the song fresh despite that. And there ARE moments within this track that are truly magical, but I just think they could have tightened things up a bit in places. Still a slod track, but my personal least favorite.''Witch Hunt'' may divide some listeners' opinions, as well. Mainly because a lot more purely electronic effects are used for a good portion of this song's opening, which causes it to take a little longer to really kick in. And even when the song proper DOES get going, it's a much chuggier, slow-moving heavy rocker than the others, and possibly the most simple-sounding song. I personally like this kind of stuff, but I can see why it may seem a little too simple and/or repetitive for some. Luckily it isn't all that long (like all the tracks except for the last one reviewed), so you won't be missing much music if you decide to skip over it.''Vital Signs''. I love the opening. More electronic stuff, but the instruments and vocals come in very quickly (about thirty seconds in, actually), and the main chorus is very accessible. It's about the same caliber as the last one, in my view. Not the best on the album, but still better than ''The Camera Eye''. A nice gradual fadeout brings this song (and record) to its end. It serves as a good album closer, anyway, but I wholeheartedly feel like the last exceptional track onMoving Picturesis ''Limelight'', and the final three tracks fall a bit short after that.However, as a complete album, this absolutely cannot be bypassed. I would say this is one of the top Rush records that shouldn't be missing from your collection. Really good. Also, many people do seem to consider this one as the band's pinnacle, so you may just find that you disagree with me on the few criticisms I do have, and unconditionally love the whole thing. But one thing is for certain: it's an album worth owning.Very happy listening."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Thursday, April 29, 2010",
      "rating": 3,
      "text": "Moving Picturesis generally considered the pinnacle of this band's career, but is it really everything that the general public make it out to be? I certainly happen to disagree with that opinion since this is a transitional album which we all know aren't usually all that consistent.It seems that most people consider hits likeTom SawyerandLimelightenough to be mesmerized by an album that is actually filled with very few ups and a lot of downs. From an technical instrumental point of view we do indeed get a few minutes of bliss withYYZbut that's basically all the excellent material featured here, which is just not enough to make me believe in the reputation that this album has maintained for over 30 years!It's true that every time Rush is mentioned in the mainstream media the only material that we get to hear are the tracksTom SawyerandLimelight. The most prominent example of this are two recent Hollywood comedies calledFanboys(2008) andI Love You, Man(2009) that both feature leading characters that are huge fans of Rush, still we only get to hear these songs as the only example for their love for the band. I would think that there isn't really a single Rush fan thatonlylistens toMoving Picturesand the reason for this inconsistency has more to do with the expensive music rights that film studios have to pay in order to feature any more of this band's repertoire in their movies.The lesser material for me begins with the first sounds ofRed Barchettawhich might not be terrible but instead becomes quite boring after the 3-minute mark. The 11 minute longThe Camera Eyemight give the impression of another progressive rock compositions but that's really not the case with this track. Instead it can be described as a prolonged rocker without any noteworthy moments from a technical point of reference. FinallyVital Signsfeatures an almost reggae-like sounding chorus which I can't help but cringe at whenever it comes around.Rush had a good 5-year run of progressive rock releases throughout the second part of the '70s and, wisely enough, decided to progress with their transition into the new decade. Unfortunately this transition also meant that quite a few fans would be left behind wishing for the old Rush to come back and eventually giving up on the band all together. Luckily I discovered the band long after their prime years had passed them giving me the opportunity to be a lot more critical in my discovery of their work.Moving Picturesjust wasn't the album I was hoping for and so my rating is good, but non-essential.***** star songs: YYZ (4:26)**** star songs: Tom Sawyer (4:34) Limelight (4:20) The Camera Eye (11:01) Witch Hunt (4:46)*** star songs: Red Barchetta (6:10) Vital Signs (4:46)"
    },
    {
      "reviewer": "progpositivity",
      "date": "Posted Thursday, May 6, 2010",
      "rating": 4,
      "text": "The format is streamlined yet again as the band skyrockets up the rock charts with \"Moving Pictures\". Even so, no amount of catchiness and popularity from tracks like Tom Sawyer and Limelight can detract from the fact that 7/8 time signatures simply can't be viewed as anything less than progressive in the rock context. We are prog-nuts, so we sometimes forget how radically different these drum fills and odd beats are in mainstream popular rock music. The fact that Rush could make this challenging music so popular attests to their ever-increasing ability to make the progrock form potent, urgent and short (as well as imaginative and virtuosic). Peart's pithy lyrics also deserve credit for providing perfect touches of vicarious thrill in Limelight and exultant tone in Tom Sawyer.Witch Hunt is Peart's first excursion into using the studio as an instrument. This is the first song in which he plays percussion parts that would be impossible for him to recreate by himself in concert.More thrills are to be had as the band takes us on an illegal car ride (Red Barchetta), and an exciting instrumental fly-by (YYZ), \"YYZ\" enjoys rock radio airplay even to this day. Surely Rush could \"do no wrong\" at this moment in time!The seeds of Lifeson's shift in approach to the guitar can be heard on the album's closing track \"Vital Signs\". The emphasis is on rhythms and textures, timbres and tone. Overall, the song points toward a rock-reggae dimension not entirely unlike The Police's \"Ghost in the Machine\", one which the band would explore much further on their next studio album."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Saturday, May 29, 2010",
      "rating": 5,
      "text": "Rush has created some of the best classics of heavy prog; here is a prime example\"Moving Pictures\" album by Canada's darlings, the power trio Rush, finds itself on number 15 in the top 100 albums on the progarchives, and for good reason. Every track, every instrumental, every vocal is pure Rush; making this a definitive masterpiece in the treasury of prog classics. The album was released at the beginning of the 80s where prog was on the decline after a glorious decade had culminated in the best prog albums such as Pink Floyd's \"Dark Side of the Moon\", Genesis' \"Selling England by the Pound\" and Yes' \"Relayer\". Rush created a triumphant progressive master work with some of their most popular songs; all killer and no filler. It receives quadruple-platinum status and, along with \"2112\" ended up in the bizarre collection of \"1001 Albums You Must Hear Before You Die\".It begins with an incredible opening track, the number 1 US chartbuster'Tom Sawyer'that all Rush fans adore, and it is great when Rush open their concerts with this and the crowd are able to sing along;\"A modern day warrior, Mean, mean stride, Today's Tom Sawyer, Mean, mean pride.\"The guitars crank out a mean, mean riff after this and there is a persistent synth drone that works well in the musical framework. The heavy dissonance or discord of time sigs and vocals is impressive, played in 7/8 for the most part. The chorus is one of the best especially lyrically, it is perhaps one of the more memorable Rush moments;\"What you say about his company, Is what you say about society, Catch the mist, catch the myth, Catch the mystery, catch the drift, The world is, the world is, Love and life are deep, Maybe as his skies are wide.\"The ensuing lead break is incredible full of fret melting shredding, huge drum fills and power synth motifs. The Rickenbacker bass guitar is also wondrous that compliments the bright crisp guitar splashes. When the band were at their best they were totally irresistible.'Red Barchetta'is longer at 6 minutes, and is another solid track. A mid tempo that is captivating locks in and quieter verses are sung until the chorus with new time sig locks in with captivating lyrics;\"Jump to the ground, As the Turbo slows to cross the borderline, Run like the wind As excitement shivers up and down my spine, Down in his barn, My uncle preserved for me an old machine, For fifty odd years To keep it as new has been his dearest dream...\"The instrumental break features echo on guitar chord crashes. The lead solo is subdued but effective.Rush have some amazing instrumentals and one of them is'YYZ', which gives each member a chance to really shine. The title is taken from the morse code used at Toronto Pearson International Airport. The main riff is memorable and heard in many concert performances. It has a progressive feel with unusual time sig and layered instrumentation. The riff is killer and well known in prog circles. On the \"Live in Rio\" DVD the audience know it so well they actually sing notes along to it. Lifeson is great on this as is Peart with his drumming metrical patterns that keep a consistent rhythm. Lee's bass is wonderful also playing fractured mini bass solos. The band really take off on this complete with glass shattering effects and all manner of solos form each member. It settles at 3 minutes in with a half time feel and an ambience is created before the main riff returns again. There is fire and ice; the explosive fire of Peart's flaming drums , the chilling ice of Lifeson's pickaxe, making this a bonafide classic on this album.'Limelight'hit number 4 on the US mainstream charts. It has a prog time sig that is unusual and captivating. The structure of the track is spellbinding with beautiful verse sections, tension and release, shades of light and dark textures and one of the most spine chilling melodies that hooks into your system. I have never forgotten this and often the melody comes back to me without even wanting it to. The lyrics are dynamic and unforgettable once it grips your conscious;\"Living in the limelight, The universal dream, For those who wish to seem, Those who wish to be, Must put aside the alienation, Get on with the fascination, The real relation, The underlying theme ...\"The theme is simple, fame and fortune is not all it is cracked up to be and there is a need to keep a wall between the performer and the audience and this comes across beautifully with sparkling vocals and emotional riffing elegance. It is based on the real life dissatisfaction Peart felt about the intrusion into his private life. The lead solo is sensational with huge upsweeping picking and glorious string bends. This is my all time favourite Rush track and it sends chills through me every time; I don't know exactly why but there is a powerful element that refuses to let go when I hear it. I love the verse;\"All the world's indeed a stage, And we are merely players, Performers and portrayers, Each another's audience, Outside the gilded cage.\"It seems to reference the live 1976 album \"All The World's A Stage\", and prophecy the release of their next album, that year \"Exit Stage Left\" which features 4 tracks from this album. The melodies are so full of life and vibrant energy, it truly uplifts my spirit every time. So ends side 1 of the vinyl, surely one of the greatest side 1's in rock history.Side 1 begins with'The camera eye'an 11 minute mini epic, the last for Rush, with a ton of synth at the opening section. There is a lengthy instrumental section and then at 3:40 Lee's high falsetto vocals chime in;\"Grim faced and forbidding, Their faces closed tight, An angular mass of New Yorkers, Pacing in rhythm, Race the oncoming night, They chase through the streets of Manhattan, Head first humanity, Pause at a light, Then flow through the streets of the city....\"The riffs on this are killer and at 6:06 the time sig slows and the track changes into some very proggy passages of music. The time sig is very intricate in the section at 7:50. The main motif returns after this showcasing Lifeson's inimitable style. The track is unusual on the album for its length and plethora of time changes, but this is what makes it such an endearing addition.'Witch hunt (Part III of Fear)'follows; another section of the 'Fear' tracks and a great addition at that. It begins with an off kilter ethereal sound made with synthesizers and bells. This builds slowly to pitch, and sounds rather creepy in a sense, but the melody drowns out the Gothic gloom. The guitar crunches in and Lee tells the story of the hunt;\"The night is black, Without a moon, The air is thick and still, The vigilantes gather on, The lonely torch lit hill...\"the dark lyrics are accompanied by a dark riff and very strong synthesizers, effective and enchanting. This track is highly unusual as the whole atmosphere is intensely grim and has startling dark textures. Also Hugh Syme features on keyboards, the artist responsible for a plethora of Rush album covers. The theme reflects the Salem hunts where paranoia set in about a nonexistent threat, the uprising of so called witches, the Spectral evidence that was manufactured to accuse those who were different than others; a theme that has still an impact for modern society.'Vital signs'is the closing track with a riff created by a sequencer made by Lee's OB-X synthesizer and well executed guitar flourishes. This is a slow paced track with a mediocre instrumental break but the vocal performance really drives this along with such enigmatic lyrics as;\"A tired mind become a shape-shifter, Everybody need a soft filter, Everybody need reverse polarity, Everybody got mixed feelings, About the function and the form, Everybody got to elevate from the norm...\"This is the weaker track on the album but still not a bad track after a few listens. The sequencer adds a nuance of 80s techno pop but there is still a proggy feel to this, especially the stylish bassline.So overall this album is a dynamic flawed masterpiece. Side 2 does not measure up to the first side there is no doubt, but the mini epic more than makes up for this. Three tracks on this have become unsurpassed Rush classics,'Tom Sawyer', 'YYZ' and 'Limelight'. The other tracks are still great but this album as a whole is a very pleasant listening experience. I have no hesitation but to count this as yet another masterpiece for my favourite heavy prog band. Rush never returned to masterpiece status after this. \"Moving Pictures\" was the last time the magic was captured and it ushered in a new approach in progressive rock music that works on every level. The album is the biggest seller for Rush and hit number 3 on US mainstream charts at the time of release, and it still makes an impact as one of the most influential, innovative albums of prog rock history."
    },
    {
      "reviewer": "memowakeman",
      "date": "Posted Sunday, May 30, 2010",
      "rating": 3,
      "text": "One of the greatest albums, but not one of MY greatest at all!There are albums that no one can deny are some of the most successful or representative in history of progressive rock, that you can't deny are good albums with great music on it, wonderful compositions and excellent musicians, but sometimes for one as listener that is not enough, because those albums or bands are not really the ones that excite you, so in the end the album for you is not that successful.This has happened to me with \"Moving Pictures\", an extraordinary album from this Canadian monster band called Rush. Before writing this review, I read at least 10 reviews that some of our excellent members have written, it is not that often when one can see such an impressive amount of five-star reviews dedicated to one album; I loved the way some of those members described their feelings towards the album or how they show their excitement with the music composed here. However, I also read a couple of three and two-star reviews that contrast with the previous ones, sharing a different point of view, but a point of view in which I feel identified.Despite I've listened to Moving Pictures (and enjoyed at times) hundreds of times, I, firstly can say that this is not my favorite Rush album at all (that would be Hemispheres), and secondly I can say that it is not what I would really consider as a reference or highlight in prog, because I find a couple of tracks pretty boring and lacking of soul. Again, I cannot deny that the compositions here are great, this power trio have always managed to create memorable tunes such as \"YYZ\" or \"Tom Saywer\" which can be listened on this album, but there are moments where I simply want to skip because it does not do anything to me, this happens with songs like \"Limelight\" or \"Witch Hunt\". I must say that \"The Camera Eye\" is an extraordinary track but in the end I would say I enjoy half of this record, while the other half is actually forgettable.For that, my final grade will be 3 stars, yeah this could be a masterpiece of progressive rock, but not for me.Enjoy it!"
    },
    {
      "reviewer": "tarkus1980",
      "date": "Posted Tuesday, November 2, 2010",
      "rating": 4,
      "text": "My original impression of this album was that this was the inferior younger brother ofPermanent Waves, with fewer interesting songs and a more synth-based, less interesting sound. I'd have given it the same low **** I gavePeW, but would have done so grudgingly, and a high *** would have been more in line with my true feelings. Now, though, I'd give it a solid ****, and this grade is one I actually believe in for the album. Furthermore, I now better understand the album's place in Rush's evolution; where I had once considered it a step back in quality (done in the name of sounding \"modern\"), I consider this another strong step forward for the band, and the best album the band had done yet. I'm not overwhelmed by most of the songs, but now I can understand how somebodycouldbe overwhelmed with them, and that makes a big difference.The giants of the album are \"Tom Sawyer\" and \"Limelight,\" two tracks that I've always loved and are certainly among the band's best work. I once used to consider the synths in \"Tom Sawyer\" to be a little overdone, but I wouldn't dream of that now; this is one of the most effective examples of \"power synths\" I can think of from any band, and it blends in well with the strong work from the other three (I'm really fond of Lifeson's mid-song screwy guitar solo, which kinda reminds me of the atonality from his solo in \"A Farewell to Kings,\" only done a million times better). Plus, I like the vocal melodies a lot, too. As for \"Limelight,\" my enjoyment of the track has just grown and grown over the years, until it's easily become my favorite second Rush song. Lyrically, it's a treatise on alienation from others as one's stardom grows, but while some of the lyrics are quite nice (albeit stiff and pedantic in the standard Peart way), the lyrics aren't the main draw for me. This is just a fantastic rock song, with an amazing bass line, phenomenally tight playing, a great guitar sound, and a terrific vocal melody that does a perfect job of working in and around the instrumental parts. If there's a reason to considerMPan all-time classic, \"Limelight\"'s gotta be that reason.So those are the tracks I've always loved, but what about the rest? Well, truth be told, I still don't love any of the other five tracks, but I do at least like most of them without hesitation, and that's an improvement. The tracks bookended by \"Tom Sawyer\" and \"Limelight\" on the first side, \"Red Barchetta\" and \"YYZ,\" are better than I used to think. \"Red Barchetta\" is an up-tempo rock song about a guy having to play \"chicken\" in his automobile with a couple of futuristic \"air cars,\" and while it's kinda silly lyrically, it has some nice riffs and a good vocal melody. My problem with this version is that I don't feel the sense of excitement and energy that I think Rush meant to convey (and that I'm sure many fans feel when listening to the song); I can't really shake the feeling that it's a songaboutexcitement more than it's onewithexcitement. It's still nice, though. \"YYZ,\" then, is a much beloved instrumental, and on paper it should be the greatest instrumental Rush ever did and one of their best tracks. I mean, it has quite a few different riffs, it incorporates a number of styles, it has a ton of power (the ensemble playing is insanely tight), and it has no Peart lyrics! So, um ... why is my ending reaction to the song always along the lines of a mild \"Hey, that's kinda neat\" and a shoulder shrug? I really don't know; it's not lack of memorability (like I once thought), so I'm gonna have to say it's more that the piece doesn't once evoke a noticable physical or emotional response in me. Still, despite that flaw, there's something to be said for a piece that I think is this neat.Starting up the second half is an 11-minute epic in \"The Camera Eye,\" which marks the last time Rush would do a piece of this length. I do think it's a pretty good extended number, but, well, pretty good extended numbers aren'tthathard to find in the world. It's mildly impressive when it's on, and Lifeson has some cool echo effects in his guitar, but 11 minutes is a bit much for a piece that's basically built around two decent musical themes. I get the feeling the band put a lot of effort into the small details of the song, and it does have a decent build as the piece goes on, but again; how many times can I use the word \"decent\" to describe this song before I just have to accept that it's not much more than that?Up next is \"Witch Hunt,\" which is probably my third favorite of the album, behind the two giants. It's rather silly lyrically, but it has a convincing dark atmosphere, and the combination of the grumbling metallic riffage and the slow synthesizer chord sequences makes it totally worthwhile musically. And finally, \"Vital Signs\" is a mildly disappointing closer, with a decent vocal hook in parts of the chorus, and an amusing tinge of reggae in the verses, but not much in the way of a memorable vocal melody in the verses.As usually happens with Rush albums, I find this one very inconsistent, but at least it's inconsistent at a higher level than what had come before. I will never find this even close to an all-time classic, but I do think it belongs in any decent rock collection, and that means something."
    },
    {
      "reviewer": "lazland",
      "date": "Posted Tuesday, December 21, 2010",
      "rating": 5,
      "text": "Some bands are both lucky and talented enough to release a signature album, a piece of work that not only accords them maestro status, but also sets the benchmark in their field.I am sure many people on the site would accord 2112, A Farewell To Kings, or Hemispheres with that description, but not to these ears. To me, Moving Pictures is the archetypal Rush album, the body of work which stands apart from all else, and also set the benchmark for what we now call Heavy Prog.There is not one weak moment on this. Tom Sawyer was a great opening track, successful single (a form of art they were becoming very accomplished at writing and performing), and set the scene for all that followed. All tracks, barring The Camera Eye, are of a similar length, but what a great deal they pack into those tracks.Red Barchetta tells a moving story about an old uncle's Capri, and this is where I think Peart had, by now, moved on leaps and bounds as a lyricist. He was capable of telling exceptional and moving stories that were rooted in real life, rather than the fantasy world.And it rocks, by which I mean really rocks. YYZ could possibly be the finest instrumental rock track of all time. The riffs, drum work, lead are all phenomenal, and the moment when it all leads up to THAT synth break is one of those hair standing up at the back of the neck moments.The album contains also the most astute observation of being a rock or other celebrity superstar ever committed to record in Limelight. It also helps that it is a fine piece of commercial heavy rock, still played endlessly, deservedly, by radio stations the world over. I doubt that Geddy Lee ever sounded so good or committed, and the band as a whole simply synch together in such a way that you really did wonder at the time whether it could ever get any better than this. Four and a half minutes of pure commercial heavy prog delight.Camera Eye is about the only nod to the epic past, certainly in terms of length, that the band both indulged themselves and us as fans in. They would never issue a track this length again in the studio. It does, however, provide a very strong hint as to the immediate direction the band would take with the heavy emphasis on synths in the opening, delicate, and patient passage. As the track develops, it really is classic Rush in the method of fine, heavy riffs, but also sounding a hell of a lot tighter than they ever did before. It is a very dark track, both lyrically and in the feel of the music itself, with its commentary on societal inequalities. If anything, however, Geddy's vocal performance is even more stunning than on Limelight. It's really a pity that eleven minute singles weren't allowed, because this track really cries out to be heard by a wider audience than traditional Rush fans.Darker still, however, is Witch Hunt, part three of the Fear sequence, and is just short of five minutes worth of very clever observations about our dark and fearful religious past, full of lilting synths and an incredible drumming performance by Peart.The album closes with Vital Signs, another synth and simple riff heavy track. It is probably the closest this fine album comes to filler, but great filler it is.The closest analogy I can give for this album is AC/DC's Back In Black. When they release a new album, hordes of magazine reviewers give praise and inform the waiting public that this is \"the best they have done since....\" Well, Moving Pictures is this band's Back In Black, and, to be honest, such comparisons are unfair and unhelpful. This is an album which towers above many other works, including by this great band, and whilst they would go on to release some further magnificent music, this is the album which truly defines both them and the music they produce.Five stars without hesitation. A true masterpiece."
    },
    {
      "reviewer": "Andy Webb",
      "date": "Posted Sunday, January 16, 2011",
      "rating": 5,
      "text": "Hit after hit after hit after hit...Here we have Rush at their absolute best. With this, they achieved an even higher critical acclaim and popularity than they had with 2112. The album contains 7 smashing songs full of life and vigor that really set the standard for progressive rock and proto-metal of that era. With the classic Tom Sawyer opening for the album, you can see how much of a classic the album really is. The album truly is a pure masterpiece.Tom Sawyer is the opening for this album, and it's one heck of an opener indeed! Coming forth with the classic synth-drum duo, and those typical Geddy Lee-style vocals, the song is an instant hit. The whole length of the track is pure amazingness. The song has intense instrumental talent, great melodic value, superior rhythmic support, and just about everything else you could possibly want in a song.Red Barchetta is the kin of song that needs to mature, for me. The first time I heard I thought it was alright, but nothing special. As I continued to play the album, I began to realize what a spectacular song it truly is. The song has some of the best melodies of the album, and a really great rockability going about it.YYZ is the essential Rush instrumental. I can talk for days about the technical ability all these guys have, but this one song about sums it all up in 4 minutes. Every savory second is full of great 5/4 fun, with that great triangle-intro to the on-off feel of the guitars and drums, and those solos! Everyone gets a solo, with Lifeson ripping on his guitar, and Lee wacking on his bass, and of course Peart smashing away at the skins.Limelight is yet another timeless classic, and was actually one of my first exposes into the sound of Rush. That classic verse and chorus makes this song an absolute timeless classic, all about Rush in the Limelight-- or not.The Camera Eye is the epic of the album, clocking in at around 11 minutes, depending on your version. The song takes a little while to really get started, but you can be tamed by the psychedelic and ambient intro the band threw in, before the song really kicks into action. The song contains some of my absolute favorite Rush moments, with that great guitar melody and the great vocal and drum tracks that back it. The whole song is just an absolute blast to listen to.Which Hunt is the only real \"weak\" track on the album, but that's only because it is on the tail end of 5 amazingly spectacular tracks. The song has a much slower and \"creepy\" feel to it, with some real \"supernatural\" feeling ambiance about it. The track is good, but nowhere near as good as Tom Sawyer or Camera Eye.Vital Signs is a great ending to an absolutely fantastic album. The song is a little weak compared to the smashing successes of Tom Sawyer and The Camera Eye, but the great funky dynamics of the song give Rush's music a whole new dimension. The great funky chorus and verses really accent the album with some really cool effects. Geddy shows off his funky bass ability and Lifeson shows off his great jazz chord ability as the whole band meshes into one cohesive and impressive body.ALBUM OVERALL: This album is the quintessential Rush album. Every single song, from Tom Sawyer to Vital Sings, is a smash hit, a classic, and a model for every band who ever liked Rush (which is most of them). Every single second of the 40 minute long album is intensely enjoyable and never do you wonder \"why did they put this on the album?\" Overall, the album is just a pure classic and a masterpiece of progressive and proto-metal music! 5 stars."
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Monday, January 31, 2011",
      "rating": 4,
      "text": "There was a law passed in Canada that required every household to have a copy of this album. If anyone tried to destroy or get rid of their copy, the punishment would be death by firing squad. Years ago \"YYZ\" replaced \"O Canada\" as the national anthem. School kids have to stand up and air bass to the song. What happens when a kid refuses to air bass? You guessed it...firing squad. \"Tom Sawyer\", \"Limelight\" and \"Red Barchetta\" are played to death on Canadian radio. I think even the country stations are required to play these three songs. The only two songs that get played more are \"Spirit Of Radio\" and \"Closer To The Heart\".Even \"YYZ\" is now a famous song thanks to that video game. What was it...Guitar Hero? Rock Band? Both? The other three songs on what was Side Two hold up a lot better due to not being overplayed. I think the title 'moving pictures' was what people used to call films or television in their earliest days. But here of course the band uses the term literally. I'm not exactly sure, but I think each painting on the cover corresponds to a song on the album. Maybe not. They continue the process started on the last album of writing shorter, catchier songs and incorporating New Wave and reggae influences.Lifeson's guitar tone and playing on this album is some of his best work. Geddy's vocals are starting to get less annoying than before. His bass and synth work is still top notch. Peart drums great as always and his lyrics are improving, IMO. \"Vital Signs\" is probably the weakest song here but it's still good. Inspired by The Police, it has a good chorus. This is probably Rush's most consistent album with no really weak moments that stand out. \"Camera Eye\" and \"Witch Hunt\" stand up very well, but \"Camera\" can be a bit repetative, even if it is one of the better and proggier tracks on the album.A now classic album. After this the band would write even more concise, catchier songs. The synths start becoming more important and overall their music becomes less interesting. They never made an album better than this, although the previous three come close. 4 stars."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Monday, February 28, 2011",
      "rating": 4,
      "text": "Rush closed out their most progressive (and to me, their best) period with this, their most consistent album. It's not surprising that most of the songs on \"Moving Pictures\" have become concert standards for the group.While most of the tracks have enough of a mainstream feel in them to get radio airplay, there is enough complex interplay between the instruments to please a prog fan as well.Tom Sawyer,Red Barchetta,LimelightandVital Signsall still in frequent rotation on the local classic rock station in Boston. And all are great songs.Witch Hunt, with it's dark theme and chord structure, is a highlight at concerts (I'd have to say the live versions are way cooler than the original, which is still a good song).The Camera Eye, the longest song on the album, may be the weakest. Although it does have a prog structure, there tends to be a bit too much repetition in it.YYZis the masterpiece in the album. One of Rush's two great instrumentals (along withLa Villa Strangiato), this song blend complexity and musical virtuosity to perfection.As an album, this one easily rates four stars."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Thursday, March 10, 2011",
      "rating": 4,
      "text": "I've resisted listening to this album in one sitting. Ever. Remember, I owned their first albums (through the first live album) and, by the time they hit their \"prog era\" I had moved into serious prog, away from power cords. But today, June 25, 2020, I'm going to give it a go. Wish me luck!I've never liked the sound engineering of this album, the instruments seem to exist each in their own universe, they aren't well blended. Plus, I have never liked that Oberheim sound. And the songs just aren't ... my cup of tea. Are these drums really that impressive?1. \"Tom Sawyer\" (4:34) never did much for me. I always find myself bothered by any lack of cohesion or flow. (8.67/10)2. \"Red Barchetta\" (6:08) starts out okay, instrumentally, (though sounding very 80s-ish) before singing and SKA and Jimmy Page guitar licks ensue. Maybe the lyrics are supposed to mean something to me. The shift in the middle shows promise but then never delivers. Interesting violin-sounding guitar solo. (8.67/10)3. \"YYZ\" (4:24) the much lauded and revered instrumental. Anticipation. Nice instrumental teamwork but, come on people, have you ever heard of Mahavishnu Orchestra? Return to Forever? (8.5/10)4. \"Limelight\" (4:21) one of the more accessible and melodic songs on the album (though sounding a LOT like \"Fly by Night\"). The drums are more enjoyable when they're singled out. (8.75/10)5. \"The Camera Eye\" (10:57) opens like a late-70s jazz-rock fusion song before beefing up and then taking a sharp left in the third minute. Silly synth noises and two-chord strings with unusual power chord progressions. I like the more laid-back vocal style here (like that used in \"Limelight\"). Nice use of space between power chords. When Geddy's voice becomes more insistent, raising an octave, it works. Then another ninety-degree turn. About half way through I can see that a rotation of themes is becoming apparent. Again, maybe these would be better if I heard the words--if I cared about the verbal message being conveyed. For me, the voice is just another instrument. Okay. I made it through that one. Interesting. But I've heard better. So many better. (17.25/20)6. \"Witch Hunt (Part III of Fear)\" (4:44) Blurry power chord progressions dominate the soundscape while Geddy sings and syncopated percussives are randomly thrown in. With fuzzy synth chords, the song congeals and tension builds. Some nice chord shifts here and there. For me, this has been the best musical journey of the album. (9/10)7. \"Vital Signs\" (4:47) more POLICE-like SKA with CARS-like synth-bass. Musically, this is a very accessible, engaging song. Depending on what Geddy's singing about, I don't know one didn't get radio play. I especially like that there is an anthemic phrase repeated over and over at the end, \"Everybody got deviate/elevate/escalate from the norm.\" My favorite song on the album. (9.33/10)Total Time: 39:55For being such a well-loved and famous album, I'm very surprised that there was so much of it that I had never heard before: pretty much all of Side Two.B/four stars; a nice contribution to Prog World."
    },
    {
      "reviewer": "baz91",
      "date": "Posted Saturday, March 19, 2011",
      "rating": 4,
      "text": "If you're new to Rush, you'd do well to buy this album first. Three reasons: 1) It contains the fantasticTom Sawyerwhich is the band's biggest hit (even if I preferThe Spirit Of Radio, their lesser pop hit). 2) It contains the fan favourite instrumentalYYZwhich I believe they play at every single concert. 3) It still manages to be really progressive, despite being released in 1981! Here's an analysis of the songs:I'm not exaggerating when I say the opening trackTom Sawyerwas once the most played track on my computer! In a time when I was wholly obsessed with Dream Theater, I borrowed the CD off my girlfriend's dad, and instantly fell in love with it. Within a few days, the plays counter quickly shot past 30, and became the most played track. This might be to do with it's relative length compared to the normal Dream Theater length of ~8-10 mins. The song is just so cool though. Whilst being a pop hit, the band are uncompromising, playing an extremely technical instrumental! The lyrics are just amazing; they don't make sense, but they are extremely cool. A brilliant opener!Red Barchettais not so good. For one thing, I don't particularly like the sound of the guitar in it, and I've never really gotten into it since I first got the album. However, it's still a bit proggy, and in fact if you listen closely, it is more of a ballad about a boy smashing his uncle's car in a getaway chase. If you like cars and you like prog, you'll like this. For me it's 2/5 though.YYZis the code for an airport in Toronto, and is also the name of this song. The letters are spelled in morse right at the beginning -.-- / -.--/ --.. This is becomes a fantastic 5/4 opening to this superb instrumental, which is one of the finest in hard rock! There is virtuoso playing going on everywhere! Lots of Alex Lifeson's extreme guitar playing, lots of Neil Peart's awesome drumming, and if you listen closely, you'll hear Geddy Lee is pushing out some awesome bass riffs as well. You'll understand why the fans love it.Limelightis yet another hit song, and is also of superb quality. I'd give it 4/5.If you weren't sure whether to buy this album on it's pop merits alone (which you really could do), the extendedThe Camera Eyeshould definitely sway you. Split into two parts - one section about New York, one about London, seperated by an ocean of instrumental goodness - this is an exceptional song! It is as good as any of their previous 10 minute hits, eg Xanadu and The Necromancer. Unfortunately, this would be Rush's swan song to extended writing, and since this eleven minute wonder, Rush have not produced any songs over seven minutes in length. The quality of this song makes me feel that it wasn't that they were getting worse at writing long songs, just they gave up interest in it. It is very sad indeed, that yet another true giant of prog was lost to the 80s pop explosion.Witch Huntis an eerie song, mainly synth driven, but still quite cool. I've never been a huge fan of it, but it's good nonetheless. To this day,Vital Signseludes me. It sounds terribly geeky to me, a bit awkward and not hard or cool at all.I'm afraid I can't give this 5 stars. I was struggling between 4 and 5, and I guess when something is a 5 star, then you will know it, so it has to go down to 4 for me. I think there is just too much filler in it for me. The tracks Tom Sawyer, YYZ, Limelight and of course The Camera Eye are very worth your money, and you might even enjoy those tracks I didn't! 9/10"
    },
    {
      "reviewer": "stefro",
      "date": "Posted Tuesday, October 25, 2011",
      "rating": 4,
      "text": "The commercial and critical apex of Rush's four-decade career, the 1980 album 'Moving Pictures' would find the Canadian outfit glazing their metallic prog bombast with a slick, pop-tinged, radio-friendly sheen. The album, which sold over three million units during it's first year of release, pulled off the very difficult trick of appealing to a younger, more- mainstream audience whilst simultaneously retaining the group's long-term fans, and in the process of doing so inadvertently became one of the last truly notable progressive rock albums from the 1970s. Essentially 'Moving Pictures' was an album cunningly split into two distinct sections. The first half features the shorter, more emotive numbers such as the popular single 'Tom Sawyer', the upbeat - and slightly jazzy - instrumental piece 'YYZ', and the fan-favourite 'Limelight', an impressive track that borders on Journey-style soft-rock. Side two on the other hand saw the trio of Geddy Lee(bass, vocals, keyboards), Alex Lifeson(guitar) and Neil Peart(drums) summoning up the spirit of their classic, fantasy-inspired, mid-seventies sound on the ten-minute mini-epic 'The Camera Eye', which saw them adding glitzy new synthesizers to the mix, before finishing off the album on a slightly maudlin tone with the ethereal closer 'Vital Signs'. Understandably then, both sides of 'Moving Pictures' prove immensely satisfying, catering as it does for both sides of the musical coin, the catchy, simplistic pop-rock ingredients inserted into the ambitious progressive frameworks with impressive skill, and the album as a whole flows effortlessly. Rush's career trajectory has been a slightly unusual one in that they started out playing fairly straight power-trio blues-rock before morphing gradually into a hard-rockin' yet highly progressive group inspired by the likes of Pink Floyd and Yes. Rather perversely, the genre of progressive rock was actually on the wane at that time yet somehow they proved immune to both punk and new wave and instead of losing focus they produced some of their best works. 'Moving Pictures' is very much Rush at their apex, yet it is also the last truly great Rush album. Follow-up releases 'Signals', 'Grace Under Pressure' and 'Power Windows' would see the increased use of synthesizers and keyboards, all the while eroding the potent hard- rock edge that gave the group their vitality. Despite still going strong as of 2011, Rush would never again reach the lofty heights of the period that began with '2112' and ended with this consumate progressive album, though they would continue to be one of the world's premier live attractions. If you haven't yet explored the Rush discography then there is probably no better place to start than 'Moving Pictures', a slick, powerful and highly-inventive slice of commercially- tinged progressive power rock. STEFAN TURNER, LONDON, 2011"
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Saturday, November 12, 2011",
      "rating": 5,
      "text": "An excellent refinement and polishing of the approach taken on Permanent Waves, Moving Pictures is a strong candidate for the best album Rush ever made. Rush had begun to incorporate an increasing amount of synthesisers into their music on the preceding album, and this tendency continues this time around. The sole extended track on the album, the ten minute The Camera Eye, makes good use of this by having Geddy Lee primarily play synthesisers for the first part of the song, which is about the ambience of New York, and then switch to bass for the second half, which concerns the ambience of London; just as the modernity of New York and the history of London are contrasted in the song, so too are the future direction of Rush and their recent musical history brilliantly contrasted in the piece.In terms of structure, the first side consists of catchy and accessible numbers which showcase the band's hard rock and metal chops whilst continuing their project of condensing progressive rock song structures into short, bite-sized chunks. This is perfectly captured on what I consider to be their best song, the haunting Red Barchetta, whose movements capture nostalgia, exhilaration, action, and escapism in an emotional trip that perfectly parallels the narrative of the song; the opening chords of the piece never fail to make hairs rise on the back of my neck. The side also includes YYZ, an instrumental in the tradition of the excellent La Villa Strangiato - the best track from Hemispheres by a long way - which again condenses the sorts of twists and turns and technical musicianship found into the earlier piece into a shorter and very accessible format.The second side of the song is devoted to more experimental and murkier material, and has taken a while to grow on me - but grow on me it has. As well as the aforementioned The Camera Eye, it includes the spooky Witch Hunt - a rare Rush excursion into horror - and Vital Signs, in which Rush's increasing New Wave influences are manifested in a very Police-like incorporation of reggae rhythms into the song (though I have to say I think Rush succeed rather better than the Police did).On the whole, this is an album where Rush hit a perfect balance between progging out and rocking out, in which experimentation and accessibility and cool synthesiser pieces and heavy guitar solos all work in perfect harmony. In other words, it attains the balance which Hemispheres spoke of but didn't actually attain itself, and in that sense it can be seen as the culmination all the work Rush had done up to that point. The band would take a radical new direction with their next album, but their early progressive metal period ended on the best possible note."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Sunday, July 8, 2012",
      "rating": 5,
      "text": "The distinguished genre of progressive rock may, with good reason, lay claim to having more pivotal, game-changing albums than any other in music. For example, Yes was a relatively small-time entity until the splendor of \"Fragile\" caused the world at large to turn and take notice of them. Jethro Tull was relegated to cult status until the arresting \"Aqualung\" made them a household name. Genesis was just an odd, eclectic art band until the grandeur of \"Selling England by the Pound\" commanded widespread attention. And Metallica was deemed nothing more than a noisy bunch of longhaired ruffians until their eponymous black LP thrust them into the cultural mainstream. I could present more evidence to bolster my theory but you get the point, I'm sure. In the case of Rush, \"Moving Pictures\" was the disc that established them once and for all as a force to be reckoned with on an international scale and, for that reason alone, it deserves to be revered and considered every bit as special as the aforementioned landmark records. I realize that there are purists who might harbor the opinion that the runaway popularity of said discs only indicates capitulation by the bands involved to the corrosive power of the almighty dollar; \"selling out\" if you will. I beg to differ. Rarely does a breakout album become a success due to the group trying to be more accessible or trendy. 9 times out of 10 it's the public who've finally caught up with the artists' uniqueness and that's certainly the case with \"Moving Pictures.\"The fact that it took eight studio albums to gain massive recognition is a testimony to this stubborn trio's determination to do it their way without kowtowing to the suits. They knew they were good, they knew they were unlike any other band and they knew that eventually their belief in each other and what they were creating collectively would pay huge dividends and this record is the culmination of that mindset. Every step they'd taken led them to this moment when all of their lucky stars and planets slipped into alignment and their destiny was not going to be denied this time. In an era when prog was on the skids and its most famous of propagators were being labeled irrelevant dinosaurs (the horrid MTV virus was striving to render them extinct), this hardy triad of Canadians flew their prog flag proudly. The opening of the inimitable \"Tom Sawyer\" cut through the chaff of tinny New Wave fare (that was saturating the FM airwaves) like a scythe and one couldn't avoid the hard-hitting song if one tried. Rarely has a solitary tune so illuminated a group that's been sneaking around in the shadows for years as this stirring number did. Every aspect of this prog standard is near perfection so I won't attempt to describe its undeniable allure. It has no faults. \"Red Barchetta\" follows and it doesn't allow the momentum to sag one iota. The song's memorable melody draws even the toughest critic in without a fight, then the band puts on full display their exemplary musicianship and keen sense of dynamics, creating a progressive rock classic. Their sometimes lean years of persistently honing their craft were now bearing sweet, irresistible fruit.Rock instrumentals were not in vogue circa 1981 but that didn't deter Rush from presenting a superb one, anyway. \"YYZ\" opens with a Yes-worthy staccato pattern, then they settle into a fortified riff which they proceed to exploit with uncanny tightness. Members Alex Lifeson, Geddy Lee and Neil Peart all get an opportunity to show off their individual prowess and the listener can't help but be duly impressed. These guys take a back seat to no one. \"Limelight\" is next, sporting another incredibly catchy melody line that further separated Rush from the herd of spandex-clad wannabes while keeping their prog integrity intact. Infectious tunes like this made folks who claimed to not like progressive rock eat their words. A mysterious intro for \"The Camera Eye\" leads to a monstrous guitar effect from Alex that drenches your senses. Soon the tempo escalates into a driving rock beat for the next movement wherein Geddy's shrill voice resounds, stamping it with their unmistakable personality. They then revisit several of the number's themes and bundle them up in a well-designed package. They construct an ominous, growing malevolence to characterize the onset of \"Witch Hunt.\" I especially like the cavernous depth of field provided by Lifeson's always-astounding guitar enhancements complimented here by tactful, unobtrusive synths. The album ends with \"Vital Signs,\" a surprising change-of-pace piece during which they back away from their usual arena-filling motif and delve into unexpected aural textures and feels. While I consider it to be the nadir of the record, it does demonstrate clearly their admirable fearlessness in taking chances.\"Moving Pictures\" steadily climbed in the charts for months, topping out at the #3 position. The single of \"Tom Sawyer\" hit #44 while \"Limelight\" rose to #55. Not bad for a trio that nobody in the record biz thought would ever be a viable commodity. From then on Rush didn't have to worry about selling tickets to their concerts and three decades later they're not only still intact but as popular as ever. Prog rock owes a debt to Lee, Lifeson and Peart for keeping the flame lit during the dark days of the 80s decade when cute videos and pouty-puss poses were all the rage. \"Moving Pictures\" had a lot to do with them being able to do that. Face it, this album has everything required to be dubbed a masterpiece whether you're a fan or not."
    },
    {
      "reviewer": "Wicket",
      "date": "Posted Sunday, July 15, 2012",
      "rating": 5,
      "text": "In celebration of Rush's latest creation, \"Clockwork Angels\", I decided to pay a well-worn tribute to the band by revisiting, quite frankly, their greatest triumph.Yes, I'll admit, 2112 is one of the greatest prog tracks ever to be conceived, and it's impossible to forget \"A Farewell To Kings\", \"Permanent Waves\" and \"Hemispheres\" (THE single most underrated prog album ever, by the way), but \"Moving Pictures\" cemented this Canadian trio as kings of the modern prog world at the dawn of the 1980's, where video games were beginning to melt children's minds, cars were getting square, dull and boring, and every single song in the 80's had cheesy synths and fake drums everywhere you looked. Yet, despite the downfall of the great 1970's, Rush rose above all to deliver this absolutely phenomenal piece of work.It's surely no surprise for those who listen to classic rock radio stations, especially to the tri- state residents familiar with Q104.3, that \"Tom Sawyer\" is a common staple on the airwaves, to no surprise. Not only is it accessible to the average audience (and short enough for radio), but it's also catchy, which is odd considering the guitar solo section is in 7/8 time, a time signature completely foreign in the world of 70's, 80's, even today's pop music. Yet it was Rush's first statement on a great album that would amaze even the most timid of rock fans.\"Red Barchetta\" may not be as much of a prog staple as \"Sawyer\", but it's still another fine example of Geddy's subtly, making himself heard without resorting to that frankly deafening falsetto of his. It's not a bad thing, but not something I'd want to listen to everyday. \"Barchetta\" also showcases Neil Pert's unique drumming style, mixing up the beat while still maintaining 4/4 time, sometimes tricking the listener into thinking the outfit changed time sigs (which they'd do a lot of, not in this particular track alone).Of course, Pert's true talent's would be resolved in \"YYZ\", a song that nearly every aspiring drummer... in the world... as attempted to play, including yours truly. This is where the time signature, like various gourmet foods on the cutting board of Bobby Flay, is diced, minced, and blended into something unrecognizable, but something that's absolutely delicious. Yet, while many praise Pert as the god of modern rock drumming, many forget about the trading 4's between Pert and Geddy, and the frankly magnificent solo by Alex Lifeson, backed up by the smashing of glass bottles and a whip, apparently. While Geddy's wonderful voice is absent here, the track benefits from it, because if I could only present one song to a prog foreigner who wanted to know what real prog rock sounded like, I'd present that being with Rush's \"YYZ\", a truly complete example of what true prog rock is.\"Limelight\" also begins in 7/8, then shifts to 6/8 during the second phrase part as well as the chorus, yet in my opinion, it doesn't sound very proggy. It's a very typical mainstream rock song, another staple on the Q, yet listen closely, and you can still hear Pert gently phasing in and out of time sigs with ease, another example of this band's mastery with a classic, and frankly crucial element of prog rock. Of course, another crucial fractor in Rush's music that is often overlooked is Alex Lifeson himself. He displays another great solo on this track, another solo that many overlook, but another one that helps the cause in placing him as one of prog rock's great guitarists.\"The Camera Eye\" is this record's epic, beginning with a subtle, yet wonderful synth intro with Lifeson quietly adding some wonderful grace notes and chords in the background. Obviously, due to the length of the piece, it's not as popular or as well known as, say, \"Limelight\" or \"Sawyer\", but still another classic example of the constantly changing time sigs, the effortless transitions by Lee, Lifeson and Pert and the astonishing technical ability al three musicians show, without resorting to fanatical showing off and ludicrously blown- out-of-proportions solos.\"The Camera Eye\" begins the second half of the disc, which is the lesser known side of Rush's music, and not too many familiar tunes on this side, but none of which should be ignored. Such tracks include \"Witch Hunt\", the third installment of the outfit's \"Fear\" suite, a grungy, foreboding song, resembling and image of heretics being sent to their deaths (hence the title). Lee expertly paints the scene, while his synths finish out the picture created by Lifeson's excellent guitar work.\"Vital Signs\" closes out the epic record, opening with fanatical synth reverberations, and Lifeson overlaying a \"Police-esque\" chord every second or two. I'm not a fan of the synth snare for the first twenty seconds or so, but the track overall isn't bad. Obviously, it isn't as well known as the aforementioned \"Sawyer\" or \"Limelight\". While the former tracks expertly disguise hardcore progressive rock in catchy, radio-friendly tunes, this song fails to catch me with a poppy lyric or enlightening hook, but that's not technically a bad thing.Because frankly, it's impossible to knock this album, really. While \"2112\" contained some fillers that could've been left without (\"The Twilight Zone\" sounded like it arrived from 5 years in the future where Geddy still shattered glass with his golden pipes every ten seconds, way ahead of it's time), this doesn't seem to have any. If there are any weak tracks on this disc (and every album you come across is going to have some), \"Vital Signs\" is easily the weakest link, \"Barchetta\" starts off too slowly for me and \"The Camera Eye\" seems to be a minute or two longer than I would've liked.Obviously, this is a much different sound than their latest creation, but that is to be explored for a later time, as I snapped off some drumsticks air-drumming to \"YYZ\" again, damnit.That's like the 17th time I've done that."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Friday, June 6, 2014",
      "rating": 5,
      "text": "RUSH followed up their huge breakthrough \"Permanent Waves\" with an even more refined and perfected 8th studio album MOVING PICTURES. Like the last album I have been sick of this one for quite some time having heard the classic radio behemoths \"Tom Sawyer,\" \"Red Barchetta,\" \"YYZ\" and \"Limelight\" to death! All, of course, are outstanding examples of RUSH focusing the energies of their converging sounds. As a result of the excessive airplay of these tracks, this is another album I have unintentionally eschewed in favor of 70s RUSH albums which to this day I still prefer even to this one. Upon revisiting all the RUSH albums lately as i'm obtaining the remasters, I have been giving this classic album some much needed attention mainly due to the fact that this is by far their highest rated album on virtually every list made. Listen again and again I have and I can only come to the conclusion that i'm in accord with the majority on that this is indeed another masterpiece and a perfect album that I wouldn't change a thing.\"Tom Sawyer\" remains one of the band's most popular single tracks and for good reason. It shows excellent powerful songwriting that manages to meld metal and hard rock into one while allowing Geddy Lee to perform some of his best keyboard work ever.Both \"Red Barchetta\" and \"Limelight\" are also brilliantly well written songs.\"YYZ\" is an outstanding instrumental that utilizes progressive time signatures with a quirky metal feel to it. Alex Lifeson is the star on this track but all member are equally riveting.\"The Camera Eye\" is officially the last song over 10 minutes to appear on a RUSH studio album. The very last hurrah of their progressive era and beautifully done staying true to the style of past while blending in the new. An interesting track that has two distinct parts. The first is synth based capturing the mood of New York City and the second is bass dominated representing the mood of London. Their intents don't really translate to me in the same way, but what the hey! It's still a great song.The album ends with two excellent tracks \"Witch Hunt\" and \"Vital Signs.\"This is an album that may have neglected earlier but after years of avoiding commercial radio and giving some time to miss even the overplayed songs, I am more than making up for lost time with this one and I have to also say that the remasters are well worth acquiring. There are no bonus tracks, just digitally remastered albums that sound so much better. This album moves my pictures in a most amazing way."
    },
    {
      "reviewer": "patrickq",
      "date": "Posted Thursday, June 18, 2015",
      "rating": 4,
      "text": "If Rush has a masterpiece, it'sMoving Pictures.The performances are superb. For whatever reason,Moving Picturesstrikes me as less self-conscious than any Rush album that came later. The synthesizer-guitar balance seems perfectly natural, and even the most intricate drum and bass parts don't feel overrehearsed until near the end of the album. This is drummer Neil Peart's finest moment, at least on the standard drum kit. It also features the best-sounding synthesizer sounds on any Rush album, as Geddy Lee stuck to tasty-toned Oberheims and Moogs.The production is also top-shelf. Luckily, the post-processing never gets in the way of the performances. The album has what I'd call \"clean\" sound (though that's probably not the correct technical term), with good separation between the sonic elements. The songs generally don't have synth or guitar pads filling in the background, which is something that would become more common over the next handful of Rush albums. Of course, there are exceptions; parts of \"Witch Hunt\" and \"The Camera Eye\" have more of a \"wall of sound.\"And then there are the songs. AmongMoving Pictures's seven cut are four Rush classics: \"Witch Hunt,\" the first and best of the \"Fear trilogy;\" the instrumental workout \"YYZ;\" \"Red Barchetta,\" which balances progressiveness with radio-friendlinessandmanages to cash in on two male fantasies at once: sports cars and science fiction; and the iconic \"Tom Sawyer.\"Moving Picturesalso features \"Limelight,\" a bit of a throwback toPermanent Waves, and their first hit (#4) onBillboard'sbrand-new rock airplay chart, \"Top Tracks,\" in 1981.\"Vital Signs,\" the album's closer, would be one of the strongest songs onPermanent WavesorSignals, yet here it's only the fifth- or sixth-best (of seven). My least favorite song on the album is \"The Camera Eye.\" From a compositional standpoint, \"The Camera Eye\" is relatively unimaginative. Had it been a shorter song, that'd be one thing, but for some reason, this was the song they decided to make their long-form track. In retrospect we can see that Rush no longer needed 10-minute songs, that, especially after \"The Spirit of Radio,\" they were capable of creating multi-faceted, genuine Rush songs in the space of five minutes. My claim, though, is that there just isn't ten minutes and fifty-some seconds of quality material in \"The Camera Eye.\" I should remark, though, that \"The Camera Eye\" is interesting because it displays several of the band's influences so clearly - - Yes, Genesis, and The Who, by my count.Everything, and I mean everything, that is good about Rush is here onMoving Pictures, and those idiosyncrasies which I find annoying about Rush are kept to a minimum. Perhaps not a \"masterpiece of progressive rock music,\" it's pretty close, and is definitely an \"excellent addition to any prog rock music collection.\""
    },
    {
      "reviewer": "Necrotica",
      "date": "Posted Tuesday, July 28, 2015",
      "rating": 5,
      "text": "If you frequently visit blogs or social networking sites, you might remember numerous online posts about the progression of the common person's interest in 2-D Disney movies. If you don't recall, allow me to give you the rundown: a kid loves Disney movies and watches them religiously; he/she gets into the preteen and teen years, losing interest in the movies and becoming pretty cynical toward them; then later down the line once he/she is older, the person regains interest and starts loving the films again. The reason I bring this up is because it's the exact same relationship I have with Rush's music. I loved them and many other progressive rock bands when I was young (I was never one of those nu-metal kids, despite how popular the genre was), had an anti-Rush phase a bit later, and now they're one of my favorite bands because of both musical quality and nostalgia. In the middle of my Rush recollection, Moving Pictures was one of the albums I remembered most fondly. Listening to it again, I can also conclude that it has aged better than most other Rush albums and remains one of their best.As with other Rush albums, Moving Pictures is a great example of how technicality, songwriting mastery, and a thoroughly emotional touch combine in an exceptional way. Lyrically, the album continues in the vein of its predecessor Permanent Waves in how it touches more on real-life subjects than the fantasy elements of previous works like Hemispheres or A Farewell to Kings. Due to drummer Neil Peart expanding his range of lyrical themes, we get songs about the price of fame (\"Limelight\"), the moods and lifestyles of different places (\"Camera Eye\"), and even automobiles (\"Red Barchetta\"). Geddy Lee's singing is improved and more varied range-wise on this record, establishing him as a more solid storyteller as he sings the tales that Peart is weaving. The instrumental work is, as usual, absolutely fantastic; the trio play off each others' contributions wonderfully and there's a great sense of unity that prevents anything from sounding like aimless noodling. Even in the sole instrumental \"YYZ,\" the band know what time to devote to soloing and what time to devote to composition. The Morse Code-inspired 5/4 section in the beginning is still an iconic progressive rock moment and luckily the song just keeps on giving, with a trade-off solo segment and a synth-ridden slow portion keeping things interesting.Even then, what's even more impressive about Moving Pictures is how it's so radio-friendly for Rush and STILL manages to be so damn good. The hard-rockin' radio staple \"Tom Sawyer,\" the dynamically-varied \"Red Barchetta,\" the fame-influenced fan favorite \"Limelight\" and of course \"YYZ,\" were all big hits when they came out, and yet remain considered some of Rush's most beloved songs even by hardcore fans who love their underrated material. Going back to the \"balance\" argument, that really does seem to be the reason for this. Radio rock fans will instantly recognize and appreciate that iconic first note played in \"Tom Sawyer,\" while the progressive rock crowd will appreciate the craftsmanship that went into the rhythmically varied guitar solo by Alex Lifeson. \"Red Barchetta\" will have the casual crowd enjoying the catchy melodies and Geddy's singing performance while musicians and hardcore fans will notice Neil Peart's varied drum fills going on in the meantime. Even lesser-known songs such as \"Witch Hunt\" and \"Vital Signs\" carry this sense of balance, the latter even using a combination of the typical Rush sound and Police-like reggae rock influences. While \"The Camera Eye\" and \"Witch Hunt\" are perhaps the weakest songs in the grand scheme of things, there's enough atmosphere and variation to let the listener know that they aren't bad tracks by any means, just a bit overpowered by the classics.This is definitely one of the Rush albums I revisit the most. There's so much quality packed into the arrangements and such a sense of unity (despite complex instrumental work) that everything comes together superbly. In the end, that's what this album is: superb. It's commercial enough for radio audiences and varied enough for the progressive rock crowd, making it most likely the biggest fan-pleaser in the band's catalog. That's probably the reason why it's still the highest-selling Rush album (certified quadruple-platinum in the U.S. alone!); in any case, it definitely deserves that distinction."
    },
    {
      "reviewer": "Modrigue",
      "date": "Posted Monday, June 27, 2016",
      "rating": 4,
      "text": "Rush's best album of the 80'sLast 20th century RUSH album to really contain progressive compositions, \"Moving Pictures\" is clearly their most varied and colorful studio opus. Its predecessor, \"Permanent Waves\", marked a turn towards more radio-friendly material, and so do this eighth offering. However, although the record contains several of the band's best-known songs, the music itself has a rich orchestration and still remains quite adventurous, with complex rhythms structures, while approaching different styles. The tracks can be seen as a link between their long elaborated 70's suites and their short and direct synthesizer-reggae-rock songs of the 80's. As ever since \"2112\", the keyboards become more and more present, whereas the incursions in the metal territory are rarefying. Another point denoting this evolution: there are no acoustic guitar passage.Inspired the famous book of American writer Mark Twain, \"Tom Sawyer\" is RUSH's most successful hit single. A powerful and retro-futuristic rock song, with changing rhythms, setting immediately the tone. Great! Alternating softer passages and raging guitars, \"Red Barchetta\" is enjoyable. With \"La Villa Strangiato\", \"YYZ\" is the best instrumental composition of RUSH, and even one the finest of the hard rock genre! YYZ is the international identity code assigned to Toronto's airport. Transcribed in Morse code, these three letters form the opening rhythmic of the track, at bells and guitars. As Toronto is the town where the members live, \"YYZ\" has a particular meaning to them, as it means home sweet home. This track possesses all you could expect from the Canadians: uncommon time signatures, different ambiances, epic passages, various soli and even a spacey interlude... Fantastic! Highly influential, this complex jazzy heavy rock is simply breathtaking! On the contrary, I'm not really a big fan of \"Limelight\". Although also elaborated and evolving, this piece is rather average.Longest and most progressive song of the disc, \"The Camera Eye\" features both somber and dreamy atmospheres. These 11 minutes contain nice guitar works and rocking passages. Not the best mini-epic from the band, but still good. The two last tracks are the most surprising for the fan. The dark fantasy \"Witch Hunt\" is quite particular in RUSH's discography. Cover art designer Hugh Syme's synthesizers' layers create a deep, haunting mystical ambiance, increasing more and more in intensity. Love it! Rather lively, the electronic reggae \"Vital Signs\" foreshadows the style that the trio will develop in their next two albums. It rocks!The mixture of genres displayed in \"Moving Pictures\" was quite unique at the beginning of the eighties, when prog has already declined. Varied, original, risky and refined, the music should even please the seventies' purists. I find this album a bit overrated though, as \"Red Barchetta\" and \"Limelight\" tend to bore me. Nevertheless, the other compositions are great and more remarkable than \"Permanent Waves\"'s. At the beginning of the eighties, Lee, Lifeson and Peart still remain pioneers and adventurers.One of the best and most eclectic albums from RUSH! Highly recommended!"
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Sunday, June 7, 2020",
      "rating": 5,
      "text": "Rush's most successful album, outstanding as its 3 predecessors, and the last of its most progressive stage, which ended with the double live album Exit ... Stage Left, shows us the state of grace and maturity they had reached for hand us Moving Pictures. Again, the use of a wide variety of musical instruments (6 and 12 string guitars, pedals, synthesizers, and percussion elements) allowed Canadians to display all their virtuosity.Side A, which begins with the powerful Tom Sawyer and takes Mark Twain's short story adapted to the modern world as a reference, goes through an intense musical path, in which there is space to embark on the song Red Barchetta in a Ferrari 166 MM Barchetta (model 1948), in a career of the future, inspired by the short story A Nice Morning Drive by Richard S. Foster, surprise us with the instrumental YYZ (IATA code of Toronto airport) considered one of the best instrumental songs of rock and piece indispensable that gives way to Neil Peart's percussion solos in his live shows, and conclude the side with the rocker Limelight, a reflection of how difficult it is to keep private life isolated from everything that involves fame.The Camera Eye, which begins side B, is the last composition of extensive duration (almost 11 minutes) of the group, but already leaving aside the mythical and fantasy theme, and more focused on worldly life, making references to New York and London. It is an excellent song and once again we enjoy the virtuosity of the three musicians, especially Alex Lifeson's guitar. The album is completed by the deep darkness of Witch Hunt, and finally, Vital Signs, influenced by reggae rhythms, which would partly mark the path of Rush for his next work, Signals.Moving Pictures is undoubtedly one of the cornerstones of Rush's discography and progressive music from the early 1980s."
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Sunday, October 3, 2021",
      "rating": 4,
      "text": "When a hard-rock group engages in big prog constructions but achieves critical acclaim with a commercial pop album consisting of medium length songs, it should ask itself a lot of questions.This is the case of Rush, a group that distinguished itself for the very high technical rate of the three instrumentalists and for the desire to bring hard rock up to prog both in terms of musical composition and lyrics. Undoubtedly Rush have combined a singer-songwriter lyrics (written by Neal Peart, the drummer) with a technical expertise worthy of the greatest prog instrumentalists but, in my opinion, in terms of composition, their elaborate songs, including the suites, have not been able to reach the peaks of the best prog groups, being more than anything else overlapping, without real development, of different rhythms or melodies not well blended together.Even in the arrangements, Rush were not be able to mix acoustic and electric moments in a coherent and organic way, acting, even in that case, with a simple superimposition of the two moments. Sometimes, the desire to show off their musical virtuosity has led Rush to sudden changes of rhythm that have made some of their compositions exhausting and, in short, in my opinion, all this has led to very well played albums with remarkable lyrics, ambitious and very appreciable albums which, however, from a musical point of view have not reached what I consider the top of the prog.What was lacking mainly concerns the musical score, often twisted and not very smooth, the beauty of the melodies and the coherent mixture of arrangements that are now soft and after aggressive (for example, Genesis managed to passing from acoustic moments with Hackett and Gabriel to electric moments in a very good way). This analysis of mine would like to explain why Rush gave their best with Moving Pictures, an album where they gave up their great constructions, they found clear and immediate melodies and arrangements by integrating not so much the acoustic sound with the electric, but the electric rock guitar-oriented sound with the synth.pop sound, and they produced very enthralling songs with sure effect.And so, here's to you the Rush's masterpiece.1. Tom Sawyer (4:34) Dazzling start with electronic and synthetic sounds and guitar playing a la Queen power (A modern-day warrior/ Mean mean stride/Today's Tom Sawyer/Mean mean pride). Rush churn out a hard-pop-electronic song of easy access.and sure effect. The central instrumental piece is excellent, while towards the end the song repeats itself without adding anything new. But the power is remarkable, the sound produced is overwhelming and gorgeus. It is the commercial masterpiece of the Rush. Rating 8.5.2. Red Barchetta (6:08) It's instead a song that takes you back to the past, more elaborate, more guided by Lifeson's guitar than the previous one. The main feature that shines through is the smoothness: Rush seem to have managed to coin a modern pop-rock synths-drums / bass-guitar sound that flows pleasantly and that comes closer and closer to the danceable. Smoothness and accessibility are the qualities that Rush lacked most, just think of Permanent Waves, or the Emispheres suite, where all those tempo changes and those crazy rhythms produced a tiring music to listen to. This track is apparently a conventional song with 3 verses and 3 choruses (with different lyrics) and a guitar solo before the third verse but the transition between the various sections is irregular and dictated by tempo changes and very pumped guitar riffs, which again remind me those of Bryan May. The ending takes place with a nuance that is too accelerated at the end of 6 minutes of exhausting song. The result, however, seems effective and satisfactory to me. Rush are inspired and manage to produce songs with a remarkable immediacy, which strikes the listener. Rating 7,5/8.3. YYZ (4:24) XYZ is an instrumental piece where Lifeson is the master. After a beginning with percussion and bells, the intro starts with a powerful riff supported by Peart's drums, then the musical verse begins with a repetitive guitar phrase played on different scales, After that. the melody becomes predominant. Geddy Lee's Squire bass embellishes this piece, especially in the long bridge that follows the musical verse, after which comes Lifeson's solo and the soothing piece with synths which, however, doesn't have time to slow down completely: the musical verse starts again with the phrase of the guitar and ends with a crescendo. Great instrumental piece. Rating 8.4. Limelight (4:21) The first side closes with a conventional rock ballad verse-verse-chorus-verse-verse-chorus-solo-chorus which has its best parts in Lee's melodic chorus and Lifeson's undertone solo. Geddy Lee in this song turns into a melodist. Simple but effective song. Rating 7,5.Very well balanced first side, formed by a very smooth sequence of four songs all easily listening while maintaining the technical rate enjoyed by Rush. Of course, Tom Sawyer's masterpiece is not replicated but, overall, this is certainly the best A-side of the entire Rush discography and it results greater than that of the individual songs taken one by one.Rating side A: 8,5.5. The Camera Eye (10:57) The song begins with urban noises, above which the sounds of the synths rise, with which Geddy Lee now knows how to juggle in a masterly way. After a rhythmic crescendo with drums and guitar that remains one of the best pieces of the mini-suite, worthy of Tom Sawyer, the intro ends and the song comes alive with the sound of synths, very aggressive. Soon after comes Lee's voice describing massified people in New York (Grim-faced and forbidding / Their faces closed tight / An angular mass of New Yorkers / Pacing in rhythm / Race the oncoming night). The music is power-pop with a glam-rock vein.The rhythm slows down for the chorus, where Lee shows off a melancholy singing (They seem oblivious / To a soft spring rain ...): now the melody has become beautiful, but soon after the rhythm returns to accelerate and the first chapter of the lyrics ends. The synths phrase of the intro returns, in practice the song starts all over again, and this is a defect: it would have been better, at this point, to take a suspension break with variations on the theme, or to put a guitar solo on it: so, instead the track simply repeats in a slavish way the same initial movements, with little imagination, and insisting on the frenzied rhythm with a lot of tempo changes which in the long run becomes exhausting. Fortunately, unlike in the past, here the chorus (this time Lee talks about London: Wide-angle watcher / On life's ancient tales /Steeped in the history of London) takes place with a slowdown and greater melodicity, and then a thin and acid solo by Lifeson starts, very good solo, but inexplicably Rush are in a hurry to finish the song and so Lee's singing returns and then the song fades quickly. This is the second flaw of the suite.In practice, what do we owe these defects to? To Rush's desire to focus on powerful synth phrases, to get a strong, commercial and catchy sound, and indeed the synths pieces are worthy of Tom Sawyer, but here, in an eleven minute song, it took more expertise prog in taking care of the details, that is to make a central slowdown with variations and not to burn the song with a hasty and patchy ending: the beautiful Lifeson solo should be more enhanced and the grand finale should be obtained with care, arriving there with all the necessary steps. In short, Rush lack in this piece for their desire to produce an aggressive synth-oriented commercial sound, and in this way the song, overall, which also had great potential, remains not fully developed with success. It could have been a small masterpiece, but you have to be content with being a song with beautiful sound ideas (synth phrase of the intro, melodic refrain in calando and in a minor key, Lifeson solo) not adequately highlighted in the overall structure. Rating 7+/7,5.6. Witch Hunt (Part III of Fear) (4:44) Atmospheric, slow song that begins with a great work by Peart on the bells and on various percussions. There are background voices and an anguished gothic vibe that has a delightful crescendo. Lee sings, rightly, The Night is Black without the Moon etc. Here the Cure and Simple Minds are around the corner. Once again Rush demonstrates that they can master the synths beautifully, in fact they are closely related to the rest of the arrangement (thanks to Hugh Syme in this case) and make the sound more epic, similar to the one that will churn out, a few years later, Wayne Hussey's The Mission. Lee's bass is excellent but it's a pity that the song ends so abruptly in the finale. Once again the Rush let themselves be conditioned by their desire to be commercial: if they had remembered their prog past they would have lengthened the ending and a masterpiece would have been released. Anyway this is a very good song, the best of side B. Rating 7,5/87. Vital Signs (4:47). Song with syncopated rhythm produced by synths and metallic \"twang\" on guitar similar to that of Police that evokes reggae (but that's something else). The sound is very beautiful. Basically it's an electronic song with a cybernetic-style syncopated system. We are now close to the dance sound of a disco but intelligently the Rush alternate the dance rhythm with harder accelerations dictated by Lifeson's riffs. Meanwhile, Lee does the usual great work on the bass that you hear especially in the final when the keyboards start, too bad that instead of a solo or a crescendo Rush they prefer a fade even one minute long. This song is also ruined by mistakes in arrangement and composition and does not exploit its potential. Another small masterpiece failed. Anyway it still remains a good song: rated 7,5.Total Time 39:55The second side, less homogeneous and flowing than the first, it is composed of a mini suite that would like to be a 10-minute Tom Sawyer but only manages to do so in some moments, bringing back the grueling pieces with tempo changes of the past at various times, and then by two songs that move (with some defects) in the field of synth-pop, totally different from the previous Rush production, two well-detailed songs that move the atmosphere from rock to dance-music. The album therefore loses a little homogeneity and quality, and in fact the evaluation of the B side is 7.5 / 8.Basically the A side is a four stars Side whereas the B side is a three stars Side, but overall, I think the record as a whole deserves an 8+ which, in my grading table means that it reaches 4 stars. Viva Rush! I managed to give Rush 4 stars!"
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Saturday, November 30, 2024",
      "rating": 5,
      "text": "Review N� 844\"Moving Pictures\" is the eighth studio album of Rush and that was released in 1981. Following the same formula of their previous studio album \"Permanent Waves\", \"Moving Pictures\" follows a more radio friendly musical format and includes several of the band's signature tracks. This is one of Rush's most famous albums. This is also the album that makes part of the transition to synthesizers that became dominant on their succeeding albums. The album represents the breaking point between Rush's rock-n-roll roots and the more studio stuff they've been doing since. It still has some great guitar moments by Lifeson, some great instrumental work in general, and several other classic Rush's tracks.\"Moving Pictures\" is the fourth and the last studio album of the band that belongs to their second musical phase. The other three studio albums of that phase are their fifth studio album \"A Farewell To Kings\" released in 1977, their sixth studio album \"Hemispheres\" released in 1978 and their seventh studio album \"Permanent Waves\" released in 1980.The line up on the album is Geddy Lee (lead vocals, bass guitar, bass pedals, Oberheim polyphonic synthesizer, Mini Moog, OB-X and Moog Taurus), Alex Lifeson (electric and acoustic six and twelve string guitars and Moog Taurus) and Neil Pearl (drums, timbales, gong, bells, glockenspiel, wind chimes, bell tree, crotales, cowbell and plywood).\"Moving Pictures\" has seven tracks. All lyrics were written by Neil Pearl, except \"Tom Sawyer\" that was written by Pearl and Pye Dubois and all music was written by Geddy Lee and Alex Lifeson except \"YYZ\" that was written by Lee and Pearl. The first track \"Tom Sawyer\" is a great song and a showcase of enough progressive musical elements in four minutes and thirty-seven seconds. It features a futuristic keyboard introduction and it has a good drum work by Pearl in the back to give Lee's bass, keyboard and vocals spotlight, while Lifeson plays a convincingly enough classic rock guitar. The second track \"Red Barchetta\" is the second lengthiest song on the album and has a very simple musical structure for a progressive rock song. It has great riffs, great audible bass, great subtle drum work and the vocal work is just we can expect from Lee. This is probably one of the less good tracks on the album, but fortunately it still gets the job very well. The third track \"YYZ\" is a super technical instrumental piece of music with a thundering drum work and heavy guitar riffs. It's the song most technically as well as the most structurally complex on the album. This is a great instrumental that pacing it's way quickly through near impossible riff age and crunching. It's quite fun to hear and is also probably quite fun to see live. The fourth track \"Limelight\" is a song with an amazing tune, not only because of the time signature dominant in the most of the song, but also because of the guitar solo and the general feeling of the song as a whole. It talks about the pains and pleasures of being in the limelight. This is a song with a great warm feel and it became as one of my favourite songs on the album. The fifth track \"The Camera Eye\" is the last one of the Rush's epics as the band didn't put such long tracks on their future studio albums. The song has some great guitar solos and after the two minutes prelude, the song has a very compact musical structure. The musical movements of great tracks like \"2112\" and \"Xanadu\" are nowhere to be seen. This is really a great song with amazing musical changes as far as tempo, signature and sound is concerned. The sixth track \"Witch Hunt\" paints a grim image of the past with amazing lyrics and is very well coloured by Lee's vocals. The haunting synthesizers, the chimes in the begging, the sound of wind fading into the sound and the drums that sound like a march make of it a great song. This song is amazingly creepy but yet beautiful. The seventh and last track \"Vital Signs\" is surprisingly a very catchy song and closes the album on a very high musical note. It also features the best bass lines of the all album. Despite it sounds a bit poppy, I sincerely think that no one should complain about this song as a closer of a Rush's album. It sounds great, really.Conclusion: There's not the slightest doubt that \"Moving Pictures\" is a great album. It continues their new musical direction with more short songs started with \"Permanent Waves\". But, \"Moving Pictures\" is even a better album. At the very end and after several listenings, we immediately figure out that we are in presence of another masterpiece of Rush. This is the last addition in what I like to call \"Rush's Holy Trinity\", with \"A Farewell To Kings\" and \"Hemispheres\". It has some of the most straightforward and known songs by the group with some tasty touches of their classic creativity and inspiration in the rest of the tracks. It's maybe with a bit of hybrid sounds and weakness, but it still is a great album on its own by one of the most legendaries progressive rock bands. I'll say that if you enjoy progressive rock music, you should definitely get this album and then get ready to be blown away by some advanced and proficient musical instrumentation. It became also an everlasting testament to their great cohesion and talent as a band. If you're new to the Rush, this is a great place to start because is easily accessible and a must have to any fan of progressive music.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "A Crimson Mellotron",
      "date": "Posted Saturday, January 25, 2025",
      "rating": 4,
      "text": "'Moving Pictures' is by far the most successful Rush album and the one that produced the omnipresent hit 'Tom Sawyer', and while there might not be much room for speculation on how important this record is for the band, catapulting them to a status of stardom reserved only for a select few artists, this is also the album that marks the most drastic shift in the band's sound, as Rush focus extensively on writing shorter, more straightforward and often radio-friendly tracks, while preserving their adventurous spirit and the desire to experiment with different styles and playing techniques. 'Moving Pictures' is also the last studio album to feature a song surpassing the ten-minute mark, which is another sign of that aforementioned change in sound. For what concerns the music on this album, we often speak of some of the most accessible Rush material, relying on more predictable patterns and more streamlined, memorable lyrics that dare not to step into the fantastical territory of earlier releases.A commendable achievement in terms of balancing their capabilities of writing good pop tunes and their overall progressive, technical approach to playing through, Rush present a collection of seven entries in a style much more presentable for radio stations than a 'Hemispheres' or a '2112'. The extensive experiments with synths, so prevalent on their 80s material, 'Moving Pictures' is perhaps the one record that achieves the finest balance between the keyboards and the sweeping guitars of Alex Lifeson. Notwithstanding, 'Moving Pictures' is undoubtedly a drummer's album - this is the LP that exhibits Neal Peart's drumming antics like no other, as his acrobatic all-around style is so upfront, cerebral and entirely impressive that you can't help but marvel at the complexity of the drum playing. There is a great unison with the bass, which never dares to overtake the space occupied by the drums on this album.But then again, even if this album contains several iconic Rush tracks and exhibits some of the band's best playing (mostly referring to the instrumental 'YYZ' and the epic 'The Camera Eye'), this is also one of the albums that feels the most emotionally detached, often leaving the listener in the cold, with the band focusing on delivering a tighter arrangement and a playful fill at the expense of a more natural flow or a more organic unfolding of many of the tracks. It might also be the pressure exercised by the media in lauding the album ad infinitum but I do believe Rush released better albums prior to 'Moving Pictures', which is in any case a great leap forward for them into the territory of more accessible, straightforward rock music."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album023e.html",
  "last_parsed": "2025-05-18T11:05:35.912896"
}