{
  "album_title": "SCRIPT FOR A JESTER'S TEAR",
  "artist_name": "Marillion",
  "artist_page_link_local": "artistd1ca.html?id=233",
  "year": 1983,
  "rating_value": 4.25,
  "rating_count": null,
  "review_count": null,
  "genre": "Neo-Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/233/cover_3914162052016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Script for a Jester's Tear",
      "duration": "8:39",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "He Knows You Know",
      "duration": "5:22",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "The Web",
      "duration": "8:48",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Garden Party",
      "duration": "7:15",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Chelsea Monday",
      "duration": "8:16",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Forgotten Sons",
      "duration": "8:21",
      "is_sub_track": false
    },
    {
      "number": 1,
      "title": "Market Square Heroes (Battle Priest version)",
      "duration": "4:17",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Three Boats Down from the Candy (single)",
      "duration": "4:30",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Grendel (Fair Deal 1982 studio version)",
      "duration": "19:08",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Chelsea Monday (Manchester Square demo)",
      "duration": "6:52",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "He Knows You Know (Manchester Square demo)",
      "duration": "4:28",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Charting the Single (single)",
      "duration": "4:51",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Market Square Heroes (alternative version)",
      "duration": "4:48",
      "is_sub_track": false
    }
  ],
  "lineup": [
    {
      "musician": "Fish",
      "instruments": "vocals"
    },
    {
      "musician": "Steve Rothery",
      "instruments": "acoustic & electric guitars"
    },
    {
      "musician": "Mark Kelly",
      "instruments": "piano, harpsichord, Korg CX-3 organ, synths (Minimoog, Roland Jupiter-8, PPG Wave, Sequential Pro-One, Yamaha CS15)"
    },
    {
      "musician": "Pete Trewavas",
      "instruments": "Rickenbacker bass & Fender fretless bass"
    },
    {
      "musician": "Mick Pointer",
      "instruments": "drums, percussion"
    },
    {
      "musician": "Pete James (Abbey Road)",
      "instruments": "sound effects"
    },
    {
      "musician": "Peter Cockburn",
      "instruments": "newscaster's voice (6)"
    },
    {
      "musician": "The Marquee Club parents association Children's Choir",
      "instruments": "backing vocals (6)"
    }
  ],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Monday, February 23, 2004",
      "rating": 5,
      "text": "My liking of neo-prog starts and stops here. This , although it owes almost everything to Genesis, is a real master strike as for the times , they were saying [%*!#] you to the industry and just for that they deserved max reviews and the music is actually fantastic. I really enjoyed ( and still do nowadays) , this first album as there is not one weak moment on it and my fave is Chelsea. Despite its lenght , He Knows got some airplay in Canada , and this was the main reason why we came to know that band.This album unfortunately became the starting point for a whole new generation of neo prog bands such ad Asgard , Aragon and countless other. I say unfortunately because if this had been one of the many sources of inspiration for those group ( as opposed to being the only source of inspiration), things would've gotten much better in the 90's . Just an opinion , but if you stop and think about it a second...."
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Monday, March 15, 2004",
      "rating": 5,
      "text": "For most of us this album really does not need a review as it has been so widely adopted as a classic. Led by FISH, this is MARILLION in top form playing some of their most progressive pieces of all time. Music is complex and yet very dark and delicate aided by the intellectual thoughts of Derek Dick (aka FISH). Songs are exceptionally well written and presented with amazing musicianship. If there is anyone out there who does not have this album then get yourself into a record store immediately! Absolutely essential progressive rock."
    },
    {
      "reviewer": "philippe",
      "date": "Posted Monday, April 5, 2004",
      "rating": 5,
      "text": "I'm not a huge fan of Marillion but I really enjoy listening many of their albums with FISH on vocals. I consider \"Script for a Jester's Tear\" to be their very best effort with \"Fugazi\". All tracks are mesmerized, painful and melancholic thanks to the great semi-operatic, melodic & screaming vocals of FISH and Rothery unique guitar style, deeply emotional & fluid. The perfect album to accompany a long period of solitude (I think mainly to 'Chelsea Monday'...). All the tracks are beautiful, from the satirical & sad love song \"Script for a Jester's Tear\" to the rebelious and reflexive \"Forgotten sons\". \"Script for a Jester's Tear\" figures among the best prog rock albums from the 80s."
    },
    {
      "reviewer": "Certif1ed",
      "date": "Posted Monday, April 5, 2004",
      "rating": 5,
      "text": "A Re-Mastered Masterpiece - a new Masterpiece!What a superb job the band have done in the remastering; This is almost a new album - the dynamics are staggering - especially at high volume, and an album of this quality deserves every ratchet on your hi-fi.The title track is a masterpiece in itself. Although clearly a song, and containing repetetive passages, there is no chorus section, and the verses do not all follow the same melodic progressions. It opens with Fish singing a capella \"So here I am once more\". The irony of opening a debut album with this line is not lost on this reviewer! From this moment on, Marillion throw hook after hook - infectious melody after infectious melody at us, and not only that, but layer melodies in each instrument until it becomes impossible to tell which is the main melody.Focus is on the dominant lyrics, of course, as every word is wrought into poetry of the finest hues. Fish is master of using strong melody lines to carry the lyrics, and inflects perfect dynamics - lights and shades - so that every meaning is put into the words; however it is still the task of the listener to work out each undercurrent and double or triple meaning that he puts in.Add to that Mark Kelly's powerfully melodic and ambient yet understated keyboards, Peter Trewavas' solid, melodic and strongly rhythmic bass, and Steve Rothery's brilliant Celtic, Gilmour influenced yet originally melodic (there's that word again!) guitar solos, and you have near perfection. Mick Pointer plays just enough on the kit to keep things moving - but as long as we don't pay the drums too much attention, they do the job without intruding. Perhaps the 1980s sounding heavy snare is too much of its era, but the surrounding music is timeless, and really, someone could have just sat there playing bongos and it would have worked with music this strong. It's good to have the full kit though!\"Script...\" works its way through a series of neck hair-raising highs, starting with the gorgeously rich bass entry, and never stops working through the story of the artist exploring his emotions after the break up of a relationship in which the protaganist suffers deeply from unrequited love, and even describes the process of writing a song about it \"I act the role in classic style of a martyr carved with twisted smile - to bleed the lyric for this song, to write the rites to right my wrongs - An epitaph to a broken dream, to exorcise this slient scream...\". All this over a winding bass line and light keyboard melody - and the word \"scream...\" is delivered in a muted, gasping fashion, making this a very powerful passage. But there's more power and drama to come - just listen.\"He Knows You Know\" - title possibly influenced by MAHAVISHNU ORCHESTRA's \"You Know You Know\"? - A song about drugs and the more unpleasant effects they can have - especially if you take to \"fixing smack\". The poet turns to drugs to assist in his rehabilitation from the catastrophic emotional loss, but ends up ill - \"Singing psychedelic praises to the depths of a china bowl...\". An insistent rhythm drives this song - and does not relent for such things as choruses, although it does fade for a short bridge passage. A strange choice for a single, despite the pounding rhythms, and remarkable that it wasn't banned for its lyrical content - but there you are!\"The Web\" fixes us firmly back into prog territory, with more of those neck-hair-raising moments. Pure, pure melody and magnificent harmonic progressions layer up upon the winding bass lines in a fine, shimmering web of rich sounds - many proggers may be disappointed not to hear dazzling technical complexities as well, but I would say that the dazzling technicalities lie in the fact that all these melodies seem to magically work together - that was not an accident! The poet is now alone in his tenement flat, wallowing in his memories and gazing through old photographs, contemplating the need to let go and move on. Kelly's keyboard melodies verge on the bombastic, and really shine in this piece.\"Garden Party\" sees the poet moving on - getting out and mingling a bit, but repelled by what he sees. This was a hit single - amazing, really, when you consider the venom with which Fish attacks society and its hypocrysies, and the unconventional rhythms and complex lyrics which dominate the song. However, its \"conventional\" verse-chorus\" type structure make for a workable single that guaranteed it some airplay, even if much of the pop audience didn't have a clue what Fish was singing about. The video was superb!\"Chelsea Monday\" Continues the poet's contemplation of what is \"out there\", and sees the archetypal society woman getting all her style from magazines while inhabiting a strange plastic fantasy world created for her so that she doesn't have to think about it. The bleak music structure and insistent rhythms drive this music through dark layers and yet more gorgeous melodies - honestly, the hairs on the back of my neck have a tough time during this one!But the best is saved for last. \"Forgotten Sons\" shows the poet finally getting himself a political conscience and considering the fate of young soldiers sent off to die for some governmental chess game, as he externalises his internal struggles - his fight against his conscience and the battle of the human animal vs the intellectual, thinking, romantic being. This is one of the greatest pieces of music I have ever heard, culminating in the truly monumental guitar solo that follows the inspired \"prayer\" section. While recording this section, according to legend, the recording booth suddenly went icy cold, and a tangible presence was felt. This presence was allegedly partially recorded - and there are also sounds on the master tape that were not produced by the band. Listen to this section and see if you can work out what they are - if nothing else, this section has the deepest power I've ever known to make people feel unaccountably uncomfortable. It's not heavy metal, but it's certainly INTENSE.On to the bonus tracks (For the 2CD set):It's the summer of 1982. The punk explosion has left but faint echoes, as the parade of \"New Romantics\" waft lace and eye-liner over the masses. The only real alternative appears to be metal - but even the New Wave Of British Heavy Metal is getting a bit old. Suddenly, up pops this quirky single from a \"new\" band called Marillion. Instantly labelled prog, Genesis soundalikes, whatever... Market Square Heroes is as far from anything else at the time as it is from anything else Marillion wrote. A catchy melody, bouncing rhythms and major keys could soon fool you into thinking that this is a happy pop song. Not true! This is the beginning of the story of Marillion - the band playing the taverns in the Market Place, hungry for the big time, bemoaning the closing down factories and large-scale redundancies in the hypocritical yuppie era of the 1980s, where to some there was endless opportunity, to ordinary factory workers there was nothing but loss of livelihoods and consignment to the scrap heap. Marillion offer the suggestion and solution of planning the day - are you following me?Three Boats Down From The Candy is much more safely in prog territory, with wafting, drifting keyboard washes. Sumptuously dissonant and borrowing structurally from Genesis, the lyrics are the foundation stone for both \"Script For a Jester's Tear\" and \"Fugazi\". Marillion also lay down their own style authoritatively in this song - all the elements are there from Kelly's meandering keyboards, Trewavas' wandering yet solid bass and Rothery's impassioned, Celtic and hugely melodic guitar.Grendel is one of the most oft-discussed tunes in prog. Is it a mere Genesis rip-off? There's not much evidence of this to start with, as the opening, musically reminds me more of Spinal Tap launching into the epic \"Stonehenge\". However, as this section \"Heorot's plea and Grendel's Awakening\" pans out, it is absolutely clear that there is much more to this track. The music follows the epic story well, even though it was originally an 8-minute piece, stylistically similar to Twelfth Night, called \"The Tower\". The opening section is then repeated and developed, and the next section \"As Grendel leaves his mossy home\" is in Marillion's more energetic style - here it is apparent that the band put so much passion into recording this piece that they don't seem to have noticed that the bass is out of tune!Fish bends and twists his voice accordingly, and Rothery bends notes into a solo that Andy Latimer would have been proud of. The vocal section is repeated (for the structure hounds!), then we have the \"Earth Rim Walker\" section from earlier before relaxing into \"Grendel's Journey\" - the opening section of which is very and comfortably reminiscent of early Genesis - if this was the only Marillion track you'd ever heard, then I'd understand the continual comparisons!A short bass solo, which reminds me a little of \"After the Eclipse\" by Twelfth Night leads to \"Lurker At The Threshold\", an ever-growing, pulsating orb of prog! Finally (sic) we have the ontroversial \"Finale\". This opens with one of the best riffs Marillion have ever produced, then layers melody after melody, texture after texture in a miraculously Camel-like style, dropping down here, building up there to the \"Apocalypse in 9/8\" riff, approximately 14' 15\" into the piece. However, listen closely. It's not what is done or what is borrowed, but what is done with that material. Marillion develop it - the epic lyrics and Fish's impassioned treatment of them take it beyond Genesis - the riff that follows is majestic and sweeping and an indication of Marillion's \"pure\" style developing. Marillion keep up the inventiveness and interest to an uncanny degree - but don't just take my word for it - you have ears!!!The Demo version of Chelsea Monday takes quite a few listens to fully appreciate why Marillion might want us to hear what superficially (production-wise) appears to be an inferior recording of one of the greatest tracks on the album. However, it has a stark quality all of its own just waiting to be discovered and enjoyed.Before \"He Knows You Know\" was pummelled into some sort of shape to be a quirky hit single, there was this version. It is typical of Marillion that so many changes should take place - every time I saw them live, you never heard the same performance twice. I love this demo version - really stripped down, and a kind of \"retro-neo-prog\". To me, this is much more convincingly prog than the version on the album.Charting the Single seems to set the scene for some parts of the \"Misplaced Childhood\" album, but has the tight focus on word play more typical of \"Fugazi\" or \"Clutching at Straws\". Many of the jokes are downright corny, and it's easy to dismiss this as a light piece of fun - which it is. However, it's more than that - it's the lighter side of Marillion, and the reference point from which to view songs such as \"Garden Party\", \"Assassing\", \"Heart of Lothian\" and perhaps \"Incommunicado\".The Alternative version of Market Square Heroes has much fuller production - and seems to have gone through the machinery of the remastering process with more attention than the \"Battle Priest\" version. There are differences, but I don't really find them notable enough to highlight any here - find them yourself!The bonus tracks are a very interesting addition, particularly the full contents of the \"Market Square Heroes\" EP, but the album alone gets the full FIVE STARS. A Masterpiece of prog - a must-own - even if you don't \"get it\" the first few times you listen to it (and you won't. Trust me). Combined with the bonus tracks, the 2CD set becomes a must-have for anyone that's ever expressed an interest in prog. Don't miss out!"
    },
    {
      "reviewer": "greenback",
      "date": "Posted Sunday, April 11, 2004",
      "rating": 5,
      "text": "The revival of progressive rock, started in the early 80's, probably occurred with the arrival of this album. Many purists pretended this album to be a Genesis' clone. Probably those people don't accept the judicious use of modern technologies, serving a noble cause: the creation of a logical continuity of the best progressive rock of the 70's. This album is certainly influenced by Genesis circa Foxtrot, but it is definitely not copied from them. Actually, the Citizen Cain's \"Serpents in camouflage\" album has more similitudes.The fresh sound has a pleasant permanent echo, and the very synchronized drums and bass have a very elastic & punchy sound. Fish's very expressive & theatrical voice has some similitudes with Peter Gabriel. There are many moog solos and delightful guitar solos a la Steve Hackett, reminding the \"Selling England by the pound\" album. There are also some excellent ambient modern organ parts; modern, melodic & colorful keyboards are also very present. There is just on slightly irritating point: the gross rhythmic electric guitar riffs, like on \"Forgotten sounds\" could have a better crafted sound.HIGHLY RECOMMENDED!"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Thursday, May 27, 2004",
      "rating": 5,
      "text": "A Masterpiece that Redefined Prog Music ...!This band was my hero! Yeah .. I still remember sometime in 1983 when I did my engineering study, the world was flooded by abundant punk and new wave kind of music. Major prog bands were heading toward that direction as well. I was so disappointed with Genesis \"abacab\" and Yes \"90125\". Nope! Don't get me wrong . I'm not saying that their music were terrible. I just could not believe these pioneers of 70's music who had laid solid foundation in the history of prog music had finally changed their direction and get commercialized themselves. Well, it's their call. Who was I, anyway? I was just a listener of great prog music. Yet, as their fanatic fans and loyal customer, I had to admit that, deep inside myself, I felt that I reserve the right to choose my musical taste. So then I did not praise their music anymore. Especially having heard Genesis \"Who Dunnit\" or \"Keep it Dark\" uuugh ..! Something is happening in my stomach. I would vomit I guess .???!!!In the midst of searching an excellent music that really fits my taste and feeling, I was frustrated with what was happening in music industry during that dark year of prog music circa early 80's. It ended until one afternoon when my friend played me an LP of a band which I never heard before .. Marillion. What sort of name? ( I was not into any of novel or book and I was not aware at all about Tolkien or Silmarillion). \"So here I am once more!\" Yeaaahh .. The opening voice really kicked me and their music really blew my mind! Yup! This is the kind of music that I've always wanted. I was really hooked to this LP that afternoon and I could not afford to put my stereo set off. I listened to this album (disc one of the re-master series, off course) continuously for 3 hours in front of my stereo set!! I kept repeating when it hit \"Forgotten Sons\", the closing track of this terrific album.Even though it's clear that Marillion music is in the vein of Gabriel era of Genesis but I never considered this band as a copy cat. They just played the music that they'd like to play. Their music is even darker than Genesis. One thing that I rate highly about this album is the melody and music composition are top class! The opening track \"Script for a Jester's Tear\" sets the whole tone of the album. It clears the path to true progressive music with strong melody that touches your heart. The opening voice of Fish on vocals with a background of simple piano sound by Mark Kelly has started to touch your heart with its crisp melody. Listen the keyboard part after Fish sings \" ..abandoning the relics in playground of yesterday ...\" yyeeaaahh . so nice piece of music segment that Mark Kelly plays on his keyboard. But hold on .. that has not reached the true orgasm of this track because the band then brings you to a reallu uplifting music when the drum part starts to roll \"The game is over!\" really kicks! The music then flows naturally with every segment of music gives nice touch on melody part. The guitar part at interlude is performed nicely by Steve Rothery. The second track is the song about drugs. It has a powerful tone opened with guitar touch and Fish voice \"He Knows You Know\" followed by keyboard soun, and reaches its climax when the drum section enters the scene. So powerful! This is a kind of song you would like to wake you up in the morning. \"Problems! Problems!\". One thing noticeable about this track, beside its upbeat rhythm, was the closing section that ends nicely with Fish tiny voice \"Don't give me your problems!\" - \"bang!\" followed by intro part of next track \"The Web\". It flows beautifully in this part!\"The Web\" was the first task for Fish to write a lyric for the band, during audition period of being the band's new vocals. He did it very well. I enjoy this track very much especially its powerful lyric (about rubber plant) and beautiful composition. \"I realize I hold the key to freedom but I cannot let my life be ruled by threads .\" is the piece that I memorize on top of my head since I heard it the first time. It was then followed by steve's solo guitar. Very nice.The fourth track is \"Garden Party\" that later became the band's and audience favorite's for live performance. This track once became a \"radio hit\" in Bandung, the city in Indonesia where I heard Marillion the first time; a well-known FM station aired this track several times.Now enters the slower music of this album \"Chelsea Monday\". Again, the band offers a nice melody with a memorable guitar tone in the interlude part. Now .. you would realize that Steve Rothery plays his guitar with Hackett's style.The closing track is my favorite, \"Forgotten Sons\". \"This is dedicated to all those who fell on a pavement outside Harrods last Christmas.\" (Intro Forgotten Sons - Real To Reel, their first live album). Harrods is an exclusive shop in Knightsbridge, London. On December 17, 1983, an IRA bomb exploded, killing six and wounding many others. This track is opened by radio tuning sound that includes bit of \"Market Square Heroes\" (from their previous release of EP) followed by \"Armalite! Streetlight!\" voice of Fish. The opening is so powerful. It brings a nuance of a group of soldiers that marches into their destination, war field! I love the part in the middle when Fish sings like reading a poet ..\"Your mother sits on the edge of the world when the camera starts to roll .. etc.\". The guitar rhythm as a background is very nice piece. Actually, I love all tracks in this album. But if I'm forced to choose the best one is this track. It's damn powerful, my friend! \"Peace on earth and mercy mild. Mother Brown has lost her child. Just another forgotten sons!\" Yeeaaaahh ....On disc 2, you can find 3 tracks from Marillion's EP prior to their debut album \"Script\". Those 3 tracks are excellent: \"Grendel\" which was inspired by a book by John Gardner. This track is also my favorite. Some people commented that this is a clone of Genesis \"Supper's Ready\". So be it. I don't care. What I really care is that I love this track very much. .. \"Three Boats Down from a Candy\" is also a nice track, with great melody - of course. Bravo Marillion Fish era!Keep on Progging ...!Progressively yours,Gatot Widayanto, Indonesia."
    },
    {
      "reviewer": "The Prognaut",
      "date": "Posted Friday, June 11, 2004",
      "rating": 5,
      "text": "I'm so grateful to life for putting me in the way of this album when I was barely getting impregnated with prog rock whatsoever. I came across \"Script for a Jester's Tear\" because of the constant suggestions of my friends and due my incessant desire to discover new musical approaches, I took those pieces of advice and got to put my hands on the record. I have to say that the impact upon me from the very first 20 seconds of the album was irremediably blinding. I embraced the song \"Script for a Jester's Tear\" as my hymn to pay homage to sorrow and loneliness, it was simply the most enigmatic yet captivating song I have ever listened to; so far, PINK FLOYD was my parameter to measure other artists works.Eventually, I fell in love with the album, it just transmitted this sort of sentiment, of passion and emotiveness to me that it has inevitable not to play this record over and over. This album contains the very first song MARILLION ever played as a band (\"The Web\") but that was not included in the \"Market Square Heroes EP\" due the indecisiveness the band constantly suffered because of the interminable counterpoints between FISH and ROTHERY. Finally, the song was included as prelude to \"Garden Party\" and in between some other magnificent songs beautifully composed such as \"He knows, You know\", \"Chelsea Monday\" and \"Forgotten Sons\".These days I pay even much more respect to this album because of what the band accomplished at the time they released it and the spotless, impeccable work they did with the whole production; and mostly, because when I attended to a MARILLION concert in September 1997 with HOGARTH behind the microphone and seeing him attempting against his integrity by daring to sing \"Garden Party\" and \"Kayleigh\" at the very end of the show, I realized there was never gonna be another FISH whatsoever, no matter how hard you tried to push things within the band or the crowd. An extremely amazing recording, definitely a must. Put yourselves together people, I'm giving it the whole five stars. Masterpiece!"
    },
    {
      "reviewer": "Chris S",
      "date": "Posted Wednesday, August 18, 2004",
      "rating": 4,
      "text": "Too many 70's cliches for my liking but there is no denying the quality of the album at a time when anything new in this genre was like headline news. The biggest problem I have with it is that it has dated compared to say any Genesis material. The comparison between the 2 bands is apt because Fish was hell bent on sounding like Gabriel. I have no problem with honest plagiarism though!!The title track and ' garden Party' for me the highlights. I do think their follow up Fugazi was better."
    },
    {
      "reviewer": "Blacksword",
      "date": "Posted Friday, August 20, 2004",
      "rating": 4,
      "text": "The comparisons to Genesis were probably more based on the fact that there was not much prog around in 1983. At least not in the mainstream which is where Marillion seemed to be heading from the outset. Partly thanks to the strength of their music, partly thanks to the unique performances of Fish, and maybe even thanks to their sleeve artwork, Marillion were talked about from their first EP onward. This excellent debut album has stood the test of time, and IMHO is their joint best album (if thats possible) with 'Fugazi', its follow up. 'Script For a Jesters Tear' is a a dark affair. The first three songs court ideas of deep depression through lost love, contemplation of suicide, living in isolation and solitude, and succombing to insanity. Sound awful? Well, to be honest the music sounds fantastic. Steve Rothery's guitar playing is melodic, his solos memorable. Fish's voice is haunting, and despite all the Gabriel comparisons is actually unique. The title track is one of the best songs the band ever wrote IMO, and has some of Fish's most lovely and un- contrived lyrics. The music changes between drama and melancholy in a captivating way. 'He knows you know' has a sharper edge, is laced with bitterness, and was an obvious choice for a single. The Web, another Marillion classic, closes what would have been the first side on the old vinyl. Again 'The Web' deals with concepts of depression and isolation, and has some of the most melodic guitar work on the album. In fairness there is not a duff track in sight. The eccentricty of 'Garden Party' is contrasted by the dark, moody allyways of 'Chelsea Monday and the album is completed by the angry 'Forgotten Sons' An anthem for those killed in action, viewed and commentated on by armchair startegists with no idea of the reality and horror of conflict. 'Forgotten Sons' is an important song for the time, making refernces to the Northern Ireland conflict. This was a big live number for some years.As a debut album, SFAJT is brilliant, bold, brave and original. Ignore the Genesis comparisons. With the passing of time I have come to regard these as way off the mark. This album scores a four and not a five, only because the drumming was better on the albums that followed (when Ian Mosely took over) and the production improved thereafter too. In terms of the songs? No complaints at all. Highly reccomended."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Tuesday, September 7, 2004",
      "rating": 5,
      "text": "As a very instinctive and emotional person, this record was a test. Fish' emotion detector is very busy in this record. If Script for a Jester's Tear don't move you lyrically, you're one stone cold soldier. Of course, the music is as dramatic and carries a lot of what Fish wants to say. Despair, sorrow, desillusion, anger, addiction and so on...Marillion tells stories, just like Genesis. Marillion even sounds like Genesis (Rutherford guitar and of course, Gabriel voice mimics).But Genesis never fueled up on Prozac like this baby. The stories are probably inspired by Fish many adventures with pal Captain Morgan on white mountains of nose- vacuuming snow. To me, Marillion has been a bit too depressing on this record, but got better in the end. Each song reflects a life of problems and difficulty to control borderline syndrome. But, the thing is...the're excellent at it. They overdo it emotionnaly a tad, but this stays a very, very acceptable start for the band. Fish' voice is never expressed such honesty in any other record. We can feel everything he means. And he put emphasis on singing with strenght, which gives to the record an honest and...a quite welcome Gabriel feel....even if it's a total rip-off.Marillion is a band which I could rank in the same vein as The Cure, James or Beastie Boys. The song cannot be split with lyrics on a side and music on the other. The two must be combined and especially the lyrics must be read while listening. This way, like the other bands I named, the experience is superior to many bands with great music, but cheesy lyrics or vice-versa.To me, Marillion is what I call: DRAMA-PROG.Moody, rather negative and claustrophobic.Fish, it must suck to be you...."
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Tuesday, October 12, 2004",
      "rating": 4,
      "text": "Genesis of a prog bandI first came across Marillion not long after this album was released. I remember well that my initial impressions were that, while the band was clearly competent, their music was so derivative of Gabriel era Genesis, as to make them appear to be little more than a tribute band (stay with me here PA member \"Certif1ed\"!).I have to admit that with the passing of time, and having become familiar with Marillion's work over many years, that association is not nearly as clear to me now as it was then. The most obvious similarity is in the vocals of Fish vs. Gabriel, and I guess it is often the vocals which make the biggest initial impression. Looking beyond that however, while there may be some Hackett like guitar sounds, and occasional Bank's like keyboards, these are no more obviously derivative than the music of any of Marillion's progressive rock peers.Yes the songs, especially on this their debut album, do tend to be structured (in terms of the story telling and incisive instrumental passages) along the lines of Genesis early epic tracks, particularly those on \"Nursery Cryme\", but the music is very much their own.As a whole, I have always found \"Script..\" to be fairly inaccessible. To prolong the Genesis comparison, there are far less in the way of familiar hooks, repeated themes, etc., the songs being generally darker and more complex. The opening title track sets the scene not just for the album, but indeed for the band for the years which were to follow. I don't normally refer to other people's reviews when writing my own, preferring to read them AFTER I have committed my own thoughts. At this stage however I would refer you to the review of this album by \"Certif1ed\". His love of the album is as clear as his intricate knowledge of the contents. Cert's review is clearly a labour of love, and gives those unfamiliar with the album very useful guidance on how to approach it.While I too enjoy the album a great deal, I find the overall package does not justify listing it among my favourites. I have some difficulty articulating the reasons for this without appearing to knock the album, which I do not wish to do (since as I say, I do enjoy it a lot). From a Fish era Marillion point of view, I prefer \"Misplaced childhood\" which I find to be generally stronger.For me, the band are at times trying to be just a bit too complex (in the way the Flower Kings can appear to be these days). Had they developed some of the themes more, before rushing on to the next one, the tracks would have benefited from a greater continuity. I would also like to have had more in the way of instrumental breaks, Fish just has too much to say in each song.These comments must however be taken in the context that I see the album as highly enjoyable and only slightly flawed, it is certainly one of the best debuts by any band."
    },
    {
      "reviewer": "Guillermo",
      "date": "Posted Friday, October 15, 2004",
      "rating": 4,
      "text": "\"Welcome to neo-prog. Welcome to Marillion`s World\". In late 1983 I read in a Rock music magazine a review about Marillion, their first album, thier image, and how they sounded like Genesis with Peter Gabriel. I saw the photos of the band in the magazine, with Fish`s painted face. I didn`t have interest in them then, until I listened to \"Kayleigh\" in the Radio in 1986, and I started to buy their albums in early 1987. I bought this album until late 1990, after I finished my University studies. I was younger then. In 1983 Marillion members were younger, too. So I consider this album a very good album, a mostly depressing album but with great musical ideas, \"atmospheres\" and moods, recorded by a young band. This album has a lot of creativity by the band. The music is very interesting, with a lot of changes. I like every song in this album, but...I don`t like the drums, their sound and how they were played. I think that there were good justified reasons to change the drummer in Marillion. At that time, Mick Pointer wasn`t the right drummer for Marillion. The live versions of some of the songs of this album recorded later with Ian Mosley are much better due to his playing. I listened again to Pointer when his new band (Arena) released their first album in the 90s, and he improved a lot in his playing. But in this album he really lacked \"power\". I don`t consider Marillion as \"another Genesis\". They had their own style since they started, in my opinion. The similarities with Genesis are not enough for me to consider them \"Genesis imitators\"."
    },
    {
      "reviewer": "Tristan Mulders",
      "date": "Posted Saturday, October 16, 2004",
      "rating": 4,
      "text": "Marillion - Script for a Jester's TearIn a time when most of the leading 70s bands in the Symphonic Rock scene decided to either stop making this specific type of music or members of those key bands decided to go solo, the fans of the genre feared for the further existence of it. In other words, there was an urgent need to satisfy a constantly growing hunger for new symphonic music that had was both refreshing and had a 'new' sound.In 1983 this hunger was satisfied with the release of an album that saved the Symphonic Rock artist from turning into an endangered species. This album was \"Script for a Jester's Tear\". by a band that later would become one of the 80s leading bands in the genre:MARILLION.Script for a Jester's Tear, by many regarded as one of Marillion's best, is most certainly a classic album in the scene. With the release of this album a new style of Symphonic Rock music saw the daylight: Neo Prog (rock).I first heard the album as a whole an average five and a half years ago. My first impression was that, in contradiction to a lot of Symphonic Rock stuff from the 70s, most of the compositions on this album are not overly complex. Sure, there are complex parts of songs, but overall seen it is not there to BE complex and it certainly does not seem difficult to get 'into'.The music presented here is mostly quite a bit depressing. Fish's lyrics are very mystical and are works of art on their own. Some of it seems to be very personal to Fish himself (Script for a Jester's Tear), whereas others have a twist of humour (Garden Party) or are about politics-related issues that were happening around the time of release in England (Forgotten Sons, which is a firm anti-war song about the Falklands War). The other band members back up his distinct vocals and the mystical, but fitting, lyrics with great atmospheres that tend to perfectly set the mood for every track.It is in my opinion by far not Marillion's best, but for the Symphonic Rock genre in general speakingandthus also meaning the history of Symphonic Rock from its beginnings up to present day, it is a classic."
    },
    {
      "reviewer": "chessman",
      "date": "Posted Sunday, March 20, 2005",
      "rating": 5,
      "text": "I was out shopping in Liverpool city centre with two friends, on a sunny Saturday back in 1983. We went into HMV to have a look around, and I spotted this album, drawn to it by its excellent cover. One of my friends, upon my enquiring about this, told me it was very good, from a new band who sounded a lot like early Genesis. Now me, being one of Genesis's biggest fans throughout the seventies, and having groaned at the downward spiral of their increasingly pop and chart influenced later albums, was immediately interested. So, without hearing any of it, (even though my friend had the album, unknown to me!) I purchased it. My initial reaction was rather mixed. Yes, there were a lot of Gabriel/Banks/Hackett influences, especially on the opening track, which reminded me a lot of 'The Musical Box', but some of the rest I found a little disappointing. At first. However, on repeatedly listening to the record, over the next few days, I grew more and more to be enamoured by its charm. For a debut, this is terrific, one of the best ever. Every track is a worthy effort, my favourites being 'Script' and 'Forgotten Sons', although this track is less like Genesis. 'He Knows You Know' has a superb atmosphere, with Mark Kelly's keyboards very much to the fore. 'The Web' has nice guitar work from Rothery, and flows seamlessly. 'Garden Party' is fun, and is probably Marillion's answer to 'The Battle Of Epping Forest'. 'Chelsea Monday' is far darker, with a tragic yet interesting story line. A good track but, if forced to choose my least fave on the record, this would be it. 'Forgotten Sons', as already mentioned, is, to me, a terrific piece of music. Fish's lyrics are, as usual, vitriolic, yet poetical as well. One of the best lyricists of his, or any generation. (He was born the year before me, 1958.) As a poet myself, his writing is right up my alley, so to speak! Some critics go overboard regarding the 'Genesis clone' theory. The truth is, these are neither as close to Genesis as some suggest, nor as different as others insinuate. Having read the band's biography years ago, which covered the period up to the release of 'Clutching At Straws', I soon discovered that Yes were a bigger influence on them than Genesis. Nevertheless, the title track here is very suggestive of Genesis. The two reasons for the comparison, in my eyes anyway, are 1) Fish's vocals, and 2) Mark Kelly's keyboards. In the early years, he played very much in the Tony Banks style, and this was a good thing for me. These days, they sound nothing like they used to do, and, although good in their own way, have lost that early charm and atmosphere they once possessed. The bonus disc here is interesting, although the version of 'Grendel' one of my fave Marillion tracks ever, is slightly inferior here. Likewise, the version of 'Chelsea Monday' plods and lacks the quality of the official album version. Another of my fave pieces is 'Charting The Single' which is here in all its original glory. Tremendous. A must have for Marillion, or prog fans in general, and one of the two best albums by this group, the other being 'Clutching At Straws'. Recommended. Early Genesis fans who haven't heard this, what are you waiting for?"
    },
    {
      "reviewer": "Prog-jester",
      "date": "Posted Thursday, April 7, 2005",
      "rating": 5,
      "text": "This is the main event in my life. The most important. This date (I've bought it on August,1,2003 - before this time I had NO IDEA about Marillion or other neo-prog bands ) is my second birthday! I consider this album to be the BEST EVER recorded on our planet!Maybe there are some else, but still \"Script\" is my favouritest! It opens with the best track ever recorded ,\"Script for a jester's tear\"; I've been crying when I've heard the last part (\"the fool escaped from paradise\")!; continiues with great \"He knows You know\" and gives us a break after the magnificient \"The Web\". I've been greatly impressed with Fish's lyrics , he is really great poet! The B-side: \"Garden Party\", a sharp one; \"Chelsea Monday\", a soft one; and the closing epic , anti-war \"Forgotten Sons\" with its famous \"praying\" mid-part and ballad final part (\"You're just another coffin \"). The GREATEST album ever written; it is too genious for this world. Highly recommended to everyone who enjoys good music. Beyond compares!!!"
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Tuesday, June 28, 2005",
      "rating": 4,
      "text": "Among the greatest debut albums of all time, Marillion really caught the world off guard with their progressive craftmanship of songs. This is arguably the album that started the Neo-Prog genre, and it is rightly so. The songs aren't as complicated as their symphonic counterparts, and they are a lot more accessible than... say... Supper's Ready. Anyway, the musicianship is top-notch, with great guitar work by Rothery, great bass by Trewavas, great keyboard work by Kelly, and incredible vocals and lyrics by Derek Dick (AKA Fish), from start to finish, this album is filled with angst and desperation, and the music is extremely well crafted. Rather than talk about each track, I will discuss my favorites.The opener, Script for a Jester's Tear, is among the best Marillion tracks. Opening with classical Piano and quiet vocals from Fish, the song quickly goes through many different moods. At one point the track is upbeat, and at one point the track is downbeat and sullen. Regardless, this track features some of the best playing from the group. Fish's mastery of the english language is also well represented with incredible and tasteful lyrics throughout.My other favorite track, Forgotten Sons, features incredible and emotional vocals from Fish, awesome guitar from Rothery, and incredible keyboard work from Kelly. It seems that from Market Square Heroes on that the group were able to create not overly intricate tracks and allow for the lyrics to take the forefront rather than the music.Overall, this is not an album to be missed. I recommend this to any fan of progressive rock. However, some may find boring spots throughout, and there are a few, but not enough to make one dislike the album IMO. 4.5/5."
    },
    {
      "reviewer": "kunangkunangku",
      "date": "Posted Friday, July 22, 2005",
      "rating": 5,
      "text": "There's no doubt this album is among the greatest debut of all time within progressive rock territory. With this, as I became aware later on, Marillion started raising the neo- progressive rock flag and confirming that progressive rock still alive and kicking in the global music map which at the time, the period of 1980s, heavily infested by punk and new wave genre.In first listening, sometime in 1985, Fish -- whose vocal reminded me of Peter Gabriel -- hit me straight at the heart and mind when he sang this line: So here I am once more in the playground of the broken hearts/ One more experience, one more entry in a diary, self-penned...What a great line. And, as if he kept the best part for the proper moment, he moved on to blew me with this: Too late to say I love you/ Too late to restage the play, the game is over.A mellow song? No. It's a killer song. This was and always is what I think. Because the lyric is so brilliant in telling the story -- about a brokenhearted someone? Whatever it might be. Because the melody is so heavenly beautiful yet so powerful in casting some marks in the heart and minds of its listeners. And also because Fish denouncing that \"... the game is over.\"But five more extraordinary songs follows: \"He Knows You Know\", \"The Web\", \"Garden Party\", \"Chelsea Monday\" and \"Forgotten Sons\". By extraordinary I mean great lyrics, incredible melodies, tight arrangements and superb performances. And all them combined set the standard for their later efforts -- probably also for another bands in the sub-genre.Not only is a must for Marillion fans, this album also essential for any progressive rock fan."
    },
    {
      "reviewer": "richardh",
      "date": "Posted Friday, August 12, 2005",
      "rating": 4,
      "text": "Early eighties neo prog 'pioneers' debut.Fish's ridiculously over dramatic vocals always dragged down Marillion (I preferred his 'replacement' ,Steve Hogarth,with his calmer approach) .What stops this from being total ruin are the keyboards of Mark Kelly and the drums of Mike Pointer.Both are superb musicians.But I still come back to those vocals.Like fingernails on a blackboard to me.Aaaarghh!"
    },
    {
      "reviewer": "The Crow",
      "date": "Posted Monday, August 29, 2005",
      "rating": 4,
      "text": "I have to say that I'm a huge Marillion's fan, but I prefer the Steve Hogarth's era without a doubt... But it doesn't meant that I don't like the Fish's years too.\"Script of a Jester's Tear\" is maybe together with \"Misplaced Childhood\" the best album that Fish made with Marillion, and It's a milestone for Neo-Progressive's lovers. The songs are a lot in a Genesis's first works style but with a very 80's sound, particulary in the great Mark Kelly keyboards. And here we can hear the particular voice of Fish, who has a lot of Peter Gabriel's influences. But Fish sings in even a more teatrical style, like a kind of clown sometimes... I have to say that I don't like his voice very much here, because I think he sounds ridiculous sometimes in this work. Nevertheless, in albums like \"Misplaced Childhood\" he sang very much better, with more personality and in a less irritating way...Pete Trewavas's bass sounds great in this album, but the Steve Rothery's guitar sound is a little weak... Mick Pointer made a good work, better than the forever insipid Ian Mosley. The sound of the album is also good for being a debut.Best songs: except Chelsea Monday, wich I find a little bit boring, I like every track in this album... Specially Script for a Jester's Tear and Garden Party.Conclusion: recommended for Genesis's fans, and for people who want to know the Neo-Progressive's origins. And if you don't like the modern Marillion because they are not very progressive, then try this album (or the other they made with Fish...), because they were really different, although not better in my opinion.My rating: ****"
    },
    {
      "reviewer": "Tony Fisher",
      "date": "Posted Monday, September 5, 2005",
      "rating": 5,
      "text": "I first saw Marillion when they opened the Nostell Priory music festival for Jethro Tull in 1983 (I think). I had no idea who they were but thought that the singer was remarkably like Peter Gabriel in style even if the rest of the band were totally different. So, suitably impressed, I went and bought this, their debut album on vinyl (ie without the excellent bonus CD). And it is one of the best debut albums of all time. It's not their best album (Fugazi is that) but it is consistently good throughout and the second side is particularly excellent. If they had substitued Market Square Heroes for The Web (the one comparativly weak track) the original would be a masterpiece. With the bonus CD, it becomes one. There are superb solos from Rothery and Kelly, Trewavas produces some great bass lines and Mick Pointer is an effective drummer. Essential!"
    },
    {
      "reviewer": "Trotsky",
      "date": "Posted Monday, September 19, 2005",
      "rating": 4,
      "text": "\"Here I am again once more, amidst her playground of broken hearts ... the game is over\" Doesn't sound like the greatest poetry does it? But believe me, in the hands of Marillion's passionate singer Fish, the words come to life with a vengeance. Love him or hate him (and let's face it, even those of us who do love his contributions to Marillion suspect that he might not be easy to get along with), it was hard to ignore this man simply because he dared to wear his heart on his sleeve. Of course Fish's similarities to Genesis' Peter Gabriel were never more pronounced than on this album, but this album is so intriguing that such \"plagiarisation\" is easy to forgive.The title track to this album shows Marillion's strengths. Sure there's a decent guitar solo from Steve Rothery, sure there's a nice symphonic arrangement (with a child-like melody creeping at one point to match the imagery), but there's no doubt that it is the sheer emotion of the singer that gets to you. That must certainly have seemed like a rare commodity back in 1983, when the detached vocalist was very much in vogue. Still, it is the manner in which Marillion overcome the limitations of their time and situation that makes this album special.While it is the title track that sold me, there's a wealth of good stuff here. He Knows You Know is a biting track held together by some really nice Mark Kelly synth lines. The Web uses interplay between heavy synthy section and light, relatively inaudible sparse passages. Kelly's synth playing on this particular song is arguably his finest hour with Marillion, and Rothery's solo is a relative masterpiece (I really think he's very overrated, by the way).I must say that the jerky Garden Party and seductive synth pop epic Chelsea Monday (which has a massive Rothery solo colouring most of the song) are both guilty of running on too long but the raging Forgotten Sons makes sure the album ends on a major high. The track is something of an anomaly, threatening to stray into both boogie and funk territory while remaining a vital, inventive anti-war rant.Once I was undecided, torn by a sentimental attachment to the third Marillion album Misplaced Childhood, but now I can confidently proclaim this one to be, hands down, the greatest album in neo-prog history. ... 76% on the MPV scale"
    },
    {
      "reviewer": "Starette",
      "date": "Posted Sunday, December 11, 2005",
      "rating": 5,
      "text": "This is an album that has captured my heart completely. I know Fish-era Marillion has been compared with Gabriel-era Genesis more than once but I'm inclined to see that as an inane statement. Sure Fish's voice is like Gabriel's but Fish is much more stronger, energetic in his singing. The painting of the face- well, you can't say Fish 'stole' that idea from Gabriel. It's just an extremely cool thing to do for a live performance! As for comparing Grendel with Supper's Ready.well.that can be debated. I like a band that can take its' name from Lord Of the Rings! The Silmarillion has been gathering dust on my headboard. ONE day.I might actually READ it! But if any of you know the style that J.R.R.Tolkien used in his writing, then you'll understand why I haven't started yet. I can't say any of Marillion's songs are very Lord of the Rings-ish as such.but the band name is random enough for me and I love it. There's also the idea floating around in the heads of a few people that this particular Marillion album has misogyny running in in its veins as a result of Derek Dick's (I can see why the poor, poor guy changed his name to Fish) bad experiences with women in his life. I admit that the man was a scary, wonderfully talented, somewhat emotionally-immature guy who probably did desire a girlfriend a little too much than he really needed to.but if THIS album has 'misogyny' in it then why am I listening to it? Of all people?? It's unrequited love- more like it. And frustration! The truth is that every single song is.depressing. Even the upbeat Garden Party has a dark undertone to it.Script for a Jester's Tear: Depressing indeed but so beautiful, so romantic. Goddamn weepy for anyone who's suffering unrequited love or has just ended a relationship. *A tear runs down my cheek at this point.* But I'll cut the cheez and assure you that I don't adore this song just because of it's sentimental value for me. \"So here I am once more- in the playground of the broken hearts.\" Piano chords and arpeggios played by Mark Kelly are always perfect for such a soulful start to a legendary song. Funny that- I've got a cousin called Mark and he also plays the piano like an angel! I've been to three different playgrounds since I first heard this song and \"I'm loosing on the swings, I'm loosing on the roundabouts\" always comes to mind. The guitar and synth-flutes bring out the slightly tragic playfulness of the theme: we're in a playground and \"The game is OVER!\" The words repeat and Fish sings with more and more passion. He sure knows how to throw his voice! Steve Rothery and his incredibly 80s electric guitar comes in. Remember- the 80s electric guitar is definitely a trait of Marillion all in all- mixed with keyboards and synthesizers in the background of course. This carries on for a while and the guitar improvises. But then it all dies down and an eerie keyboard dances in the background with the guitar as Fish practically mumbles: \"I never did write that love song, The words just never seemed to flow.\" Irony in lyrics= a lot of pathos= gooood. Did I mention that this song could be described as an 'Essay of Emotions'? \"PROMISED WEDDING NOW A WAKE!\" This is the catharsis of the song and something gets caught in my throat now whenever I hear it. My eyes tend to fill up. \"As you grow up and leave the playground where you kissed your Prince and found your frog- remember the Jester who showed you tears. The script. for tears.\" Amazingly tragic. Rothery's guitar moans and the 80s drumming of Mick Pointer (when you think about it, that's a pretty good name for a drummer!) keeps- up a constant beat at this point. Gorgeous. Teary. \"So I hold our peace forever when you wear your bridal gown, In the silence of my shame the mute that sang the siren's song has gone soloooooo in the game.\" The chordal progression repeats but you can't deny Steve Rothery's improving guitar. \"Can you still say you love me? Can you still say you love me? Can you still say.that you love me?\" I cannot emphasize how when Fish sings quietly, almost pitifully here, and then rises to a more passionate tone- it can stop me from breathing sometimes. After this- it fades out. The LEGEND of a song has now ended.He Knows You Know: Pretty-much the least like a progressive rock song on the album but it certainly has its' moments. Pete Trewavas plays a funky 80s beat on the bass all the way through which really stands out. The way Fish uses his voice in this song is also exceptionally lovely. If not frightening. The quiet transition, with a 'pumping' synth, very 80s, in the background, is one of the best bits. \"He's got experience, he's got experience, he knoooows you know.\" The way he both talks and sings the word \"problems\" is almost disturbing. But so incredibly awesome! It's heard so many times though. The synth-keyboard is the most impressive; going up a key with the electric guitar jumping over it. Another thing about Fish's voice in this song= he 'flicks' it! \"Pumping arteries ooze the problems through the gap in the razor claw, YOU GOT..\" Then the rest of the band's voices back him up. Rothery's guitar strumming toward the end of this song is gorgeous.And then comes the great Marillion moment found at the end of this song: the phone call for Fish. Altogether now: \"DON'T GIVE ME YOUR PROBLEMS!\" If you ask me- Derek Dick seems to give a half-hearted effort in this angry outburst. But he's more passionate in this singing than his acting- needless to say. It's still a legendary moment!The Web: *Flash!..Flash!..bang, bang, BANG etc.* The way the start of this song intrudes on the silence, straight after the He Knows You Know phone-call, is an instant thumbs-up. This anthemish song is, like the rest of the album, a melancholy one. I say this because of the lyrics, and the lyrics in this song are fantastic- all written by Fish as his first try at writing lyrics for the band. The way he sings his lungs out then resorts to mumbling at a few points in this epic is heart-rendering. Mark Kelly's synth-keyboard continuously goes down in this song and drags the whole band in tow (when you listen to it, you'll know what I mean) which singles this song out as the most capturing. In other words- it gains our attention instantly. \"And thus begins The Web.\" This song is most definitely Mark Kelly's baby- for not only does he control the synth but also the keyboard which dances over the top and improvises the whole way. \"The flytraps need the insects, Ivy caresses the wall, Needles make love to the junkies, The Sirens seduce with their call..\" Fish's voice has an echoing whisper for this part. His poetry is excellent. I also like the type of epic which seems to have the singer changing his mind about something in the lyrics: \"I realize I hold the key to freedom, I cannot let my life be ruled by threads..\" Also, note the allusion to Script for a Jester's Tear: \"I only laughed away your tears but even jesters cry.\" Fish sure likes his jester-imagery. He was an insane man, that one. Steve Rothery shows off on his guitar with various distortion- effects and Mick Pointer picks-up on the drums- changing to an 80's 'gunpower' tactic at one point. The words repeat after the guitar finishes its improvisation but the effects used on Fishes voice are different. Later things quieten down and the gentle synth 'pumps' again. Things get even more exciting (can you believe it?) when both the key signature and the time signature change in an unexpected place. Here, the keyboard gives us an even better improvisation than the first while the rest of the band work together underneath it. \"Decisions have been made, I've conquered my fears, all my fears, The flaming shroud.the flaming shroud! Thus ends the web, the web, the web, the web..*spoken* The Web.\" This is an optimistic song, in comparison with the others, but only if you look at it from a certain view-point: it's a song about getting things done.Garden Party: People talking.various conversations.a gentle synth- so typical of Marillion.then the drums and bass join in. \"Garden Party held today..\" This is the only slightly happy song of the album but the lyrics suggest how pretentious and wanky high-class parties in England are. Therefore- there's still pessimism here. Mick Pointer's complicated drumbeat is an impressive one. When the beat stops and all that we hear is Rothery's quiet acoustic with Fish singing \"Champagne corks are firing at the sun.again. Swooping swallows chased by violins.again.\" we find a perfect example of how Fish can moan, sing, yell and whisper at the same time. He gets even more bizarre later on. \"Oh God not again!\" I love the crescendo of the synth-bashing. It's very dancey and it makes me want to have a Garden Party for my 20th birthday all of a sudden. Strange-isn't it, how the lyrics of some amazingly good songs can enlighten us in making decisions. Another thing about this song= \"Social leeches. quoting Chaaaaucer!\" My dad was rather happy when he heard I'd enrolled at Uni for an English paper on Chaucer next year. On the other hand, he was a bit taken-aback when he heard I only made that decision due to the subliminal messages within an 80s rock-song. I don't care- I'm sure I'll enjoy that paper! And when I've finished it- maybe I'll find out where exactly that random quote said in the background comes from. Fish has such a beautiful vibrato in his voice. Again- Mark Kelly plays a tremendous solo on his synth-keyboard. \"I'm punting, I'm beagling, I'm whining, Reclining, I'm rucking, I'm f**king..\" naughty, naughty Fish! That's such an unexpected lyric, I suppose we'll just have to use our imagination to find out what it means. A dancey, almost cutsie invitation ensues: \"Garden Party held today they say, Oh please do come, Oh please do come, they say.\" The flashing of the synth echoes into the distance. This is definitely a fun song!Chelsea Monday: The sounds heard at the beginning of this track are very creepy. Fish's voice is heard constantly saying something- but rewound. Then the crawling- upwards arpeggios on the bass begin. Rothery's beautiful guitar and some tinkling 80s sound effects go over the top of that. This is a song about a girl who is \"Playing the actress in this bedroom scene, she's learning her lines from glossy magazines.\" There's one immortal and very repeated line I love: \"Patience my tinsel angel. Patience my perfumed child. One day they'll really love you, you'll charm them with that smile.\" This song seems gentle at first but it becomes very passionate after the guitar, with (as usual) the synth in the background, takes over and the whole band comes together. Then suddenly it changes key and dies down to an almost acoustic sounding guitar. This is later changed by what appears to be a havard organ and guitar playing the same tune over comes through. \"She'll pray for endless Sundays as she enters saffron sunsets!\" I suppose the point is that she's a very effeminate and yet very superficial and brainless young woman. Then, my favourite!!, an even better and even more sentimental, reminding one of the Apocalypse, chordal progression takes over. I know this sounds a tad strange but I tend to picture a girl with her arms stretched out and light coming out of her for this point of the song.but that's just me. What's your imagination like for this one? A man talks in the background- we hear part of a conversation: \"Hello John, did you see The Standard about four hours ago? Fished a young chick out of The Old Father. Blond hair, blue eyes, she said she wanted to be an actress of something. Nobody knows where she came from, where she was going. Funny thing was she had a smile on her face.she was smiling! What a waste!!!\" This confuses me a bit. Yes, we know it's about a girl who wants to be an actress but does she drown herself? Is she really insane the whole way through? The \"she was only dreaming\" at the fade out could even suggest she sleep-walked into the river. It gives you something to think about. I know a few actresses because I've worked with them. They're all potentially mad I think. BUA-HA-HA! Musician-ship-wise, this is probably Steve Rothery's big moment.Forgotten Sons: A tuning radio is heard with Market Square Heroes on one of the channels. Then the thumping beginning starts and it's VERY catchy! \"Armillite. streetlights.nightsights.\" It all seems very happy but the words suggest otherwise: \"Searching the roofs for a sniper.a viper.a fighter\" This song has been considered as relating to an IRA explosion in late 1983. The way the synth dances over and over reminds me of an Irish jig. While Peter Cockburn (what an unfortunate name!!) announces this piece of poetry, Fish practically yells it: \"Your mother sits on the edge of the world when the cameras start to roll. Panoramic viewpoint resurrect the killing fold. Your father drains another beer, he's one of the few that cares, Crawling behind a Saracen's hull from the safety of his living room chair. Forgotten Sons. Forgotten Sons. FORGOTTEN SONS.\" Rothery's distant guitar plays the whole way through this- very stylie! Then he goes solo after Fish and Peter finish their 'soliloquy'. After this solo- a chanting section begins: \"And so as I patrol in the valley of the shadow of the tricolour, I must fear evil.\" Gunpower- drums and elec-guitar sound in the background. Should I say this part is a bit pretentious? My thoughts are varied on this. Fish is certainly INSANE in this one. One bit of drama: \"Halt! Who goes there?\" *spooky whisper* \"Death.\" \"Enter friend..\" The guitar towards the end is repetitive but the melody is beautiful. We hear a trumpet in the distance and then an echoing-effect guitar as he sings: \"You're just another coffin on its way down the emerald aisle.\" Then the little boys from the Marquee Club Parents' Association Children's Choir come in and sing their part! Are they symbolic of the ever-sung-about 'forgotten sons\"? leave that to the decision of the listener. The song isn't *that* long- only lasts around seven minutes and it ends on an upbeat (a major chord).Overall, I am now a very proud-to-be Marillion fan. Neil from the 'Young Ones' likes Marillion too! We all need to bring out the dirty hippy in ourselves. The best tracks in this album are definitely The Web, Garden Party and Script for a Jester's Tear. If I could sum-up Marillion (after listening to this album and Market Square Heroes, Three Boats down from the Candy and Grendel *so far*) in three main parts, they would be: Fish's energetic and somewhat frightening voice, a repeating synth often in the background, and a wonderful guitar solo. I don't care about all the claims that they're a blatant rip-off of Genesis, they're too fantastic! The best 80s prog in a nutshell."
    },
    {
      "reviewer": "ClemofNazareth",
      "date": "Posted Tuesday, December 20, 2005",
      "rating": 5,
      "text": "The year was 1983. Music charts were filled with what we would later come to realize was some of the worst music ever committed to vinyl – Michael Jackson, Culture Club, Wham!, Spandau Ballet, The Eurythmics, Paul Young, Men at Work… heavy drinking and depression seemed to be the only answer.And to make things worse, all my mystic heroes from our days of musical nirvana were abandoning us in search of pop stardom and fleeting fame – Genesis, Kansas, ELP, Yes, Pink Floyd, and King Crimson were all laying down turds they would spend the next decade trying to distance themselves from. I was spending my days trying to find some comfort in the modest efforts of Asia, Saga, and the technically excellent but hard to stomach Rush, wearing out all my old albums, and trying to get through the long, cold winter in my college dormitory with some semblance of sanity intact.Then, as the snow gave way to early spring, I happened across a most unusual import album cover on a fresh-air trip to my local new & used record shop. The cover showed a creepy-looking, caffeine and cigarette addled jester clutching his violin and struggling to pen the notes to some (presumably) brilliant and angst- ridden epic. I spent hours just studying the album artwork after shelling out $10 to make it mine. The crinkled up parchment with the lyrics to Yesterday lying in the violin case; the out-of-place horned lizard perched on the hard-backed wooden chair; the magazines, newspapers, and album covers strewn about the back cover (including what appears to be a copy of Floyd’s A Saucerful of Secrets lying on the floor). Who the hell were these guys, and what was one of their albums doing in a neighborhood record shop in Wichita, Kansas?So I played it. And played it. And played it. Couldn’t get enough. The voice of Fish was haunting, abrasive, strident, but most of all intoxicating. This was a guy who was really going through some kind of mental distress, and I could feel it in every note. The production was crisp, clear (compared to the muddy mixes of the 70’s I was used to at the time). The spitting contempt in lines “To eliminate those who would trespass against you” and “Death in the shadows he'll maim you, he'll wound you, he'll kill you for a long forgotten cause” on Forgotten Sons, and the interspersing of snippets from the Lord’s Prayer and Hark, the Herald Angels Sing were poignant and sobering. Here was an anti-war song nearly a decade after our Vietnam War, and long after similar sentiments from Lennon, CSN, Joan Baez had faded. The band wore it well, and convincingly.The posers in the Garden party filled me with contempt, representing all those pretentious, condescending bastards I waited on in restaurants and got cut off by on the freeway, primping and sneering as they moved through life on a different plane than the one I knew and struggled to survive in.The line on Script… – “I never did write that love song, the words just never seemed to flow”, was so haunting and reminiscent of the aftermath of every lost love from my younger years that I must have played that track a hundred times, and each time it spoke in different ways. I had written those words myself, in my dreams, over and over – and now I was hearing them in the flesh.He knows, you Know was a jumble of pain, misery, fated thoughts, and words that meant nothing, and also everything, flowing through my head for weeks –“Blank eyes / purple fever, streaming through frosted pane You’ve learned your lesson far too late from links in chemist chain; You've got venom in your stomach, and got poison in your head, You should have stayed at home and talked with father - listen to the lies he fed”What the hell did it mean? What difference did it make – the pungent smoke made it all the more clear, and more cryptic at the same time.The songs were all long, wandering, introspective, brooding, just what I needed to disappear into and escape the fast-changing world around that was fast ceasing to make any sense. The earth Moms and happy times, hippy love, the innocent naivety of the flower children, was slipping away fast, replace by pastel-clad, self-absorbed plastic people of the sort Frank had warned us.But this was real, spoke volumes, and was mine. These songs and the warming sunny days of spring were dismal and exciting at the same time. Things were changing, but that was okay, I guess… Not like I (or anyone else) had much choice. Time marched on, and so did I.“Decisions have been made, decisions have been made I've conquered my fears, the flaming shroudThus ends the web”peace"
    },
    {
      "reviewer": "Andrea Cortese",
      "date": "Posted Thursday, December 29, 2005",
      "rating": 4,
      "text": "\"So here I am once more in the playground of the broken hearts / one more experience, one more entry.\"I've started to listen to Script from the last june and I was initially a little bit disappointed! In fact I'm not really an \"aficionado\" of neo-prog genre. by the way I have to admit that this album, at each time I listen to it, amazes me ever more! That's not for the (obvious) Genesis' references which seem to be the fundaments of this 80s prog re- birth. In fact I feel there's a great injection of originality in Script for a Jester's Tear due to the fact of the unique vocals provided by Fish, its most precious trademark, also due to the fact of the master hands of all the band members who created these stunning arrangements, running keyboards and convincing guitars, almost perfect drumming!The opener track is a perfect introduction and it's nowadays my favourite Marillion's track. Warm atmosphere and strong poetry is sparse in all the of the album's compositions, from beginning to end!Yes, I like it!As a debut-album it is powerful, sometimes dark, in a great symbiosis with the nice cover, rich of particulars. What a pity I still don't own the 1997 remaster cd edition (with all that interesting bonus material)!"
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Wednesday, February 15, 2006",
      "rating": 5,
      "text": "The late Seventies and early Eighties were very poor times for me and my friends as '24-carat symphonic rock'freaks: Love Beach by ELP sounded almost as crappy as the cover looks, Roger Waters had left Pink Floyd and Genesis and Yes had jumped on the 'pop-prog' bandwagon... but then there was Marillion. At first we nailed them as a blatant Genesis-rip off, mainly because of the similarities between Grendel and Supper's Ready on their min-LP Market Square Heroes. But on this new album we discovered that Marillion had so much more to offer than Genesis echoes (the twanging acoustic guitars, Fish his voice, the organ runs and the synthesizer flights that often reminds me of The Lamb). When I noticed this just released album in my favorite record shop Supertracks in The Hague it was love at first sight: the wonderful artwork by Mark Wilkinson (layered with mystical associations), the poetical lyrics (\"yet another emotional suicide\", \"catalogue princess, apprentice seductress\" and \"who order desecration, mutilation, verbal masturbation in their guarded bureaucratic wombs\", splendid words!) and the amazing equipment like the Rickenbacker bass, Yamaha SG guitar (like Steve his hero Carlos Santana) and Minimoog synthesizer, could it go wrong with all these ingredients?No! From the very first moment on this pivotal neo-progrock album you are carried away to the wonderful and compelling world of early Marillion. Four long captivating compositions and two short, catchy songs. Fish delivers inspired, often emotional vocals and beautiful poetical lyrics. Steve Rothery his guitar work(between Hackett, Latimer and Gilmour but with the emotional overtones from Santana) is very powerful with lots of great, very sensitive soli. The keyboards from Mark Kelly range from tender piano and harpsichord to flashy Minimoog runs and bombastic eruptions on his Yamaha and Roland synthesizers. Peter Trawavas plays fluent and propulsive, only Mick 'E.T.' Pointer his drum work sounds sometimes a bit too tight. My absolute highlight is Forgotten Sons, Fish his statement against the UK policy in Northern-Ireland: Marillion succeeds in a very emotinal and compelling way to translate that tension, anger and sadness into a mindblowing epic composition with one of the emotional 'grand finales' in the progressive rock history: \"for a second you'll be famous but labelled posthumous\" ... it's about Northern Ireland but \"l'histoire se rep�te\": Vietnam, Afghanistan, Irak and all those many other countries were young soldiers were, are and will be manipulated by governments that are only interested in money and selling oil and weapons ...\"Peace on earth and mercy mild, Mother Earth is loosing her children\" ...."
    },
    {
      "reviewer": "E-Dub",
      "date": "Posted Monday, February 27, 2006",
      "rating": 4,
      "text": "First and foremost, I'll not even get into the unfounded Genesis comparisons. Although Fish can be somewhat compared to Peter Gabriel in sound and stage presence, Marillion and Genesis really don't sound that much alike. Not so much that deserves so much discussion.Kicked off by the title track, everything about \"Script\" is emotional. From Fish's amazing lyrics and vocal output to Rothery simply punishing the guitar, it is truly a song for the ages. The only problem is Pointer. Marillion made such an upgrade in sound with Ian Mosley replaced Pointer. Live versions after Mosley's dismissal are much more fluid. Especially the beginning when Kelly and Pointer keep time with one another.\"He Knows You Know\" is a classic example of how underrated Mark Kelly is as a keyboardist. Great textures about three minutes in, with Rothery tearing off (yet) another memorable solo. This tune just has a nice driving beat and Pointer actually sounds decent with his kick drum work.\"Garden Party\" gets a bit cheese laden at times, but it's got some nice work by Trewavas and Pointer, keeping impeccable time. I do prefer the way Mosley handles the later live versions, however. Much more of a fluid drummer than Pointer.\"Forgotten Sons\" is a pretty powerful anti-war track. Very haunting vocals by Fish, but could've done without the little \"Although I walk in the valley of death...\" part in the middle; however, everything else about the track is very moving. Again, I can't say enough about Rothery's guitar solo and lazer-like slashing in the middle. Such an underrated guitarist.I'll always be a Hogarth follower; however, I can't dismiss the work of the Mad Scotsman. A masterpiece will be created a couple of years down the road in Misplaced Childhood; however, Script really laid the foundation of years of memorable music created by a group of very underappreciated musicians."
    },
    {
      "reviewer": "sleeper",
      "date": "Posted Friday, June 2, 2006",
      "rating": 5,
      "text": "Script for a Jesters Tear is the debut album of five-piece Neo-prog band Marillion, the album that thrust prog back into the public conscience and effectively started the Neo-prog boom of the 1980's early 90's. So after more than 20 years, what can one say about this album?The most obvious stand out is Fish. He has a singing style that is incredibly theatrical, in fact he is the closest anyone has got to singing like Peter Gabriel, though he uses this style in a completely different manner, more like that of Peter Hammil, and accentuates it greatly. And I love it, he communicates the feelings, even imagery, that he instils into the songs brilliantly, a charismatic front man if ever there was one.Its not just his singing style that dominates this album, he proves to be an impressive song writer as well. The main basis for this would be his self destructive lifestyle witch lends itself brilliantly to the themes of the songs here. Speaking of the themes, a lot of these songs focus on the individual, with Garden Party and Forgotten Sons being the exceptions. In Script for a Jesters Tear he sings about himself, how he played as the class joker in an attempt to deflect criticism of his size and the fact that he was on the social boundaries. He Knows You Know was about his drug and alcohol abuse, The Web about infatuation with someone (at least that's what I get from the lyrics here) and Chelsea Monday is the search for fame. What makes these lyrics so special is that they weave a story, seemingly giving the album characters, and character, to really think about, that leave a lasting impression in your mind.Musically this band rocks in most quarters, with Rothery immediately marking himself out as one of the most emotional guitarists of the time, each riff, lick, solo suit's the song brilliantly. OK, he's not the most technically gifted guitarist of all time but that doesn't matter here, his guitar lines aren't overly simple and they work around the keyboard passages to add a real sense of feeling.Mark Kelly's keyboard lines move between slow, simple backing to Fish's voice to powering the atmosphere behind the solo's of Rothery or leading the melody. Not a lot needs to be said here, he's just extremely well suited to this style of music, you just have to hear the songs to find what he adds.Pete Trewaves is probably the stand out musician of this album, he has a unique and powerful style of playing bass that drives the songs forward. Sadly, Pete's partner in the rhythm section, Mick Pointer, was not quite up to the task. His drum lines are acceptable but his eventual full time replacement Ian Mosley would have done much better here. Because of this its Pete's bass work that holds the songs together more than the drums, but having said that, Pointers work isn't inappropriate, it just lacks a technical edge that many other drummers have.Overall this is quite an amazing album, most definitely one of the strongest debut's in the prog world, and historically the album that kicked the Neo-prog movement into high gear, even if it wasn't the first one there. Despite its flaws in the rhythm section, this album is stunning because of its immaculately formed songs and deserves everyone of the 5 stars."
    },
    {
      "reviewer": "Australian",
      "date": "Posted Monday, July 31, 2006",
      "rating": 3,
      "text": "Script for a Jester's Tear for me falls into the same category as Minstrel in the Gallery and Songs From the Wood, they are very good but not quite masterpieces. Script for a Jester's Tear shows Marillion at the height of their power, excellent compositions, musicianship and ideas all contribute to the overall quality of the music on this album. MArillion is a very Genesis sounding band, but they aren't all out copies as they also combine more modern rock with Symphonic Prog.The result is very good and there are some very memorable moments on Script for a Jester's Tear. The guitar work on Script for a Jester's Tear is one large difference between Marilion and Genesis, MArillion's guitar passages are generally heavier and more dominant. While Genesis seem to relay on them more as fillers. The Vocalists are very similar, which isn't a bad thing as they are both very good singers. I only wish Fish would sing in a Scottish accent as it sounds good and add character to the music.Synthesizers and Keyboards are a very important feature of Script for a Jester's Tear and they succeed in creating haunting and strange sound scapes. The sound of the Synthesizers on Script for a Jester's Tear sound much more modern, if you get my idea. But there are a few good old style mini-moog (at least I think It's a mini-moog) solos here and there, the solo on the Web comes to mind.Script for a Jester's Tear is perhaps the best song on the album; it is a very progressive song which follows the same basic pattern as many other prog songs. There is a fantastic guitar solos and the closing section of the song is very good. The other highlight of Script for a Yester's Tear is the Web which is another very proggy song. The other songs on the album aren't quite as impressive but are still excellent. The synthesizer work on The Web is a highlight of the album, it is spectacular.1. Script for a Jester's tears (4/5) 2. He knows you know (3/5) 3. The web (4/5) 4. Garden party (3/5) 5. Chelsea Monday (3/5) 6. Forgotten sons (3/5) Total = 20 divided by 6 =3.333 = 3 starsGood, but non-essentialScript for a Jester's Tear is in summary a very good album but is not quite at the masterpiece level, but hey, it still is an excellent album and it is very high on the PA top 100. I'd recommend Script for a Jester's Tear to all symphonic fans as it is very interesting to see a more modern approach to classic prog."
    },
    {
      "reviewer": "Raff",
      "date": "Posted Tuesday, August 15, 2006",
      "rating": 4,
      "text": "The album that, according to many critics, resurrected prog in the early Eighties, \"Script for a Jester's Tear\" is (in my very humble opinion) the best Fish-era effort from Marillion. Though accused by many of being mere Genesis clones, the British five-piece were in fact more original that that, as well as considerably darker. There is nothing in Genesis' output that can compare to the unrelenting gloom of the tracks, with even the apparently lighter-hearted \"Garden Party\" being a corrosively ironical indictment of British upper-class society and manners. Fish's dramatic, sometimes exaggerated vocals do not recall so much the more understated Peter Gabriel (besides a very slight similarity in timbre) as Peter Hammill's all-out theatrics. The same can be said for his lyrics, which rank indeed among the most impressive in prog, though sometimes - just like his vocals - they can border on the overblown.The title-track opens the album in a quiet, nearly understated way, with Fish almost whispering the words, before the band kicks in with a great guitar performance by Steve Rothery. The following song, \"He Knows You Know, released as a single, could be awarded the prize of the 'commercial' song with the darkest, most despairing lyrics ever - a deeply disturbing tale of drug addiction punctuated by dazzling keyboard work by Mark Kelly. Lengthy \"The Web\" is probably the proggiest song on the album, but also the least memorable to these ears - it definitely goes on a bit too long, though the performances on it are excellent.Venomous \"Garden Party\", with its staccato rythm, sweeping synths and Fish's deceptively humourous vocal delivery, lightens the musical (if not the lyrical) mood - before the band plunges into misery once again with the chilling, all-too-credible tale of a girl's wasted life that is \"Chelsea Monday\". A cautionary tale for all those young women who live vicariously through celebrities and glossy magazines, waiting in vain for fame and fortune, it is a musically simple piece, enhanced by Fish's poignant vocals. The best track on the album, however, is saved for last, with \"Forgotten Sons\" - a haunting, bitter indiction of the tragedy and waste of life that is the ongoing struggle between Catholics and Protestants in Northern Ireland, ranking alongside The Police's \"Invisible Sun\" as the most memorable song on this tragic situation. The song opens with a strong rythmic beat, with Fish singing almost hysterically; then, a soaring Rothery solo leaves room for a chanting, almost whispered section in which Fish, backed by an almost military drumbeat, rants against the choices of the British government. The song climaxes with another beautiful, atmospheric guitar solo, and Fish's stark, poignantly true final words: \"Peace on earth and mercy mild/Mother Brown has lost her child/Just another forgotten son\". Easily the best Marillion song ever.Fish-era Marillion cover art is undoubtedly not to everybody's taste, and in sharp contrast with the minimalistic style favoured by most Eighties bands. However, I find that its larger-than-life, gaudily coloured imagery suits the lyrical and musical content quite perfectly. Though \"Script for a Jester's Tear\" may not be a full-blown masterpiece, it is almost required listening for everybody who is keen on understanding the evolution of prog from its Seventies beginnings to its contemporary developments. For all that Neo-Prog may be an acquired taste and much too derivative for some, it is a phenomenon that cannot be ignored - and it does not come much better than this album."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Sunday, October 15, 2006",
      "rating": 4,
      "text": "I wonder how many GENESIS fans jumped ship to this new band called MARILLION in 1983. IQ released \"Tales From The Lush Attic\" the same year. As a prog fan I have so much respect for these guys.To see many of the seventies greats change to what was fashionable back then.Then along comes this new band to take up the mantle of progressive music, at a time when it was not the popular thing to do. In fact i'm sure a lot of industry insiders felt they were committing suicide with their careers. Funny thing was that they even gained some commercial success with this new take on seventies prog. On this their debut album the star of the show is no doubt FISH with his animated vocals and fantastic lyrics, he drew a lot of attention to the band. The lyrics are emotional, thought provoking, very personal and dark. He sings about love, drugs, society, suicide and politics.To hear the self titled track open this record is so inspiring to me. I can't help but think of Peter Gabriel when Fish opens the song with those reserved vocals. It kicks in at 1 1/2 minutes.Great sound 2 minutes in. Check out the chunky bass as Fish sings with emotion. I have to mention Steve Rothery, the guy can flat out play and he really has his way with his guitar on this first track. I like when it settles 4 1/2 minutes in, i'm reminded of the intro. Kicks back in. Such a great track ! \"He Knows You Know\" becomes bombastic with Fish spitting out the lyrics. A calm before 2 minutes then it kicks back in with some excellent synths and bass. Guitar follows lighting it up. \"The Web\" is my favourite track on here.The moods change often and the main melody sounds so good. Love the guitar 4 minutes in.\"Garden Party\" opens with the birds chirping and people talking. Hey it's a garden party ! The song changes from bombastic to mellow quite often. Fish gets theatrical later on. \"Chelsea Monday\" is such an emotional song, and Steve has a lot to do with that with his weeping guitar that is so sad, until it turns into an uplifting, soaring solo after 2 minutes. Pure emotion right there. Check out both Fish and Steve after 5 1/2 minutes. \"Forgotten Sons\" is Fish delivering a theatrical vocal display. Some spoken words as Fish says the same words in the background with passion. Some nice bass and guitar follows. Best part of the song for me is before 6 minutes to the end. The guitar soars and Fish sings. The perfect ending.This album isn't without it's faults but it's a classic that breathed life into the dying progressive music scene and at the same time helped spawn a new genre."
    },
    {
      "reviewer": "octopus-4",
      "date": "Posted Tuesday, October 31, 2006",
      "rating": 2,
      "text": "After releasing some good singles, Marillion decided to release their first album, but it was too soon. The title track wants to be a suite, but there's nothing really good in it. He knows, you know.. - Nobody knows why they included this track. Anyway, Garden Party is a good song, but I enjoyed the live version on Real to Reel more than the studio version. The same about Forgotten Sons, that's a real masterpiece and pay you back the price of the album. I should rate it 2,5 because 3 is too much."
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Saturday, November 4, 2006",
      "rating": 5,
      "text": "The year was 1983. Progressive was a genre forbidden to be talked about in the press at the time. Or so it seems. Nevertheless for some musicians it did not matter. Music came first and if some punters decided prog was no more, then some would prove them wrong. And Script For a Jesters Tear was one of the first and surely the strongest one to emerge that year, showing the world prog music was alive and well and having a great breed!.I still remember how I felt at the time as the sole human being who still enjoyed prog music. When I heard this album I was completely bowled over. Yes, the singer has a voice so similar to Peter Gabriel it misled a lot of people to believe they were copying early Genesis (some very ignorant ones still do!) Poor Fish! Was he guilty of having a similar voice? But the music was quite original, exciting and new. The lyrics were so unique! Fish proved to be one of the true poets fo his time (Twelfth Night's Mann was another). Every track here is a gem. Contrary to Genesis fantasy stories, the subjects here are much more down to earth, dealing with drugs , personality crises, the irish conflict, the hollywood lure, etc. All songs are wraped up with great melodies, the band played brilliant and unlike 70's too much keyboard oriented work, this new british acts would give the guitar a proeminent play.This album is a a neo prog classic and worth all the praising it has been giving since its release more than 20 years ago. No wonder Marillion was considered the main figure of the neo prog movement. How many bands star with a work as powerful as this one? And how many delivered such great albums in a row? (I'm talking about Marillion WITH Fish, of course). Highly recommended to anyone who likes prog music in particular or good music in general."
    },
    {
      "reviewer": "1800iareyay",
      "date": "Posted Tuesday, January 9, 2007",
      "rating": 5,
      "text": "Script For a Jester's Tear is the first full length album from neo-prog pioneers Marillion. This one album launched an entire movement, a fact that always impresses me. The band takes almost all of its sound from Gabriel-era Genesis, but they do not rip off their idols. Fish's thoughtful and metaphorical lyrics are as strong as Gabriel's but they are much more bitter. Rothery's style is identical to Hackett's, but he stands out whereas Hackett blended in with Tony banks' keyboards too often. Trewavas is slightly better than Rutherford. Pointer and Kelly sound too much like Collins and Banks, but they are not blatant rip-offs.The songs on Script are not epic in length, but they are longer than the majority of the songs being written at that time or even now. Every song has an inventive arrangement. The album is sort of a big breakup song, only the couple was never together. It is a tale of unrequited love, and Fish fills his lyrics with his trademark irony. The concept follows a poet's unrequited love and its effects on him. The title track starts things off softly until Trewavas enters. Rothery's decent solo arrives and raises the bar. It's more moving than technical, and it stays true to the symphonic soloing of Howe and Hackett, not taking up too much room. The difference is that his guitar sound much more modern than Howe or Hackett; Steve cements his 80s guitar in Marillion's sound on this song.He Knows You Know deals with the poet using drugs to give him an escape from his sorrow. I like Trewavas funky bass on this, but the track didn't grab me for a long time.The Web is my favorite song on the album. Rothery's solo is superb, and the poet ponders whether he should move on.Garden Party shows that the poet decides to leave his pain behind him and mingle with society. Fish viciously attacks the hypocrisy of society on this number. I have a feeling Oscar Wilde would have loved this song, and the whole album for that matter.Chelsea Monday directs Fish's rage towards high society women. The poet pictures the perfect societal woman as one who essentially lives her life out of fashion and other wemen's magazines so she does not have to live her own life. The arrangement on this track gives me the creeps.Forgotten Sons shifts the attack now to politics and the subject of war. The poet wonders why young men and women must die for their governments; Gatot says it also deals with the IRA's attack on the Harrod's department store. Then Fish gives a manifestation of man's interal conflict with himself. Primal instincts vs. intellect and morals, etc.The flaw of this album is that concept sort of slips. We go from unrequited love to pondering war. However, Fish does manage to tie it all in, and the result is a triumph of prog. Though not as good as Mispalced Childhood, this album is a must own.Grade: A-"
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Thursday, March 29, 2007",
      "rating": 3,
      "text": "While not quite the masterpiece many claim it to be, \"Script\" is still a solid album-- but really only when one considers that: this is the first piece of \"progressive\" music to come around for a while, and that it is from a band which is very much in its infancy. When compared to the band's later, Fish-era albums, \"Script\" can be seen for what it really is: experimentation, and an attempt to discover a unique sound.That being said, it is still a great example of the times and of \"neo-prog\". Fish's vocals are reminiscent of Gabriel's, but lack control; fortunately, he is a passionate and emotive singer, and even though he sometimes sounds a little goofy, it doesn't detract from the music. The rest of the band itself plays well given their burgeoning style, but aren't as cohesive as they will be on later albums. Along with the dramatic title track, \"Garden Party\" stands out as the most interesting tune.Marillion's early, melodramatic, and emotional album isn't perfect, but its probably the most accessible and enjoyable of the progressive revival.Songwriting: 3 Instrumental Performances: 3 Lyrics/Vocals: 3 Style/Emotion/Replay: 4"
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Thursday, April 5, 2007",
      "rating": 3,
      "text": "BeginningsFor many, the best of the Fish-era albums and without a doubt a very enjoyable album. Obviously I'm in the minority as to the importance of Marillion, but I do respect that they carried the torch during this somewhat bleak period.I saw the band live twice during this period and what struck me was how little they seemed to enjoy themselves onstage. Fish especially looked like he couldn't wait to get off the stage. There was almost no interaction between the members, no smiles, little enthusiasm. The crowd was definitely appreciate though, and I enjoyed myself too. The first time I saw them was opening for Rush. What a double bill! The second time, during the Clutching tour, the band played all the new material and not even one song from Script. While the audience was calling out for Script and unhappy about not hearing any, I thought it was really brave of the band to stick with the new material.There's not much need to break down the songs as it has been done many times by others. They are high quality, well composed, and well executed. The title track is a classic in any time and I'd never deny them that. 3 1/2 stars."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Sunday, April 22, 2007",
      "rating": 5,
      "text": "I could hardly have chosen a better album for my four hundredth review on PA (a lot more to come). As I have mentioned in some other reviews, I stopped listening to prog music from 1978 to 1996. I had actually no idea who Marillion was till the year 2001. A colleague of mine leant me \"Misplaced Childhood\" and here we go...I purchased the single CD version of \"The Script\" in 2003 and I couldn't believe my ears. Yes, I have LOVED Genesis (and still do of course) like a maniac in some ancient times and no, I have no problem with a band sounding as Genesis when the level of the songs are of this caliber.There are not a single weak moment here. All compositions are brilliant. Kelly on the keys is outstanding, both Pointer and Trewavas offer a solid rhythmic section, Rothery's work is subtle and so pleasant.Then, Fish. He makes my flesh creep (especially on this first officail release). And I'm listening to him while I write. Yes, he sounds as Peter, and yes, he knows, you know. Actually Fish gave a try at almost all the instruments because he wanted to be in a rock band. But he was by no way gifted. Then, some friends told him he should try the vocals since he had some similaritites with Gabriel while he was humming. He was very proud of this. He liked Genesis, and Yes (hence his nickname : Fish; partially because he was a fan of Chris Squire). The other origin of his nickname goes back, apparently, straight to his youth during which he would spent endless times in the water of his bath...To find a better track than another is very difficult here. The title one maybe with this delicate voice ? Or \"Chelsea Monday\" with this wonderful guitar and mellotron sound ? Or \"Garden Party\" with these aerial vocal passages and its strong instrumental ones ? Or \"The Web\" with this great guitar break ? Or \"Forgotten Sons\" and this background riff at times sounding like \"Watcher\" and the incredible final section ...Throughout the album, rather intricate lyrics have also contributed to the filiation with Gabriel.All this work is so nice and melodious than any Genesis fan couldn't resist I guess. At least I couldn't. Almost thirty years later. \"He Knows, You Know\" is maybe the least achieved number : but still, it is a good one. The proof of time did not have any negative effect to this fantastic album, like the greatest ones to which it belongs.What is also remarquable, is that Marillion put a lot of attention in the design of their sleeves (albums, but singles as well). An incredible look really. From their logo to some Fish's costumes.A year later, in 2004, I was already in my Marillion mania period and I purchased the double CD (24 bit digitally remastered). This is another great habit from the band. They will re-release almost (if not all) of their earlier recordings with a complete bonus CD (not one additional and miserable track or two of little interest like it is mostly the case). No, what you get there is truely another great FIFTY additional minutes of fabulous music.Alternate versions of their single \"Market Square Heroes\" as well as for \"Chelsea Monday\". Another of their single is featured as well in an alternate version : \"He Knows You Know\", the very nice B-side \"Three Boats Down From The Candy\" and finally \"Grendel\".I just love this number. Of course, at times it sounds as \"Supper's Ready\". But it is also a sublime track. One of my fave of the band. It is very much the central piece of this double CD set. IMO, it superseeds all the other numbers (even if lots of people do not like it because of its \"Supper's Ready\"'s cloning.What else can I say ? If you have not listened yet to this masterpiece of prog music, you only have one thing to do : buy it, lend it, rob it. But do get it !If you have read my reviews of the last seventeen bands I have commented, you know that I do it vertically. Meaning from start to finish. Almost all the way through. This will be a marvelion travel.Five stars, of course."
    },
    {
      "reviewer": "obiter",
      "date": "Posted Saturday, August 25, 2007",
      "rating": 5,
      "text": "Market Square Heroes/Three Boats/Grendel whetted my teenage appetite. My local stores did not have Script and I first saw it (and bought it) on a day trip to Bath while on school hockey tour to Cheltenham/Monkton Coomb/Dean's Close. Ten days of waiting to play it were rewarded as a bunch of spotty mates called round to listen to the latest offereing from the Scottish wordsmithand the English band.We heard a melancholic album, introspective, emotional and dramatic. This was an album that has resonated for me: a few years after its release I was attending Garden Parties by still (heavily polluted) Cam waters while studying at Cambridge: at home during vacation I listed to the band playing Forgotten Sons at Maysfield Leisure Centre a few weeks after a family friend was murdered by the IRA. This was not, and is not, a detatched musical piece. It confronted real contemporary political issues. No punches pulled. It satirised the elite. (always an easy target). Maybe this is lsot on the present generation. Forgotten Sons stands the test of time. SLF wrote many but they were from Ulster and saturated in the political ethos.it's definitely in my prog desert island discs let alone a 5 star."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Monday, September 3, 2007",
      "rating": 2,
      "text": "This album has been a mystery to me for over twenty years. Why do people like it so much?Perhaps I can supply an answer. It was issued in the same year that GENESIS and YES supplied the market with albums seen as betrayals of progressive sensibilties ('Abacab' and '90125' respectively). And look, here's a band playing like they were GENESIS from the 1970s! No wonder the progressive community lapped MARILLION up, to the point of inventing the perfectly silly genre title 'neo-progressive' to describe this so-called renaissance.Trouble is, I did not share the progressive community's opinion. I found both '90125' and 'Abacab', while not either group's best work, to be perfectly acceptable offerings. This, on the other hand ...I wish I could share your fun. I must say I rate 'Misplaced Childhood' very highly because of its integrated approach, and parts of 'Fugazi' appeal to me. I'm also a fan of HOGARTH-era MARILLION. This album, however, frustrates me. Everything is so obvious, nothing has any hidden depths, nothing invites me back for a second listen. I give it a spin every year or so, and I've yet to discover anything of interest. In fact, I listened to it three times over the weekend before writing this review. So, how does this album compare to those of their '70s heroes? Well, FISH'S obvious influence (to VAN DER GRAAF GENERATOR fans, AT LEAST) is PETER HAMMILL, and Derek Dick is no HAMMILL. He struggles to sing (though he gets better on subsequent albums), and his lyrics are just too trite for the genre. Mick POINTER is definitely no PHIL COLLINS ... need I go on? There isn't a song here that can hold a candle to the acerbic lunacy of 'Lemmings' or 'Plague', or to the sweet melodies of 'Firth of Fifth' of 'Entangled.'There are many other incongruous aspects to this band and album. MARILLION take their name from J.R.R. TOLKIEN'S masterwork, 'The Silmarillion', yet they seldom if ever reference fantasy motifs. What an odd choice of names for blue-collar proggers.I respect the consensus of the progressive comunity, and acknowledge that in most people's eyes this is a five-star album. But it's important to have a variety of opinions, so here's mine. If you love melody and beauty above all else in your music, I fear this album may disappoint you, as it did (and does) me. On the other hand, the weight of evidence suggests that if you are a fan of '70s progressive music, you'll enjoy MARILLION'S first four albums, this included."
    },
    {
      "reviewer": "progaardvark",
      "date": "Posted Monday, September 17, 2007",
      "rating": 5,
      "text": "With progressive rock dying a quiet death in the late 1970's, and ultimately when foundation groups like Genesis and Yes switched to radio-friendly AOR/pop music by 1983, along came Marillion. Marillion's debut album Script for a Jester's Tear was the lone beacon of hope for prog rock in the 1980's, amidst a sea of digital pop songs, drum machines and an endless wallpaper of MTV videos. It actually did quite well in the U.K. considering the time period, but was basically lost in the U.S. (Indeed, I myself only discovered it 13 years later). Marillion started what would later be called the neo-progressive movement, a long list of bands chiefly influenced by Genesis, Yes, and symphonic prog rock, but with varying doses of AOR sensibilities allowing much of their material to be more \"radio friendly.\" Unfortunately very few of these bands ever got any radio airplay, especially outside of the U.K.Marillion's Script for a Jester's Tear is the foundation of neo-progressive rock, the ultimate pinnacle of this much maligned sub-genre. Led by vocalist Fish, Scotland's answer to Peter Gabriel, the group would construct some of the most thoughtful and compelling lyrics and subject matter since pre-Lamb Genesis. Keyboardist Mark Kelly became the 1980s answer to Tony Banks, though tended to focus more on atmospherics then solos. Script for a Jester's Tear has some of the lushest synths I've ever heard (like Genesis meets Eloy), and it's nice to hear more analogue synths then the digital ones that became so prevalent during this time. Steve Rothery is quite a skilled and competent guitarist, not quite in the same league as the prog greats, but very respectable nonetheless occasionally suggesting a Gilmour influence here and there. Drummer Mick Pointer is exceptional, though I don't think Marillion makes as good use of his skills as he would show later when he joined Arena (Pointer would leave after this album). Finally, the group is complete with excellent bassist Pete Trewavas.Each song on Script for a Jester's Tear is a masterpiece, musically and lyrically. It is probably the best symphonic prog rock album released since Close to the Edge and Selling England by the Pound. Well deserving of five stars, a must-have for all symphonic and neo prog fans, and a historically significant contribution to the genre."
    },
    {
      "reviewer": "Angelo",
      "date": "Posted Friday, September 21, 2007",
      "rating": 5,
      "text": "Almost perfect... or just perfect?Marillion was introduced to me (or I was introduced to them) by my old table tennis coach. He always thought that Marillion would be too mind boggling for me, the 17 year old Rush, Metallica and Iron Maiden fan in the second half of the eighties, but one day I visited his home and he was playingClutching at Straws- which was just released at the time. I borrowedMisplaced ChildhoodandScript for a Jester's Tearand on my next visit we enjoyed theLive at LoreleyVHS. I was hooked - and then suddenly Fish left. Luckily, the guy stayed long enough with the band to leave four remarkable albums, including the grand opening Script for a Jester's Tear.From the vocal note of of the title track up to the last note of the title track, up to the last second of Forgotten Sons, this album manages to get my attention, which is rare for me - always being occupied with many things in parallel. Even now, while writing this review, the album keeps distracting me from just writing about it.Script for a Jester's Tearis a poem put to music, with painful emotions showing in both the vocals and the music. It gives me goose flesh, even after having known it for 20 years now. The followerHe Knows You Knowseems to have been a single that I missed out on, not knowing Marillion at the time. I can't imagine it did much in the charts, with what we now know and say about eighties pop music. The song pounds on and on, driven by bass and drums, while Fish shares the Jester's opinion on God - only interrupted temporarily by a flashing piece of energy generated by the keyboard and guitar breaks.After this,The Webhas always given me the creeps. The music fits the mood of the lyrics, the Jester drowning in his memories - almost whispering, than screaming out and complaining. Breathtaking, until the opening ofGarden Party- a completely different beast. The keyboards fading in, followed by a strong beating of bass and drums - then Fish' vocals. A great opening for a great party track, with lyrics that mean more and more to me over the years, as I learn to see how society (pun intended) operates. As I read in another interview on this site: the lyrics are pure venom, but of a kind that I can stand. On a personal note, the track always reminds me of a garden party at a friends house. He was a huge Marillion fan, but I spent over an hour convincing the hired disc jockey to play this one. I insisted our host would love it, he insisted I was drunk. Oh well... I won.Chelsea Mondayis a classic one for me. The opening lulls me into quiet moods, until Fish shuts up to give Steve Rothery some room for a guitar solo, accompanied by the keyboards of Mark Kelly. Time to just stop writing and listen for a bit...The anger ofForgotten Sons, represented by hacking rhythms and 'jangling' - for lack of a better word in my English vocabulary - keyboards reach their peak in a prayer that might scare me stiff if it would be played to me unexpectedly in the dark. When this album is mentioned, this track isn't the first that comes to my mind, due to my love forGarden PartyandChelsea Monday, but like the latter it is among Marillion's best - and certainly one of darkest.All in all,Script for a Jester's Tearis one of the most treasured albums in my collection, and one of the few of my older ones that was given playtime during a ten year period without much serious listening to music. A classic to me, and to progressive rock - no matter what bad critiques the band had to suffer from the hard core Prog crowd of the 70s. The anger and emotion in this album, as well as the musician ship are akin, but from a different nature than the Genesis classic it was said to be a copy of. I like them both and grant them both 5 stars on the ProgArchives.com scale."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Thursday, September 27, 2007",
      "rating": 3,
      "text": "I totally agree with Menswear's description of this album as \"drama-prog\", where the focus is less on the music and more about the theatrics. I'm generally not moved terribly by lyrics, and I tend not to enjoy shrill (though emotional) notes. Thus, I'm not moved overall by Script from a Jester's Tear. I'm glad Marillion kept the prog fire burning, and there are some terrific musical moments to be found here (even for a curmudgeon like myself), but I cannot use the term \"masterpiece\" to describe this album.Script for a Jester's Tear. I have to admit, this is one heckuva way to introduce yourself to the world. The beginning is absolutely haunting, and the lyrics are incredibly painful. The weeping clown on the cover could be considered rediculous, but it does fit this song extremely well, and so I love it. I FEEL that clown's pain! Now, let's address some of the weaknesses: Fish hits some absolutely awful notes, and the percussion is so generic that it really detracts. As creative and powerful as this song is, I simply cannot overlook these aspects.He Knows You Know, The Web, Garden Party. Some good synth runs, decent guitar work, and creative lyrics, respectively, but overall these songs are too slow, and the truly enjoyable moments are few and far between. Here the drama-prog borders on the rediculous. On The Web, when Fish passionately belts out \"But even Jester's cry!\", I always laugh, because I have a difficult time taking this seriously.Chelsea Monday. Simplistic and overlong, this song still is powerful. Finally a display of the guitar prowess of Rothery I've been hearing so much about, put to anthemic melodies, and the result is a strong (though depressing) tune.Forgotten Sons. Fortunately, Marillion has another epic to match the quality of the opener. These guys are certainly creative, from the catchy intro, to the spacey instrumental, to the twisted interpretation of the Lord's Prayer, to the absolutely provocative anthemic conclusion. Here Fish's passion and voice perfectly match the music (not to mention his thoughtul and relevant lyrics), and the result is a killer album closer.Three stars because this is a debut, the album's historic significance in prog, and for the opening and closing tracks. The rest is entertaining at best and boring at worst."
    },
    {
      "reviewer": "apps79",
      "date": "Posted Sunday, October 28, 2007",
      "rating": 5,
      "text": "MARILLION were formed as ''Silmarillion'' in Aylesbury,Buckinhamshire,UK by drummer Mick Pointer and guitarist Steve Rothery.In 1981 they shortened their name to MARILLION,the same time when vocalist Derek Dick ''Fish'' joined the band.A lot of important gigs would follow,before the band released their debut album named ''Script for a jester's tear''.Very much influenced by the music of GENESIS and VAN DER GRAAF GENERATOR,the band developed their own superb style based on melodic solos,atmospheric keyboards and the theatrical performance of FISH.The abstract lyrics of and the dramatic vocal chords of Fish would give the band an extra mystic flavor,but the album would also include some catchy tunes added for good measure...''Script for a jester's tear'' finally meant to be a progressive rock classic,containing some of the most atmospheric,well-crafted and intense tracks ever to be heard and it desreves till' today a special place in my heart and collection.A true gem of the 80's progressive rock-era!"
    },
    {
      "reviewer": "progrules",
      "date": "Posted Wednesday, November 21, 2007",
      "rating": 4,
      "text": "An early day hero album you might say. And since I am a true neo progger I should love this and give it 5 stars without hesitation. But alas .... This is not the case. And I will try to explain why. Twenty years ago I absolutely loved this. Marillion was the progressive revival and of course we will always be thankful to them. But the problem is that in my perception this album is nowadays outdated and I'm reviewing it now so what can I say ? I'm not judging for sentimental reasons. I'm judging the music and my feeling about it. But don't worry, of course there's still a classy vein about this, at least most of the songs.My favourites are the title track, Chelsea Monday and The Web. The other 3 songs are a lot less, particularly Garden Party. But even the three favourites have slipped away from me. It's still good (I'm somewhat ambiguous about it, I know) so what to do ? We'll leave at 4 stars (3,75)."
    },
    {
      "reviewer": "JLocke",
      "date": "Posted Tuesday, February 5, 2008",
      "rating": 5,
      "text": "I actually can't recall exactly when or how I first heard of Marillion, but I do know that they were my first real delving into more obscure prog bands that weren't as well-known in the public's eye (Before this time I had only been listening to the obvious prog bands such as Pink Floyd, Yes and Dream Theater). This particular album was actually my first experience with Marillion, so isn't it fortunate that it is so fantastic?I was lucky enough to find myself a copy of the now out-of-print (I believe) double-disc remastered edition. However, I am going to review only the album proper, as I don;t think that the bonus disc is part of the album experience per say.This masterpiece begins with a very simple, mellow intro featuring Fish singing his signature theatrical vocals overtop of Mark Kelly playing single piano chords. This soon evolves into a moment of silence, then we now jear the keyboard sounds as Kelly plays a tune that makes me feel like I am in some medieval court right away. Soon, Steve Rothery comes in with absolutely brilliant acoustic guitar that even further creates the illusion of some older time period. What I like about Marillion's music (and this will continue all throughout the album) is that, for me, it not only makes me feel emotions, but it also transports me to physical places in my head, and the picture becomes so clear to me that the mood is set once and for all, and I believe in the story Fish is telling for the rest of the album's duration. The first track as a whole eventually becomes a very heavy rocker and Rothery shows his true abilities as a guitar master. And let us not forget Pointer and Trewavas, who also contribute greatly to the overall sound of the record. Just when you think you know where the track is going, it once again takes another dramatic turn into a more ballad-like structure, with soaring moody guitar work and the always amazing voice of Fish complimenting one another as the track fades out, leaving the listener excited to hear what will come next.As amazing and moving as the first track is, here comes another great one, which what I believe was the original single from the album (though I could be mistakes), He Knows You Know. The lyrics found here are, in my opinion, actually rather weak, especially when compared with the lyrics of the previous track, although this really is of no matter, since the music itself holds up on it's own very well. In fact, the musicainship found on this particular song is so good, frankly Fish could be singing about badgers, mushrooms and snakes and the song would still be very powerfull. Kelly really shines here, with a very cathy yet unusual keyboard riff that accompanies Rothery's rhythm guitar section of the song, then becomes the backing track to another perfect guitar solo. At one point, the song also introduces a very punchy, catchy chorus that repeats a few times in very typical song structure manner. This is where the proto-prog label comes from I believe, because these guys, while clearly progressive, definately have a very straightforward rock edge to them that I think would normally make them more accessible to people; sadly for them, they were around at the wrong time, and to this day many people don't know who they are simply because they debued in an era where prog rock was still not the most revered of musical styles in existence. In this chorus, Fish starts off on one of his shouting sections. The first of many. While some people could find this annoying, I actually like the intensity of the man's vocal performance; it really brings an extra punch to the band's music. Here in the chorus, he yells You've GOT! Venom in your stomach, you've GOT! Poison in your head . . . and so on. I really like this, as it puts alot of power and aggressivness to the song. Like I say, not everyone will like this about Fish-era Marillion, but for me it really heightens the listening experience. (By the way, this is not all that Fish can do. He also has a very beautiful soft side to his voice that gives me chills at times)Bringing together tracks 2 and 3 is a quite hillarious interlude that has a very Pink Floyd-like quality to it, in which a ringing phone is featured . . .The Web redeems the album's lyrical prowess with Fish's poetry being once again shown in all of it's glory with such lyrics like: 'I'm the cyclops in the tenement, I'm the soul without the cause'. A moment in the song that is particularly striking is when the music becomes very song, and Rothery dishes out a rather tasty clean guitar section as Fish quietly sings overtop of it. However, another potentionally funny moment happens immediately after when Fish suddenly and inexplicably shouts out the last part of a verse. Like I said, it may take some time for this vocal style to grow on you, but there is no reason why it ultimately couldn't do just that. Something definately worth a mention is that this song features possibly the best guitar solo found on the entire record by Steve Rothery, and it truly shows how greatly underrated of a guitarist (and indeed, the band itself) he is. Actually, Rothery is among my all- time favorite guitar players, just because he has such a great ear for catchy melodies without losing his own originality along the way. The solo I am speaking of in this particular song is truly beautiful, and I get chills every time I hear it. Pointer also does an exceptionally great job on this track, playing some truly complex beats without being too showoff-y. Finally, Mark Kelly has his finest moment on the album with an otherwordly uplifting keyboard solo that sends my imagination to outer space and beyond!Garden Party - Possibly the most epic song on this album, despite it's meager length. It begins with a very interesting rhythm set by both Trewavas and Pointer, followed by a placid keyboard riff, which backs up Fish in his most theatrical-style vocal work found inJester. Here he makes full use of voice projection, rounding his 'r's and singing in a very original manner that sounds more like speaking than singing, and yet it still has a tune. Difficult to explain, but the voice work is definately exceptional on this song in particular. Kelly once again shows his ability to produce spacy keyboard solos and Rothery doesn't do too bad of a job himself at accompanying the madness that is this song's structure. It feels all over the place, yet it works so well to give the listener that frantic feeling that Fish no doubt intended.The next song is Chelsea Monday, and quite honestly is my least favorite track on the album. However, it is still great in and of itself, so just because I like it the least doesn't mean that isn't a good song. The looped voices at the beginning don't really make sense to me, and they feel out of place. However, Trewavas does his best bass work on this song, with a riff that really gets me quite emotional, and bass rarely does that to me. It's probably due to the keyboard and guitar lines accompanying it, which all combined make for a very moving backdrop for Fish to dish out more theatrical voice work in front of. Steve Rothery also gives another very beautiful guitar solo, his second- best on the record. Slowever, and a bit jazzier, which reminds me very much of David Gilmour. Following that, he impresses yet again with very haunting clean guitar work. All the while, Fish is doing some of his best lyrical work of all time, and Pointer is doing a great job of keeping everything together in a very slow, accurate backbeat. Yet more voices now, but this time, they are actually understandable, and I suppose at this point in the song don't really add or take away anything. They are just there. The song then abruptly ends. Not too shabby for my least favorite song on the record. In fact, it's quite enjoyable.Ah, Forgotten Sons, the finale of this true prog masterwork. Well, the song's opening actually isn't the greatest, with more seemingly aimless yelling from Fish, but like I say, I actually like this aspect of the man's voice, so I quite like it. The keyboard work here makes me feel like I am sailing the seven seas with a group of pirates, which really gets my blood pumping evreytime I hear the riff begin. At around the 02:15-02:20 mark, the song begins it's main section: a man's rather calm voice presenting the song's lyrics in spoken word, while a maniacal Fish screams the same lyrics in the background. Backing these rather dramatic but enjoyable vocals is Steve Rothery's best rhythm work I have ever heard. Truly exciting to listen to every time. Building on to that after a little while is Trewavas' excellent playing, giving the already entrancing rhythm guitar an extra punch with his accompanying, equally impressive rhythm section. Pointer and Kelly also do not dissapoint here, all together giving this section of the song a very heavy, crunching edge to it. Now, the song changes yet again and we now hear the song's rhythm become very military and march-like, while Fish recites a slight mockary of a traditional prayer. This could potentionally be the album's most dramatic moment yet, or it's funniest. I must admit, I laughed aloud when I first heard Fish's drawn-out, overly-exaggerated Arrrrrrrrrrrmen!, but over time, I have grown to love this part of the album, and it really cements the experience for me. As a whole, I think the album gous out with a bang, and the entire experience makes it very worth while to anyone interested in more underrated prog bands.Overall the album is terrific. I happen to think it's essential, but I understand that many people seem to think that Marillion simply ripped-off Genesis. However, I think that is unfair. (Although, not being a Genesis fan myself, I may not hear the similarities between the two simply because I'm not familiar enough with their music). Frankly, I think that Marillion are compared to Genesis so much because Fish's singing voice happens to resemble Peter Gabriel's a bit. But this band has so many original moments in their music, I think it is an unjust claim for anyone to make that Marillion is merely a Genesis 'clone'. For anyone who has put off listening to Marillion simply because they have heard negative things about them, please, give this album a try, as it has some truly epic moments on it. It is as far as I am concerned a hidden gem lost among many unoriginal neo-prog bands. Quite a shame that more people haven't given it (Or indeed, Marillion themselves) the respect it deserves, but for those of us who know just how precious it, the wonderful listening experiences never cease to return each time we play 'Script For A Jester's Tear'.Happy listening."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Tuesday, February 12, 2008",
      "rating": 5,
      "text": "\"Script For A Jester's Tear\"is the debut full-length studio album by UK progressive rock actMarillion. The album was recorded between December 1982 and February 1983 and released throughEMI Recordsin March 1983. The band had originally planned forDavid Hitchcockto produce the album, as he had produced the band�s first single\"Market Square Heroes\"(released in October 1982), which had been a minor hit in the UK. HoweverHitchcockwas seriously injured in a car crash driving home after completing his work on the single, andNick Tauberwas brought in byEMI Recordsto produce\"Script For A Jester's Tear\".The material on\"Script For A Jester's Tear\"is progressive rock, but with a more contemporary 80s sound (especially on the keyboards and the drums), which sets the style apart from the 70s progressive rock scene.Marillioncan�t escape comparisons to artists likeGenesisandVan der Graaf Generator, but with the more contemporary production values the neo-progressive rock term was coined by this release (and by other contemporary releases by artists likeIQ,Pallas, andPendragon).Marillionopted not to include neither their single\"Market Square Heroes\", nor the B-side to the single\"Three Boats Down from the Candy\"on\"Script For A Jester's Tear\", and they left off their 17 minutes long epic\"Grendel\"too, which had otherwise been songs they had performed live as part of their setlist in the preceding years. Instead\"Script For A Jester's Tear\"features six new original compositions. Three on each side of the original vinyl version of the album.The title track opens the album with a quiet melancholic vocal line, which more or less sets the tone for the remainder of the album...but it�s not completely true though, as the band are also able to rock a little harder on tracks like\"He Knows You Know\",\"Garden Party\", and\"Forgotten Sons\". All tracks are very dynamic in nature though, and typically features both quiet melancholic sections and more hard rocking ditto. All instruments have an equally important role in the music, and in front are the paatos filled and powerful vocals byFish. Again the word dynamic comes to mind, asFisheasily go from low volume singing to high volume shouting/screaming. He has an incredibly versatile voice and a wide range, and uses his abilities to the full potential. Add to that his clever lyrics which are engaging, intriguing, and paints pictures in the head of the listener, and you have a world class vocalist/lyric writer on your hands.\"Script For A Jester's Tear\"features a professional, detailed, and powerful sounding production job, which is a combination of the typically more organic sounding productions of the 70s and a contemporary 80s production style. The production choices work perfect with the material and\"Script For A Jester's Tear\"is overall a very well sounding release. Upon conclusion it�s definitely one of the most impressive debut albums out there and it�s a seminal release in terms of keeping progressive rock alive in the 80s, where the genre had dire conditions to thrive (and even survive). A 5 star (100%) rating is deserved."
    },
    {
      "reviewer": "LinusW",
      "date": "Posted Sunday, April 27, 2008",
      "rating": 4,
      "text": "I instantly liked this. With the first tones of the title song I got that reassuring feeling that this is going to be a pleasant ride. Where Misplaced Childhood offered a selection of songs that at once gave me a both hopeful and fearful view on the rest of Marillion's discography, Script For A Jester's Tear instantly clicked. With loads and loads of reviews, I'll at least try to get something across with this one.The biggest problem I had with Misplaced Childhood was the fact that Fish dominated that record to such an extent that the rest of the band ended up in the background. That's not a problem here, as the band in this stage seem to have had a more democratic approach when creating their music. I love the fact that Mark Kelly's keys aren't trapped in the woodwork this time, and are allowed to shine with what they are. Melodic, ambient and providing structure without ever going over the top. No instrumentalist does that. Not even the emotional solos of Steve Rothery. It's all very solid and disciplined, yet always interesting and proficient and naturally this enhances the lyrical and vocal strength of Fish. I rarely listen very carefully to lyrics. Up until now Rush has been the only band that really made me follow the vocals as something else than just another instrument. I can now add Marillion. It's impossible not being drawn in to the world of Derek Dick when he delivers such powerful, dark lyrics in a dramatic Peter Hammilll-esque way. It's just that he does it even better.It's when you listen to an album such as this you realise why neo-prog and symphonic are separated genres. Script is a symphonic album by nature, but it achieves that goal in a different way than we're used to. Without tens of different instruments, Marillion emphasises strongly on the synthesiser. Perhaps inevitable, but here it adds so much dynamics, tension, melody and atmosphere that it easily take on the role of an orchestra. Somehow understated, it still remains a favourite on the album, and Mark Kelly deserves the attention if only for the crucial role he has in shaping Marillion's sound. The arrangements are all very good, and this is another element making Marillion something unique in the 80's rock scene and something I think is often sadly overlooked by critics of the whole genre. There are some questionable segues here, I admit that, and some ideas wander off in the distance in strange ways. But this is a debut after all, the hunger and passion makes up for such problems.Melodic, emotional and powerful pseudo-symphonic rock with lots of colours from it's time, and a very pleasing album. Very addictive: 4 stars.//LinusW"
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Tuesday, May 27, 2008",
      "rating": 4,
      "text": "3.5 stars really, but I have to round it up because of its historical importance as well as its quality when compared to other discs in this dark era of music.Calling it the first neo-prog album is up for debate. While many bands in the eighties and some later on followed somewhat closely this marillion sound, you can also argue that post-Gabriel Genesis was the band that brought this genre and influenced Marillion to sound like the band we all are familiar with.I do not think I should describe the album is too much detail as great reviewers already did, as the band is very well-known here, and because the first available sample is a summary of the band's sound. Just expect clear-crisp production, theatrical feel, lush and modern keyboards, thick bass, emphasis on melody and harmony, and various prog elements except for perhaps complexity .. phew, long list.I think I could divide the album into two parts: the greater songs and the lesser songs. I really feel that three songs are clear standouts while there is not a single song that feels like the weakest/strongest song in the album.The greater tracks: _Script for a Jester's Tear: It begins with just the vocals, piano is later added and after a couple of minutes a fantastic driving theme appears. The rest is quite dynamic, making this an epic in the vein of Musical Box._The Web: I have heard this song in some guitar compilation and I remember it flooring me. There is a lot to love here: the emotion in the vocals, the amazing keyboard work, the wonderful musical ideas, the coherence, the dynamics and that special guitar solo._Forgotten Sons: Quite an interesting track. While the introductory groove and vocals are easily my least favorite part of the album, it is short and the rest is quite wonderful. The highlight for me is the middle of the song. Around minute two, there's an incredibly groovy guitar riff with someone reciting a poem while Fish screams the lyrics at the same time. Later in the song, a similar thing happens, but more dramatic and with a haunting military drum line. Between them, there is a psychedelic instrumental section. The ending is a fitting melodramatic finale.The lesser tracks include the melodic but somewhat AOR-ish \"He Knows You Know\", the whimsical and synth-driven Garden Party, and the somber \"Chelsea Monday\" which features atmospheric electric guitars. All of them are quite enjoyable once they grow on you, though they do not leave as much of an impact as the three other tracks I mentioned.Recommended, an important album in the history of progressive rock that still manages to be quite enjoyable. For fans of melodic rock and people who don't demand ultra-progressive works. Also, for people who find lyrics an important aspect of music."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Wednesday, July 2, 2008",
      "rating": 4,
      "text": "Marillion's first and probably most influential album with a taste of the things to come!The first thing I react to while listening to the album is Fish! He is all over the place and actually steals the show from the rest of the band during the first two songs. It's not until the third track,The Web, that my attention finally could switch to the instrumental section. The music up to this point complete top notch material but it shifts into a lower gear withGarden Party. I know that it's considered a great classic among the fans but for me it's easily to weakest link of the bunch.LuckilyChelsea Mondayis a return to for thanks to some of the strongest lyrics that Fish has ever written. The melancholic feel of the lyrics combined with the music transfers those feeling over to the listener and it's a perfect mood to be in leading up to the album's concluding track.Forgotten Sonsis the final track and the only one where both the music and vocals get an even amount of attention from me.In conclusion: I find the jumping back and fore very tiring but because of the great material, the album still manages to rate quite highly in my collection, but not enough for me to recommend it to everyone.***** star songs: Script For A Jester's Tears (8:39) He Knows You Know (5:22) Forgotten Sons (8:21)**** star songs: The Web (8:48) Garden Party (7:15) Chelsea Monday (8:16)Total Rating: 4,48"
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Monday, July 28, 2008",
      "rating": 5,
      "text": "The Dawn of a New EraIt's strange for a member of the Neo Prog Team not having released \"Script for a Jester's Tear\", for many the masterpiece of MARILLION (The most iconic band of the sub-genre) and for almost everybody the album that defined Neo Prog.May sound contradictory, but I refused to review this album because until a few years ago, I believed Neo Prog was a \"B\" class sub-genre, a prejudice that took me time to leave behind, but when listened the music with open ears, understood that there is really fantastic that would be a shame not to listen, so it's time to review the point where everything started.The album is opened with the title song and the band gives one of their most memorable performances. The introduction is sung almost \"a capella\" with Fish's peculiar Scottish accent and emotional range, only a soft piano makes company to his unique style, but then the change comes, a sudden burst of energy and power, the keyboards of course have that particular sound of the 80's, in the meanwhile, Fish takes us on a trip trough different moods from the peaceful calm of the start to the anguish and pain we can feel as the song advances, all performed with a quality that few vocalists achieve in one of the most clear operatic styles.From the beginning we can notice that Neo Prog brings something different the guitar passes from being a dark instrument left behind the keyboards in traditional Symphnic to be a main character in this new genre, and Steve Rothery is a great ambassador of the style.From start to end, almost nine minutes of great Prog Rock.\"He Knows You Know\" starts with the guitar in crescendo and soft vocals announcing another sonic explosion, which in this case is not as powerful and the opening track, only from this point I can listen the clear GENESIS references and Fish's style boosts the effect.The best section of this track is the middle instrumental break where Mark Kelly, Pete Trewavas and Steve Rothery get involved in a keyboard, bass and guitar duel, with the appropriate drumming by Mik Pointer simply fantastic.\"The Web\" is a track that defined another facet o Neo Prog, starts dramatic with an almost Symphonic structure and a Gabriel like vocals with that style that only Fish is capable to create, but as it advances and gains in energy, moves more towards a hard Rock territory, first as a power ballad and then rocking as professionals, not the most progressive track despite the radical changes, but pure energy and power, the final guitar solo sumarizes the blend of two genres.\"Garden Party\" is a classic in every sense, with a strong GENESIS influence, lush keyboards, unconventional rhythm, radical changes and to crown the song, excellent and deep lyrics, everything you can ask from Prog can be found here.\"Chelsea Monday\" is another display of social poetry by Fish, enhanced with the dramatic and obscure music, this song shows us you don't need a vocalist that sounds like nothing matters as in most Indie, because Fish's dramatic voice can transmit whatever he wants, without giving the listener the urge to blow his brains or run for a Prozac pill.A great album is defined by how well the songs are balanced, and MARILLION achieves complete success in this field, \"Forgotten Sons\" is another dramatic track, but in contrast with the previous, it's almost frantic without falling in excesses, the guitar interplay with the whole band is impeccable and the subtle keyboards combine perfectly, another high point. Again the powerful lyrics combining with the radio broadcast and the almost military march in the middle fit perfectly but the organ and mellotron (or a digital version) keeping the suspense, enhance everything. Another masterpiece.We should only give the maximum rating to an album if it's essential, well, if the defining album of a genre is not essential, I don't know the meaning of the word, but \"Script for a Jester's Tear\" is much more, is a masterpiece that I should had bought ten years before I did. So five stars it is, and without any doubt."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Saturday, August 16, 2008",
      "rating": 3,
      "text": "My first safari into the jungles of Neo-Prog occurred about a year and a half ago and it was a total disaster. I bought \"Dark Matter\" by IQ and I was so underwhelmed and disappointed by it that I kept my distance from the entire genre until I could get over the heebie-jeebies it gave me. But this band called Marillion continued to intrigue despite their dubious labeling. Here in my neck of the woods (the USA) they get nary a mention in the media and I never even knew they existed until I discovered this site and found that they are quite well-respected by many whose opinions I respect. Ever in search of music that will knock my boxers off, I finally took another trek into this odd corner of Progville and grabbed up their highest-rated CD, \"Script for a Jester's Tear.\" While it didn't generate any WOW! moments for me, at least this time I don't feel like I got ripped off.First of all, it's their debut and those can be tricky affairs, as we all know. Secondly, they released this very progressive album in '83 when the once-mighty spirit of prog was suffocating, caught in the strangle hold of the viral scourge known as MTV. You gotta give them props for having the jumbo-size spheres to create something that was obviously a case of swimming against the pop tide. Thirdly, anyone who sounds as much like Peter Gabriel as Fish does is inevitably going cause the group to draw a host of understandable comparisons to the \"Nursery Cryme\" and \"Foxtrot\" era of Genesis. But, in his defense, I don't get the impression that he's imitating PG at all. He just has that kind of voice, coupled with a very theatrical delivery. And I find the band's music to be much more representative of early 80s New Wave than classic symphonic rock. Plus, the keyboard work is exceptional from beginning to end and the intelligent lyrics are literate and meaningful.However, in my book a group is only as good as its drummer and whether it was just inexperience in the studio environment, acute indigestion or whatever, the percussion section is the albatross draped around the neck of this album. There's also a lack of compositional imagination in a few places where it seems like the group was satisfied to just coast along, something that the truly great ones hardly ever did.\"Script for a Jester's Tear\" is a splendid way to start. A quiet, subdued intro allows lead singer Fish to set the dimly-lit aural stage with sorrowful lines telling us that he's \"once more in the playground of broken hearts,\" a place many of us have visited all too often in our lives. Soon the band jumps in and one of the things I like right off the bat is the refreshing brightness of the production. (Alas, If only Genesis' first four ill-engineered albums could've possessed that redeeming quality!) It definitely makes the journey through the CD a lot more enjoyable. Steve Rothery's fuzzy guitar rides are nothing special here but the music is engaging as Fish sings about being \"yet another emotional suicide/overdosed on sentiment and pride.\" Dynamics are always an admirable trait to display and when they back off to make room for some uncluttered space in the middle section it keeps things from getting stale. They emerge from the other side in a half-time motif where Mark Kelly's keyboards sate the room with a great big, full sound that surrounds Fish's passionate vocal as he asks his lost lover \"can you say you still love me?\" It's heartbreaking to witness the honest and sincere pain he conveys.The powerful \"He Knows You Know\" is next. It has a slick Alan Parsons Project aura about it that makes it instantly accessible and, while the chord progression is nothing we haven't heard numerous times before, the striking vocal performance makes this tune the high point of the proceedings for me. The song is about addiction and the tie-in with the previous cut lies in the fact that the protagonist doesn't realize that his substance abuse is the reason his woman left him behind. Again, Kelly's dreamy keyboard textures and tones are wonderful as they support the dramatic singing of words like \"when your conscience whispered/the vein lines stiffened/you were walking with the dead\" and \"you learned your lesson far too late/from the links in a chemist chain.\" Some may think Mr. Fish is emoting way over the top here but considering the subject matter I don't think it would have worked any other way. So far, so good. This is pretty decent stuff.But maybe I spoke too soon. During \"The Web,\" the drum set deficiency surfaces and the whole atmosphere is affected. The unusual arrangement on this track involves a lot of changing time signatures and shifting tempos, requiring steady and supremely confident leadership from the drumkit to pull it all off. Mick Pointer may have acquired that talent further along in his career but here he just doesn't have the chops and the tune suffers accordingly. The poignant lyrics describing the poor sap's self pity and withdrawal from society (\"I'm the Cyclops in the basement/I'm the soul without the cause\" as he stares at \"faded photos exposing pain/celluloid leeches bleeding my mind\") are almost wasted because of Pointer's distractingly weak patterns wavering underneath. Steve's fine guitar solo and Mark's excellent keyboards keep it from being an embarrassment.\"The Garden Party\" is burdened with the same flaw but this time it arises from Mick's dragging the groove. He's following the group instead of blazing the trail for them. It's a shame because this is an interesting number on all the other fronts. Fish's colorful description of a ritzy soiree belies more of the problem-addled, jilted beau's jaded opinion of the world his former lady love inhabits than a true observation of it. His sarcasm literally slithers across the notes. \"Couples loiter in the cloisters/social leeches quoting Chaucer/Doctor's son, a parson's daughter/where why not and should they oughta\" and \"chitters chat and gossips lash/posers pose and pressmen flash.\" You don't often find clever rhymes like that in Progland. I adore Kelly's sharp keyboard accents that follow the softer segments and his synthesizer lead is a treat but the rhythm section never locates a \"feel\" and it leaves me unsatisfied.\"Chelsea Monday\" has a slower pace and the song's conventional beat is better suited to Pointer's skills but the somewhat pedestrian chord progression becomes tiresome after a few minutes. Perhaps it was designed to be no more than a smooth, uncomplicated platform for Fish's acrid, biting vocalizations. In that case it works. Here he describes his former object of affection in jealous, unflattering terms and it only serves to emphasize his deplorable insecurity. To him she's become a \"catalogue princess, apprentice seductress/living in her cellophane world in glitter town\" who is \"drifting with her incense in the labyrinth of London/playing games with the faces in the neon wonderland.\" In other words, she's moved on and he hasn't. It's not a great tune but better crafted than the two that preceded it.That seems to signal the abrupt end of the sad jester's story because the closer, \"Forgotten Sons,\" is unlike anything that came before it. Here the singing performance is outrageous and near-histrionic as Fish immerses himself in an effective anti-war anthem that is complex, moody and somewhat challenging to dissect. After a rocking start the band segues into a more eccentric movement where stark spoken words ramble over a lone, distorted electric guitar. A Steppenwolf-like psychedelic section ensues over tepid, unsure drumming before a crowd chanting ominously above a military march takes over, creating an unnerving, tension-filled atmosphere. Once again it is the keyboard mastery of Mark Kelly arriving like the cavalry in the nick of time to save the piece from overindulgence and insanity. His melodic, cavernous wall of organ and synthesizers gives the album a spectacular fadeout that helps to make it all worthwhile.I'll admit that I didn't warm up to this album immediately but somewhere around the 5th or 6th spin I started to discover its charms so my advice is to let it grow on you a bit. There's a lot to like. If you're a fan of early Genesis then Fish's affected vocal style shouldn't bother you at all and along the way you'll discover that Mr. Kelly does an extraordinary job on this recording. (I've noticed that the band changed drummers before their next go-round so I figure I must be right about my assessment of Mike Pointer's inappropriateness as the guide for this group.) If anything, this CD has made me reconsider the whole Neo-Prog category and I'll be a lot more open to exploring it further in the future. During the dark ages of the horrible MTV plague, when our kind of music was as hard to find as Jimmy Hoffa's body, Marillion kept the prog fires burning and they deserve a medal of honor for that accomplishment alone. \"Script for a Jester's Tear\" is no stunner, but important nonetheless and pretty darn entertaining. 3.2 stars."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Tuesday, September 2, 2008",
      "rating": 3,
      "text": "Review 69, Script For A Jester's Tear, Marillion, 1983Script For A Jester's Tear is a hard one for me to review. Several aborted efforts have ended in deletion. The reason for this is that it is an album which is extremely consistent in both its strengths and weaknesses, and the number of both of these makes it sort of challenging to write about without feeling like the review's becoming a list. Still, I'll try.Clearly there are a lot of musical ideas in the constantly changing pieces; we get touches of psychedelia, symphonic moments, quirky light jaunts, an arena-rock solo and even a tad of blues. All of the members (except Pointer) seem fairly involved and capable, though not individually massively distinctive. The lyrics are pretty solid, depressive and entertaining, and the general accusations of sounding too much like Genesis... well, I don't really see it.The negatives really come from the execution of some of these ideas. Various sound effects similar to those on The Wall often feel like forced insertions, especially damaging to Chelsea Monday, and they are a bit too frequent for my liking. Mick Pointer, as often mentioned, does not do the world's most sterling job here, but I honestly think that he isn't that much of a hindrance to the band's ideas. Complex and distinctive drum parts aren't there, but they aren't really called for. Finally, the trite Garden Party doesn't really seem to fit the album's mood for me, and I think that the weaknesses simply make the overall album less of a pleasure to listen to. Overall, the album's still pretty strong, but its charm was, for me, too soon worn away by the weaknesses.The title track has pretty much all of the strengths, and very little of the weaknesses, with the soft 'Here I am once more... in the playground of the broken hearts' executed brilliantly by Fish. His vocals and the lyrics throughout are to match, and the band supports neatly and provides new contexts for it. The fact that the same line is executed again with a virtual roar and not feeling at all out of place alone makes for pretty good listening. Mark Kelly's keys control a lot of the tempo changes and ideas, while Rothery's superb rocking solos add force, and the rhythm section, especially Trewavas do manage to escape monotony and make their own contribution. The psychedelic ideas are equally at their most successful, with repeated words and whispered overdubs intensifying the atmosphere. The song's a sample on PA at the moment. Have a listen for yourself, and enjoy. A brilliant opener, and not to be missed.The ambiguity of He Knows You Know extends beyond the title, with spat-out words, great lines like 'Light switch. Yellow fever. Crawling up your bathroom wall/Singing psychedelic praises to the depths of the china bowl', and the psychedelic ideas and repeats fit in solidly. Pete Trewavas especially seems to be on top form, with great aggressive bass-work. The keys fit in over the top, adding a couple of riffs and chords over which Rothery's guitar can characteristically explode all over the place as well as adding a couple of subtle edges to vocal lines. The fairly random tack-on of the maddened phone call at the end is admittedly nice in the context of leading up to The Web, but feels a little off in ending He Knows You Know. Still, I do enjoy it a lot.The Web begins with a series of very aggressive, almost big-band on guitar-and-drums, stabs, before Fish joins in to provide a rather excellent set of vocals, both featuring some extended bits of vocal phrasing which are quite interesting, as well as the more normal lines. His own aggressive confusion (something that so few vocalists can handle well) is supplemented by harmonies and low key effects. The musical side is initially little more disjointed than the previous couple of pieces, occasionally feeling like a bit of a crib for his vocals, though it pulls together very well later on. The swelling and whirling keys are a highlight of the piece, and, though Pointer is a bit more of a drawback here than on the previous couple, the playing is otherwise top notch. Not quite sure what it is about Rothery's almost cut-off, yet extremely full, guitar tone that gets me every time, but it does. Unfortunately, the ending seems a little vulnerable in comparison to the rest of the song, with a rather uninteresting set of riffs crossed with irritating synth tones, though there are still a few points to commend in there. Overall, however, the piece is another success.Garden Party is a bit of a disappointment following these pieces, with the voices on the opening feeling a little too unnatural to me, and the repeated jumpy bass-and-drums riff being present for far too much of the long and rather sarcy piece. A few of the effects do work well, as do some of the keyboard choices. Fish letting his hair down with the lyrics and vocals is a partial success, with a couple of amusing moments (particularly the Chaucer rambling and a rather fed up 'Oh god, not again'). Only of a few of the ideas really fail, most notably the repeat of 'flash', but the piece overall simply doesn't feel very satisfying to me.Chelsea Monday contains the worst of the special-effects barrages, with idiotic paper/news announcements and supposedly Cockney or Australian (I can't work out which) conversations with needless line repeats. A couple of less driven-into-the-ground effects supplement Fish's vocal, but without the precision that characterises some of the earlier choices. Pointer's percussion, also, doesn't add a lot, feeling needlessly shouty. However, I absolutely love some of the other components of the song. Trewavas' superb bass line, Rothery's wails and Fish's high, slightly more like Peter Gabriel than usual, vocals are thoroughly enjoyable. The emotional Gilmour-esque guitar soloing rips through the headphones the first couple of times, and the acoustics and keyboard touches add a bit more survivability to a song that desperately needs it. This was my favourite piece from the album on the first listen, but the cringeworthy effects uses seriously damage it for me now. Shows off the Floyd influence, but not in a heavily positive way.Forgotten Sons, thankfully, is a much more rewarding experience, with a range of kicking riffs from all quarters (especially the mock blues/hard rock one from Rothery), and a serious range of emotions and ideas, including a rather more biting and impressive sarcastic opening becoming gradually a bit more serious and without losing the satire. Heck, even Pointer sounds good on this one. Fish's vocals are powerful and biting, and with lines like 'You're just another coffin, on its way down the emerald isle' and his mock prayer, the lyrics match. Psychedelic edges and wails jump out at all points and add a lot of fun. A keyboard solo section is brilliantly handled by Kelly, and the general atmosphere is tremendous. Hearing the 'halt, who goes there?' line gives me shivers every time, and I'm quite impressed that somehow the range of ideas is stunningly summed up in an ending, complete with a choral mellotron and Fish at his most Gabriel-esque, perhaps the only things which remind me bluntly of Genesis in the whole album. A great conclusion.So, strengths everywhere, but some really, really annoying weaknesses around the middle and not enough consistency in the fascination. Don't get me wrong, it is a good album with some very good tracks, and I can understand why it's so well-regarded, but I still get that painful twinge in anticipation of Chelsea Monday's 'she had a smile on her face' every time I go to connect the CD with the CD player. Should be a definite purchase if you're a bit fonder of The Wall than I am. Perhaps the only people I wouldn't really recommend it to are those who are really picky about drummers. Enjoyable, and it nets three stars from me.Rating: Three Stars Favourite Track: Script For A Jester's Tear"
    },
    {
      "reviewer": "LiquidEternity",
      "date": "Posted Thursday, October 2, 2008",
      "rating": 3,
      "text": "I hate to use the overrated, but I'm afraid I have no choice here.Don't get me wrong, this is a neat album. It is historically significant, too, being one of the major factors in spawning the neo prog movement, which arguably saved progressive music as a whole. However, the music here is progressive in the most generic sense of the word. Most of the tracks sound like Marillion trying to be Genesis. I don't mind bands drawing influence, even, if they must, a heavy influence, from other bands, but on more or less all the tracks save for the final one, it sounds like they used an imaginary Peter Gabriel to produce their album. The sound, then, is lost in the 70s, kind of piddling around and never moving forward really. This problem will be the one to haunt almost all neo prog until well into the 90s.Here, we have the beginning not only of the band but the first of the four albums from the Fish era. The man has a unique voice when he chooses to use it thus, giving tracks like Forgotten Sons and the title track a lot of punch and flair. The musicians are all talented; however, none of them really stand out as particularly skilled or exciting, at least on this record. The general criticism of neo prog bands playing only safe prog rather than pushing the boundaries applies a bit less to this record than to later ones, still. The very quiet intro to the title track kicks into a surprising bit of bouncy keyboards. Forgotten Sons is a haunting and raging cry for justice, with a few sounds from Fish that could almost be called screams. He Knows You Know is a fun, fast paced tune. The rest of the songs are well-balanced, but on the whole they are sort of generic and nothing special.This is a good album, don't misunderstand. I enjoy listening to it plenty. However, Marillion recorded several better albums, and other neo prog bands have done better, too. Genesis did better as well. In all, a worthy album to own for fans of the genre, but I'm not going to recommend it to everyone."
    },
    {
      "reviewer": "MovingPictures07",
      "date": "Posted Tuesday, November 11, 2008",
      "rating": 4,
      "text": "This is one of the most groundbreaking and good neo-progressive albums, and I love it. As such, I'm absolutely torn as to whether to give this album a 4 or 5 star rating. Let me elaborate:It may seem silly to nitpick such an influential and well-composed album, but I feel conflicted to give this album a 5-star status mainly because of the less than competent drumming of Mick Pointer. This album would have been infinitely better with a better drummer, and thus it is not absolutely perfect. However, let me tell you why this album is still an extremely excellent addition to any prog collection.1. Script for a Jester's Tear- Wonderful opening song here introducing us to the world of Fish. Fish's vocals and lyrics are perfect on this track, Kelly's keyboards are great, and Rothery crafts great guitar. Very good song. I'm losing on the swings... I'm losing on the roundabouts! 9/102. He Knows You Know- A great song, but possibly the worst one on here. The guitar work is great as usual, Fish keeps his spiteful lyrics and vocals up to a wonderful par here, and the tension in this song is fantastic. Wonderful guitar solo again from Rothery. 8/103. The Web- Possibly my favorite on here. The keyboard parts here are amazing and I love the continued pressure between the softer parts with the very odd keyboard effects and Fish's distant vocals and then the more upbeat parts. I absolutely love the part after Decisions have been maaaaaaaaaaaade! and the song breaks out into a wonderful keyboard progression from Kelly and further goes from there. Awesome. 9/104. Garden Party- Why is this song so underrated by so many people? The lyrics are fantastic, possibly Fish's best on the entire album, and the keyboards are once again perfect. This actually was a relatively popular song from the album, which is ironic, as people would be singing these lyrics without knowing that they very well could be the subject of them! I really like the overall structure of this one, but it's not perfect. 9/105. Chelsea Monday- Another great song. Fish and the crew seem to be very good at really crafting wonderfully crafted songs of a unique yet accessible manner! This song really rocks, especially with another ripping guitar performance by Rothery. Still, it is the song I always remember last for some reason, despite it being quite good. 8/106. Forgotten Sons- This is the ultimately perfect closer to this album. Even though I may think The Web could be my favorite song, this is its competition.. and as a song, it is much more objectively effective. The drumming can be overlooked here as Pointer has his best performance. Fish's vocals are FANTASTIC, Rothery plays possibly his most amazing guitar on the album (which really says something), and the song is perfectly structured. This is unarguably one of the greatest neo-progressive tracks ever composed. 10/10I REALLY want to give this album 5 stars, but it is not a perfect masterpiece. The drumming is one major flaw, and the album is not without flaws... some of the songs are not crafted to absolute perfection and are not as memorable, despite being quite enjoyable. However, this is the first album you should get if you want to delve into neo-prog and it is an album that your collection really shouldn't go without.A very excellent addition to any progressive rock collection."
    },
    {
      "reviewer": "tszirmay",
      "date": "Posted Saturday, April 11, 2009",
      "rating": 5,
      "text": "Okay, I know, it's time! I will do it, no need to pay me and I do not need anymore prompting! I know some of you have been waiting for my theatrical take on this one, so here it is, in dripping splendor. For the others, don't bother reading further, it's a (yawn) booooring 5 star deal, again!While it would be superfluous and even presumptuous to anoint this disc with \"Prog Saviour\", it certainly was a question of impeccable timing and in retrospect, a dying genre (for whatever reasons pundits wish to argue) was resurrected in extremis thanks to a talent, a vision and a dedication. We all know who the players are, they have been discussed, cussed, nailed, glorified, venerated and scorned ad nauseam within this site and countless others. This review will therefore stay away from the subplots and the corporate business contexts and stick to the music. Script for A Jester's Tear certainly inaugurated anew found spirit , slicing through the Duran Duran/Culture Club/A Flock of Seagulls monolith and found a still very hairy audience that demanded a little passion far removed from the \"I Ran after the Girls on Film but Do You Want to Hurt Me\" extravaganza bullied upon then impressionable youth. We have perhaps forgotten that this IMPORTANT recording starts off in incredible fashion, with the ultra-painful melancholia of the title track, sugared by mountains of Genesisian bitter sweetness, as far removed from a commercial hit as one can imagine, a brooding explosion of mayhem from a broken heart and the desperation that ensues. The guitar howls with exasperating fury, keyboards orchestrating the depth of the agony and the rhythm tandem follow radiantly in tow. Fish is not just a vocalist, he is a storyteller, a highly dubious character trait of progressive rock (that dinosaur genre, critics whipping boy). Yes, but do you love me? \"He Knows You Know\" hits you lyrically right in the gut (\"he's got problems!\") while Fish fervently spews his venom , \"poison in your head\" , raging convincingly, Kelly's synths whirl dervishly and Rothery spins some slick licks. This is the tune that most heard first, I know I did and it was a memorable moment indeed, even in Quebec where Prog never died. The slammed phone says it all as \"the Web\" kicks into hyper-gear, an �ber-symphonic avalanche (\"Its symphony echoes\") that masterfully contrasts 12 string acoustic pastels with colossal detonations of orchestral splendor, setting the velvet curtained stage for Fish to vent his deepest spleen. Temper, pique and malice are the props as the tall Scotsman sings like no other, crying, whispering, sobbing, raging and hurling his pain like some demon from a sci-fi movie. Rothery subtly comes in with an almost blood-drenched and gory \"matador\" solo that will lift every hair on your dizzied bleary eyed body. Frankly, I do not care if this is perceived as the second coming of Genesis, the music is positively brilliant and the entire premise exhilarating. These gents certainly had \"cojones\" to slyly slip by all the chat-topping elitist New Wavers, too smug in their lust and thus blind to the future legacy of this oft ridiculed band. Jokes on you, disco dudes! The disc only gets better, as \"Garden Party\" warbles through the maze, the reclining Fish hitting all the lofty ethereal notes, jousting with his burring Highlander intonations (crafty little devil!), slipping in a little porn, Kelly trouncing bolts from his banquet of keys and Rothery ramming home the champagne bottles , ice-buckets and all! Prog perverts, I daresay! And allegedly they probably got laid as often as the Durannies! Go figure! \"Chelsea Monday\" is where the boys get a little prissy, taking on all kinds of politically incorrect themes and getting positively rude musically (another Rothery barrage), gritty and angry as to create a new kind of prog-punk really! Progressive rock with a surly edge, a somewhat new phenomenon at the time and probably why they were immediately adulated by the somber masses who just couldn't cope with the nihilistic punk drone of the time. Lyrically, this is an acme of frustrated zeal, \"patience my perfumed child\". The background voices are like a riveting prog opera with wailing guitars slamming home the dire message. As if that was not challenging enough \"Forgotten Sons\" is an anti-war rant (twas the Falklands War, just finished) loaded with \"snipers, fighters and boys baptized in war\", Rothery's axe screaming like an Exocet missile aimed at the Sheffield, imminent burning flesh, innocent pawns in drunken generals' playgrounds and politicians' pernicious manipulation to save face. The guitar is raw, the rhythm is ballistic, marshalling drums and militaristic drills. \"Verbal masturbation\" is intoned with spit-laden contempt, for \"Power and Glory\" and \"Amen\" are extolled as the only refuge. Insanely heady and daring stuff indeed. These musicians actually had a social/political conscience, a cause which is how \"rock\" started out in the first place. A powerful and monumental recording that increases in value and majesty with each audition, year after year, a loving reminder of the musical Knights that came and saved Camelot. 5 feathered violins."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Friday, May 1, 2009",
      "rating": 4,
      "text": "Marillion's debut failed to impress me the first time or two I heard it, but it has grown on me since. Certainly Fish sounds an awful like Peter Gabriel, both in his God-given voice and in his way of singing so theatrically; but this comparison wears out with repeated listens. I don't hear the terrible drumming that many profess to hearing, although I will say the drumming does nothing for me. Strangely, this is an album that's enjoyment value changes as it goes (for me anyway); I really like the first two songs, but things begin to drag after a while. In fact, my ranking of the tracks would be exactly as the tracks appear.\"Script for a Jester's Tear\" Quiet vocals over piano begin the album. When the band comes in, they do sound rather like Men At Work, at least until the introduction of the synthesizer. The song stops completely to allow the next section to begin, a technique I don't particularly care for. Fish sings pensively over quiet acoustic guitar and easygoing synthesizer, before the heavier dramatic section comes in. The lead guitar during the next park (not to mention the overall sound) has an unmistakable 1980s sound, even as it fades out.\"He Knows You Know\" At first, the vocals can be off-putting, but after only two listens, they grew on me. The tightly structured synthesizer work and subsequent guitar solo are excellent. It ends with a short but weird telephone call (a la Pink Floyd's \"Young Lust\").\"The Web\" From heavy rock to more theatrical acoustic guitars, this might be the most varied song on the album. Mark Kelly's synthesizers are pleasing, and , despite a simplistic chord progression, Steve Rothery performs a rather sophisticated guitar solo. Speaking of chord progressions, the main one sounds like \"House of the Rising Sun,\" so it sounds terribly derivative.\"Garden Party\" The gentle noise of a party leads into the synthesizer-heavy introduction, punctuated by Pete Trewavas's bass and Mick Pointer's drums. Clean but strange guitar lets the music sound breathy, especially alongside Fish's vocals, which sound like they are outdoors. While the musicians do a fantastic job, I find myself largely bored, at least until the flashy solo from Kelly.\"Chelsea Monday\" Trewavas plays the chords on his bass one note at a time, as Fish sings. Once again, the chord progression demonstrates a lack of creativity, particularly during the rather loud guitar solo. A clean guitar enters for the next segment, which features some intriguing lyrics. During the final guitar solo, there's some panned conversation that can be unsettling if heard through headphones- I look over my left shoulder every time!\"Forgotten Sons\" My least favorite track on the album is the last one; it's just so hard to stay interested in. I enjoy the bass playing and synthesizer work the most, but largely, this song is directionless and irritating. The most aggravating part is the spoken vocal with the higher singing that accompanies it, and the warped recitation of The Lord's Prayer puts me off. The ending is the best part, with some tasty guitar bits and good vocal work."
    },
    {
      "reviewer": "progkidjoel",
      "date": "Posted Saturday, May 2, 2009",
      "rating": 5,
      "text": "Marillion - Script For A Jester's TearReview by ProgKidJoelMarillion's debut album, Script For A Jester's Tear, is heralded by many as the birth of neo-prog. Heavily reliant on its Genesis roots, this is truly one of the best 80's prog albums.1. Script For A Jester's TearThe song that began it all - The song that flew the prog flag in the dark days of the early 80's and proved that prog wasn't dead. This opens with FISH's great lyrics and Mark Kelly's great piano work. Flowing onwards, it reveals a memorable synthesizer harmony and an equally memorable lyric. As it flows onwards, it seems this is going to be another guitar oriented arena rock track, although this couldn't be further from the truth. Peter Trewavas bass work is brilliant on this track, supplying a backbone to a solid guitar harmony, lyrics and keyboard work. The one area lacking on this track, and indeed, on this album, would have to be Mick Pointer's drumming, which although not terrible, is very bland and usually cackles on like clockwork. Easily the best track on the album, this is an incredibly strong opener which helps earn this album a high rating.5 out of 5.2. He Knows You KnowAnother solid guitar led track, He Knows You Know is a song about drugs; FISH would often introduce live as \"the drug song\". Also followed by a shocking, heavy-handed lyric and great guitar work on Steve Rothery's part, this is one of the two singles from the album, the other being Garden Party. The bass is very good on this track as well, nearly as energetic as FISH's screams. Percussion took a turn for the better after its abysmal effort on the first track, and prove that Mick Pointer indeed does have some chops as a rock drummer, even if he can't read musical notation. Finishing in an intriguing spoken outro, this is another great track, although was marred in its efforts by its repetitiveness.4.75 out of 5.3. The WebMy second least favourite track from SFAJ'sT, this track isn't bad at all, although incredibly repetitive. At a glance, this is another saddened ballad, although is quite interesting after multiple listens. A less accessible track than the two that preceded it, The Web has earnt it self a place of fame as the name of Marillion's current official street teams. During Steve's softened guitar harmonies, a high pitched buzz hollows in the background, adding much dimension and depth to a decent track. The lyrics on this track are, once again, brilliant. A track about deciding what is right for yourself, and moving on from one stage of life to another, this track features on of Steve Rothery's famous guitar solos, and as always, this solo does not dissapoint. Carrying its trademark 80's keyboard and guitar oriented sound, this is another interesting track, perhaps not as good as the two which came before it.4 out of 5.4. Garden PartyAhh, Garden Party. Perhaps the least depressing track on this album, FISH didn't hesitate to mock British high society in this entertaining and technically thrilling anthem. Led by a great keyboard melody from Mark Kelly, this track travels through several high brau mockeries of a Garden Party, as the title would suggest. It seems FISH was not a fan nor member or such mingling, and boy, did he let us know with these lyrics! The other single from this iconic album, the film clip to accompany is equally entertaining. The rhythmic section is incredibly consistent on this track, complementing the melodics in a way which is nothing less than technically fantastic. The keyboard solo is another great part of this track, and when met with an identical riff on the guitar, shows that Marillion are indeed technically relevant in the prog world. An incredibly entertaining and lovable track, this is another stand out on this album.5 out of 5.5. Chelsea MondayMy least favourite track on this album, although lyrically masterful, is somewhat boring and shows an unneeded change of pace from the previous four tracks. Yet again, great guitar work shows a high point for this track. A rather relative solo, however, as the melodies surrounding it are incredibly similiar to that of The Web, and, once again, are incredibly repetitive, as is the solo. Not a bad track, but it feels highly uninspired and even less entertaining.3 out of 5.6. Forgotten Sons.Ay, there's the rub! My favourite track from this album, and easily the technically strongest, this is one of Marillion's most outwardly protestant songs. Lyrically inspired by the Northern Ireland conflict, and continuing onwards with a great keyboard led chorus, this track doesn't disappoint. Another great rhythmic section helps this track along nicely, as does its masterful guitar work, which is, upto and above the Marillion standard. Fully of typical wordy lyrics and metaphors, this track has four distinct sections. The first, a fantastic melodic opener. The second flows into a 60's style psychadelic hippie rock song, somewhat reminiscent of Jimi Hendrix. The guitar work peaks here, and only slowly fades out. This track is backboned by what I'd say is one of the top-five funkiest bass lines I've ever heard. Flowing into a spoken bridge, the most heavy section lyrically is truly terrifying. My favourite section of this song is a fantasticly heart-wrenching outro, all brought together by its guitar work. The lyrics here are without a doubt the best on the album. Incredibly wordy and heartfelt, FISH brings tears to one's eyes in his typical fashion. The vocals here express incredibly anger and confusion, which the lyrics portray equally. Forgotten Sons is one of, if not Marillion's most solid protest track, and will go down as one of my favourites from the FISH era. Finishing on a high note, this was easily the best track the band could have picked for an outro, and it worked fantastically.Other notes:Perhaps overrated by some, this album definitely deserves five stars. Its worth mentioning that I have the 1997 Digital remaster, 2000 Repress, and that the sonic quality of this disc is inspiring.5 out of 5. Not an average.Keep listening! -Joel"
    },
    {
      "reviewer": "Slartibartfast",
      "date": "Posted Monday, June 22, 2009",
      "rating": 4,
      "text": "Peter Gabriel and Steve Hackett got back with Genesis and they're doing new tunes in the old style! What? Oh...Well, if you were a fan of old Genesis back in 1983, Marillion came along and took up the style that Genesis had abandoned. If you have any doubts, get your hands on the remaster with Grendel, which is pretty much a dead ringer for Supper's Ready, other than having a coherent theme. And why not adopt an abandoned style? It was a really good one, after all. The band would eventually move away from it, but was nice while it lastedI'm not entirely sure now but for some reason I quit following the band after getting this one even though I really liked Script at the time. I didn't get back into them until they were doing material more imitative of Pink Floyd (Brave/Afraid Of Sunlight). With Hogarth at the vocal helm, they did finally settle into a style of their own where they are stuck to this day.For newbies to prog this won't be a bad addition to your collection after you've exhausted old Genesis. Assuming of course you've gotten hooked on old Genesis, are craving more, and don't mind an imitative act."
    },
    {
      "reviewer": "lazland",
      "date": "Posted Tuesday, June 23, 2009",
      "rating": 5,
      "text": "My first set of reviews on the site were for (nearly) all of the Hogarth era Marillion albums. I neglected the place where it all started, and that needs to be rectified.Because, whilst for many the 1980's was a dark and miserable place to be for 70's prog fans, for me it was a period of renewal in the genre, and this album was one of the main reasons for it.I had read a review of Market Square Heroes in Sounds music paper, went out and brought it, lapped it up as any fan of classic Genesis would, saw them live in The Marquee in London before the LP was even released, where they did, of course, showcase most of this material. It blew my mind away and started a love affair with the band which has lasted ever since. Of course, the lasting impression was of that giant, mad, Scottish man with face paint whose voice carried with it just a little bit more of a passing resemblance to Gabriel.The album starts off ever so strongly with the title track, a maudlin paean to love's lost dream. For a single bloke still in his teens, the bitterness and recrimination rang very true, and the exceptional guitar work by Rothery and Kelly's lilting guitars, combined with a strong bass section by Trewavas, all in the style of the prog I loved, was just too good to resist.He Knows You Know was the single from the album, and continued off where the Market Square EP left off, commencing a tradition of strong singles that has lasted to the present day. It is catchy, sad, and angry, being a sorry tale of a young man descending into the chaos of hard drug use that has its inevitable end. The sad Jester alone in his bedsit indeed. The bass playing still amazes me now on this track, and the keyboards and guitar sing out an incredibly beautiful sad tale. The end section is angry and urgent.The Web, which, of course, became the name of the fan club, is probably the one track that has, to these ears, not dated as well perhaps as the rest of the album. It is a long track at over eight minutes, but there is still much to enjoy. The differing moods keep the interest throughout, but it is still mainly one of sadness. I still listen to the musicians wondering how lucky I could be that a band had appeared that recreated, with a biting edge, my favourite type of music. Rothery, especially, sounds every bit as good as Hackett in his pomp with Genesis, and this is incredible given how young he was. Then, when Decisions Have Been Made, Mark Kelly comes in with quite the most exquisite keyboard passage which most certainly would have graced any Trespass, Nursery Cryme, et al. That is how good and relevant this band were.Garden Party was another single, and is a scream. Hugely amusing with Fish basically ripping the mickey out of the landed gentry with their ridiculous ways, it was a decent seller. It also gave the name to one of the finest gigs I have ever been to at Milton Keynes to celebrate the success of Misplaced Childhood.Chelsea Monday should be on the playlist of every single prog rock fan. It tells the most tragic story of a young aspiring actress/model who was found dead and splattered all over the gutter press. The lead guitar by Rothery soars and makes the hairs on the back of your neck stand up in sheer emotion. It should be impossible for a band as young as this to be so good. A special mention is owing to Mick Pointer for his sterling drum work in the rhythm section some 4.5 minutes in. The closing section has Rothery soaring above Fish almost crying out the tragic end to a wasted life. An exceptional piece of work.The album closes with Forgotten Sons, a song written in the aftermath of Britain's war in The Falkland Islands and bomb outrages by the IRA. It remains one of the finest anti war songs ever written in any genre. It is bitter, angry, spits out at you from start to finish, and is the best example of what Fish described at the time as new prog - bands who loved the old music, but had also lived through and learned from punk. The military timings of the denouement are not just clever, but also compelling.I give this five stars. It is an essential piece for any discerning prog rock collection, not just because of the quality of the music, although that deserves the rating itself, but also to appreciate how important it and the band are to the second wave of prog which started in the UK in the early 1980's. It tells stories with vital and real images.Although a vastly different band now, this started off a career that has delighted and intrigued me for most of my adult life. Eternally grateful....."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Thursday, September 3, 2009",
      "rating": 4,
      "text": "From the very start this album is conjuring up the great days of Genesis' 'Selling England by the Pound'. This used to impress me more when I was 16 then it does now. It's a bit uneven in song quality and the vocals sound strained at times.But the timing of the album, the exceptionally beautiful artwork and the standout tracks like 'Chelsea Monday' and 'the Web' still make this a classic album. If you add the bonus disc with Grendel, Market Square Heroes and Three Boats Down From the Candy you have a top-package of early Marillion music.Marillion would only get better on subsequent efforts where they reached an better mix of their love for vintage prog with the pop sensibilities of the 80's. An essential title nevertheless."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Monday, November 2, 2009",
      "rating": 5,
      "text": "Marillion debut album. Great event in progressive rock history - neo-prog was born. I am not a big fan of Marillion, but this album is great! With many influences from 70-s, you can discribe them as modern Genesis (from Peter Gabriel era).Music is melodic , energetic and ...fresh!!! I believe this album will become classic ( and it is extremely rare thing when we speak abot so called \"neo-prog\"). I like Fish voice ther, drive and melodies, nice sound - everything!!!It's pity, but after few more albums Marillion became just one of faceless neo-prog band. In fact, I am not sure about all that name - \"neo-prog\". It's more name about time, not music. For me Marillion debut became next logical step after canadian Saga few first albums. Saga isn't neo-prog, and Marillion is. What the difference? And more: after Marillion few first albums succcess there were born myriad of semi-professional band playing some mish-mash of Marillion, art-rock a-la 10 cc and Roxy Music, plenty of citates from all the possible bands from 70-s. Usually without new ideas at all, with very average tecnhique of musicanship, and with hundreds of faceless albums. All that was named neo-prog. Ok, there are few so-so bands, as IQ, etc., but all others aren't accessible for listening and I believe the history will delete them as synthy-pop from 80-s, or disco.But this Marillion album will stay as perfect example of progresive from early eighties."
    },
    {
      "reviewer": "Nightfly",
      "date": "Posted Friday, December 18, 2009",
      "rating": 3,
      "text": "While the progressive rock revival of the early eighties gave birth to some excellent bands my initial impression of the early days of the neo prog movement was one of disappointment. Of that first wave of albums including Script For A Jester's Tear by Marillion and the first releases from IQ, Pallas etc, nothing came close to the excellence of the bands they were influenced by like for example Genesis and Yes. They fell short in the musicianship department and the songs though clearly inspired by the music I had grown up with in the seventies, to my ears were watered down versions with a more commercial edge.With the benefit of twenty six years since it was released I'm able to look on Script For A Jester's Tear more favourably than I could have done then, judging it on its own merits rather than a direct comparison to the seventies heyday of prog. The word that went around at the time though was about this band called Marillion who were going to be the new Genesis, sounding like the band did in their early days. This was very exciting news as Genesis were now well and truly going down their more mainstream road. The reality was somewhat different however. Here was a band clearly influenced by Genesis, but lacking the musical skill and experience to truly pull it off.Over the years I have grown to appreciate Script more as a reasonably good neo prog album. The six songs, most around the eight minute mark show a band developing their songwriting and musical skills with some decent melodies and enough space to stretch out over different musical themes. The results while being a little predictable at times and a bit leaden in execution, particularly in the rhythm section show a band with promise which would be fulfilled a couple of albums later on Misplaced Childhood and Clutching At Straws. The best of the bunch here is Forgotten Sons which flows better than most of the album, some of the musical joints lacking cohesion and some themes being undeveloped. Here though they nail it and create some musical tension, lacking on most of the record.Script For A Jesters Tear while having grand intentions falls short of excellent, to a large extent down to the band at this stage lacking the musical chops to match their vision. Hats of though to guitarist Steve Rothery, who's Dave Gilmour influenced style was already showing promise. Marillion did get much better though and lets face it, this albums a far more satisfactory piece of work than the first Genesis album. Good but far from essential then."
    },
    {
      "reviewer": "friso",
      "date": "Posted Thursday, March 25, 2010",
      "rating": 4,
      "text": "Perhaps the biggest difference between sixties psychedelic music and seventies prog is the subject of the lyrics. Had once the trippy zeitgeist of the era been the main inspiration for lyrics; now the artists started exploring making music based on brand new fantasy stories with a dramatic and/or philosophical edge (King Crimson, Genesis, VdGG, etc). Marillion took up on this tradition, but gave the symphonic progressive music back to the man in the street in a way. The drama, the make-up and stories are still here, but the lyrics are now inspired by the political and social issues of the day. Fish had the theatrical potential to really reach for the listener with performances on all these songs, whilst the band reinvented the symphonic prog sound for the eighties. More controlled, rhythmically constant and less based on individual prowess of the musicians involved. Yet, the songs have their unique way of unfolding themselves thought a string of melodic themes and symphonic chord progressions. Guitarist Steve Rothery would become a hero of the genre, though I think he reached his maximal potential around the 'Clutching at Straws' album. The keyboards by Mark Kelly have a full and modernized sound. The choices of the production continue to influence the sound of neo-progressive rock today. The overall sound of Marillion's debut is much better than that of its contemporaries and has therefor stood the test of time quite well. Moreover, writing strong lyrics on political en social issues is extremely hard and you'll see modern neo-progressive rockbands either refraining from it or failing miserably at it. Oh yeah, of course this record is influenced by Genesis in a big way. Which is why I tried to write about what makes it so distinctly different and original."
    },
    {
      "reviewer": "J-Man",
      "date": "Posted Thursday, April 8, 2010",
      "rating": 5,
      "text": "One of the Best and Most Relevant Debuts in Prog Rock HistoryScript For A Jester's Tearis one of those albums that, whether you love it or hate it, is a defining album in the progressive rock genre. In 1983 almost all of the progressive rock giants of the seventies were in a downward spiral into commercial songwriting. Marillion emerged from the U.K., creating an unexpected progressive rock masterpiece in 1983 withScript For A Jester's Tear. Twenty-Seven years later, this still stands as one of the finest progressive rock albums out there.The first time I heardScript, it was one of the most remarkably positive first listens I've ever experienced. The first time I heard this I was absolutely blown away, and soon bought all of the Fish-era Marillion albums. Having heard all four of their early albums,Script For A Jester's Tearisn't even my favorite album with Fish behind the microphone, which just shows what a great band Marillion is!I've often heard this album (and band) called a \"Genesis clone\", and I can't help but feel a little offended whenever I hear that. Sure, Fish sounds a hell of a lot like Peter Gabriel, but once you look past that, these two bands don't have much in common. This debut has a very distinct 1980's sound, mostly in the production. The drums have that distinct 80's synthetic sound, and the synthesizers sound from the era as well. I wish the production quality were better, but it's not that much of a problem. The music is so great that I can excuse a few flaws from a production perspective.The music played here is symphonic prog rock. It has 80's production values and instrumentation, so you can call it \"neo-prog\" if you want, but I always just look at this album as progressive rock. I think the neo-prog label on any band is a little misleading. \"Neo-prog\" was essentially a movement that revitalized prog in the 80's, but the bands in the movement still played normal prog rock in the vein of any other symphonic prog band from the 70's.One of the best things about early Marillion in my opinion is the fantastic vocals and lyrics from Fish. His singing style can be so emotional, yet he can be so aggressive and powerful as well. Fish is one of my favorite singers, hands down. The lead instrument on this album is usually Steve Rothery's guitars. He gets most of the solos, and Mark Kelly's atmospheric and melodic synthesizers are usually in the background. This contributes significantly to Marillion's overall sound.The drumming from Mick Pointer is decent. He doesn't really do anything special, but he gets the job done. I do, however, believe that this album would have certainly benefited from better drumming. The bass playing Pete Trewavas is pretty great as usually. I do think he got better with time, but he still does a fantastic job on this debut album.This album consists of only 6 songs, most of which are over the 8-minute mark. All of the songs are fantastic standalone tracks, as they are all memorable and easily distinguishable from each other. It'd be hard for me to pick a favorite because, as I said earlier, all of the songs are absolutely fantastic! There isn't a single weak track on all ofScript For A Jester's Tear. If I had to pick a favorite, it would either be the title track,The Web, orGarden Party. They all are well worth hearing, though.Conclusion:As I've mentioned earlier,Script For A Jester's Tearis a complete masterpiece, so don't be surprised when you see me give this album 5 stars. This isn't even my favorite Fish-era Marillion album, but it would be a crime for me to give this less than a perfect rating. If you're new to progressive rock, this should be one of the first albums you hear. It really is THAT good!5 stars."
    },
    {
      "reviewer": "The Sleepwalker",
      "date": "Posted Thursday, May 6, 2010",
      "rating": 3,
      "text": "Marillion's debut is considered to be the beginning of the subgenre of neo-prog. The sound that the band creates on this album could easily be described as an 80's reincarnation of Genesis in their progressive heyday. Still, there is a difference between the sounds of the bands, very notable being the very dominant synthesizers and somewhat heavy drums on this album, which I suppose are part of the sound that's distinctive for the 80's.I'm not really sure where the album gets it's high ratings from, but I suppose the historical value plays a role in it. Personally, I find the album to have quite a few very weak moments, such as the title track, which seems to lack any direction during the first half; Fish's immature and forced vocals on \"He Knows You Know\"; and the gimmicky feel that \"Forgotten Sons\" has at times. Fortunately there's plenty of good material on it, like \"The Web\" and \"Garden Party\", both being songs full of warm synthesizers and interplay between soft and gentle verses and bombastic riffs and solos. Also, Steve Rothery's guitar playing on the track \"Chelsea Monday\" should be mentioned, as he delivers some great melodic solos there.Apart from the dominant synths and thick drums mentioned before, Fish's vocals also stand out in its own way. The vocals could easily be compared with those of Peter Gabriel, having a similair sound. Fish also states to be influenced by Peter Hammill, known best from the band Van Der Graaf Generator, which might explain his sudden outbursts and sharp vocals at times. Though I'm a big fan of Peter Hammill, these fierce outbursts by Fish often sound somwhat forced and immature and therefore annoying, in particular on the song \"He Knows You Know\". Fortunately Fish doesn't sing like this constantly, and his less fierce parts sound excellent.Script For A Jester's Tear is a decent debut by Marillion. It's got many flaws, and therefore is not much of a consistent disc, but fortunately there also are plenty of enjoyable moments. The album might appeal in particular to those who enjoy Genesis and aren't scared away by pounding drums, dominant synths, and a tad rough vocals."
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Sunday, May 23, 2010",
      "rating": 5,
      "text": "Synonym of progressive rockI'm in front of another breath-taking debut album! It's Script for a Jester's Tear by Marillion. It's very hard to review such a phenomenon album. Probably one of the best albums in music history. Constant magic full of energy, emotion, great compositions and polished musicianship. This album turns around the destiny of dying progressive rock and creates one of its main streams - neo-progressive rock, despite being a strong return to the typical symphonic rock of Genesis. Especially the voice of Fish,which is real reminicent of Peter Gabriel's. All that embarrass some people, who don't want to judge the album only on its own merits. It's perfect note by note. Every single tune is situated where it has to. Moreover, it's the right successor of Genesis' legacy. I think after all these words I would not comment Script for a Jester's Tear song by song. It's completely unnecessary! Highly recommened for all who loves music in general, sincerity in art and those who believe in God, because this album wasn't made by humans, but by God!"
    },
    {
      "reviewer": "EatThatPhonebook",
      "date": "Posted Saturday, August 14, 2010",
      "rating": 2,
      "text": "The start of the best and most talented Neo Prog band ever is this album, an excellent effort that seduced and fascinated many progressive rock fans. \"Script For A Jester's Tear\" is today considered the best and most important album of the genre, even though it has a very strong competitor, the band's third album, \"Misplaced Childhood\", which is in my opinion their greatest masterpiece. In fact, frankly speaking, I find this album a bit overrated, even though there are some moments and songs that are in my opinion worth the listen and rightfully acclaimed, like the wonderful title track, a tour de force of the band.With my surprise, in this album I found less Genesis like vocals, but more Genesis like instrumentation, very enjoyable at times, mixed with the heavy synth 80's moods, a unique element in Marillion (Fish era) music. Some parts are even influenced by melodic and cheesy like pop of the time, even though there is always a great original touch to it.Many consider this the best Neo Prog album because it contains in the most quintessential way one f the most interesting and fascinating themes of this genre: the theater, great medieval courts and halls, Jesters, minstrels. I'm not sure if the lyrics concern exactly these subjects, but I always feel like I'm in another world, medieval times, when I listen to Marillion and in particular this album.The first three songs are incredible: the title track is a bomb, with beautiful melodies, delicate at times while in others epic sounding and haunting like few other Marillion songs. \"He Knows You Know\" is another gem, a great melodic piece with some great moments by Fish, and a surprisingly good work from the backup vocals. \"The Web\" is the song that has the most epic taste, thanks to the haunting and appealing melody, which reminds of Medieval pieces, thanks also to some great passages and to the length of the track, almost nine minutes.From here it goes downhill: \"Garden Party\" has some nice moments, but it isn't exactly a great song, since it has it's weaknesses, and \"Chelsea Monday\" has some really goos moments and passages, but overall it never really convinced me. Finally, \"Forgotten Sons\" is definitely the weakest track off this album, long, boring, repetitive and easily forgettable.As a conclusion, I would consider this easily an excellent addiction to any progressive rock fan, but definitely won't consider this an essential masterpiece, since, like I said earlier, it has it's weak moments."
    },
    {
      "reviewer": "stefro",
      "date": "Posted Wednesday, October 13, 2010",
      "rating": 4,
      "text": "Though Marillion remain popular to this very day, for many, it is the first four albums that really matter. Released in 1983, 'Script For A Jester's Tear' would kick-start a hugely-successful decade for the group, with follow-up 'Fugazi', the commercial smash 'Misplaced Childhood' and 1988's 'Clutching At Straws' all continuing the shiny, keyboard-and-guitar dominated neo-prog themes. Of course, the glue that links these four albums is lead-singer Derek Dick, more commonly known as Fish, and once he left the group thanks to internal tensions following the release of the popular 'Clutching At Straws', Marillion would change forever. However, this is where the Marillion story begins and, alongside 'Misplaced Childhood', it remains the group's defining statement, a cunningly-crafted, pop-edged, instrumentally- impressive album filled with haunting melodies and Fish's trademark squawking jester vocals. Both the title-track and the epic 'The Web' are the stand-outs on an album with a strangely- sombre tone, but in truth, one can happily listen to 'A Script For A Jester's Tear' all the way through without feeling the need to flick the needle forward. Alongside IQ's 'Tales From The Lush Attic' and Twelfth Night's 'Fact & Fiction', this is undoubtedly one of the high watermarks of the early-1980's neo-prog scene. STEFAN TURNER, LONDON, 2010"
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Tuesday, November 23, 2010",
      "rating": 3,
      "text": "The debut album release from the most recognized Neo Prog artist in the world. Released unto the British public on March 13 of 1983, the single \"He Knows You Know\" was released on the last day of January. Mark Wilkinson's distinctive artwork would grace all of the band's first eight albums. I'll never forget the reverence with which my musical friend held this album in--it was as if the Second Coming (of PG-era GENESIS) had just happened! I heard this album the day it came to American record stores--my roommate bought it on the basis of album cover and proceeded to play it to death. While I was impressed that (finally!) a band was trying to imitate (\"carry forward\" I liked to say) the Gabriel-era GENESIS sound, I was dismayed with the quiet, murkiness of the sound--instruments and channels were so melded and quiet--I could hear the Gabriel-like vocals and Hackett-like guitar parts, and could see/hear the mythic references similar to GENESIS but it wasn't appealing--it wasn't catchy enough or inviting enough to draw me in, get me involved, get me to like it.1. \"Script For A Jester's Tear\" (8:39) our initial introduction to \"the new Genesis.\" The styling imitation is unmistakable but sound choices, engineering, and subtleties in Fish's voice make this not quite as close to the masters as one would try to have us believe. Still, an admirable construction and even higher praiseworthy performance from the lead singer. Organ and guitar are weak, drums and bass worthy. (17/20)2. \"He Knows You Know\" (5:22) BABYLON-sounding electric guitar intro precedes sparse and simple foundation over which Fish's highly-theatric Peter-Gabriel-like voice tells his story. I find it hard to believe that this was well-received as a charting single in both the UK and USA. There must have been a lot of Old Genesis-starved consumers out there at the time. Gabe was never as demonstrative as Fish was. This must be where DISCIPLINE's Matthew Parmenter learned his chops. (8.75/10)3. \"The Web\" (8:48) descending blues-rock chord progression (think the ending of Led Zeppelin's \"Stairway to Heaven\") supports opening vocal until things soften drastically in the second half of the opening minute for a more delicate story-telling section. This 100-second heavy-delicate pattern cycles through thrice before Steve Rothery is given the first instrumental solo at the four minute mark. He does show some nice chops despite his thin, mixed into the back sound. Nothing very new or exciting here. (Once again, I may be handicapped by my inability to hear/process lyrics.) There are definitely some issues with the isolation with which each track is beholden to; the music never seems to blend. (16/20)4. \"Garden Party\" (7:15) sounds so much like one of GENESIS's earlier more staccato songs (think Nursery Cryme). Yes there are a few unique flourishes here and there, and, of course, a new libretto, but the song could otherwise have been stolen from the Trident Studio cutting room where Nursery Cryme was edited. Fish here displays his usual exceptional theatric story-telling acumen but shows flaws in his actual singing voice (pitch and sustain). (12.5/15)5. \"Chelsea Monday\" (8:16) though the music opens sounding a little more New Wave-ish (Esp. treated drums) but the vocal and even lyric sound like they were nearly directly lifted from a Peter Gabriel Genesis performance. AT 2:10 things kick into full force with a classic blues-rock Neo Prog vengeance. Steve Rothery's guitar seers in a solo of over 90 seconds (though he cheats a bit with the addition of a second track to reinforce and harmonize some of his notes). A soft tinkling synth and picked guitar passage ensues as Fish sings. Sustained and wah-ed lead guitar notes accompany Fish's transition back into full force voice and then Rothery really begins to soar and seer despite Fish's persistent vocals and shouts of \"Chelsea Monday.\" Pretty good song; great performance from Fish and Rothery. (17.5/20)6. \"Forgotten Sons\" (8:21) surfing through televisions stations is superseded by another pseudo-New Wave passage until 0:50 when synth and staccato power chords signal a shift. The guitar solo that follows sounds as if Rothery is trying to mimic the guitar sound of Flock of Seagulls' PAUL REYNOLDS. An annoying metallic rhythm guitar remains persistent throughout, even when the music style and sounds shift in the third minute. At 4:10 there is a pause and then another shift as increasingly numerous voices read a kind of prayer or declaration of grievances and power. At 5:48 a door opens into a completely lush GENESIS soundscape over which Rothery and Fish perform with notable confidence and restraint. This final section is almost enough to salvage this otherwise forgettable son(g). Nice way to end an album--leaving the listener with a positive impression. (17/20)Total time 46:41To my ears, the sound production on this album was always too quiet, too compressed. With all of the subtleties that were occurring on multiple layers at any given time, I felt as if I'm always straining to hear the music. I believe that much of the power concealed in this music has been trapped within this constrained, closeted effect. I have the same \"problem\" with all Fish-era Marillion: it does more to put me off and irritate me than draw me in. Too pretentious, too imitative, too weak melodically and certainly lacking in the classical and folk influences that the originators drew from. I'll take the lush simplicity of Hogarth-era Marillion over this stuff any day.B/four stars; a nice addition to prog world but by no means the Second Coming."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Friday, April 29, 2011",
      "rating": 4,
      "text": "Marillion and Fish are as iconic as the 80s decade itself.The debut for Marillion is a milestone album that virtually started the Neo Prog genre single handedly and also kept alive the prog scene during the difficult 80s. Prog took a nosedive after the glorious 70s and bands like Rush and Marillion were the saviours of the genre.Fish was the mastermind of the band and his enigma shines through on the debut. Fish's dramatis personae, composure and self assuredness holds the album together, and he is well supported by the incredible keyboard wizardry of Mark Kelly, percussion by Mick Pointer, the indispensable Steve Rothery on guitars and maestro bassist Pete Trewavas, who would later continue to dazzle as Transatlantic's bassist.The tracks have become bonafide classics, namely the title track, The Web, Garden Party and Chelsea Monday. The epic Grendel raises her ugly head, on the bonus CD version and is well worth a listen, and Market Square Heroes is included among other singles and alternative takes, so it is definitely worth getting hold of the bonus double CD version.Trewavas is excellent on bass and the guitar work throughout is absolutely exceptional. The songs have infectious hooks and the voice of Fish is mesmirising, a storyteller style with high octave resonating timbre. The songs are lengthy with a great deal of instrumentation to revel in. Although the debut album is definitely not my favourite from Marillion, this album is still excellent Neo and is important for grounding the foundation for other Neo style bands to come such as Pallas or IQ. This album acts as a blueprint for how to reinvent music. \"Misplaced Childhood\" would bury this for sheer quality but \"Script for a Jester's Tear\" is highly revered as one of the greatest albums of the 80s."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Thursday, November 24, 2011",
      "rating": 5,
      "text": "The neo-prog movement had already been underway for a couple of years at least when Marillion's debut album came out, but this is the release which made it catch fire - in particular, the fact that a new prog band could emerge in 1983 and bring out an album which made it to the top 10 of the album charts was amazing to all. The album deserves it too; despite critical sniping about the band's similarity to Genesis, the fact is that Marillion had their own distinctive and original sound straight out of the gate. Yes, you can hear Genesis influences here and there - in Fish's theatricality, say, or in the pastoral interlude in Garden Party - but you can also hear snatches of Camel and flashes of more modern New Wave bands if you listen carefully. What's more, the emotionally fragile and bleak atmosphere captured on the album's best tracks - such as the title track or Forgotten Sons - is unmistakably Marillion's own.The one criticism I'd have of the album is the usual one - Mick Pointer's drumming is workmanlike at best and doesn't really add much to the proceedings. Then again, he isn't much of a presence on the album - a lot of the time his drums are either quite low in the mix or are simply not playing. But even this isn't enough to knock the jester off his perch. Five stars."
    },
    {
      "reviewer": "Marty McFly",
      "date": "Posted Monday, December 12, 2011",
      "rating": 5,
      "text": "The first album where bonus songs are as strong as the original ones.The album that started it all, the one many following acts will be trying to imitate (more or less successfully) and also the album where \"the voice\" shines fully. It's wonderful, how many colours, emotiones and pain Fish can handle, isn't it ? One then wonders how much of these stories is true.The model album how Neo Prog and Prog itself should sound like, exploring interesting themes (lyrically it's a heaven) comparable with Selling England By the π, with a great cover art (you can imagine the suffering and occasional joy of the proverbial jester.Even the most conservative members of our Prog society thaws here and rate highly, so what can you expect of someone like me, known symphatisant with all genres of Prog.5(-), so don't give me your effing problems!"
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Friday, April 13, 2012",
      "rating": 3,
      "text": "Historically Critical, but a Child of its TimeI think it is fair to say that every prog fan should have SCRIPT FOR A JESTER'S TEAR. It is an essential part of the history of prog rock and I hold a respect for it somewhat as I do the Beach Boys' PET SOUNDS. At the same time, neither of those records really connect with me and both sound extremely dated now. While every single reviewer notes the Genesis comparisons, what instead is the most dramatic first impression left by this album is the early 80's key sounds, over the top reverbs, and production style. This album, to me, has more in common with Styx's MR. ROBOTO than Genesis' FOXTROT.The only viable rock drummer in my high school was a year older than I, and basically lived in a Marillion shirt while everyone else wore Metallica or Iron Maiden. I always thought the artwork was interesting, and borrowed albums from him a few times to try to figure this odd sound out. I never did. The production on this is so heavy handed that it takes alot of work for the musicianship and songwriting to come through, at least for me now. Even back in the 80's, the sound itself overwhelmed the lyrics. The drum sound is terrible, and the key tones lack interest. The guitars would actually sound pretty good if the reverb were simply dialed back 50%. In 2012, the ethic is on the opposite end of the spectrum now with everything being mixed to sound like its 2 feet away from your face in a closet. But even by 80's standards, everything here is underwater.The production is not the only thing that scream early 80's. There are new wave allusions a la Blondie or perhaps Discipline era KC as in the mid section of \"Forgotten Suns.\" The video- game ethic is still evident. Some of melodic themes do remind me of Dennis DeYoung. Mark Keys' synths are as much Asia or Kansas as Tony Banks. Fish's dramatic delivery alludes to Gabriel but is actually much more over the top and arena targeted. To be sure, he is one of prog's most powerful vocal stars. His skills include some of Hammill's tricks and crazed tension.Digging through this, however, reveals some nice theatric prog. I agree with other posters that \"Garden Party\" is probably the best track, but all of the album is good. The pacing is also strong, with good contrasts and variety in emotional subject. The energy is powerful. As with all neo-prog, there's a certain pop element that is not my personal preference. And aside from Fish, none of the players really have anything new to offer. Steve Rothery is certainly solid on guitar, but we've heard it all before. On the other hand, some of Mick Pointer's fills are pure cheese.It's extremely difficult to rate a classic that is long past its prime and doesn't connect with me much personally. I'll go right down the middle."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Thursday, January 10, 2013",
      "rating": 3,
      "text": "I feel somewhat left out of the historical and emotional impact that Marillion had in 1983 simply because I was born a few years after the fact. So, I don't have that first-hand account as to the impact/hope it gave to the underground progressive rock scene of the '80s.I first heard Marillion through their last album with Fish in CLUTCHING AT STRAWS, and the man's vocal delivery sounded halfway between Peter Gabriel's theatrics and Phil Collins's timbre. On SCRIPT, Fish apparently went near-full-throttle Gabriel on the voice including the emphasis on the dramatic side of the voice. So, it's my understanding that Fish's vocal delivery is the reason for the many Genesis comparisons. Everyone else in the band just has shears of influence mingled with other styles to create their own playing style, guitarist Steve Rothery in particular. The man sounds as equally influenced from Gilmour and Latimer as he does Hackett. And Mark Kelly's keyboard array fits into the term ''contemporary'' without getting too annoying.The songwriting itself varies throughout the album. The big draw card for SCRIPT FOR A JESTER'S TEAR for progsters is that 2/3 of the content breaches the eight minute mark, enough for a cozy sit-down with the music but short enough to be satisfying. All four of the eight minute tracks have their moments, but the title track is the most gripping, opting to really scale the dynamics and jerk at those emotion strings, and quite effectively. The remaining three eighters all have their moments but ultimately run too long for their lengths. The little rant in the middle of ''Forgotten Suns'' sounds little more than a big lipped alligator moment to me in the realms of it not making any sense and being so goofily over-the-top.The two shorter tracks actually steal some of the fun from the big daddy epics. ''Garden Party'' is an extremely close second place on the album in terms of quality with the edge on the bass and the slight shift in the metre (the song is not in your standard 4/4 if you listen closely). ''He Know You Know'' is little more than an '80s pop prog pastiche, but sometimes the album needs a song of lesser intelligence for balance.Recent bonus reiusses add more content from Marillion's early days that didn't quite make it on the record. One of those is an enjoyable little pop tune called ''Market Square Heroes'' which really would have fit nicely on the original record. Another is the mammoth epic ''Grendel'', or the 1983 version of ''Supper's Ready''. The comparisons are quite obvious, particularly the ending section which bears an uncanny resemblance to ''Apocalypse in 9/8'', but there's a section in the middle that I swear was from Alice Cooper's ''Halo of Flies''.In short, if you like Genesis theatricality mixed with Pink Floyd simple complexity wrapped in '80s keyboards, then SCRIPT FOR A JESTER'S TEAR will fit nicely in your collection. I actually think this is a rather decent to good album that had the potential to be great if ''Market Square Heroes'' was included and some of the epics were more fleshed out."
    },
    {
      "reviewer": "rogerthat",
      "date": "Posted Saturday, October 5, 2013",
      "rating": 4,
      "text": "There are many prog albums over the years that have enjoyed a dazzling musical entrance. The mighty riffs of Red or the piano arpeggios of Can You Understand (Ashes are Burning) come to my mind immediately. Not many albums, however, have enjoyed a striking lyrical entrance, with the vocalist softly rendering a powerful turn of phrase. Script for a Jester's Tear is one of those few. \"So here I am once more in the playground of the broken hearts\". With such a spirited entrance, it is hard for me, at least, to dislike the album that follows.Not only does this line serve as a fitting opening to the album, it is also used as a motif for the title track as such. It is a technique that singer and lyricist Fish employs throughout the album. Not just a repetitive chorus, but a lyrical motif as a theme is explored through the length of a composition. As you can gather from this, Script for a Jester's Tear is very much a lyrical album.Menswear's review mentions that this is an album that you need to read the lyrics along with to enjoy. In addition to that, I would also opine that your interpretation of a track's emotions might be completely at odds with what the band intended if you do not read the lyrics. Let me explain. For instance, Chelsea Monday sans lyrics might sound like a cheesy, overly melancholic dirge. That is at least the impression I got and, combined with Fish seemingly wailing through it, it may not be an inviting proposition. But on reading the lyrics, one gathers that it is a biting, ironic account of a narcissistic starlet. Thereafter, my impression and opinion of the track changed greatly. I especially love the lines, \"Perform to scattered shadows on the shattered cobbled aisles/Would she dare recite soliloquies at the risk of stark applause\".Lyrically, Marillion are hard hitting, emotional and poetic right through, also attacking high society, politicians and war along the way. Their assault, unlike Genesis's witty approach, tends to be direct and in your face. Fish accentuates this directness to further distinguish the band from Genesis. He is usually heard wailing, shrieking or growling (NOT death- growls, mind) and Peter Gabriel-esque light hearted moments of pop comic relief are nowhere in sight. The emphasis is on forcefulness rather than finesse.The finesse (or relative lack thereof) is also what distinguishes Marillion further from not only Genesis but the other prominent bands of the first wave of 70s prog. There's not much by way of subtlety in the music. Similarities with Banks and Hackett begin and end with arpeggios and the tone respectively. It might sound closer to 80s Banks, I give that.But this is essentially hard hitting, keyboard based 80s rock music attempting to fit into the complex structures of 70s prog. The textural depth of great 70s prog which made the complexity more palatable is not quite in evidence here. Mark Kelly's keyboards sound rather predictable after a while and there is more of Kelly and less of guitarist Steve Rothery on this album. That would change to an extent on Fugazi and more the better, in my opinion. The drums too lack dynamics and tend to be rather loud and stiff. Even as Fish slips into soft falsettos to contrast his grittier, angrier moments. The expression in Fish's lyrics and vocals doesn't seem to be evident in the accompanying music, save some superb Rothery solos. The \"Oh, it was the 80s\" apology doesn't entirely convince me because Kate Bush used 80s technology to craft the incomparably more eclectic The Dreaming. Nor is the musicianship nearly as virtuoso as on King Crimson's Discipline. Who's to say that, given the chance, even in the 70s, Marillion perhaps may not have matched up to the standards of Genesis or King Crimson, musically that is.Still, the complexity of five of the six tracks (excluding the radio-ready He Knows You Know) also serves to make it an engaging listening experience. Taken together with the lyrics, the album is more than solid and has an appealing consistency (if a bit tiresome on days when you are not quite in the mood for listening right through). Four stars for a very satisfying album that just lacks that something extra to push me to consider a five."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Tuesday, January 7, 2014",
      "rating": 5,
      "text": "Although the neo-prog branch of symphonic progessive rock started in the 70s, it's pretty easy to pinpoint just where the movement caught fire in the drought years of the 80s. MARILLION burst onto the scene with this classic and reminded the musical world that prog wasn't dead but merely taking a siesta while all the angry punkers were having their short stint in the limelight. As the punk scene was becoming splintered into diverse new arenas such as new wave, no wave, post punk and more, MARILLION delivered a message that despite the attempt to suffocate the movement by dumbing everything musical down to the lowest common denominator, prog was like a nasty weed that continues to grow and thrive in the cracks of the pavement.Although Fish does nail the Peter Gabriel thing quite spectacularly, I would have to add that he sounds much more like Peter Hammill at times. With strong and lengthy compositions and energetic band members delivering with gusto this is one of my favorite albums in the whole neo-prog subgenre. Fish has never sounded better and despite my usual dislike of overtly borrowing of another's past workings I have to admit this album delivered the right thing at the right time and was done extremely well at that. One of those cases where I like the influenced better than the influencers."
    },
    {
      "reviewer": "Modrigue",
      "date": "Posted Wednesday, May 4, 2016",
      "rating": 4,
      "text": "First and best neo-prog album ever?Released in 1983, \"Script For A Jester's Tear\" marks the genuine birth of the neo-progressive rock genre. MARILLION mixes various ideas from the 70's prog masters like GENESIS and PINK FLOYD with the energy, urgency and synthesizers of the 80's. One may find the influences too obvious, the songs less complex and interesting, and Fish's theatrical singing trying too much to mimic Peter Gabriel's. However, from these elements, the band manages to modernize (at the time) progressive rock and to define a new musical sub-genre. This first opus already offers a novel approach, many keyboards and guitar soli, and sonorities that cannot be found in the 70's classics.Featuring several ambiance changes, the title track is a true delicate depressive musical drama. A little gem, with an aerial guitar. On the contrary, \"He Knows You Know\" is rock-ier and sharper. The fantasy synthesizer playing will become typical of the neo-prog style. Then comes \"The Web\", alternating tense and soft beautiful passages. This song contains very nice and refreshing keyboards and guitar soli.Although less remarkable than the other songs, the punchy \"Garden Party\" is also quite pleasant. The melancholic \"Chelsea Monday\" contains a pretty unreal guitar play, sometimes sounding Gilmour-ish, but used in MARILLION's world. This magical atmosphere was quite new at the time. The powerful finale is simply great. The ender \"Forgotten Sons\" is my favorite song of the record. Featuring the most lively and ferocious passages of the disc, it also shows different influences, like a slight funky feel. A successful marriage between keyboards and lyrical guitar, with a beautiful evanescent finale. It rocks!Although shorter when compared to the prog classics, the compositions manage to offer good progressions, changes and variety. MARILLION manages to build their own identity by merging their different seventies inspirations into the musical landscape of the eighties. Despite a dated sound, this first opus is rather refreshing and promising, and opens new horizons for other bands to come.Simply essential for every fan of the genre. Also the one to start with for Gabriel-era GENESIS lovers. With \"Fugazi\", \"Script For A Jester's Tear\" is MARILLION's best album, as well as one of the best neo-progressive record of the 80's!"
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Thursday, July 13, 2017",
      "rating": 5,
      "text": "Review N� 128\"Script For A Jester's Tear\" is the debut studio album of Marillion and was released in 1983. The album was released after their fantastic EP \"Market Square Heroes\" with also \"Three Boats From The Candy\" and on the B side with their great epic \"Grendel\". The line up on the album is Derek Dick \"Fish\" (vocals), Steve Rothery (guitars), Mark Kelly (keyboards), Pete Trewavas (bass) and Mick Pointer (drums). Beyond \"Market Square Heroes\", this is the only album to feature Pointer in the group. He left Marillion to found Arena where he is still their current drummer.\"Script For A Jester's Tear\" has six tracks. All songs were written by Fish, Rothery, Trewavas, Pointer and Kelly, except \"The Web\" which was also written by Brian Jellyman and \"He Knows You Know\", \"Garden Party\" and \"Forgotten Sons\" which were also written by Jellyman and Diz Minnett. The first track is the title track \"Script For A Jester's Tear\". This is a fantastic song, is a brilliant opener and is also without any doubt a memorable musical moment on the album. It's clearly progressive rock music with a strong melody and sung wonderfully by the magnificent voice of Fish. It's a song that reminds us perfectly, the good old times of the progressive rock music, especially the masterpieces of Genesis in the vein of Gabriel's era. The second track \"He Knows You Know\" was the song chosen to be Marillion's second single and is a song that tells us about the abuse of drugs, and alludes particularly to intravenous drug use. This is the shortest song on the album but it's still a great track and represents also another great musical moment on the album. It's a very powerful song with powerful lyrics too. The song begins with the guitar followed by Fish's voice and soon the keyboards appear also and then, the song reaches its great musical climax when the drum section enters on the scene. The third track \"The Web\" is another great song with a beautiful composition and powerful lyrics and is very enjoyable to listen to. Probably it isn't as appealing as the other two previous songs, but it's without any doubt a song that fixes us firmly into the territory of the progressive rock music. This is a very melodic song and it has also a magnificent harmonic musical progression, making of it a truly progressive track. It has also magnificent individual musical performances, especially the fantastic guitar work of Rothery and the magnificent and bombastic keyboard work of Kelly. The fourth track \"Garden Party\" was another song chosen to be released as a single and it was their third single. This time, the song is a parody of social elitism and snobbery in our society and this is probably the least depressing song on the album. The lyrics are absolutely fantastic, very satiric, and it represents perhaps Fish's best lyrical performance on the entire album. This song reminds me strongly the very personal and unique style of Gabriel in the good old Genesis' times. This is also, in my humble opinion, another great track. The fifth track \"Chelsea Monday\" is another great song and represents another highest moment on the album. This is one of the simplest tracks on the album but it's still a very powerful song. It became one of the classic songs of the band and it remains, even today, as fresh as it was in those days. This always was one of my favourite songs of the group, very mellow with a very reach musical ambience and with also very deep lyrics that almost make us cry. The musical arrangement of this song is, for my taste, absolutely fantastic. The sixth and last track \"Forgotten Sons\" represents another highlight of the album and is without any doubt a perfect way to close this incredible musical work. This track represents for many of us the best musical moment on the album. The opening of this song is very powerful and reminds us a group of soldiers marching into their destination, the battlefield. It's also a song with very powerful lyrics and a clear political message. This is, in my humble opinion, one of their greatest pieces of music with absolutely fantastic individual musical performances, culminating with a great guitar solo. This is really a very powerful and overwhelming song, a great close for the album.Conclusion: It's commonly accepted that \"Script For A Jester's Tear\" is with \"Misplaced Childhood\" probably the two best studio albums released by the group in the music era of Fish. It's also true that the opinion of which of these albums is the best, is divided. Both have their supporters. However, and in my humble opinion, \"Misplaced Childhood\" is a better album because is a more cohesive and well balanced musical work. Still, nobody can't deny the fundamental importance of \"Script For A Jester's Tear\", in those times, for progressive rock. In a certain way \"Script For A Jester's Tear\" was as important as \"In The Court Of The Crimson King\" of King Crimson was for the progressive rock music in the 70's. In the summer of 1982 the punk explosion was gone but remained some echoes, a parade of a new romantic musical movement. So, when the music world seemed to be at the mercy of the new romantics, \"Script For A Jester's Tear\" represents a landmark and a breath of fresh air that progressive rock music, so needed at the time. We can even say that since \"Script For A Jester's Tear\" the world of progressive rock has raised again and no longer was the same.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Tuesday, June 2, 2020",
      "rating": 5,
      "text": "One of the best debut albums in the history of neo progressive music. After the euphoria of the 70's with the traditional groups of the genre fighting with their own demons to stay current with new proposals that revitalize them, Marillion arises to take the flag and plant it with Script For A Jester's Tear. Although they were not the first of this new wave, they were the renewed blood that the progressive needed to make flow through his veins to stay current.Not pretending to be a concept album, the one that Fish, singer and frontman, is responsible for all the compositions, Script For A Jester's Tears achieves a cohesion and structure that keeps it solid throughout its 6 songs, covering much more earthly themes than the usual cosmetic and spiritual trips in the genre. Thus, the song that bears the same name on the album is about the painful end of an intense love relationship (it is said to be an autobiography of Fish), the devastating effects of drug use in He Knows You Know; how it is better to leave behind toxic relationships to develop in freedom without being trapped in The Web, the criticisms of bourgeois and elitist society and its frivolities in Garden Party; the dreams of young women for being famous on Chelsea Monday, and finally Forgotten Sons, a tribute to those who returned from the clashes between the English and the Irish in the early 80s with disabilities, and especially those who did not return.Absolutely recommendable also Grendel, which appeared as side B of the 12 'single, Market Square Heroes, 19 spectacular minutes of a song that in my opinion should have been part of the original album, and to which justice was done 14 years later including it in a bonus disc in the remastering of the original (1997).There were many criticisms of Fish for the evident similarities of his vocal register with that of Peter Gabriel, and even more so with the music of Genesis, but that does not detract a bit from the value of compositions that did not deny their influences, but on the contrary they took them as an impulse to develop their own path, and that they would reach their peak with the acclaimed Misplaced Childhood 2 years later.Excellent album and essential for fans of the genre."
    },
    {
      "reviewer": "Dapper~Blueberries",
      "date": "Posted Wednesday, March 15, 2023",
      "rating": 5,
      "text": "I intended to review this album on its 40th anniversary, March 14th, however I was sick and thus didn't quite have the energy to review it, but better late than never right?Unlike most, I think the 80s weren't all too bad on prog. I mean, King Crimson reunited with a cool new yet still proggy sound, Kate Bush released a plethora of great prog pop albums, Rush was still going mighty strong, and avant-prog bands like Cardiacs and Univers Zero got quite popular in the threshold. It was also the decade when we got introduced to neo-prog, which then was a synth driven progressive rock movement that combined elements of new wave, punk, and prog pop into prog rock, creating this fun and inventive ideal for bands to take. Obviously, it goes without saying the genre's start can be pointed to Marillion's Script For A Jester's Tear.Released in the same year as Metallica's debut album, Iron Maiden's Piece of Mind, and Talking Heads' Remain In Light, I feel like Script For A Jester's Tear is quite the album for the 80s, and one that with time, I fell in love with.This was created in the wake of many life changing melodies the then frontman, Dereck Dick, or Fish, held within his life. Break up, drug abuse, and his encounters with the rich and war, all can be found within the album's longevity of music and what he had experienced within his life. Whilst these more personal, and more outwardly touchy subjects aren't new for prog rock, hell bands like Pink Floyd and King Crimson had talked about them for quite some time, I feel like what Fish crafts here is truly his own, and in retrospect, paints a beautiful, yet very depressing picture. I think it really makes Script For A Jester's Tear a very special album in my eyes, as I feel like it takes the best elements of more punk ideals and merges them with the fun exploration of progressive rock. To me, this feels like if Genesis or any symphonic prog band decided to make their own interpretation of Animals by Pink Floyd.Musically speaking, this album is quite some of the best prog rock you can get. Many passages on here have this overwhelming charm to it. While on first listens the Genesis inspiration is quite apparent, I feel like that inspiration goes away pretty quickly and merges within this more unique quality the band takes on. Tracks like the title track, The Web, Garden Party, and Forgotten Sons does such a charming job in my opinion within the entire beauty it all holds, and while you can definitely hear some form of inspiration within the sounds and qualities to bands from the 70s, I do not think it makes the sound any less than so, and in fact I feel like it is truly progressive, using the sounds and stylizations of bands from the past and coating them in a new coat of paint and adding a new edge to the whole is a great showcasing of progressive rock and why I really love it. I mean, it is pretty telling of this fact with the album cover. The back depicts albums from the past, on the floor, relatively hidden away in the darkness; the past is still there, but the future, the jester, is now. I think this musicality represents the entire scope of prog rock, as it looks and reflects on the past, like how Fish does within the lyrics, but it is shrouded and foggy in the wake of new things. The more I think about it, the more ingenious this whole album becomes as a metaphor for not only Fish's life, but for prog rock as a whole.It is without saying, or denying that this album is a masterpiece. Every track on here is a masterclass of prog rock standards, and while it isn't my favorite Marillion album, nor my favorite Fish era album (that title goes to Misplaced Childhood), Script For A Jester's Tear is still a boundless and quite an amazing record, taking what was and turning it into something new. It is no better time than now to see and hear this album as it is one of those prog rock classics that I feel needs more recognition. This is an ingenious, beautiful, edgy, and quite charming record if I do say so myself."
    },
    {
      "reviewer": "A Crimson Mellotron",
      "date": "Posted Wednesday, August 21, 2024",
      "rating": 4,
      "text": "If Marillion's debut single held a strong promise, the album that lived up to that promise has to be 'Scipt', the ultimate example of the classic Genesis resurgence in the 80s. With a solidified lineup, founding member Steve Rothery & Co. could now finally construct a musical product that entirely celebrates the classic era of progressive rock, as the sound of early Marillion emulates quite strongly the stylistic tropes of Genesis, while it is also at least partially informed by Pink Floyd, Peter Hammill, and ELP. All of this comes in an era seeing the decline in popularity of punk as well as the rise of new wave and heavy metal. 'Script for a Jester's Tear' is a daring piece of music that reintroduces this fascination with progressive rock, while it also stands as one of the most unhip releases of the entire decade.It would be quite futile to attempt to undermine the cult status of the album discussed here, as 'Script' introduced above all the incredibly imaginative and sophisticated poetry of Fish, as the songs on Marillion's debut album are ripe with words of bedside etiquette (no pun intended), allowing for a very vivid, dark, and even gothic imagery to punctuate the otherwise claustrophobic sounds on many of these songs. Keeping in mind that very often the melodies followed the words to the songs, one could immediately understand the role Fish had in establishing a style and a mannerism of creating music that could be referred to as Marillion's very own. 'Script' is also one of these album that charm with its lack of perfection, with the ever so valuable innocence of a young band that still lacks the experience of knowing the sound they want. The complexity of the compositions indicates nevertheless the technical ability of the band members, making up for the occasionally lackluster songwriting on some of the longer tracks. In any case the album has produced several seminal, iconic moments for the neo-prog movement and still stands as one of the very impressive, bold and consistent musical releases of that era, with all the classic prog references thrown at the band."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album668d.html",
  "last_parsed": "2025-05-18T12:48:39.234234"
}