{
  "album_title": "THE SILENT CORNER AND THE EMPTY STAGE",
  "artist_name": "Peter Hammill",
  "artist_page_link_local": "artist8ea3.html?id=443",
  "year": 1974,
  "rating_value": 4.3,
  "rating_count": null,
  "review_count": null,
  "genre": "Eclectic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/443/cover_132171152016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Modern",
      "duration": "7:28",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Wilhelmina",
      "duration": "5:17",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "The Lie (Bernini's Saint Theresa)",
      "duration": "5:40",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Forsaken Gardens",
      "duration": "6:15",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Red Shift",
      "duration": "8:11",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Rubicon",
      "duration": "4:11",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "A Louse Is Not A Home",
      "duration": "12:13",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "The Lie (Live) (6:31) #",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Rubicon (5:02) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "Red Shift (5:51) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "# Recorded  at the All Souls Unitarian Church, Kansas City, on 16 Feb. 1978",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 12,
      "title": "* BBC session, Feb 1974",
      "duration": null,
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Marcelo",
      "date": "Posted Tuesday, December 30, 2003",
      "rating": 5,
      "text": "Maybe the best solo effort of PH, a sort of a lost VDGG album (if you look at the line-up, you'll see the very well known names Banton, Evans and Jackson). The melancholic feeling and the emotive Peter's voices are always present, and the listener is involved in a sad and opressive sensation sometimes. Dark and nostalgic, it is the most symphonic solo album from PH. \"Wilhelmina\", \"The Lie\" and \"Forsaken Gardens\" -tracks 2, 3 and 4- are really pearls of prog music."
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Friday, February 27, 2004",
      "rating": 4,
      "text": "I always wondered if I was hallucinating or if I was a pervert looking at this weird or should I say bizarre cover.Another good solo album on which some of those numbers might have been placed elsewhere on a VDGG album (albeit rearranged for the group). Some of those tracks are spine-tingling , notably The Lie and Forsafen Gardens. I had high hopes for Randy \"Spirit\" California's guitars parts but unfortunately , he was not given a free rein. Other standout tracks are Red Shift , Rubicon and Louse."
    },
    {
      "reviewer": "James Lee",
      "date": "Posted Friday, June 25, 2004",
      "rating": 2,
      "text": "There's a few reasons an artist will decide to do a solo album; he wants to explore a style that is at odds with the band or he wants to achieve a measure of success apart from the band's recognition. It's difficult to imagine Hammill being constrained or at odds with VDGG- he led the band, and everyone stays with him on this album anyway. So why is it not a VDGG album? Maybe it's the addition of the suspiciously named 'Randy California'- sounds like an in-joke to me...Oh well, that being said, if you're a fan of Hammill there is plenty to satisfy you here. Vocally I find him somewhere between early Bowie and Bruce Dickenson (IRON MAIDEN) with a hint of \"Frankenfurter\" Tim Curry in some of the less credible dramatic moments. The songs mainly move when the lyrics move, only rarely finding a steady rhythm in songs like the jazzy \"Red Shift\". \"Modern\" is full of interesting spacey, synthetic textures upon which he speaks, sings, mumbles and screams- much of his range is ably demonstrated here. \"Wilhelmina\" softly caresses and then gets harsher in the way \"Man-Erg\" fans will recognize, but notably focuses on something other than Peter for a while (relatively- it's about what \"Willy\" means to \"Peter\", and stop giggling). \"The Lie (Bernini's St. Theresa)\" is Hammill's examination of religious ecstasy- not sculpture- against a dramatic piano and organ score. \"Forsaken Gardens\" continues the piano and vocal structure before breaking into the first real rhythmic section on the album. The lyrics deal with isolation and unrequited...something. Upon hearing the emotionally charged climax of the song, my wife exclaimed, \"I'd like to meet him...and then slap him.\" The Echoplex (or whatever primitive delay unit they had) is used to great extent, especially on \"Red Shift\" and \"Modern\", and contributes nicely to the psychedelic/ progressive tone of the album. \"Rubicon\" has a loping acoustic feel- probably the most like \"Space Oddity\"-era Bowie or even pre-electric Marc Bolan. \"A Louse is not a Home\" is my favorite song title on the album, and reveals a little of the humor I wish he had more of in his lyrics. The music, however, is a bit too blatantly emotional to be fun and a bit too \"Rocky Horror\" to take very seriously. As it progresses, however, it reminds one more of VDGG than most of the album and features some interesting passages and textures.I'm tempted to start liking Peter Hammill, mainly because he so consistently surprises and amuses me with his eager, humorless dedication to defy all notions of taste and restraint. Be warned- playing this album will bring out previously hidden violent tendencies in your friends and relatives, but if you are (or think you may be) one of the fragile, uncommon souls out there who really love Peter's music, you'll find paradise within this album."
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Saturday, June 26, 2004",
      "rating": 4,
      "text": "'The Silent Corner & The Empty Stage' follows in the same vein as its predecessor 'Chameleon', only this time assuming a more agressive disposition. The opening track 'Modern' shows you exactly that right away. with its delirious guitar layers (some sound really creepy) and frantic singing about the dehumanizing side of modernization. Hammill's incendiary spirituality continues to express itself on the next three tracks, all of them piano based. 'Wilhelmina' reveals this performer taking a more candourous attitude as he speaks to his first daughter (back then, still an infant) about the confusions of adult life. Then, the first bass piano notes come thundering increasingly to give way to a mystical/psychological observation on 'The Lie', a disturbingly dark Gothic- tinged number, and may I add, an exercise of lucid expressiveness throughout the use of very few notes - brilliant! Track 4 is performed in a VsGG ambience (well, it's supposed to, since his fellow members are all guests here): 'Forsaken Gardens' explores and laments about the destructive side of self-centredness in a progressive manner, sounding very similar to the most pompous moments of 'H to He' in the harder sections - yes, a piece can be hard rocking without including a guitar in it. But again, the album doesn't end here. 'Red Shift' does include a pretty amount of guitar parts (riffs, textures, brief dissonant solos) creating a perfect partnership with Jackson's saxes, in a context of electric blues and psychedelia: this piece is not too frantic, but it certainly is powerful instrumentally. Its structure even anticipates at some degree that of La Rossa, soon to appear in the VdGG album 'Still Life'. The only calm piece in the album is 'Rubicon' (calm under Hammill patterns, that is, only voice and acoustic guitar, yet still portraying a disturbing set of lyrics that brings turmoil into the listener's ears and mind). The closing number is pretty effective, since it's the most dramatic and fiery track in the album. 'A Louse is not a Home' brings back the VdGG sound to the fore, with Hammill experimenting with his vocal range undefatigably to match the track's gloomy grandeur. Once again, the subject of the ego's potential and limitations brings back a Hammill wildly exorcising his own personal existentialist ghosts. Tracks 1, 3, 5 and 7 are my chosen highlights of 'Silent Corner', though the rest of the material is also captivating enough. I give it 4 stars, though I wish I could give it an extra half."
    },
    {
      "reviewer": "Peter",
      "date": "Posted Wednesday, October 20, 2004",
      "rating": 3,
      "text": "Like much of Van Der Graaf Generator, Peter hammill's third solo outing THE SILENT CORNER & THE EMPTY STAGE can make for some disturbing (if not outright painful) listening, yet this 1974 work is not without its substantial rewards. Hammill's wild vocals and soul-lashing lyrics are very much an acquired taste -- as fellow reviewer James Lee wittily suggests, playing this dark and strange stuff in the presence of the \"uninitiated\" may well test the limits of tolerance and/or friendship.If, however, you're already a fan of pyrotechnic prince of darkness Herr Hammill, you should find much to \"enjoy\" in this musical version of the medieval hair shirt. (Feels good when you take it off.) As with my initial exposure to VDGG, I was at first almost repulsed by this disc, but found that, over time, and much like a sunbather's neglected melanoma, it began to grow upon me, and sink its hooks into my substance. I can't really maintain that TSC&TES represents \"an excellent addition to ANY prog rock collection,\" but I can say that it is \"good, but non-essential,\" and thus award it a solid three stars. (That being said, I do urge VDGG and Hammill fans to get this one -- I don't think you'll be at all disappointed!For my tastes, noteworthy tracks include the multi-faceted \"Modern,\" which forcefully establishes the near-suffocating atmosphere right away, the \"quieter\" piano-driven \"The Lie\" (an extended response to a religious sculpture, with the memorable opening line \"Genuflection -- erection in church\"), and the very Van der Graaf-esque \"Forsaken Gardens,\" which finds band mate David Jackson contributing his signature flute and sax sounds to the mix.\"Red Shift\" is another winner: it starts slowly, but steadily builds to a powerful piece that is quite reminiscent of the harder moments of King Crimson's LIZARD, especially via the \"Frippoid\" guitar of Randy California (of Spirit), and the militaristic snare.My overall favourite though (perhaps predictably, as it could easily have been lifted from a VDGG album) is the longest and closing track: \"A Louse is Not a Home,\" with its theme of (surprise!) isolation and incipient madness, alternately strangled, spitting and quietly intimate vocals, Jackson sax and eerie keyboards, strongly deserves a place in the collections of all Van der Graff/Hammill adherents. This one is not to be missed -- check out the MP3 here!I would be remiss if I failed to mention Hammill's tender address to his little pink Willy. His (then) baby daughter's name serves as the title for \"Wilhelmina,\" though I don't know just how soothed the tot might have been by papa Hammill's crib side crooning of lines like \"life's hard now -- you know it gets harder -- and hope, it is but a single strand. We pass it on, and hope you'll understand.\" Despite the unflinching, non sugar-coated lyrics, this softer song is actually rather nice. (Though perhaps not destined for inclusion on an \"All Time Best Lullabies\" compilation any time soon....)THE SILENT CORNER & THE EMPTY STAGE is thus a good (verging upon great) Hammill album, and one that followers of his solo career, and/or Van der Graaf Generator, will want to check out. (Four stars for them, three for all other prog listeners.) Give it a go."
    },
    {
      "reviewer": "Matti",
      "date": "Posted Wednesday, September 14, 2005",
      "rating": 5,
      "text": "This one has the highest rate of PH albums for a good reason. At least everyone who digs VDGG should love this, clearly the closest in style and sound to VDGG's classic albums and also featuring other VDGG members. The second in a trilogy where Chameleon in the Shadow of the Night has more acoustic approach and quite a rough sound quality, and In Camera carries on deeper in the extremes of sanity and experiment (I admire that too, but it's a bit harder to enjoy).'Modern' is a frantic classic? track which I rather skip. 'Wilhelmina' is as an emotional ballad to a little girl quite different from the overall tone. To me the magic of this album begins with 'The Lie' (inspired by the named church art) and continues all the way to the ending of 'A Louse Is Not a Home', a gorgeous 12- minute study of alienation which would be perfectly at home in Pawn Hearts (get the mp3!). 'Forsaken Gardens' is very touching (\"there is so much sorrow in the world\"... \"thru the grief, thru the pain, our flowers need each other's rain\"). David Jackson (fl,sax) makes 'Red Shift' sound a lot like Godbluff which appeared the next year. In a word: a treasure for fans of VDGG!"
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Saturday, May 3, 2008",
      "rating": 4,
      "text": "I discovered VDGG a very long time ago, and when I looked at the friends that surround Peter for his earlier ''solo'' work, I really wonder why VDGG was put to a (temporarily) end after \"Pawn Hearts\".All the likes of Jackson, Evans and Banton are featured on his first three albums (and the story will go on, episodically, for quite some time) which is an excellent news but plunge me in some perplexity. Was this all necessary?This album starts almost like a VDGG one. The noisy moments are back and the organized cacophony is fully present during \"Modern\". A dark yet strong song. The next \"Wilhelmina\" sounds as \"Man-Erg\" for a while. Simple piano and the man. So vibrant. Just the two of them. He is probably the one and only to be able to bring me these feelings. One of his very good songs. A delicacy.The structure of \"The Lie\" is almost similar but the vocals are more tortured. If you would have added some powerful sax in here, this would have been another great VDDG song. As such, it reaches the barrier of the good piece of music.As if my vow would need to be fulfilled, this is exactly what happens during \"Forsaken Gardens\" as well as with \"Red Shift\". Other highlights from this very good album so far which can be considered by now as another VDGG album actually. At least, I feel that way.As during his prior album, Peter had the good idea to release a long and great song as the closing number. The counterpart of \"Black Room\" here is \"A Louse Is Not A Home\". A wonderful journey in the dark and sad affairs, with vocals changing from delicate to screaming, but always passionate. The band following the pattern brilliantly.Gloomy atmosphere, scary. Thinking that I'll go to bed just after this review (it's about three AM here). Not very comforting. This piece of work is really on par with the greatest Van Der Graaf Generator songs. Maybe because it is one?Four stars for this Silent Corner. By far his best ''solo'' work so far. Thanks Peter."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Friday, July 11, 2008",
      "rating": 5,
      "text": "Review 55, The Silent Corner And The Empty Stage, Peter Hammill, 1974StarStarStarStarStarThe Silent Corner And The Empty Stage was my first venture into Peter Hammill's solo career, and every bit as stunning as I could have expected. Given that it features my favourite lyricist and vocalist, as well as the assorted members of Van Der Graaf Generator, it couldn't have really flopped for me, but I was not expecting so diverse, powerful and interesting a range of material. Consistently superb, with highlights beyond all expectation and lowlights virtually non-existent.Modern kicks off the album with an odd ascending acoustic before Hammill's vocal enters, clear but extremely dark. The second verse features a much starker and more aggressive delivery to match the increased intensity of the lyrics. The piece features roaring sax, whirling electric guitar with an eclectic edge and a very driven, near-mechanical bass. A desolate mid-section features softer organ, and hollower twists on the acoustics. Throughout the two vocal sections and intermediate instrumental section, the piece is horrifically dark, highly eclectic and powerful. Hammill's vocals are, as usual, entirely stunning, with matching lyrical city-characterisations fitting the delivery brilliantly. Certainly one of the best.Wilhelmina is a contrast to Modern's intensity, with a basic piano-vocal entrance gradually being supplemented by bass and later acoustics and something that sounds like a harpsichord. The mellotron makes an appearance when appropriate. All the performances are excellent, piano, vocals, acoustics, and the end piece is a very personal and touching song.The Lie is similar in its feel to the opener, though achieving the darkness and intensity in a very different way. The piece is basically sharp piano, incredibly powerful vocals, and a whirling synthesiser thing. Later on in the song, church-like organ makes its appearance. The final two lines are perfectly handled, moving from optimism to rejection. Brilliant, and lyrically enigmatic and potent.Forsaken Gardens is the first didactic piece in the album with a related theme to Childlike Faith In Childhood's End. A capella opens the song, and piano and bass again feature prominently. Guy Evans' percussion and David Jaxon's flute are added skilfully to this mix, along with sax and a more harmonised vocal. A very convincing argument for community and more open lives is presented by emotional vocals with the support of incredible musical material, managing to be persuasive as well as thoroughly rock-based. A very impressive combination, and worth more words than I've given to it.Red Shift moves back to sheer experimentalism, again featuring Guy Evans with a very odd bass-disregarding drumming part. Very thick bass and guitar feature, as well as a wonderfully unrelated/disassociated guitar solo. The vocals move between very strong and prominent to equally strong, but fading and disappearing. The incoherence and alienation is conveyed well musically and quite naively, but without feeling unconnected and without alienating the listener. Wonderful, even if it took a fair few listens to 'get'.Rubycon features a clean vocal, with resonant quality, and is very lyrically dominated with its interesting and intelligent evocation of choice. Oddball acoustic guitar and bass are most of the instrumental content, though slippery sax does turn up on occasion. I did only get it after focusing on the lyrical content more actively.A Louse Is Not A Home is simply one of the best pieces of music ever, certainly in my top ten. It is very much a Van Der Graaf Generator-styled piece, with splintering sax, cascading rock drumming and subtle organ featuring alongside the dark, potent piano. High-tempo powerful rock meets softer breaks, haunting and tense slow parts, vocal parts fast enough to make it difficult to sing along and varied enough to equal A Plague Of Lighthouse Keepers. All of these extremely varied features are merged into one entirely coherent whole. Lyrically stunning, both in terms of its personal connection (and its mildly didactic nature), clever recurring themes that become clear with a little examination, delivery and stylistic originality. Stunning throughout, and an essential piece for anyone.The live version of The Lie included on the remaster follows this after a sufficient break and is different enough from the studio version to merit inclusion. An extended piano introduction opens it with stunning energy and haunting resonance. The vocal begins softly, and only later moves onto hideous force similar to the studio version. The piano is slightly more edgy and abrupt than the studio version. All these differences pay off brilliantly, and suggest that I am highly deficient in Hammill and VDGG live material. The sound quality isn't brilliant, but that doesn't really bother me.The other two live versions (BBC sessions) feature David Jaxon. Rubycon features wonderful flute additions, as well as some significant twists on the acoustics. It holds up surprisingly well without the bass, and the vocal performance is equally sublime. Red Shift is very different in arrangement, though it is essentially the same song, with acoustics taking over the role of the bass, harmonised vocals appearing, and the sax taking over flawlessly from the lead guitar. The vocals are stunning, and the acoustics are done with energy and verve. A surprisingly strong and loyal live adaptation for such a complex piece by (as I understand it) only two performers. The sound quality on these two is perfectly good. Overall, the bonus material adds to the album and my enjoyment of it, fitting in neatly at the end without imposing itself on the listener.Given my glowing review, I can in good conscience consider it a masterpiece. Essential for anyone who enjoys Van Der Graaf Generator or high-quality lyrical content. Anyone who doesn't fall into those two groups should still find something of interest.Rating: Five StarsFavourite Track: A Louse Is Not A Home"
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Wednesday, November 5, 2008",
      "rating": 4,
      "text": "4.5 stars. For many Hammill fans this is the one, their favourite. With Banton, Evans and Jackson on board it might as well be a VDGG album right ? Well it's probably the most VDGG sounding record that Hammill did anyway. I have to say that this album only recently clicked with me. This was tough going. Experimental and dark, with Peter's tortured and theatrical vocals doesn't exactly make this very accessible. In fact I think this music would clear out unwanted guests fairly quickly.\"Modern\" opens with strummed guitar as vocals and fuzz bass join in. Mellotron foods in before Hammill spits out the lyrics. Organ and an atmospheric interlude after 2 1/2 minutes. It's building 4 1/2 minutes in as it becomes pretty dark and experimental. Vocals are back before 6 1/2 minutes. \"Wilhelmina\" is a song for Guy Evans' daughter who they called Willie. Piano and vocals lead the way. Mellotron 3 1/2 minutes in is a nice touch. \"The Lie (Bernini's Saint Teresa)\" is a rant against organised religion. The vocals get really passionate here, but the lyrics are even more biting. I really like his reserved vocals with piano to open. Organ 2 1/2 minutes in before it calms right down after 3 minutes. The organ is back before 5 minutes reminding us of church. Experimental ending.\"Forsaken Gardens\" is a song VDGG would play after the Godbluff reformation. Fragile vocals, piano and flute early. Evans comes pounding in on the drums before 2 minutes as the tempo picks up. Very meaningful lyrics about the suffering and pain in the world. Amazing track. I like the sax that comes in later. The drumming is really upfront as well. \"Red Shift\" features guest the late Randy California from the band SPIRIT on guitar. Hammill said the talking at the start of the song was a mistake and shouldn't have been left on there. This track goes back to the sixties. It has a psychedelic flavour to it. I like the sax, and the drumming is outstanding. The guitar comes in after 5 minutes and suits the psychedelic mood. The guitar goes on for 2 minutes. Nice.\"Rubicon\" is mostly strummed guitar, bass and vocals. \"A Louse Is Not A Home\" had already been played by VDGG before the band broke up and was originally to be on their next album that was obviously didn't happen at the time. Almost gothic vocals to open with piano. The tempo and mood really sway back and forth a lot. Hammill is incredible vocally on this track. This really is a monster song, a classic ! I like the drumming late followed by the floating organ to end it.Patience might be the key here. This is still growing on me."
    },
    {
      "reviewer": "The Truth",
      "date": "Posted Saturday, May 16, 2009",
      "rating": 4,
      "text": "I just love this album! Peter Hammills best solo album undoubtedly! Very dark and depressing lyrics reminescent of Pink Floyd but musically it almost sounds like a King Crimson album musically. Modern is a crazy song in which Hammills vocals almost sound as if he is deranged. Wilhelmina is a full-blown prog rock ballad, a love song that shows Peter Hammils lighter side. Forsaken Gardens is a hidden gem in the prog rock catalog and A Louse Is Not a Home is one of the best epics Hammill has ever written in which his vocals are almost operatic. All through the album you get the feeling that this is a Van Der Graaf Generator album and not Hammills solo work and it's no wonder, three of the original members play on the album! Excellent work by Peter Hammill!"
    },
    {
      "reviewer": "The Sleepwalker",
      "date": "Posted Monday, September 7, 2009",
      "rating": 4,
      "text": "The Silent Corner and The Empty Stage is Peter Hammill's third solo record. The album is technically an huge leap forward from his previous album. Silent Corner contains lots of experimentation, like the heavy fuzz sound on \"Modern\", the distorted bass on \"A Louse is Not a Home\", and the heavy use of an oscillator on the whole album.The heavy experimentation can clearly be heard on the first track, \"Modern\", a bass heavy and very dissonant sounding song. The song starts out very interesting, with some good verses, and acoustic guitar playing. Soon after this a extremely fuzzy sounds come in. The song is incredibly dark and ominous and took me a while to get into. Another rather bombastic track is \"Forsaken Gardens\", a song with pretty much the same structure as VDGG's Still Life, from the same titled album. \"Forsaken Gardens\" is a very enjoyable and dramatic song, one of the best on the album, and perhaps one of the best Peter Hammill has ever made.The album contains three songs that somewhat sound like most of the material from Chameleon In The Shadow Of The Night. \"Wilhelmina\", \"The Lie\" and \"Rubicon\" are more minimalist tracks, and are less experimental than most of the album. The songs all are interesting, though nothing more. Exception is \"The Lie\", which is much stronger and more interesting than the two. The two remaining tracks on the album are \"Red Shift\" and the epic \"A Louse is Not a Home\". \"Red Shift\" is an extremely experimental and mysterious, brilliant piece of music, and it always keeps me interested.The magnificent climax, \"A Louse is Not a Home\" is probably the best song on the album, and arguably the best song Peter Hammill has ever made. The song starts pretty minimalist with only piano and vocals, but soon the song becomes a bombastic masterpiece, with lots of amazing unexpected changes and some of the best lyrics I've ever seen. The melancholic music and lyrics in combination with Peter's extremely powerful and haunting vocals make this song one of the most extraordinary ever made. A true masterpiece.This album deserves four stars in my opinion. From the three \"classic\" Peter Hammill albums (Chameleon, this one and In Camera) I probably enjoy this one the least though. The magnificent \"Red Shift\" and \"A Louse is Not a Home\" really worth the money though, they're both masterpieces. I would recommend this to anyone who's (getting) into Peter Hammill, but I think he has made a few better solo albums."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Wednesday, November 4, 2009",
      "rating": 5,
      "text": "Obviously, when you have to review an album that has been a long-lasting companion, it's entirely different then assessing music you've just come to know for a few years.Can you be impartial and review it without nostalgic sentiment? Or doesn't it stand a chance against new stuff that always sounds so fresh and exiting? Can you avoid being over-critical when you know every little detail of it by heart? When it comes to Hammill's Silent Corner, the answer to those questions would be 'No'. Thrice.No, I'm not impartial. This used to be my Hammill favorite at an age where one doesn't listen to new albums every day. So whatever you listened to, you put almost on endless repeat. As such, the album became an essential part of your life and every time you hear it again, you're flashed back, right to the days and ambiance of your past.No, it doesn't stand a chance against new stuff. The acoustic guitar and piano sounds old and aged. The rusty production can't live up to modern standards.No, I can't help feeling critical towards the often weird twists in the songs and the theatrical vocals. Nor can I always support Hammill's na�ve and inexperienced choices in the sonic arrangements.So no, I wouldn't be surprised if even the people that have similar tastes wouldn't get this album at all. Luckily, many seem to share my appreciation of this masterpiece: the pure emotion, the sparkling creativity! 4.5 stars!"
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Friday, January 8, 2010",
      "rating": 4,
      "text": "This is so far my favorite Hammill solo effort. The album starts withModernwhich is easily the best intro track out of the Peter Hammill trilogy and sets a great mood for the rest of this release. There isn't really a single lesser/weak composition here and, once again, the trilogy-album ends on its biggest highlight.I just realized that I still haven't said anything about the lyrics that are so prominent on all Peter Hammill albums.Forsaken Gardensis my favorite lyrical theme of this album because it deals with such ground breaking every realizations that are just too good to be contemplated on by a 25-year old.Still this albums biggest highlight isA Louse Is Not A Homewhich will always be one of my top ten favorite compositions ever recorded! There is just nothing I can write that will be good enough praise for it so I'll just recommend everyone to listen to the sample available here on Prog Archives!***** star songs: Forsaken Gardens (6:15) A Louse Is Not A Home (12:13)**** star songs: Modern (7:28) Wilhelmina (5:17) The Lie (Bernini's Saint Theresa) (5:40) Red Shift (8:11) Rubicon (4:11)"
    },
    {
      "reviewer": "baz91",
      "date": "Posted Monday, July 4, 2011",
      "rating": 5,
      "text": "Peter Hammill was much more than just the lead singer for Van der Graaf Generator; he was the creative force behind the band. Whilst the music on his solo albums are shorter, one feels as if they are travelling further into the upside-down world of VdGG land, where the songs and ideas are experimental, but extremely classy. 'The Silent Corner and the Empty Stage', Hammill's third solo release, is no exception. With guest appearances from all the members of VdGG (minus Nic Potter), there is a lot here to keep fans of the group happy, between listening to Hammill's more personal songs.The album begins withModern, a bizarre track that is not explicitly experimental, but contains many experimental elements, especially in the instrumental. This is certainly not the type of music you could put on at a party, but the heavy music can be really gripping.Wilheminais a more calming song with a lullabye like verse sound, and an emotional bridge section. At around the 3 minute mark, there is a powerful instrumental section that always stirs me. A beautiful track, although it can be hard not to snigger at the name 'Willie'.The Lieis my second favourite track off this stellar album. The lyrics have a profoundly religious theme, and with a brilliant echo effect, the track even sounds like it was recorded in a giant cathedral. The lyrics'Genuflection / Erection in church'reach out and grab you in the first line, and one feels slightly embarassed that it's taken the word 'erection' to get you listening to the powerful lyrics. The use of dynamics in this song is phenomenal, and the grand piano has never sounded quite so grand.Forbidden Gardensis then my third favourite track. This is essentially a VdGG composition, as all of Hugh Banton, Guy Evans and David Jackson can be heard here. The rocky middle section provides the backbone to this track. There must be many interpretations of the lyrics, but I personally like to think of a man who is obsessed with gardening having a mental breakdown and just spouting garden-related nonsense. The most memorable line in the song is'The fences erected to protect simply divide'. For a VdGG song, it's actually rather short, clocking in at just over 6 minutes.On Side 2, the next two songs aren't much to shout about.Red Shiftis a longer track, but while there are good moments, there is little meat to be found.Rubiconis one of Hammill's many acoustic guitar tracks, a tradition I have never become used to.However, Hammill saves the best till last with the epic 12 minute opus that isA Louse Is Not A Home. LikeForsaken Gardens, this is a bona fide VdGG track, with all members participating. Further than that though, this is actually one of VdGG's best tracks! It's honestly up there withMan-Erg,LostandScorched Earth(to pick three of the bands' many 5-star tracks). Honestly, I'd say it's better than all three of them! Never staying in one place too long, and implementing scores of metre changes, this track is complexity incarnate. Honestly, so much happens in this song, that it will seem like 12 minutes have passed, when only 6 have. This is one of the meatiest prog tracks a man can hear, with great musical passages throughout. Despite the silly name, this track is quite dark and serious, just like any other VdGG tune, with Hammill's twisted lyrics permeating throughout. The standout lyric here is'Maybe I should delouse this place / Maybe I should deplace this louse'. It's worth buying the record just to hear this amazing track.The original gatefold cover for the album was the second to bear Hammill's unique insignia, but was the first to contain handwritten lyrics on the inner sheet. These handwritten lyrics give the album a really personal touch, and make listening a far more intimate affair.If you're a fan of Van der Graaf Generator, and want to hear more from the prog rock masters, you should definitely hit this album first, as you may be stunned by the music you hear. There is no doubt in my mind that this is his best album, at least from his classic period. WithA Louse Is Not A HomeandThe Lieon this album, this is Peter Hammill's magnum opus."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Friday, August 26, 2011",
      "rating": 5,
      "text": "A refinement and perfection of the model established on Chameleon In the Shadow of the Night. Once again, the whole of Van der Graaf Generator returns to record a storming version of a track originally intended for the followup to Pawn Hearts - in this case, it's A Louse Is Not a Home, which takes the themes of isolation and dissolution of identity from In the Black Room and sets it in an architectural framework which results in some of the band's best playing and Hammill's most clever lyrics. (\"Maybe... I should... delouse this place... maybe... I should... de- PLACE this LOUSE!!!\") Once again, we have odd \"prog singer-songwriter\" tracks with Hammill alone or accompanied by sparse instrumentation, as on Wilhelmina or The Lie.There are also some masterful collaborations, such as Red Shift (featuring Spirit's Randy California on guitar), and some tracks which once again reveal a learning for prog excess, such as Forsaken Gardens. And opening track Modern is one of the most startlingly original of the tracks that Hammill developed during the VdGG hiatus between Pawn Hearts and Godbluff, pointing the way to the avant-garde experimentation his solo career would take in later eras. Quite simply vital."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Wednesday, January 18, 2012",
      "rating": 5,
      "text": "Controlled passionate vocals, dynamic everchanging music, mindbending lyrics - \"The Silent Corner and the Empty Stage\".Peter Hammill's solo efforts only appealed to me due to my avid interest in the mighty Van der Graaf Generator. Hammill's voice has a distinct storyteller quality that has made him a popular icon of the prog scene for many years. At least 3 of his solo albums have become revered treasures and \"The Silent Corner and the Empty Stage\" is definitely one that is closer to the VDGG sound than many others. Jaxon, Banton and Evan's contribution is of course a primary reason for the Van der Graafian sounds. The consistent quality of the songs is another reason for the high status of this album; whereas many Hammill albums wallow on one style, this one throws in a plethora of styles and holds the interest on repeat listens. it also contains arguably Hammill's finest solo composition 'A Louse is not a Home'.In the first 5 seconds Hammill makes his presence known with the exhilarating 'Modern' with potent lyrics; \"Jericho's strange, throbbing with life at its heart, people are drawn together simultaneously torn apart.\" His vocals are a pervasive force. The music is as VDGG as it can get with fuzz bass and odd time sigs with very unusual instrumentation. In the liner notes Hammill states the song is, \"simply a sonic assault.\" There is nothing simple about this with its weird meter and shifting moody atmospheres. The instrumental break is a dynamic soundwave of hyper tense musical structures, high pitched soprano saxophone screeches from Jaxon, and an ominous build-up of Banton's keyboard and Hammill's angular phased guitar. Then after this tension it releases into a new time sig and back to the descending acoustic chords. The dissonance of woodwind competing against the melody is astonishing.'Wilhelmina' is a piano ballad similar to the softer VDGG songs where Hammill croons about his existential state of mind. However the lyrics of this are more focussed on the love of Guy Evans daughter and giving advice to how she can cope with the changes in her life as she grows to be a lady. Quite beautiful and a little sad in tone. 'The Lie' features a slow cadence and the familiar cathedral organ of Banton. At times Hammill rises to his passionate aggressive voice and it even climaxes on a grinding Hammond blast. It is also directed towards Evans' daughter.A capella Hammill begins 'Forsaken Gardens', a slow moderate melancholy song. Hammill points out in the album notes, \"we played it on a few occasions after the \"Godbluff\" reformation.\" It is a transition between the two VDDG periods and sounds similar to that style, building with flute and some scorching sax passages. It is so great to hear that sax on a Hammill solo release, a part of the more recent VDGG albums that was sorely missed for a time. The birds twittering at the end is an effect using Hammill's Fluid Sound Box, a Leslie effect according to Hammill.'Red Shift' is a track that must rank as one of the solo highlights, along with the album closer. It begins with some narrative, spacey sax squeals and a VDGG time sig. Lyrics are off the planet, \"once all the stars were bright now they are red and fading, and all the colours we wore, the shades that we bore have moved, and the gold turns to red with no time for changes: Red shift all moving away from we.\" The chorus is a slow meter vocally, with odd sporadic percussion from Evans. This is a darker song on the album and Jaxon's sax is dynamic. The track immerses the listener into its dark recesses as only Hammill can.The release of the next track, 'Rubicon' is a welcome relief. It is acoustically driven and peaceful with some poetic beauty; \"open the toy box, you are Pandora, I am the world, if you cross the stream you can never return.\"The last song is the clincher, the masterpiece of the album, 'A Louse is not a Home' and it reeks of VDGG. It should, as the band were going to add this to their new album before they disbanded again. The sound is pitch dark and reflects the downbeat lyrical content which at times is brilliant; \"my words are spiders upon the page, they spin out faith, hope and reason, but are they meet and just, or only dust gathering about my chair\" and later \"day is just a word I use to keep the dark at bay, and people are imaginary, nothing exists except except the room I'm sitting in, and of course the all-pervading mist - \" Hammill is chilling speaking of a presence of someone watching him and his paranoia is frightening.The time sig that pounds with Banton's staccato sax blasts and loud guitar is similar to the \"Pawn Hearts\" era. It soon settles into quiet meditative reflections. The haunting solitude is an intense atmosphere, with spasms of sax and organ. It builds with a ferocity and Hammill's scream to the world is unnerving. It returns to the huge melodic motif at the beginning with, \"maybe I should delouse this place, maybe I should deplace this louse, maybe I'll maybe my life away, in the confines of this silent house.\" A brilliant eargasm clocking 12 minutes and encompassing the best of Hammill in his blackest mood.The bonus tracks are intriguing raw versions of album tracks played live in various locales and with varying quality. The rumbling thunder of Hammil's piano is a weapon to project his anger and anxiety on 'The Lie', especially the primal scream at the end. As Hammil makes clear in the liner notes, \"somewhat deficient in sound quality but very much there in Presence.\" 'Rubicon' live is a flute driven evocative version, 'Red Shift' is acoustic and sax dominated, no drums necessary fore either recorded at BBC Radio One. \"The Silent Corner and the Empty Stage\" is a definitive Hammill classic and certainly one for VDGG fans as well as those with a proclivity for dark atmospheric moods."
    },
    {
      "reviewer": "LinusW",
      "date": "Posted Wednesday, March 5, 2014",
      "rating": 4,
      "text": "Naked, stark and pounding sincerity marks a high point of Hammill's tortured persona on The Silent Corner and the Empty Stage. It's a chilling expos� of ravaging emotional stirrings and storms set in a stately musical framework of high-impact melodies, rhythms and sonic posturing with dark experimental bite. Interestingly, it's also very diverse and full of movement in terms of general ideas and musical backing.Where I've always found Hammill drawn to stripped-down and a bit ponderously simplistic (but dense) arrangements that brings the unhinged emotionality of his vocals front and centre, there's a refreshing delicacy and richness to this album. It's still full of those focused, top-heavy and bare melodies that just barely hold up under the weight of the immense vocal delivery, but in the end it never really loses balance.Some skeletal and spindly guitar here and there, keyboard noodling and oscillations erratically lost in time and space, a wash of ceremonially dignified organ, a flute deliciously fluttering around like a doomed moth in the vicinity of the otherwise electrified atmosphere, the dry and pure sounds of a harmonium and the ringing, yearning clarity of piano, edgy saxophone. There's more, but the point is that it feels rich and ever so slightly more of an extrovert dialogue (rather than an introvert diatribe), something I've always considered a bonus where Hammill is concerned. Melodies (acoustic or electric) come and go, interlock, reach a burning point in a pressure-relieving and resolving hook or a beautifully placed pause before dissipating into asocial disharmony or starting over in yet another intricate pattern and emotional state. At times it borders a more twisted side of symphonic. There's even enough room for the scaled-down and musically intimate to sneak in with the airier singer-songwriter material you often hear in his solo efforts.But the real magic comes from how this wealth and diversity flow between sensitive and frail grace and crushing and commanding onslaughts of anger and frustration. It's a constant battle between reflective and lucid moments and grinding chaos and catharsis. Fuzzy, screeching or sharp guitar and dirty bass pommel the unwary into submission and push you ever downwards into spiraling noise, accompanied by an organ collapsing in on itself or another tasty sonic calamity . Other times it's more subtle, letting things move towards uncertainty and madness in gradually disassociating instruments or by lurking hints of trouble in bubbling, underlying atonality.I guess the middle-point between these two sides are the more rocking Van Der Graaf Generator-styled parts, with spitting, synchronized instrumental and vocal attack, concentrating the layering into sharp, thrusting strikes of unapologetic impact. Everything is lined up and thrown right at you in cascading force, leaving a smell of vitriol and cordite in its wake.Even if it's never been said outright yet, you might have guessed that this isn't a smooth or forgiving affair. It takes its toll, even the less intense bits. While there are certainly a lot of dark, destructive and frustrated energy, ominous uncertainty and disorder around, even the softer and more melodious bits have a beautiful, but sapping, sadness and haunting melancholia. But in spite of that it is still more welcoming, diverse and outgoing than a lot of Hammill's other output. Just a bit more willingly engaging.An album that's been growing on me for years and one that's teasingly near the masterpiece status so many think it deserves. Only time will tell.4 stars.//LinusW"
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Saturday, April 26, 2014",
      "rating": 3,
      "text": "An album I bought in the 70s that baffled me and left me cold but which I have revisited many times throughout the years--and more recently--due to its acclaim and curious dissonance. Though Peter's voice has never quite won me over (though his performances on H to He, Who Am The Only One are wonderful), coupled with the fact that I am not a lyric/content man have always left me \"outside\" music like this. Plus, I do not find any of the instrumental performances impressive or to have stood up very well over time. There seems to be a lot of starkness and relative simplicity in PH/VDGG's recording styles that leave me cold and unimpressed. \"Red Shift\" is amazing and \"A Louse Is Not a Home\" is interesting but ultimately always forgettable. There is nothing else here that I can ever attach myself to much less remember despite numerous listenings over forty years."
    },
    {
      "reviewer": "apps79",
      "date": "Posted Wednesday, May 7, 2014",
      "rating": 4,
      "text": "Peter Hammill's solo stint during Van der Graaf Generator's original hiatus continues in 1974 with the album ''The silent corner and the empty stage''.This was another record to feature the member's of the demised legendary British band minus bassist Nic Potter, who decided to focus on the attempts on the newly established Long Hello, a jazzy-flavored instrumental group of a Hamill-less Van der Graaf Generator line-up.However the new album features the surprising appearance of Randy California in one track, the guitarist of Psychedelic Rockers Spirit.''The silent corner and the empty stage'' was recorded during two periods, spring and autumn of 1973.The ever-supporting Charisma was once again the labelhouse to support another Van der Graaf Generator-related album.Reputedly all these early Peter Hammill albums contained material intended for inclusion in future VAN DER GRAAF GENERATOR's albums, but this one sounds more like a team effort than Hammill's second album and for the first time so close to VAN DER GRAAF GENERATOR's classic style.And what a team effort it was!It contains a mix of lyrical pieces with full-blown Prog Rock deliveries, based on an epic keyboard sound, an incredible balance between electric and acoustic moments and discreet sax/flute drives with Hammill's voice being deeper and more expressive than ever.The music follows the dark lines of VAN DER GRAAF GENERATOR with hidden jazzy flavors, atmospheric orchestrations and poetic singing, completing powerful, haunting and complex songs with great instrumental work, full of unexpected twists and sinister moods.The smoother pieces are mostly based on Hammil's unique voice, supported by his piano, guitar and sporadic organ, sax and flutes, but even these tracks are not easy for the non-mystified listener, evolving from poetic atmospheres to Classical nuances to pastoral, acoustic interludes.For the longer and more complicated pieces, words are poor to describe the monumental atmosphrere this group of musicians could create.From an extreme lyricism to the scratching saxophone of David Jackson, from mellow piano lines to symphonic themes, showered by Mellotrons, organs and harsichord, from psychedelic textures with abnormal structures and deep bass to minimalistic sounds with a dark atmosphere, everything seems well placed to create great, progressive pieces with an original character.The definition of dark and doomy Progressive Rock.There are no silent corners or empty places in this album.This should be easily regarded as a Van der Graaf Generator offshoot work, which means that the content can be no other than passionate, complex and irritating.Highly recommended...4.5 stars."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Wednesday, September 4, 2019",
      "rating": 5,
      "text": "'Maybe i should de-louse this place, Maybe i should de-place this louse.' And so the poetic prowess of PETER HAMMILL continues on his third album THE SILENT CORNER AND THE EMPTY STAGE. The relationship between PETER HAMMILL's solo career and Van Der Graaf Generator was always a murky one dating back to VDGG's earliest releases but due to an overload of touring, studio time and scant financial payoffs VDGG decided to take a hiatus after 1971's overachieving spirit of 'Pawn Hearts.' Despite the break, the band had been working on the next album and after the decision to call it splitsville, HAMMILL found a surplus of material that he could use on his solo releases which he promptly reworked so he could do that very thing! HAMMILL's prolific and restless nature was in some ways unleashed with the excessive grandiosity of VDGG out of the picture and he started cranking out solo albums at a steady stream. 1971's 'Fool's Mate' was basically a bunch of holdovers from the 60s and showcased HAMMILL's earliest recordings in a much happier mood but beginning with the sophomore release 'Chameleon In The Shadow Of The Night' a darker melancholy had completely usurped control and there would be no going back.On the third album THE SILENT CORNER AND THE EMPTY STAGE, the stylistic approach of the predecessor was retained with piano based melodies teased into slithering emotional beasts that displayed HAMMILL's uncanny modulating abilities of emoting pure sadness to excitation in the drop of a hat. With his fellow VDGG band along for the ride, this album is like many of the early ones and barely distinguishably from the mighty Generator's own manic depressive technically infused emotional rants however HAMMILL remained careful to focus on the singer / songwriter attributes first and foremost no matter how wild and crazy the accoutrements that followed would become. SILENT CORNER is clearly where HAMMILL came of age as a solo performer and one where he displayed his talent of creating a product as magnificently divine yet kept the intimacy of a solo artist's endeavor perfectly in tact. With HAMMILL's piano and vocal talents firing at all peaks, SILENT CORNER remains one of his finest achievements both in and out of VDGG.Emotional changed and frenetic to the core, SILENT CORNER offers a roller coaster ride of HAMMILL ups and downs as heard on classics such as 'Pawn Hearts' but while the piano rolls and compositional unorthodoxies rule the roost, SILENT CORNER was more willing to adopt some of the more adventurous aspects of Van Der Graaf Generator such as crazy electronic enhancements, unhinged reverb and distortion and schizoid mood shifts from calm and introspective to explosively unhinged and raging ferventness. As reflected in the rather eye-catching album cover, the dramatic themes tackles the emotional depth of the self, loneliness, isolation and above all exists in HAMMILL's own poetic universe of his making. Firmly in command of the compositional structures, with his conductor's hat on, HAMMILL directs the VDGG cast along a uniquely pensive musical experience that exhibits the same roller coaster prog universe epic flair while offering the more tamed down versions of intimacy of a man and his instrument. While the VDGG team of Hugh Benton, David Jackson and Guy Evans play on the entire album, they are allowed to forge new territories outside of the VDGG paradigm and there is even a guest guitar playing performance by Randy California of the band Spirit on 'Red Shift.'Graced with seven excellently strong tracks SILENT CORNER begins with 'Modern,' a delightful acoustic guitar frenzy with HAMMILL's excitable vocal style lamenting the impermanence of the achievements of the human constructed environment. The track wastes no time slinking around off-kilter time signature rich passages that morph into psychedelic free-for-alls suitable for an Amon Duul II album and then back into the melodic constructs from whence they came. The following 'Wilhelmina' takes on a more intimate approach with a simple piano and vocal performance laced with a contemplative narrative that takes on a few symphonic and heavier stances but remains a rock free moment. 'The Lie (Bernini's Saint Theresa)' continues the piano focus but takes it into more turbulent territory with violent stormy piano noise and atmospheric cloud covers that was inspired by the 17th Century Baroque sculpture 'Ecstasy of Sin Theresa' by brian Lorenzo Bernini. Perhaps one of the moodiest tracks on SILENT CORNER, HAMMILL generates a rather dramatic performance that alternates between soft spoken and demonically possessed.One of the highlights in my world is 'Red Shift' which is the closest track to a fully fueled Van Der Graaf Generator band reunion performance. Laced with a cyclical saxophone riff and oceans of reverb and echo effects, the track is one of the few true rockers that features Spirit's Randy California offering a guitar performance amongst the crashing tidal waves of recurring musical motifs augmented by HAMMILL's vocal ratcheting effects. The track sort of swings but pummels the senses with heavy pulsing waves of sound and Guy Evans' most dynamic percussive performances on the album. 'Rubicon' calms things down with as an acoustic guitar cooling down period that tackles a progressive folk stance with more insightful lyrics but sounds like a fluffer for the album's most dynamic track of all, the over the top gusto of 'A Louse Is Not A Home,' which was one of the leftovers from the 'Pawn Hearts' followup that never came to be. Not only is 'Louse' one of the best HAMMILL tracks ever but one of the best tracks ever recorded PERIOD. Chock full of a never-ending flow of vocal intonations and mood enhancing drama, the track is actually based upon a rather simple yet effective piano motif but HAMMILL's brilliance is that he dances around it vocally, melodically and by implementing contrasting stylistic effects. The track is a powerhouse of lyrical subterfuge, vocal dynamism and progressive rock divinity.While HAMMILL had proved himself as the leader of the VDGG band of his making, THE SILENT CORNER AND THE EMPTY STAGE was the point where he hit his stride as a solo artist and proved not only his prolific output was in no danger of burning out any time soon but that he diverse range of subject matter and musical ideas was somehow generated from a fully intact creativity pool. SILENT CORNER built upon the ideas from 'Chameleons' but launched them into the full power of the progressive rock pomp and awe of the early 70s with impunity. Through a wide-range of powerful vocal antics and dramatic stylistic shifts THE SILENT CORNER exorcized the demons from the simple pop melodies that undergirded the melodic flow and twisted them into lengthy edifices that perfectly illuminated HAMMILL's poetic virtuosity, melodramatic theatrical vocal gymnastics which were accompanied by psychedelic overtones and production experimentation. When all is said and done, THE SILENT CORNER is perhaps the most masterful example of HAMMILL's ingenious fusion of progressive rock with his singer / songwriter tendencies and all accompanied by the most outrageous displays of musical accompaniments. Despite HAMMILL's prolific nature that has gone well into the present, SILENT CORNER remains one of his most dynamic and mind-blowing examples of his unique genius and one of the few album's of his canon that i can never grow tired of no matter how many times i give it a spin."
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Saturday, December 14, 2019",
      "rating": 5,
      "text": "The third album by Van Der Graaf Generator's leader, after the masterpiece \"Chameleon in the shadow of the night\", \"The quiet corner and the empty space\" reinforces the progressive component of Hammill's music, thanks to the extensive presence of Jackson, Evans and Banton.The beginning is spectacular, with1. Modern (7:28) Hammill produces a music that, like in the first albums, manages to combine aggression, epic, paranoia and existential anxiety, with a hybrid sound that has no equal in rock. Compared to the past, only the line-up changes, where guitars and bass are much more important. There is an orgiastic passage of fantastic instrumental sound and the voice is quite functional. It is an absolute masterpiece. Rated 9.2. Wilhelmina (5:17) A deeply felt piano ballad, a songwriter story, it starts slowly, then it has an excellent progression between a minute and a half and two minutes, which it repeats a minute later, to reach the climax towards the end of the piece , which arrives suddenly. Excellent arrangement, refined. Rated 8+.3. The Lie (Bernini's Saint Theresa) (5:40) Beginning at the piano worthy of classical music, with the piano played in a percussive way, comes the voice of Hammill, very at ease with the contrite, penitential, almost church-like atmosphere, then voice and piano perform in a crescendo full of pathos , with slowdowns and accelerations. Typical song by existential philosopher songwriter, with an atmosphere that is at the same time romantic and distressed. Rated 8.4. Forsaken Gardens (6:15) Splendid rock piano ballad, with a riding progression, which returns three times inside the song and has a splendid epic emphasis and the song of heartfelt Hammill (There is so much sorrow in the world). Voto 8,5.End of side A.5. Red Shift (8:11) The song is more experimental than the others, with sound effects and jazz drums, saxophone in evidence, to recreate a cosmic sound that compared to the old Van der Graaf Generator albums is more rarefied and jazzed. The beginning is too much slow but then comes an instrumental piece with Jackson's sax and the very jazzy Evans' drums, until the piece stops, Hammill's voice expresses his lament and at that point the song starts up again with much more energy, with Randy California's acid guitars finally in evidence. The piece then improves in the final, and while not remaining among the best of the album, it arrives at a beautiful instrumental orgy, acid, before the final sung again by Hammill. Rated 8.6. Rubicon (4:11) Pastoral folk piece, with voice, guitar and bass well in evidence. Hammill's voice makes the music restless, with moments of pathos, but overall it is the calmest and most unadorned song on the record, the acoustic song by a songwriter that interrupts the soundstorm heard so far. It is the weakest piece of the album but its position is strategic, it serves to make the listener breathe. Rated 7+.The album ends with one of the absolute masterpieces of the solo Hammill, which, as in the previous album ends the disc in a crescendo of sounds worthy of the best Van Der Graaf Generator.7. A Louse Is Not A Home (12:13). We are at very high levels, we seem to hear VdGG at their peak, and in fact we didn't feel them so full and so fit as In A Black Room. But this composition surpasses even the aforementioned, because it is more homogeneous, more linear, a single sound poem as in the days of the trilogy (The Least, From H to He, Pawn Hearts). After a melodic and epic beginning at the same time, the first instrumental variation begins, which includes the Jackson's medieval flute and soon after sound electronic anguish. The rhythmic progression and the voice of Hammill alternate with moments of stasis, comes a pause with sounds of sax that resemble those of the suite of Pawn Hearts, then the suite starts again. Hammill still manages to amaze the English scholastic prog groups with moments that are completely wild and full of violent pathos that upset the controlled feelings of English people. Hammill confirms itself to be irregular, out of the box of the same progressive due to the emotional charge that it puts us: the progressive music that it forges is disturbing, aggressive, violent, emotionally very strong, and in these its emotional earthquakes it translates into a rock completely unpredictable and composite that is categorized as progressive but in fact, unlike progressive groups, which first of all try to compose complicated music in a planned way, in the case of Hammill the progressive sound of the music is only the consequence of the swing of his emotional stages, and therefore it is a much more visceral and much less cerebral progressive. In the end the piece reaches a climax of rare emotional power. Rated 9.5.Very inspired album. Absolute masterpiece of progressive rock.Medium quality of the songs 8,3. Rating 9,5/10. Five stars."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Monday, February 24, 2025",
      "rating": 4,
      "text": "The need to express his thoughts musically has always been the driving force behind the prolific Peter Hammill's path, whether in Van Der Graaf Generator or in his solo career (which are not the same thing, after all, but almost...). And so, during the band's hiatus between 1971 and 1975, the British musician did not stop and continued to release solo albums, among them \"The Silent Corner and the Empty Stage\" (1974), the third of his discography, ironically accompanied instrumentally by his band mates.In \"The Silent Corner and the Empty\", Hammill exposes his recurrent existential themes that question everything that is questionable (the value of past civilisations in the present, religion, the relentless passing of time, the mirage of existence itself, among other topics), in pieces in which his peaceful and sublime voice coexists with the intimate complicity of the acoustic guitars he plays himself and the keyboards and bass of Hugh Banton, such as the beautiful and emotive ballad \"Wilhelmina\" and the naked \"Rubicon\", with others to which he adds poignant and hysterical moans of rage and denunciation with a striking naturalness, as in the opening \"Modern\", the introspective \"The Lie (Bernini's Saint Theresa)\" and the anguished \"Forsaken Gardens\".On the other hand, and deviating somewhat from the general mood of the album, the psychedelic and hypnotic ambience of the desolate \"Red Shift\" with a great contribution of jazz aroma from David Jackson on sax and the electric guitars of guest Randy California (who tragically died at the age of 45 from drowning while surfing in Hawaii) , is an approximation of the direction the musician will take from now on, and, as a compendium of all the above, the lengthy and intricate \"A Louse Is Not A Home\", full of nuances that go back and forth from melancholic reflections to euphoric instrumental displays (including a middle section in the best experimental Crimsonian style), brings the work to a close.The excellent \"The Silent Corner and the Empty Stage\" is one of the many gems that, by those things of fate and also because of Hammill's almost unhealthy obsession to express his ideas without any kind of conditioning, did not get all the recognition that its enormous musical and compositional quality brings with it.4/4.5 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album64fb.html",
  "last_parsed": "2025-05-18T00:25:36.424445"
}