{
  "album_title": "VOYAGE OF THE ACOLYTE",
  "artist_name": "Steve Hackett",
  "artist_page_link_local": "artist3f60.html?id=782",
  "year": 1975,
  "rating_value": 4.25,
  "rating_count": null,
  "review_count": null,
  "genre": "Eclectic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/782/cover_4814132652016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Ace of Wands",
      "duration": "5:23",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Hands of the Priestess, Part I",
      "duration": "3:28",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "A Tower Struck Down",
      "duration": "4:53",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Hands of the Priestess, Part II",
      "duration": "1:31",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "The Hermit",
      "duration": "4:49",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Star of Sirius",
      "duration": "7:08",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "The Lovers",
      "duration": "1:50",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Shadow of the Hierophant",
      "duration": "11:44",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Ace of Wands (live) (5:25) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "Shadow of the Hierophant (extended playout version)",
      "duration": "17:00",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Peter",
      "date": "Posted Tuesday, January 6, 2004",
      "rating": 5,
      "text": "This wonderful record (Hackett's first solo outing) is absolutely essential listening for fans of classic Genesis. In fact, then Genesis band mates Phil Collins and Mike Rutherford assist on the album, with Phil providing vocals for the standout \"Star of Sirius\" (the best Genesis song that Genesis never recorded).The album is loosely organized around the theme of the Tarot (the awesome and frenetic opening track, \"Ace of Wands,\" is named for a Tarot card, as are other tracks), one of Hackett's interests at the time.The beautiful cover art -- which won an \"album cover of the year\" award -- also reflects the subjects of the songs, and was provided by Hackett's spouse, the immensely talented artist Kim Poor, who did many of Hackett's subsequent album covers. (It's a pity that the diminutive size of CD covers don't carry the impact of the old LP jackets!)The songs vary in structure and overall sound much as those on early Genesis albums did, and are all excellent. As Genesis became increasingly commercial-sounding, many of us were heartened by the knowledge that we could always turn to Steve Hackett for complex, uncompromising, beautiful and powerful progressive rock. \"Voyage of the Acolyte\" is perhaps my favourite Hackett disc, although \"Spectral Mornings\" could give it a run for its money. Not to be missed!"
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Saturday, March 13, 2004",
      "rating": 5,
      "text": "This record has been praised time and time again, but let me take my shot at it! Steve actually gets more progressive than GENESIS had at this point in their recording career. \"Voyage of the Acolyte\" is another superb release containing some absolutley incredible prog moments that will please all fans who like good music. Steve is joined by some of the members of GENESIS during the recording of the album (Collins and Rutherford) who bring a welcome, strong familiar sound into the recording session. This recording is essential in anyones collection and is best interpreted in a dark room lit by perhaps a lava lamp."
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Wednesday, March 31, 2004",
      "rating": 4,
      "text": "His best album but I think too much is made of it, as this is a good show that he was a good composer himself. The dithyrambic reviews of the best Genesis album never recorded are overdone. This is a fine album but I find many faults on it. Oh Well! Can't stop enthusiasm without sounding like a party pooper so I will stop here.Clearly this first album has a lot of Genesis qualities (Phil and Mike help out too), but on the strict songwriting issue, Hackett is clearly lacking his bandmates. The ideas are certainly there, but they need the refining and the other's involvement, to achieve the quality of Genesis' tracks. Tower and Ace Of Wands are my two picks as highlights in a fairly even album.Oh BTW, Mr. Bonzo?!?! The stuff Collins did with Brand X makes you sad? Also, if you listen to his first solo album there is some fine drumming but the many of the tracks on it are uninspiring to ... us, anyway."
    },
    {
      "reviewer": "daveconn",
      "date": "Posted Tuesday, April 27, 2004",
      "rating": 5,
      "text": "With GENESIS on hiatus following the departure of PETER GABRIEL, guitarist STEVE HACKETT wasted little time in channeling his energy into an album of his own, \"Voyage of the Acolyte\". Even with a rhythm section of PHIL COLLINS and MIKE RUTHERFORD, few could have expected a progressive rock gem of this magnitude. Picking up his cue from KING CRIMSON's mellotron-led struggle between good and evil, HACKETT floors the listener within the first fifteen seconds and never releases his grip, flitting between the pastoral and the powerful with equal comfort and confidence.The opening \"Ace of Wands\" is one of the most abrupt entrances I've ever heard, but it's fair warning that \"Voyage of the Acolyte\" has opened the floodgates of a very fertile imagination. This enthusiasm sometimes gets the better of good judgment: \"Ace of Wands\" is chocked full of good ideas, but it tries to pack ten minutes' worth of music into half that time. Like ROBERT FRIPP or PETER BANKS, HACKETT is no vocalist (despite various attempts to disguise his voice over the years), which gives him a certain freedom to set the mood with different singers. Sally OLDFIELD is an excellent choice for \"Shadow of the Hierophant\", an eleven-minute masterpiece that features the best arrangements on the album. PHIL COLLINS does passably well on \"Star of Sirius\", but he would get better with time; Steve's treated voice on \"The Hermit\" recalls the first King Crimson album, complete with strings and a lovely flute passage from John Hackett.Although there are moments when Genesis is recalled -- the distinctive lead guitar on \"Hands of the Priestess\", a followup to \"Foxtrot\"'s \"Horizons\" on \"The Lovers\" -- Voyage of the Acolyte represents a new and different journey for the Genesis guitarist. Still, fans of \"classic\" Genesis will definitely want to check this out, as it's more likely to please prog rock fans than anything that band recorded after Hackett's departure."
    },
    {
      "reviewer": "Proghead",
      "date": "Posted Sunday, May 2, 2004",
      "rating": 4,
      "text": "This album came about because of material HACKETT wanted to record for GENESIS but the band didn't record them (in fact it was that very reason that caused him to leave the band two year later, in 1977). Despite that, Mike RUTHEFORD and Phil COLLINS appear here, as well as Sally Oldfield (Mike's sister) and John Hackett (I presume Steve's brother, who also appeared on Steve's following solo albums). The music varies from nice guitar-oriented numbers to the more sinister \"A Tower Struck Down\" (complete with what sounds like a crowd chanting \"Sieg Heil\" over and over, but if you listen more carefully, the crowd is actually chanting \"Steve Hackett\" over and over). There are also some more gentle acoustic numbers complete with Mellotron. One of my favorites, without a doubt is \"Star of Sirius\" in which Phil COLLINS handles the vocals. Unsurprisingly this is by far the most GENESIS-like, and it gave listeners a clue on how GENESIS would sound like after GABRIEL (since \"Voyage of the Acolyte\" was released in October, 1975, in which GABRIEL was no longer with GENESIS, and \"A Trick of the Tail\" was still four months away).But I have always had a problem with the cut Sally Oldfield sings on. I might be a minority, but I find it really difficult dealing with her high-pitched singing. Many people call it the album's high point, but I just find it difficult listening. But, still, it's definately one of the best solo albums from a GENESIS member (which is ever more so when you hear the string of mediocre and downright horrible albums Tony BANKS gave us, not to mention Phil COLLINS solo career, which was basically corporate pop sold to the masses - and sold they did)."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Wednesday, July 21, 2004",
      "rating": 5,
      "text": "Until 1975 STEVE HACKETT was probably the most obscure Genesis member, of course everybody knew he was a virtuoso guitar player, but he was only the bearded man who almost hided himself behind his instrument and the newbie who had replaced Anthony Phillips (a long time friend of Peter, Tony and Mike) without having the charisma of the other newbie Phil Collins.The release of \"The Return of the Acolyte\" changed this perspective, this amazing album (the first solo project by a Genesis member) that proved not only his band mates but also the whole world he was a very talented musician and composer.Some people see \"The Return of the Acolyte\" as the lost Genesis album because Mike Rutherford and Phil Collins were part of the band formed by Steve, but that's really unfair, it's a 99% Hackett album, with his very characteristic sound and style fully developed and at the same time an advice that he was decided to continue faithful to his beloved progressive rock and creating even more complex and adventurous music than he ever did with Genesis instead of taking the safer and easier commercial path.But this album also brought him some problems with the rest of the band; they believed he should dedicate 100% of his effort to Genesis instead of pursuing a solo career even when they weren't ready to allow him to take the lead compositional role.Steve accepted the conditions and didn't released another album until he left Genesis, but his compositionscontinued being ignored by the band, it's true that his contribution to Wind & Wuthering was his biggest as a Genesis member, but that wasn't enough for him, so Steve finally knew what he was able to do and the path he wanted to take.The album begins with \"Ace of Wands\", a breathtaking track with the most violent entrance where the extremely complex guitar is the seal, of course greatly supported by Phil Collins with an amazing drum work and his brother John playing the flute in a much more aggressive style than Peter ever did. Radical changes, bells, strong bass and incredible guitar passages are just part of this notable song, the first one of a long and solid career that was about to start in 1975 and still going on in the XXI Century (hope for long).\"Hands of the Priestess Part I\" is a beautiful flute (more in Gabriel's style) and guitar track with that mysterious and haunting sound he developed during his career in Genesis but with a totally new approach, simply delightful.\"A Tower Struck Down\" is another aggressive and almost violent song where Mike Rutherford makes an absolutely powerful bass structure supported by Percy Jones extra bass, and again Steve's incredible guitars mixed with crowd shouts (not sure if they say Sieg Heil or Steve Hackett), explosions and other sounds announce the final section where a Genesis like mellotron prepares for the end of the song.\"Hands of the Priestess Part II\" is even softer than part one, keyboards help to give a bit of light in the melancholic and dark mood of the album but without loosing the mystery and sadness, only 1:34 minutes long but enough to close and complement the song that started two tracks before. A special mention to John Hackett who again plays his flute with singular skills.\"The Hermit\" is another soft and melancholic tune, but this time with pretty decent vocals by Steve and his incredible guitar, this track reminds me of the sound that would be preeminent in \"A Trick of the Tail\" and the atmosphere of sad fairy tales. \"Star of Sirius\" is probably the \"piece of resistance\" a very complex track where Phil Collins vocals sound better than ever, probably because he was sounding as himself and not trying to copy Peter Gabriel's style. Starts soft and gentle but suddenly John Acock's keyboard announces a total change into a Jazzy and violent section where the guitar background is simply perfect but about the middle the track changes again to a soft style where keyboards and flute are again perfect and lead to another complex passage plethoric of drums, mellotron, keyboards and Steve's electric guitar played in acoustic style without leaving behind his atmospheric trade mark. This is what the word progressive rock should mean.\"The Lovers\" is a short acoustic track that gives some relief after all the complex music played before and to prepare for the closing track.\"Shadow of the Hierophant\" an 11:44 minutes epic starts with the characteristic Sally Oldfield clear and well educated vocals (Even when sometimes reaches very high ranges) that makes the listener believe he will be in front of another soft and complex track. A dramatic passage reminiscent of earlier Genesis interrupts Sally's voice for a few seconds announcing that this one would not be another calmed song and then again the soft voice but this time she goes in crescendo as to prepare for an ultra complex instrumental section with an incredible guitar skills demonstration by Steve introducing the listener for the full band section, from this moment to the final it's a sequence of changes and different atmospheres that complement each other and the exquisite and incredibly dramatic finale provided again by Steve playing in his unique style supported by the mellotron, church (or cemetery) bells and the rest of the band. Wonderful way of closing a wonderful album.I'm usually very careful rating debut albums and prefer to investigate the further career of the artist, but \"The Return of the Acolyte\" is an extraordinary album, probably one of the higher points in Steve's Hackett amazing catalogue and surely one of the top releases of the middle/late 70's.While the star of Genesis was slowly starting to fade, Steve Hackett appeared in the firmament as most solid follower of the original Genesis approach to music.Five stars for a wonderful album."
    },
    {
      "reviewer": "Chris S",
      "date": "Posted Sunday, August 1, 2004",
      "rating": 5,
      "text": "People keep saying this was the one album Genesis never released. what a load of [&*!#]e!!! This was the first album released by Steve Hackett and while we all know he did not get enough creative ' airplay' in Genesis this is a ligitimate solo album by one of the most talented guitarists of our time. Do not forget Genesis were prolific at this time, personeel changes and all. Albums were relentlessley released to standing ovations. However Mr. Hackett started to exert his own individuality and what smacks from the first track is that he went head first into collabotating with his peers as well as other notable artists of that time to help create this genuine masterpiece. Never ever to be surpassed again apart from maybe ' Spectral Morning'. There is no point in mentioning each track laboriously showering praise all over them as each one is unique, continuous play and simly awesome. The mood and emotion is unique as is kim Poor's moving artwork. Star of Sirius though stands up there with the great prog rock creations of all time. Five stars is NOT overkill at all nor if there were is six either....."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Saturday, August 14, 2004",
      "rating": 3,
      "text": "An album to place between A Trick of the Tail and Wind and Wuthering. Not only chronologically, but also in quality; this album tops Trick of the Tail and flats out easily Wind and Wuthering. Steve was gone on his own way before it really ended. He brought with him a few pals, and I must admit that the fact of hearing Rutherford and Collins playing comfortated me. It's like a seal of satisfaction. Before listening to the record, I always thought that Hackett was more like John Entwistle or Ringo Starr. Lots of talent (and docility), but too few good ideas. Man was I wrong.....again. I'm getting used to being tricked by my prejudices. Just hearing Ace of Wands or Shadow fo the Hierophant and I got convinced that Hackett is far, far, far from being just there. He has more than guitar skills (which I don't find particulary stunning), but rather the ability to build a world of romantism and old fashioned fairy tales. The covers shows up the mood he wants. Obviously, the guy don't need anybody to back him up. He stands solid on his two legs even in the early work. Mature, confident and strong. Just like Harrison! Harrison and Hackett had talent that was growing and expanding has time went by. One day, the circle of friends is too tight and claustrophobia (musically and socially) sets in. Hackett shows here where he's going and...it's way more proggish than anything Genesis done after Peter. THIS is romantic progressive rock. No sissies admitted and leave your blanket at the door please."
    },
    {
      "reviewer": "Guillermo",
      "date": "Posted Saturday, October 23, 2004",
      "rating": 5,
      "text": "After being \"left out a bit\" of the songwriting of \"The Lamb...\" album (as Banks/Collins/Rutherford said in one interview in 1982) and after the long tour for that album, after Gabriel left, but before \"A Trick of the Tail\" was recorded by Genesis, Hackett recorded this excellent solo album, which I prefer more than \"The Lamb\" and even more than some of the solo albums by the other members/former members of Genesis (including Gabriel). Hackett showed with this album a lot of creativity in songwriting, arrangements, guitar sounds, production ideas, etc. He really could have been bored in Genesis by 1974- 75, and after the success this album had in England in 1975 (number 26 in the charts!) he really could have left Genesis in that year.I like all the songs of this album, but the best of all for me is \"Shadow of the Hierophant \", a Hackett/Rutherford song, with very good use of mellotrons, guitar sounds, bells, drums. Sally Oldfield`s voice is very good in this song. All the songs have \"fantasy\" elements which are in the music. Some of the songs show some influence from King Crimson, but Hackett`s guitar style is \"very personal\". He really knows how to \"make\" very different sounds from his guitars, and he has a very distinctive \"guitar technique\". In the \"Genesis-A History\" video from 1990, Hackett said (more or less as I remember): \"I recorded a very successful album in 1975, but the band perceived it as a threat, and they told me to give up my solo career to contribute more to the band`s albums. I say O.K., if every musician contributes equal parts to the songwriting.But I didn`t have the music they claimed from me for the band. It took me two more years to organize the way to leave the band\". The band didn`t like many of Hackett`s music ideas and songs, so he finally left the band during the mixing sessions of the \"Seconds Out\" live album in 1977.But this \"Voyage of the Acolyte\" really shows Hackett`s influence and sound for the Genesis`s albums \"A Trick of the Tail\" and \"Wind & Wuthering\". I consider this first solo album as a \"first sight\" into the new music style of Genesis between 1975-1977. The cover art by Kim Poor (Hackett`s wife) is very good too. It really works with the sound of the album."
    },
    {
      "reviewer": "greenback",
      "date": "Posted Sunday, March 27, 2005",
      "rating": 4,
      "text": "This is Steve Hackett's first album. It is his most progressive one, having a bit the old Genesis sound and style: indeed, Phil Collins & Mike Rutherford play fantastic, fast & elaborated drums & bass, especially on the 2 tracks \"Ace of wands\" and \"Star of Sirius\". Collins' drums are comparable to his work on Genesis' \"Trick of the tail\". Steve's electric & acoustic guitars are more in the foreground than on the Genesis' albums, maybe because Tony Banks' awesome keyboards are not present. There are nevertheless excellent floating mellotron textures, and its combination with tubular bells + flutes on \"Ace of wands\" is delightful. The repetitive \"Lovers\" contains moving mellotron parts, delicate flute & acoustic guitars; it is a graceful track perfectly sung by Sally Oldfield. Phil Collins sings on a couples of tracks. The album is a bit melancholic and dramatic, as evoked by tracks like \"Hands of the priestess part 1\" and \"Shadow of the Hierophant\". I think the completely irrelevant and bizarre \"A tower struck down\" still has some influences from \"The lamb lies down on Broadway\" album. \"Hands of the priestess part 2\" sounds much more joyful than the first part: it has a delicate, ethereal and graceful mix of flute, acoustic guitars, mellotron and tender electric guitar: a GREAT moment on this record! Steve seems to sing on \"The Hermit\", a quiet track made of acoustic & electric guitars, peaceful flute and cello: the light pedal effect on the electric guitar in the end, combined with the excellent wind instruments is remarkable! There are some relaxing oboe/English cor parts which give a noble character to the whole.Rating: 4.5 stars"
    },
    {
      "reviewer": "Trotsky",
      "date": "Posted Friday, April 15, 2005",
      "rating": 4,
      "text": "You'll have heard it all before ... that this is the \"lost Genesis\" album, the best solo album that any member of Genesis (or any major prog group, for that matter) ever recorded, a wonderous secret known to a select few ... well, I'm not one to disagree. Yes, it doesn't feature either the vocals of Peter Gabriel or the keyboards of Tony Banks, but Voyage Of The Acolyte does bear many of the hallmarks of the classic Genesis sound and certainly belongs in the collection of any self-respecting prog fan.Along with the Genesis rhythm section of Michael Rutherford and Phil Collins, kid brother John (on flute and Arp synths) and keyboardist John Adcock, Steve crafts a fine album that isn't quite up to the standards of the Genesis albums that preceeded it, but is still pretty darn special.One way of telling that is a classic album is the absolute lack of filler material ... every song has its moments. The biting Ace Of Wands is a delightful instrumental with punchy fusion guitar, some pastoral twelve string, another winning one with bells and mellotron. Hands Of The Priestess, Part I has a beautiful flute and acoustic guitar melody. A Tower Struck Down is anominous hard rocking prog tune with some great bubbling synth work from John Hackett and a crescendo that has crowds baying for blood. Hands Of The Priestess, Part II is a brief mournful instrumental, and the vibe is carried on by The Hermit, a haunting acoustic piece that Steve actually sings (well, he sort of talks his way through it actually, but it suits the piece).One of the best pieces on the album is Star Of Sirius on which Phil Collins handles lead (and inadvertently presages the Genesis sound on the guitar-led songs that are on A Trick Of The Tail and Wind And Wuthering). Most of the song is gloriously pastoral and even when the whole band joins in, it's never really rocks. I love it and as Steve himself commented on Star of Sirius in 1992 ... \"I suppose looking back on it the song was rather twee - not the sort of thing I would record today but ... I think of it as the best song on that album.\"The Lovers is another of those brief guitar/mellotron instrumentals that serves as a fine precursor to the awesome Shadow Of The Hierophant, a monster prog piece featuring the ethereal vocals of Sally Oldfield. If you're looking for great solos and blistering interplay don't come here though ... Shadow Of The Hierophant is all about sweeping soundscapes and gentle acoustic guitar passages.30 years on, there's a mesmerizing quality about this excellent album that goes beyond the sheer instrumental creativity and virtuosity that draws me to most other classic prog albums. ... 85% on the MPV scale"
    },
    {
      "reviewer": "Philrod",
      "date": "Posted Saturday, May 28, 2005",
      "rating": 4,
      "text": "Steve Hackett's first solo album ''voyage of the acolyte'' is all about progressive music. Hackett's style of guitar playing is used to the best of its capacities here and his mastery is inevitable. On electric and acoutic guitars, he lets us into his world of sorcerer and Tarot elements; everything is around magic and mysticism. Also, two of his old pals from Genesis come in and help him(Phil Collins on drums and lead vocals on Star of Sirius and Michael Rutherford on bass) to create this mystic aura around the album. Also, the usual progressive instruments and elements are present, wether its keyboards, moog, mellotron, 12 string guitars, flutes. What is great is that he uses them as building blocks to the sound and textures. A total of 3 singers are present, but really its Sally Oldfield's presence that is the best, on '' the shadow of the hierophant''. This song is absolutely wonderful, with some space rock passages that will let you a dreamy feeling. This album in a whole is a gem, buy it not only to complete your genesis collection but for its beauty. 4.5/5"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Wednesday, June 22, 2005",
      "rating": 4,
      "text": "It's hard to argue with this excellent debut album from the guitar maestro Mr. Stephen Hackett. When I reviewed his live archives album couple months ago, I did mention that for some of you, you might have known Steve only from his tenure with Genesis and probably still label him with something like \"ex Genesis guitarist\" and you might not know what his work after he left the band. Nothing wrong with that. That's the same case with me when I got the cassettes of his first two albums, I still considered Steve as Genesis guitarist instead of Steve as a solo artist and did not play the cassettes intensely. Until one time when a support band of Uriah Heep Live in Bandung, Indonesia sometime in 1980, there was a local band that played Steve Hackett's \"Ace of Wands\" excellently. It clicked me to replayed the cassette. That's the first love I got with Hackett music. I was hooked with \"Voyage ..\", \"Please Don't Touch\", \"Spectral Morning\" and \"Defector\". For me, Steve has produced many great prog tunes that I consider now as a classic, such as: \"Every Day\", \"Star of Sirius\", \"Ace of Wands\", \"Narnia\", \"Clocks\", \"Shadow Of The Hierophant\", and many more great tunes. \"Ace Of Wands\" is a great track - and has become my favorite track - started with a dazzling drum. The intertwining works of guitar, keyboard and flutes are really good. Oh man . this is a wonderful track and it's so uplifting.Being a debut album, it's heavily influenced by early Genesis - not that two members of Genesis (Mike Rutherford and Phil Collins) contributed, but musically I can sense the flavors of \"Supper's Ready\" in \"A Tower Struck Down\" (track 3). You won't argue that the rhythm section is totallyFoxtrot-ized. Nothing wrong with this. I especially like this track during the keyboard solo - it's stunning. Stand-alone, this third track is probably not an attractive one but as this track is positioned in between \"Hands of the Priestess Part I (3:28) and Part II (1:31)\" with mellow Genesis guitar style, it becomes interesting to enjoy. The Hermit (4:49) continues the same style and nuance with Hands of the Priestess with Hackett on vocal. Phil Collins takes a vocal role in the next track \"Star of Sirius\" (7:08) that starts mellow with good guitar fills and keyboards. The music turns into faster tempo with drums and other instruments.The peak of this album, IMO, is \"The Lovers\" (1:50) - \"Shadow of the Hierophant\" (11:44) whereby the first part serves similar to Horizon of Genesis' \"Supper's Ready\": an acoustic guitar work augmented with mellow keyboard. The music continues seamlessly to \"Shadow of the Hierophant\" with a blues-based rhythm and nice quieter passage where fabulous voice of Sally Oldfield enters the music. Uh . it's really cool man .. In a way, it reminds me to Renaissance's music - not because the lead singer is female but it shares similar nuance. In fact, Sally and Annie Haslam have different timbre - so both cannot be compared. But the song is really great and I now remember that this song was featured in a compilation cassette of \"Heavy Slow\" sometime in the eighties. It's a great tune.In summary, this is the kind of classic prog album that you don't want to miss. Excellent composition and musicianship. Highly recommended.Keep on proggin' .!Progressively yours, GW\"Lost in thought in search of vision. As the moon eclipsed the sun.\"- \"Shadow of the Hierophant\" by Steve Hackett."
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Saturday, July 23, 2005",
      "rating": 4,
      "text": "Hackett's first solo album begins with a bang, and ends with a bang as well. You'll find here a very Genesis-like affair, in fact Phil Collins and Mike Rutherford make appearances. Hackett's performances are the main foray of the album, from his acoustic passages, to his electric runs up and down the fret board, one cannot feel anything but awe as this virtuoso plays his soul out. Most of this album is instrumental, but the vocal passages are very welcome and add even more Genesis sounds to the atmosphere.From the opening Irish feeling of Ace of Wands, to the ending jam in Shadow of Hierophant, there is one thing clear, Hackett is brilliant. Ace of Wands is a rocking instrumental, which has a Celtic/Irish feel at first, and soon becomes a mellotron/acoustic guitar led tune. Hackett's command over the rest of the musicians is key, for he has a much more involved role than he did in Genesis. Hands of a Priestess Part I begins with a very Firth of Fith sounding intro, the flute sounding very much like Gabriel. Star of Sirius is one of the three songs with vocal, and it features a catchy chorus, and some very calming acoustic passages in the beginning. Shadow of the Hierophant is one of the other vocal- laden songs. It has a very Starless type of feel, in that there is a long jam that proceeds after the vocals have finished. The music in this one is powerful, and ends the album on a high-note.Overall, this is a very enjoyable album from a very enjoyable guitarist. However, the Genesis feeling is very large, and it would take another album or two for Hackett to stray somewhat away from that sound (he would come back to it occasionally). 4.5/5."
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Wednesday, September 7, 2005",
      "rating": 5,
      "text": "Of course this is the progrock sound that Genesis should have played from the late Seventies, unfortunately Steve Hackett left in '77 and Genesis became a poppy prog act under the command of Mr. P. Collins. But, as our famous Dutch soccer player Johan Cruijff used to say, \"every disadvantage has its advantage\" so we could enjoy an inspired and very progrock sounding Steve Hackett solo from '77.This wonderful album features a Hackett who still was a member from progrock top act Genesis but also lost his battle to maintain his marriage. Music is a perfect way to sublimate this kind of negative emotions and I think that Hackett has done this very well, supported by his new Brasilian girlfriend Kim Poor who designed the beautiful art work. On this album the music carries me away to Progheaven, what a wonderful, captivating and varied progrock sound featuring mindblowing guitarplay by Hackett (distinctive volume-pedal work and lots of sensitive electric guitar), amazing keyboard work by John Acock (what's in a name?!), a fine collaboration from Genesis members Collins and Rutherford, Sally Oldfield and Johnny Gustafson (ex Quatermass and Roxy Music) and, last but not least, a frequent appearance of the unsurpassed Mellotron, EXCELLENT AND ESSENTIAL!!"
    },
    {
      "reviewer": "Fishy",
      "date": "Posted Wednesday, September 28, 2005",
      "rating": 4,
      "text": "Hackett's first solo outing reached the charts very quickly in 1975 which was proof that he delivered more than just a decent album. In fact, this masterpiece was the start of a solo career spawning the next three decades. Shortly after Peter Gabriel announced his departure from Genesis there was a uncertainty of the future. This was the first time several group members were involved in various projects outside the group. Hackett did a solo album and the quality of \"Voyage.\" proves this was the right decision.By looking at the magnificent cover art you'll get an idea of what's the music like. It breaths mystery. The tracks have been named to tarot cards. The music seems to be the perfect soundtrack for this kind of main theme. Some people call this album \"the lost Genesis album\" but I couldn't possibly agree. Although there are certain links to Genesis, a track like \"Ace of wands\" is a typical product of a guitar hero. Unlike Genesis, the melody lines and moods rapidly succeed one another. It get driven by acoustic and electric guitars but the keyboards add much colour to the sound.\"Hands of the priestess\" is a dreamy soundscape due to the wonderful melodies provided from the flute of brother John. \"A tower struck down\" is an intriguing example of Hackett's longings for music of a more experimental nature. Its dark, yet rhythmic atmosphere was something that was never heard before and till today it keeps on sounding unique.\"The Hermit\" suffers from Hackett's lack of confidence in his own singing. Fortunately there's some excellent melodies in the arrangements which makes this another great track with a rather sad feel to it.On this albums Hackett gets assistance from his Genesis mates Rutherford and Collins on bass and drums. Next year they would contribute on the solo debut of the formal Genesis guitar player Anthony Phillips. \"Star of Sirus\" also holds Collins vocals and may let people think of a replacement of Gabriel for the next Genesis album. Although this isn't exactly my favourite tune on this album, the Genesis references in vocals and composition are obvious. The vocal line isn't highly melodic which is contrary to the excellent melody lines on the other tracks. The superb arrangements saves it.I always listen to \"The lovers\" as it was an intro for the next song. Its delicate acoustic nature suits this purpose perfectly. \"Shadow of a hierophant\" is without any doubt the most important gem on Voyage. I notice two very different sounding parts in this piece of extraordinaire music. The first part has the classical trained voice of Sally Oldfield who does a tremendous job in reaching high notes with her angelic voice.The instrumental chorus of this track is characteristic for Hackett's work. This consists of a sleepy guitar solo on top of some splendid mellotron sounds. The second part of the track has an Oldfield feel. One stunning melody is repeated a dozen times, growing louder and more majestic by gradually adding different instruments to it. In the end you'll get a full blown orchestral sound. What an incredible way to end an album ! The new remaster includes an enlarged version as an extra but it doesn't sound very different from the original. The other bonus track is a live performance of \"ace of wands\". I always wondered how on earth Hackett did manage to bring this splendid track live, knowing there's a lot of guitar playing going on at the same time. But this version is excellent ! Most surprising is the different acoustic ending which is comparable to the ending of \"Moonlit knight\" from Genesis.There's a magical feel to this album, it almost sounds like a fairy tale. Throughout the album the mellotron is used a lot and maybe this is the reason why the album still sounds timeless after all those years. It aged a lot better than other Hackett efforts. Moreover the sound of the album benefits quite a bit from the remastering process. Half of the album has a rhythm section the rest doesn't need one as the excellent melodies are shining through a lot better without. The melodies throughout this album are outstanding.If you're unfamiliar to the work of Hackett I would like to make a recommendation to start with this prog classic of the seventies."
    },
    {
      "reviewer": "chessman",
      "date": "Posted Saturday, October 29, 2005",
      "rating": 4,
      "text": "Not a lot I can say really that hasn't been said before about this excellent recording. The most Genesis-influenced of Steven's solo ventures, recorded when he was still with the band, it is a superbly constructed album. 'Ace of Wands' is a classic, with lovely guitar work, both 12 string and electric. 'Hands Of The Priestess', both parts 1 & 2, is a wonderfully peaceful and melodic tune, with brother John's instantly recognisable flute playing to the fore. 'A Tower Struck Down', which cuts the two 'Priestess' parts in half, is a louder, more bassy tune, but still effective. Mike Rutherford performs effortlessly throughout the album, as does his colleague Mr Collins. Steve obviously felt, with them driving the rhythm section seamlessly, he could get on with his own work, safe in the presence of his fellow band mates. 'The Hermit' is another slow, moody, melacholic piece, with Steve handling the vocals himself, and not doing a bad job either! 'Star Of Sirius' is Phil's vocal contribution to the record, and a good job he makes of it. Remember, this was recorded just after Peter Gabriel left Genesis, and Phil was not yet established as the band's singer. 'The Lovers' is a very short, acoustic guitar piece, which pre-dates his later classical leanings. And lovely it is, as well. Of course, to finish we have the magificent 'Shadow Of The Hierophant' with the unique, pure, high voice of Mike Oldfield's sister, Sally. I always loved this piece, especially the way it fades away to nothing after the last verse, then builds slowly back up to full volume, with instruments being added one at a time almost. This track also has some nice 12 string guitar on it. I have the remastered version now, which is why I have not reviewed this until today. There are two bonus tracks on it. A live version of 'Ace Of Wands', which is good, but not essential, as it is similar to the live versions on the boxed archive set already owned by many of us. The second track is the original version of 'Shadow Of The Heirophant', which lasts for over 17 minutes. This, likewise, is not essential, as it is basically the same song, until we reach the end, when the instruments start to build up. In this version, it just takes longer to reach the end. The quality on the remaster, however, is superb, far louder, brighter and clearer than the original, with nice packaging. New liner notes inside, whilst the cd itself now sports the original 'Famous Charisma Label' logo, the one the records used to use. It happens to be probably my favourite label of all! A nice touch. All this in a slip case as well. All Hackett fans need this!"
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Thursday, March 9, 2006",
      "rating": 4,
      "text": "The waiting (to leave the band) roomSteve Hackett's first solo album is still held by many to be his best. It was in some ways an extension of his work with Genesis, even down to the \"Trespass\" like sleeve designed by his wife, Kim Poor. The album was recorded after Peter Gabriel had left Genesis, but prior to the release of \"A trick of the tail\". The other remaining Genesis members were reportedly uncomfortable with Hackett pursuing a solo project while still in the band, and consequently further solo releases by him were not forthcoming until after he left.While \"Voyage of the Acolyte\" is veryprogressive, with many of the sounds which distinguished early Genesis albums, it is quite different in terms of composition. If the opening track \"Ace of wands\" is anything to go by, the influences are more in the way of King Crimson or Yes. Indeed, track 2, \"Hands of the Priestess Part I\" is reminiscent of \"I talk to the wind\" from King Crimson's first album.There is a diversity to this album which tends to be lacking on subsequent Hackett releases. While he has explored many different styles through the years, each album has tended to focus on a particular aspect, whereas here he throws many of them into the same pot.The Genesis sounds start to come to the fore on \"A tower struck down\" which borrows strongly from the \"Apocalypse\" section of \"Supper's ready\" (or is it \"Grendel\"!). The track also has a \"Waiting room\" (\"Lamb lies down..\") flavour, a track which Hackett clearly favours, since he also included it in his \"Genesis revisited\" project.Just when it seems the album is to be entirely instrumental, vocals appear for the first time on \"The Hermit\". This \"Blood on the rooftops\" like song is comparable with the work of Camel, accentuated by the fact that Hackett and Andy Latimer have a similar vocal style. Hackett is clearly aware of his own limitations in the vocal department, they are adequate but no more than that. A couple of guest vocalists therefore appear on side two of the album. Phil Collins, who at the time was about to take on the lead vocalist role for Genesis, sings on \"Star of Sirius\". His performance is more like the multi tracked style of \"Harlequin\" (\"Nursery Cryme\") than the \"Track of the tail\" onwards albums, and is thus a bit rough at the edges. The track is quitepop, but has some fine instrumental work.The feature track is \"Shadow of the Hierophant\" which is preceded by the brief \"The lovers\". In the same way as \"Horizons\" precedes \"Supper's ready\", \"The lovers\" should have been incorporated into \"Shadow..\" as an integral part of the song. The guest vocalist here is Sally Oldfield, sister of Mike and an accomplished singer in her own right. There's an \"Epitaph\"/\"Fountain of Salmacis\" feel to the opening section, which is transformed by Oldfield's supreme performance. A \"Ripples\" like link leads to a lengthy closing section which features a repeating theme building from delicate xylophone to a bombastic, majestic conclusion and fade. The piece is quite typical, perhaps derivative, of other prog pieces of the time but is nonetheless a magnificent opus.With his first solo album, Steve Hackett showed that he had much to offer. In retrospect, it is easy to understand how he became frustrated with the constraints of working within the Genesis framework. Had Tony Banks not also been in his most productive period, Hackett would clearly have been able to carry Genesis to greater heights himself. Whether these particular songs were ever actually offered to the band, is a matter for speculation.This is a highly accomplished work, recommended to all who enjoy thecoreprog of the early to mid 70's.The recently released re-mastered CD version has an additional live version of \"Ace of wands\" and an absolutely essential 17 minute extended studio version of \"Shadow of the Hierophant\"."
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Wednesday, September 6, 2006",
      "rating": 3,
      "text": "3 StarsNote: I modified my rating system. I \"grade\" individual tracks as well now, located inside parenthesis.It is always interesting to hear solo albums to see the musicians' musical expressions that would be limited when that artist is in a band and is not the leader. Here, it seems like Genesis has influenced him all over the album, unless Steve Hackett was a main composer in the band (I honestly don't know). The symphonic nature of Genesis is clearly heard here as well, especially when you notice that Rutherford (bass) and Phil Collins (vocals, Drums) are present. Also, Steve's trademark guitar sound is everywhere. Unlike many, I find this album very inconsistent in quality: Star of Sirius being unlistenable while Shadow of the Hierophant and the hands of the priestress interludes are beautiful. The rest of the songs are decent but quite disappointing considering it's supposed to be Steve Hackett's best album.(C) Ace of Wands: A cheesy and frenzied solo introduces the song which is very dynamic and proggy. The song changes rhythms numerous times, though too much for my enjoyment. The result is a promising, yet slightly choppy piece with great parts and bad ones as well. However, I don't think anyone could call this dull.(A-) Hands of the Priestess: this interlude; with its acoustic guitars, haunting electric guitar riffs, mellotron, beautiful flute melodies; melts me.(D-) A Tower Struck Down: A somewhat aggressive and repetitive piece with bizarre guitars and synths. Unfortunately, it makes me wish that there was a melody present in the song. The last minute is musically pointless, and the whole song doesn't do anything for me.(A-) Hands of the Priestess II: While the tone and style is similar to part 1, the song is not a regurgitation of the first part. It begins with a charming flute that is later accompained by a beautiful theme played on an electric guitar.(C-) The Hermit: A nice acoustic ballad, but nothing special. Any ballad from Genesis in this period is superior to this one. The relaxing outro is pretty good though.(F) Star of Sirius: The first two minutes are charming enough, but that doesn't stop me from giving an F to this song. The reason is simple: one of the most horrible choruses I've heard in my life, prog or not. I cannot believe that it is Phil Collins who is singing here because if that's him, he must have been having a major flu (his vocal performance is horribly subpar). Not only is the singing weak, but the ridiculous melody and vocal harmonies make my parents ask me to please put my headphones whenever the chorus comes up. Skippable song for sure.(C) The Lovers: A nice interlude between the horrible song and the masterpiece.(A+) Shadow of the Hierophant: You can't have an album as inconsistent as this one in terms of quality. After an unlistenable song with choruses that could be used for harsh interrogative tactics, here comes one of the highlights from the whole progressive rock movement of the 70s. It begins with a glorious and bombastic mellotron/guitar punch that is played a few times throughout the song, alternating with folk melodies sang by a talented woman. After that ends, the song leaves room for an impressive electric guitar solo that I consider one of his best guitar performances in his entire career. It is not technically impressive (excluding the lighting fast tapping that introduces it) but it is rich in melody and emotion. Just when I feel goosebumps all over my body, the best is yet to come: a crescendo that would make post rock bands like \"Godspeed you Black Emperor\" shake their heads in shame as this guitar player made one of my favourite crescendos in the whole music world. I won't spoil much, but I could say that it has one of the best Collins performances, a synthesis of guitar riffs,delicious mellotron, and other instrumentation. A perfect ending!Shadow of the Hierophant is worth the album itself, but you won't find more of this quality except for the priestess interludes. The album is so inconsistent in quality that it severely mars my enjoyment whenever I spin this disc. Proceed with caution.Highlights: Shadow of the Hierophant, Hands of the Priestress pt1+2Let Downs: A Tower Struck Down, Star of Sirius.My Grade : C"
    },
    {
      "reviewer": "Australian",
      "date": "Posted Friday, October 6, 2006",
      "rating": 5,
      "text": "Steve Hackett's \"Voyage of the Acolyte\" is a shinning example of the mixture of band and orchestral instruments into one album. This is probably why Steve Hackett is classified as a symphonic artist. Also the inclusion of synthesizers gives it that final symphonic touch which tops off the album's sound. The album its self is a tremendous success in my eyes, it is an advancement on any Genesis album as it features, in my opinion a more interesting atmosphere. Whether it be the unique sound or just the greater focus on classic guitar I just can't say, but it's just an improvement.The album contrasts greatly in sound and mood, take the opener \"Ace of Wands\" and the following track \"Hands of the Priestess pt.1.\" \"Ace of Wands\" is a louder, more violent song while Hands of the Priestess pt.1.\" is a beautiful mixture of classical guitar, flute and mellotron with some percussion here and there. These contrasts pop-up throughout the entire album and become very obvious after a while. Steve Hackett's guitar styles on this album range from intricate classic fingering to experimental guitar synthesizers, very interesting guitar work.The album opens with the fast-paced \"Ace of Wands\" which features a couple of themes which appear throughout the entire album, played on instruments ranging from guitar to harmonica in a mellower mood. The song its self is excellent and features some very powerful progressive elements including synthesizers, changes in meter and mixture of instruments.The next song \"Hands of the Priestess, Part 1\" is a somewhat mellower song with a really great flute melody played by Steve Hackett's brother. The song is more down to earth than \"Ace of Wands\" but still features little snippets of oddity. The song is a buffer for the upcoming chaos.\"A Tower Struck Down\" is a louder, more aggressive piece than its predecessors and it incorporates the use of odd synthesizer effects. The synthesizers and general sounds in the piece are quite monotonous, but this is a minor factor and will eventually be forgotten. The song also breaks the calm of \"Hands of the Priestess, Part 1\", and it's really does its part well.\"Hands of the Priestess, Part 2\" is quite a short song and it echoes the first part of the song. At the beginning of the peice a new tune is introduced which is repeated later in the album. There is also another tune repeated on a harmonica which sounds very. hazy and good. It is a good revival after \"A Tower Struck Down.\"Next is \"The Hermit\", which features great acoustic guitar work from Hackett and also great string backing which adds to the mood of the song. The song excels at conjuring the image of a weather-worn hermit who is more that what meets the eye.Then comes, the masterpiece of the album, \"Star Of Sirius believe me this is one amazing song. The contrast of loud and soft parts, as well as the very melodic guitar work and woodwinds (cor angelis I think) is amazing. A few of the tunes are repeated during the climax of the song and blend with the total feel of the song like clockwork. Amazing stuff.Up next is the short \"intermission\" song \"The Lovers\" which is basically just a winding, mellow acoustic solo from Hackett with minimal backing. It acts as a buffer before the climax.Last is the fantastic \"Shadow of the Hierophant\" which is another highlight. The piece features the lovely voice of Sally Oldfield who really brings something anyone else could not. The song is very epic and there is a particular tune which is repeated numerous times throughout the song. \"Shadow of the Hierophant\" is a great way to end a truly unforgettable album.1. Ace Of Wands (5/5) 2. Hands of the Priestess Part I (5/5) 3. A Tower Struck Down (3.5/5) 4. Hands of the Priestess Part II (4/5) 5. The Hermit (5/5) 6. Star of Sirius (5/5) 7. The Lovers (3.5/5) 8. Shadow of the Hierophant (5/5) Total = 36 divided by 8 = 4.5 = 5 stars!!Essential: a masterpiece of progressive music\"Voyage of the Acolyte\" is in my opinion better than any Genesis album, but really what has that got to do with anything? Anyway \"Voyage of the Acolyte\" really is an amazing album in all regards and it does what Genesis albums could not. I'd recommend this album to everyone, its great."
    },
    {
      "reviewer": "Chus",
      "date": "Posted Thursday, October 19, 2006",
      "rating": 4,
      "text": "Well, there are hardly ratings below the 4-star rating for this album. That shows something: anyone could easily get used to Steve Hackett; yes, the dorky shy guy with beard and lenses sitting lonely on a corner at Genesis' concerts (as a musician, of course, not to be confused with another roadie) now has broken loose, or well, just a little bit; he's still mostly drown in the mix of mellotron layers and synthetizers, like in the old Genesis' days; but he's in charge of the compositions now, and great compositions they are, taking you into a world of romantic fairy tales and stories of ancient religions.Yes, it's still in the vein of Genesis (and it's not a complaint); however, he could slap Banks' face with this album, demonstrating that he could live without Genesis' pity.There are two familiar names on the band's credits: Collins and Rutherford (of the same Genesis fame); though they are under Hackett's command this time.So I'll get to the actual review: it starts on a fast beat with \"Ace Of Wands\"; with fantastic interludes and amazing ending, even though they're split together by an annoying and dated sound effect, a low point but it doesn't even last 2 seconds, so there's no point in skipping it. Then we get transported into the suite \"Hands Of The Priestess Pt.1/A Tower Struck Down/Hands Of The Priestess Pt.2\": the prelude is highly atmospheric with haunting chords of 4th's, 7th's and 2nd's, both in acoustic guitar and mellotron; the flute work is superb; \"A Tower Struck Down\" is more electric and bombastic, and you could hear chants and the tower being struck down at the end in a crashing sound, the mellotron laments again with strange chords and then, fading in, the epilogue reprises the prologue with good effect. The Hermit is based in a single guitar riff, but there's beauty in it's simplicity and the oboes bring a sense of nostalgia with emotive notes. \"Star Of Sirius\" is also acoustic-based but a bit lighter in mood and some up-beat moments (Collins fills the vocal spot in this one). I think the weakest song here is \"Shadow Of The Hierophant\"; it has a great melody and is beautifully crafted with Sally Oldfield's vocals, but it tends to be too repetitive and overlong for that matter.In this album there's also the tendency to reprise a main melody in all of it's songs: the melody that is first found at the 2nd half of \"Ace Of Wands\"; evoking the idea of a concept in the same manner as Pink Floyd's \"Dark Side Of The Moon\"; Gentle Giant's self-titled album and Jethro Tull's \"Thick As A Brick\".It's a great addition to any collection of symphonic rock music, and I would recommend it highly to any Genesis' fan before Wind And Wuthering. 4 stars."
    },
    {
      "reviewer": "silvertree",
      "date": "Posted Monday, October 30, 2006",
      "rating": 4,
      "text": "Well, a lot has been said about this album being the lost Genesis album... I don't quite agree with that suggestion. It definitely has a Genesis sound to it of course but knowing Hackett's other works, Voyage Of The Acolyte has Hackett's trademark written all over it. This means that his next couple of albums are as good if not better (in sound). Phil Collins' contribution on the vocals is not that good unfortunately but the drumming makes up for it ! The only setback is when Hackett sings on the Hermit. However the rest of the album is fantastic. My own favourite is Shadow of the Hierophant : what a great piece of progressive music. Attention Genesis fans : go and get this album if you don't already have it."
    },
    {
      "reviewer": "NJprogfan",
      "date": "Posted Wednesday, December 27, 2006",
      "rating": 4,
      "text": "A very beautiful truly symphonic prog album by one of the most important guitarists in prog. It's the only album I have of his so far and I really can't see how he could have topped it. It starts off very aggressively, which took me by surprise, (I did have the original vinyl record years ago, but I toally forgot what it sounded like). \"Ace Of Wands\" is my favorite song for the simple reason that it doesn't sound like Genesis. It's a tad fusiony mixed with symph changing tempo often and at only 5.25 minutes long, it has enough melodies and themes for six songs! A classic! The next three songs tell a story and are haunting and dark with the third part acoustic and pretty. \"Star of Sirius\" is sung by Phil Collins and is the catchiest and very memorable. But hands down, the most symphonic song on the album is \"Shadow of the Hierophant\". With Sally Oldfield's precious vocals and Steve's wailingly sad guitar, it features super Melotron passages which sticks in your head for days. My copy is the re-mastered version with two bonus tracks, a killer live version of \"Ace Of Hands\" and an extended version of \"Shadow of the Hierophant\" which tends to get on your nerves after it surpasses the original version timewise. All in all, I'd guess this would be the best solo album symphonicaly by any member of Genesis and garners a 4.5 star rating from me. A must have for Genesis fans and symph fans in general."
    },
    {
      "reviewer": "Sagichim",
      "date": "Posted Thursday, February 22, 2007",
      "rating": 4,
      "text": "Knowing genesis before i knew steve hackett ,deffinitely didn't prepare me for this album. Although i knew he was a good guitar player that sometimes was not fully noticed ,i didn't imagine he was such a wonderful songwriter and a progressive one too. I guess he was the main guy pushing the music to prog territories in genesis.The album openes with a bang ,'ace of wands' is one of the most progressive 5 minutes song i have come to hear ,it changes about every 30 seconds from the main theme to a second theme and back ,then evolves some more having one of the most coolest breaks in history of breaks. Spectacular bass and some good drumming. One of the greatest tracks by hackett. But the album is not all crazy like the opener ,but presents a mellow side too with good acoustic guitars incorporating some flutes and keys ,creating some beautiful moods. Another thing i like about this album is how it demonstrates hackett's songwriting ability and not focusing only on his guitar playing ,that is noticed on 'a tower struck down' which is a prog song focusing on the keys, also great. The music on the album is eclectic symphonic with very good ideas, some are well done and some are less, like the closing track which clocking at above 11 minutes ,is nice but drags too long for minutes when nothing really changes.This was a very promising debut by hackett ,and followed it a couple of more progressive albums. 4 stars"
    },
    {
      "reviewer": "tszirmay",
      "date": "Posted Saturday, May 5, 2007",
      "rating": 5,
      "text": "No real point in annointing this immense talent and huge guitar innovator any further , I still remember rewiring my jaw (after picking it up off the concert floor) subsequent to Genesis' show in Montreal in 1974. \"A flower?\" blooming amazing guitar display that was. This debut album is still justly viewed as a glowing icon of melancholia-infused progressive rock. With most of his Genesis bandmates on board, Hackett is in obviously comfortable surroundings and hence, positively shines throughout the tracks , effusively flowing guitar forays searching for new tonal horizons , dazzling atmospheres wonderfully coloured by the ubiquitous mellotron cascades, rivers of liquid flute runs and an occasional stream of vibrant cello. The supporting cast does well to further enhance the fragile delicacy of the arrangements , namely the pulsating Rutherford Rickenbaker combining deftly with the marvelous Collins drumming (they were a very underrated rythm section ), a burping Percy Jones fretless bass cameo and the glimmering voice courtesy of Sally Oldfiled . The tracks have been already dissected by my esteemed colleagues, so I will reserve my comments to the closer, where the disc spirals effortlessly into the upper reaches of nirvana (no, not the band) , an unmitigated classic that easily rivals or even surpasses any prime Genesis tune, proving conclusively that Steve's departure was the final progressive moment in Genesis' existence. The next chapters of their history has only further confirmed the obvious. Tied with Spectral Mornings but a slightly more precious overall package (Beautiful cover to boot). 5 stars, with \"no reply at all\"."
    },
    {
      "reviewer": "fuxi",
      "date": "Posted Thursday, June 21, 2007",
      "rating": 3,
      "text": "With this solo album, his first, Steve Hackett set the pattern he would maintain throughout his career. Some tracks may annoy the listener, some leave him/her indifferent, some are so beautiful it hurts. To the first category belongs \"A Tower Struck Down\", to the second \"The Hermit\" and the much-vaunted instrumental climax of \"Shadow of the Hierophant\" (melodramatic, self-important film music which takes a lot of time getting you nowhere). With a bit of goodwill, we might state that the third and final category is the one that's best represented here. A good album, then, but not a great one.To be more precise: the pastoral folk of \"Hands of the Priestess\" and \"Hierophant\" (at least the latter's vocal half, sung by Sally Oldfield) feels truly charming and refreshing. Hackett's fortissimo guitar-and-mellotron outburst on \"Hierophant\" will frighten the pants off you the first time you hear it; it clearly shows how much he was enthralled by King Crimson's \"Epitaph\", but it's no less effective for that. A shame, though, that Hackett (or Mike Rutherford - I don't know who was responsible for the lyrics) wouldn't let Miss Oldfield sing a simple love song but decided to stick to fake-poetical nonsense. 'Veiling the night shade bright stalks a flower revealed / Nearing the hour make haste to their threshold concealed'? I don't think so...Silly lyrics are also the one weak point of \"Star of Sirius\", but otherwise I don't want to hear a word against this particular song. It's one of the most ravishing melodies I've heard Phil Collins sing - easily as good as anything on TRICK OF THE TAIL (then as yet unreleased). To top it all, \"Sirius\" includes a mellow middle section for oboe and mellotron so achingly beautiful it makes me want to burst out in tears every time I hear it. Hackett tends to write wonderful tunes for wind instruments; it's something I truly admire. He also has a great ear for analog synth sonorities. On the gorgeous instrumental \"Ace of Wands\", Moog synthesizers are employed to great effect (as well as twelve string guitar, mellotron, bells and of course Steve's mischievous electric lead guitar).To sum up, VOYAGE OF THE ACOLYTE is worth hearing but not the masterpiece of symphonic prog some Hackett fans make it out to be. When pressed, I'd give it three and a half stars. (You may be interested to know that the album's best two tracks can also be found in the excellent compilation THE UNAUTHORISED BIOGRAPHY.) As for ACOLYTE's cover art, I'm afraid it's the kind of wishy-washy fairy tale stuff that gives prog a bad name. (Unfortunately, on later releases the artist concerned was to prove she could do even worse.) Finally - any mixed feelings I may have about this recording cannot disguise that Steve Hackett's post-1975 career has been far more fascinating than anything achieved by comparable figures like Steve Howe or Rick Wakeman. Whatever his defects, Hackett rarely runs out of ideas. Long may he continue to perplex and surprise us."
    },
    {
      "reviewer": "Andrea Cortese",
      "date": "Posted Monday, July 30, 2007",
      "rating": 4,
      "text": "\"...lost in thought in search of vision as the moon eclipsed the sun...\"This album is of a rare beauty. I adore almost every minute of it.The choice to try something new outside Genesis was a winning decision for Hackett. The atmosphere is warm with strong classical influences (a special mention goes to Sally Oldfield her beatutiful and pure vocals), rich of varied and intelligent compositions. Above all, its freshness, that sense of joy and delicacy flowing from all the notes, from all the synth's chants.Acoustic and electric guitar softly whispering create pure melodic structures. Many changing moods from baroque (thanks to the use of instruments like oboe, cello and flute) to dramatic: the couple \"Hands of the Priestess - part 1\" and \"A Tower Struck Down\" are the most evident proof. The second one, in particular, is great, superb, nervous, exciting with those peculiar and distorted bass parts. Not to speak of the master use of synth whose results have bring the melodies to Olympus mount of prog.The album is instrumental for the most part, with some exceptions like \"The Hermit\", \"Star of Sirius\" (which features excellent vocals thanks to fellow Genesis member Phil Collins) and \"Shadow of the Hierophant\" (11,45 mns).The last one, is mainly instrumental and pompous. It reminds me (in its first part), a little, of Barclay James Harvest's memorable tune \"For No One\", especially for the majestic choir mellotron eruptions. That's one my best \"goose bump moments in prog\".Thanks, Steve. 4.5 stars."
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Saturday, December 8, 2007",
      "rating": 3,
      "text": "One Genesis album not credited to Genesis is the first solo effort by Steve Hackett. The album was made after Gabriel had left and the guys were taking some time to try different things before making decisions about Genesis. Hackett took the chance to \"be the Captain\" for a change and this album has all of the beauty and grandeur of the 70s finest symphonic successes. A balance is achieved between delicate pastoral moments and rocking ones, the arrangements and sound are quite good, and the list of guest stars is impressive: Collins, Rutherford, John Acock, Sally Oldfield, and Percy Jones. Hackett notes that it \"was great to work with Phil and Mike in a different way outside the confines of the band.\"\"Ace of Wands\" begins with an uptempo riff and muscular bass that alternates a mellow section of acoustic guitars and synths. Nice progressions lead to some fancy Hackett leads towards the end. \"Hands of the Priestess part 1\" is pure prog heaven with acoustic and lovely flute over mellotron. The melody is gorgeous and dreamy. Occasionally light chimes and volume controlled electric leads make a welcome appearance. \"A Tower Struck Down\" jolts you from the serenity of the previous song with a Crimsonesque harshness to the mood. Sound effects come and go adding drama and unease. It then drifts back to the loveliness of \"Hands of the Priestess part 2\" briefly before going into \"The Hermit.\" The music is very pretty with cello, acoustic guitar and flute. The vocals are somewhat tentative and thin as Hackett was obviously not too comfortable with his vocal prowess. \"Star of Sirius\" begins side 2 with mellotron, acoustic with effect, and a guest vocal by Collins who does a nice job. This track features a catchy pop-ish chorus that gets a bit sing-songey but I find the overall cheese rating of the album to be more than manageable. Let's face it, there's good cheese and bad cheese and this is some of the fine stuff.Some say albums like this are what made Punk necessary and while there is an element of truth to that philosophy, it can never take away the joy that music like this gives to people. Punk and prog can co-exist just fine in the eyes of we fans-it seems like the artists are the ones who have trouble getting along. \"The Lovers\" is a short instrumental introduction to the real highlight of the album, the magnificent \"Shadow of the Hierophant.\" This has to be one of symphonic prog's greatest moments. I am captivated by the yearning beauty of the main melody that keeps finding its way back, seemingly more passionate each time. And then there is the angelic beauty of Oldfield's vocal which just makes my heart burst. The louder parts trade off with soft passages of mellotron, acoustic guitar, and flute. There are some pleasant electric leads peeled off now and again. Some have complained the track is a bit sweet and this is true but what can I say? Sometimes a particular piece of songwriting catches you in its spell and other times definitely not. I find it completely charming and spellbinding.I would highly recommend this album to anyone who loves melodic symphonic prog like Genesis, Novalis, Willowgrass, Rousseau, Yes (think \"To Be Over\"), Oldfield, or Camel. It may not be a masterpiece but it is an exceptional album. The gatefold mini-lp reissue features good sound and the amazing artwork of Kim Poor whose album cover won an award. Her website describes the cover as follows: \"Through bone and fire the sightless priestess foretells the future. Her eyes are denied the usual sight, but she represents events foretold: precognition, premonition and the road of the tarot are her stock in trade. The hands of this gifted seeress, and feminine intuition, allow the drawbridge of consciousness to be lifted for her, immediately becoming an open door. It is a Chinese watercolour in her background which tells of past lives ... the tower about to be struck down ... the balloons of colour that must be snatched and fully grasped in order to move forward, representing the artist herself.\" [Kim Poor] It also features two bonus tracks, a live version of \"Ace of Wands\" and a 17 minute extended version of \"Shadow.\" All in all a high-quality release and one deserving of its reputation as one of the highlights of the mid 1970s prog scene."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Monday, December 24, 2007",
      "rating": 3,
      "text": "Hackett delivers one of those albums where you can just hear the love and painstaking effort put into the composition and recording, but in the end the result does not quite resonate with me. This is primarily a mellow, reflective, and often times--I hate to say it--boring album. You'll find plenty of beautiful melodies and wonderful 12-string and mellotron arrangements, but often not simultaneously. I guess to be succinct, every time I put this album on, I really have to resist simply forwarding to the good parts.Highlights for me include the opener, Ace of Wands, which features plenty of up-tempo playing and lots of guitar/keyboard interplay. There are also a bunch of different synth tones and guitar sounds, which have the effect of always keeping the song fresh and engaging. Hands of the Priestess (Parts I and II) is also a definite highlight of the album, with a wonderfully gorgeous flute melodies over delicate 12-string and floating mellotron. This combination does it for me every time, and Hackett is truly one of the masters of this format.Star of Sirius, Shadow of the Heirophant. Based on other reviews and the arrangements of these songs, I know that I SHOULD thoroughly enjoy them. But I don't. I suppose one obvious reason why is that the mellow parts of the songs are a bit too repetitive, but more importantly, the faster sections are too short and lose their impact--basically I always find myself wanting more. That being said, there is plenty to delight any progger with these tracks. Star of Sirius features excellent vocal harmonies, tasteful guitar from Hackett, nice keyboard and mellotron, and a nice (except perhaps the repetitive chorus) melody. Heirophant has some incredible moments as well, such as Hackett's tapping/solo section, and the finale. The problem is that the last six minutes of the song repeat the same chords, and simply add instruments (and volume). It seems to me Hackett overdid the dynamic contrast here.I have to say that this album seems overrated--I really wonder what rating it would receive if Hackett's name was not attached to it. There's a fair amount of unique and entertaining music, but it's couched in within an equal amount of boring material. Also, this is a tough album to relax to because of the volume contrasts--I CONSTANTLY have to adjust my volume to hear the delicate parts and not subsequently have my eardrums pierced by the louder segments. Solid album, but nothing exceedingly cohesive or groundbreaking. Bonus points for the album art."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Saturday, January 12, 2008",
      "rating": 5,
      "text": "This is a marvelous musical voyage released by Steve and his acolytes. Only Tony is missing on this one to get the whole of Genesis, while they were four.Back then, I was an orphan young boy of my most beloved band. Peter had left a few months earlier and when I heard that Steve was releasing a solo album, I rushed out to buy my copy of his work. And what an excellent surprise it was! It starts already with the great cover artwork and lasts till the last and wonderful song.The whole of this album was (and still is more than thirty years later) a real enchantment. It sounds of course fully as a Genesis album if you would except the crazy lyrics from Peter of course. It is also more instrumental (but this is more than logical).Several aspects of the band are depicted. Complex and intricate instrumental with Ace Of Wands, fully pastoral and very melodic Hands Of The Priestess (both parts). The most Crimsonesque track A Tower Struck Down is another instrumental winner. Heavy, repetitive and scary. Even if I don't listen to this piece very often, it doesn't spoil the whole. The first part really sounds as an end of the world track (till the Sieg Heil shouts are fading away). The least accessible number from Voyage Of The Acolyte.The Hermit is plunging into the Trespass-esque mood. Although I like very much the combination acoustic guitar and great keys, I can't say that the vocal part (from Steve) is on par. But this is only the start of his solo work, so I would rather be indulgent.One of the best song available is Star Of Sirius. You can't imagine a closer song from Wind & Wuthering than this one. Rhythm changes, great synthesizers and a really catchy (even poppy) chorus and tranquil verse part (in the style of One For The Vine). When you listen to this excellent piece of music featuring Phil on the lead vocals, there are no wonder that all the Genesis fans were just thrilled with this great album. Mike is just great in his bass play as well. A highlight of course.A short Horizons oriented acoustic guitar solo is opening the way for a great closing number : Shadow Of The Hierophant. If you happen to like sumptuous mellotron, this one is for you. Aerial vocals from Sally Oldfield, bombastic instrumental passages, clever guitar breaks. Another truly Genesis number and another highlight. The long, repetitive and crescendo fianle is a fantastic symphonic prog moment.This is by far the best album ever recorded by any Genesis member in a solo effort. The rating? Five stars of course! I have just ordered the remastered edition while listening again to this marvel, since I read that the two bonus tracks are really worth."
    },
    {
      "reviewer": "apps79",
      "date": "Posted Sunday, February 24, 2008",
      "rating": 5,
      "text": "STEVE HACKETT is among the most influential guitarists in the history of rock music.Born in London in 1950,he begun his musical journey in 1970 with ''Quiet World'' along with his brother Jon.A year later he joined GENESIS after the departure of original guitarist Anthony Phillips,with whom he spent 5 overcreative years.In 1975 Steve was announced the first GENESIS member to release a solo album,''Voyage of the acolyte''.A fantastic work of high quality,''Voyage of the acolyte'' actually moves GENESIS' sound a step further.Now,the familiar pastoral orchestral GENESIS-like arrangements (featuring strong use of flutes and mellotron) are mixed with some really progressive guitar work based on virtuosic changing tempos and climates.The album doesn't allow you to breathe,as at one moment the acoustic folkish sounds of Hackett's guitar relax you at the maximum,when suddenly the next track offers complicated musicianship with amazing interplays and fast tempos!Hackett is accompanied for this release by a number of great musicians like his brother Jon,GENESIS' fellows Rutherford and Collins,Sally Oldfield etc...Words are not enough to describe this absolute masterpiece of music,a lost GENESIS album by one of world's best musicians/song-writers.Certainly a must-have!"
    },
    {
      "reviewer": "progaardvark",
      "date": "Posted Friday, April 4, 2008",
      "rating": 4,
      "text": "In 1975, Steve Hackett became the first Genesis member to release a solo album. Although Anthony Phillips left Genesis in 1970, he did not release his first album until 1977, the same year Peter Gabriel released his debut solo album. Of course later on, Mike Rutherford, Tony Banks, and Phil Collins would all release solo albums. At the moment, I can't think of another band that had so many members release solo efforts, and in mostly large numbers.Hackett's debut, Voyage of the Acolyte sounded like a missing Genesis recording that never made it into the light of day. And maybe that's because Hackett had some of his Genesis friends help him out with this album, notably Mike Rutherford on bass and Phil Collins on drums. But it wasn't just that. Hackett also played the Mellotron and harmonium, adding lush background drops to these songs. Sure, it wasn't anything like having Tony Banks on board, but the effect was good enough to give it that Genesis feel.In addition to Rutherford and Collins, other musicians contributing include Steve's younger brother, John Hackett, who performs admirably on the flute and Arp synthesizer. Co-producer John Acock contributed more Mellotron, harmonium, piano, and the Elka Rhapsody, a string synthesizer. Robin Miller, who appeared on some King Crimson albums adds some oboe and English horn, and Nigel Warren-Green contributes some cello. So this is a little more than the usual Genesis affair.The music is mostly instrumental as only three of the songs contains vocals. Hackett sings on The Hermit, Collins sings on Star of Sirius, and guest vocalist, Sally Oldfield (sister of Mike Oldfield) sings on Shadow of the Hierophant. Some of the songs are quite complex (like the opener Ace of Wands), some are pastorally laid back, and the last track (Shadow of the Hierophant) is a lengthy piece deserving of placement on any of the mid-1970s Genesis releases.Hackett does a very impressive job on his debut as a songwriter. Genesis had a more democratic approach to writing music and this one really let Hackett open up. In fact, after this album Hackett often felt stifled by the Genesis approach and he often felt that he didn't have a fair share in contributing music. This led him to go solo in 1977. I don't fully understand why the other members of Genesis reacted this way towards Hackett's abilities, especially if they had listened to this album (and Collins and Rutherford played on it!!). I have no doubt that his contributions would have not only been fitting for the Genesis albums of that time, but certainly would have made them even better.Although Hackett did a great job on this album, this was all new to him. It shows on some of the material. The short pieces often sound unfinished and the cohesiveness of the album as a whole is often lacking. It seems like it jumps around a bit and it gives me a feeling of unevenness.An enjoyable listen that is highly recommended for Genesis and symphonic prog fans. Not quite a masterpiece, but surely an excellent release considering the circumstances. Four stars."
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Wednesday, May 21, 2008",
      "rating": 3,
      "text": "Steve Hackett�s first solo album, recorded and released while he was still in Genesis, is a mixed bag. It has some wonderful tunes and some that are less than that. At the time I thought it was a bit of a frustration. I was expecting more, specially considering the fine musicians involved. I still have the same feeling. It sounds like a Genesis record that is somewhat incomplete, without some of that magic touch all Genesis albums had so far.Most of the time my feelings were that the tunes were good, but not fully developed. Some more, some less. Even in the best songs (Ace of Hands, Star Of Sirius) I cannot help but thinking that something�s missing. Don�t get me wrong, the playing is great, the production is good and the overall sound is above average. I really love that guitar sound! The problem is really the songwriting and maybe some arrangements that could bring more life to the tracks (lack of time pehaps? After all, Genesis was still the priority).All in all, a good record, even though I expected more from such talented musicians. 3 stars."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Monday, September 15, 2008",
      "rating": 5,
      "text": "There is lots of mellotron, sadness and beauty throughout Steve Hackett's debut record. In other words... this is my kind of album ! His GENESIS mates help out here except for Banks and Gabriel(who just left that band). Steve's brother John is on board, and he will continue to help out his brother on future releases.\"Ace Of Wands\" is surprisingly in your face to open with guitar, bass and drums leading the way. I like the synths that follow before they hit us again. Gentle guitar follows with mellotron before another outburst. Synths and bells before 2 1/2 minutes as themes continue to be repeated. It changes completely 3 1/2 minutes in. Where did that come from ? Guitar and mellotron are so good. \"Hands Of The Priestess Part !\" is a pastoral track with gently played guitar, flute and mellotron leading the way. \"A Tower Struck Down\" is a fairly heavy pulsating piece of music. Percy Jones helps out with some extra bass on this one. Synths come at 3 minutes followed by samples of a Hitler rally. The mellotron before 4 minutes is so majestic, the best on the album. \"Hands Of The Priestess Part II\" features flute, mellotron and some intricate guitar.\"The Hermit\" is the first song with vocals. Steve sings on this one as he plays acoustic guitar. Cello a minute in with flute to follow. Aboe 3 1/2 minutes in. I like this melancholic tune a lot. This song and \"The Lovers\" are the only two tracks without mellotron. \"Star Of Sirius\" is another vocal track with Phil Collins at the helm. More gentle guitar as aboe then vocals come in. Mellotron rolls in. Synths as well. Very pastoral until the song kicks into gear 2 1/2 minutes in. What a great section ! Aboe 4 minutes in with mellotron as guitar and synths follow. Very GENESIS-like here. It kicks back in around 5 minutes right to the end. \"The Lovers\" features more acoustic guitar to open until synths take over half way through. \"Shadow Of The Hierophant\" is such a gorgeous song that contrasts those uplifting sweeping mellotron sections with the higher pitched vocals of Sally Oldfield. Her voice is so moving. We get some vibes from Collins after 6 minutes which signals a change for the rest of the song. It almost becomes dead quiet, then builds with mellotron, drums, synths and more right to the end.In my opinion this is the best solo effort by a GENESIS member, although \"The Geese And The Ghost\" by Anthony Phillips is pretty darn close."
    },
    {
      "reviewer": "The T",
      "date": "Posted Tuesday, September 30, 2008",
      "rating": 5,
      "text": "For some people, GENESIS really disappeared the moment that Steve Hackett left the band. In a way, it is true. Onlypartially. What died with Hackett's departure wassymphonic-GENESIS, and the band still had a few good albums up their sleeves (especially the trio's first). But something good came out of all of that. Finally, the guitar-master was able to explore his art freely, to create whatever he wanted. And the results were truly magnificent. Curiously, one of Hackett's best (if notbest) albums was recordedbeforehe left GENESIS, his first masterpiece, the superb \"Voyage of the Acolyte\"We have an album made of 8 tracks, all of at least better-than-good quality. As always with Hackett, we have a big array of styles and influences, even though it's safe to say that he still owes a little bit of his sound to his(then)-main band. It's no secret also that probably this record's best tracks are, in my view, those two which feature GENESIS members alongside Hackett. So, hearing the style (still much more prog-rock-oriented and less world-music) and having in mind the collaboration of Collins and Rutherford, both factors would clearly affirm that the guitarist's own project was still not 100% his own. That, of course, is a totally invalid conclusion, and I'd say it's the other way around.For what we have here is 100% Steve Hackett, exactly because abig part of GENESIS' beautiful music was due to Hackett's wonderful playing. If one ever wonders what was lost in the band's music after \"Wind and Wuthering\" (I would say after \"And then there were three\", an album were the trio still managed to pull a prog masterpiece), it was theatmosphericstyle, that sound that evoked somethingbeyondthe music. What GENESIS lacked from \"Duke\" onwards was, simply put,magic, the kind of magic that their guitarist was able to provide in enormous, immeasurable quantities (and, mostly, quality).Steve Hackett has never been a guitarist that tries to show off his skills. We will rarely hear him dazzling us with his speed or his mind-defying fingering. His technique is superb, even admired by classical music fans, but it's not in his fingersbut in his mind, in his imaginationwhere we will find the true high art. He manages to make the guitar sound like a keyboard, manages to make it cry, to make it laugh, toexpress things that can't be explained in words.De-wording music is actually makingpuremusic, and Hackett achieves this constantly. He invented (or perfected, actually) techniques later falsely attributed to others, he played music thought impossible for rock musicians, but that's not what his art is about. His art is aboutsounds, aboutcreating a canvas where his guitar's notes are the brushes and the colors at the same time.His art is aboutsongwriting, for if there's any doubt that Hackett can craft a good track, it only takes a few listens to any of his albums to erase it.Ace of Wands (8.5/10) The most energetic of the lot, is also probably the less atmospheric but at the same time the more virtuosic. But even in the midst of the convulsion the artist creates magic in a middle section that ascends to the stars. Excellent opener.Hands of the Priestess - Part I (9.5/10) A beautiful opening reveals a flute that tries to bewitch us like that one that legend found in Hamelin. We will dearly follow its trail. Pure beauty. This is what prog music is all about. Short but memorable.A tower Struck Down (8/10) A very haunting, menacing opening sends shivers down our spines. Terror lurks in the dark it would seem. Peace eludes us as the second section fills us with even more doubts and uncertainty. The scene has flames, little figures dancing around it, mental-illness, eyes like tornadoes. Very good track.Hand of the Priestess - Part II (9/10) The amazing melody of Part I returns but this time it sounds more pastoral, with an oboe singing the tune in a joyous celebration of nature and prog-rock. Even shorter, but still outstanding.The Hermit (9/10) The beginning is very sad, with vocals appearing for the first time, buried under three feet of reverb, coming from a distant place. It's Hackett, who never was a singer but always was (and is) an artist who knows where and how to use his voice. The flute appears again, with a little melancholic melody. The end of the track is pure instrumental bliss. Excellent.Star of Sirius (9.5/10) My love for GENESIS shines through when, at the mere appearance of Phil Collins' voice, I smile. Of course, the majestic music underneath it is what really captures my emotions. Everything is pensive, atmospheric, surreal; a figure in keys appears which announces the arrival of the fast section, full of the same glorious relaxed-energy that only GENESIS or its guitarist could create. We get a repetition of both sections, and we long for more minutes when the track's 7 are finally over. Superb.The Lovers (8/10) A quick interlude in acoustic guitar, this is very soft and acts as the perfect introduction for the magic that is about to unfold.Shadow of the Hierophant (10/10) Mike Rutherford collaborates with Hackett in this track, and one can't deny the importance of his input. But in the end, it's the music that absolutely overwhelms us. When the female voice rises over the acoustic arpeggio, it's like an angel singing to us tales that we can't yet grasp because we've never been told to truly understand beauty. The tragic melody that strikes when the bass and drums come back feels like a dagger in our weakened hearts. The celestial creature sings again, but then we're brought back to our senses immediately before we can get lost in so much light. She appears once again, but for the third time she's stricken off the canvas. Suddenly Hackett starts playing around with his instrument, he taps the strings creating a whirlwind that ascends to a much brighter place. The music is happier now. Percussive vibes start announcing the arrival of the final part of the epic. First we get it at very low intensity. It grows until it explodes tenderly in our ears. And a superb song has ended, one of the best in all rock. The album fades.There are no weak tracks and no boring moments. Maybe a couple songs could've been evenbetter, but rarely do we get albums like that. This is a towering masterpiece that grows with me every time I hear it, like the legend that created it, arguably the greatest guitarist in all progressive-rock, and for my taste, in all that is rock."
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Friday, October 3, 2008",
      "rating": 3,
      "text": "The solo voyage beginsSteve Hackett is one of my all time favourite guitarists and possibly my favourite solo recording artist. Yet, I cannot rate most of his solo studio albums higher than three stars. His solo debut, Voyage Of An Acolyte suffers from the same problems as many other Steve Hackett solo albums.The first half or so of the album is entirely instrumental. The Jazz-Rock/Fusion of Ace Of Wands and the mellow, acoustic folk of Hands Of The Priestess (parts 1 & 2) as well as the dark, heavy A Tower Struck Down are all excellent, but still not quite masterpiece standard. These four opening tracks give the impression that the whole album is an instrumental affair (as it probablyshouldhave been!). But this is not so, however. The Hermit is the first vocal track; a soft, mellow song, sung by Steve himself, that leaves no lasting impression on me. I think that Steve's singing voice would develop and mature very much over the years and become much better in the 80's and 90's.Star Of Sirius features vocals by Phil Collins and is a decent song. However, it sounds more like a Genesisleftoverthan a 'lost Genesis classic' to my ears. On albums like Trick Of The Tale or Wind And Wuthering it would easily have been theleastgood track by far. And thank goodness that Steve stayed in Genesis for another couple of albums before he went solo for real. Voyage Of An Acolyte proves that he wasn't ready for a real solo career just yet.The closing number Shadow Of A Hierophant has vocals by Sally Oldfield. She has a beautiful voice, but it is completely out of place on this album. Besides, having different vocalists on different tracks on the same album almost never works. And that is something that brings a lot of Hackett solo albums down. The closing section of this last track is way too long and seems to be going absolutely nowhere.Overall, apart from Ace Of Wands and a Tower Struck Down, Voyage Of An Acolyte is a very soft and mellow album. It really would have benefited from a couple of rock songs like Every Day from the Spectral Mornings album or Camino Royal from Highly Strung or Mechanical Bride from To Watch The Storms.Sorry Steve, but this album is simply not the masterpiece some people say it is! There certainly are a few real gems on this album, but as a whole this is hardly excellent. If you are new to Steve Hackett's solo discography, I would recommend starting with a later album (but please don't touch his next one, Please Don't Touch!), or even better, one of his excellent, recent live DVDs where he blends highlights from his entire solo career (including a couple of pieces from the present album, often in improved form!) with some Genesis material.Good, but Steve would do much better later on"
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Thursday, October 9, 2008",
      "rating": 3,
      "text": "Voyage Of The Acolyte is the debut solo album from Genesis guitarist Steve Hackett. It�s no secret that Steve Hackett is one of my big heroes and sources of inspiration when it comes to guitar playing. His innovative approach to the use of a guitar is praised by many and his contributions to Genesis sound is invaluable.Voyage of the Acolyte was recorded while Steve Hackett was still a member of Genesis in the turbulent time after Peter Gabriel had left the band and Genesis was in search for a new singer. This meant that the members had time to concentrate on other projects for a while and Steve Hackett decided it was time for a solo album. He is helped by his brother John Hackett on flute, Arp synthetizer and bells and his Genesis collegues Mike Rutherford on bass guitar, bass pedals and Fuzz 12-String and Phil Collins on drums, vibes, percussion and vocals. There are also contributions from John Acock, Sally Oldfield, Robin Miller, Nigel Warren-Green, Percy Jones, Johnny Gustafson, Steve Tobin. Steve Hackett plays electric & acoustic guitar, Mellotron, harmonium, bells, autoharp, effects and sings lead on the song The Hermit.Voyage Of The Acolyte turned out to be a big succes both among fans and critics and as a consequence Steve Hackett�s desire for a solo career and full control over his music grew to a point where he couldn�t see himself as part of a band anymore. He stayed with Genesis for two more albums ( A Trick of the Tail and Wind & Wuthering) but then decided to leave.The music on Voyage Of The Acolyte is very dynamic progressive rock. There are loud symphonic parts with lots of mellotron and Steve Hackett�s signature electric guitar leads and soft parts with flute and acoustic guitar. Besides that there are also a few fusion elements on the album.Ace Of Wands starts the album in melodic fusion mode. It�s a rather challenging song but very memorable and melodic. Hands of the Priestess Part I is a beautiful soft song with flute from John Hackett. A Tower Struck Down which is my favorite here is probably the most experimental song. It�s in fusion territory with some extraordinaire bassplaying. Hands of the Priestess Part II is just a short interlude before the calm The Hermit where we hear vocals for the first time on the album. Steve Hackett sings lead on that song. Star of Sirius has Phil Collins on lead vocals. The Lovers is just a short beautiful song before the Epic Shadow of the Hierophant where Sally Oldfield sings lead. It�s a 11:44 minute long symphonic song with both calm parts and bombastic symphonic ditto.The musicianship is great and the production is good.Many reviewers have written praising reviews of this one but I must admit that even though I do enjoy Voyage Of The Acolyte I don�t think it�s a very cohesive album and the full picture suffers because of this IMO. This is good music but I fail to see it being excellent and therefore I will only rate this 3 big stars. Genesis fans will have an interest here, but like me ( and I�m a giant Genesis fan) it�s not certain that they will be more than partially satisfied with Voyage Of The Acolyte."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Sunday, November 16, 2008",
      "rating": 4,
      "text": "Like much of his work, the first Steve Hackett solo release had to grow on me. I was not immediately delighted with what I heard, but after some time, the album gained life and a more frequent place in my player. Having heard it multiple times, I can do nothing less than rate it higher than I initially expected I would. Fans of early Camel should appreciate this much, as the varying textures of sound are pleasing to the ear. Give this album time- it sits loftily among Hackett's best.\"Ace of Wands\" \"Ace of Wands\" kicks off with a frantic guitar introduction that reminds me of what The Mars Volta would be doing three decades later. Insanely creative guitar work dominates this piece, but aside from the dual lead work, there are patches of tasteful synthesizer, acoustic guitar, bells, and more, all laid over a cool bass line. The sudden whistle is a really silly transition, but other than that this is a solid instrumental, full of energy. It is a great way to begin the album.\"Hands of the Priestess, Part 1\" This sorrowful instrumental centers around acoustic guitar and flute, with a mournful electric guitar creeping in now and then. The Mellotron adds an extra layer.\"A Tower Struck Down\" The rhythmic structure is similar in feel to the \"Apocalypse in 9/8\" section of \"Supper's Ready\" by Genesis. This piece could have fit right in with the darker moments of The Lamb Lies Down On Broadway; bits of it sounds like it came right out of \"The Colony of Slippermen.\" The last minute of the song begins with a breathtaking Mellotron that segues into the final moments, which are rather bland, but not awful..\"Hands of the Priestess, Part 2\" Another beautiful track, this one is under two minutes, and features acoustic guitar, flute, and oboe, among other instruments that add to the layer of pleasing sound.\"The Hermit\" Like a lonely a hermit, Steve Hackett's despairing voice is only accompanied by his twelve-string guitar. He sounds as though he's performing his lonesome song in the deep recesses of a cave, and you, a mere passerby, are hearing it from within. Sharing in his woe, and curious, you seek him out and join him on cello. Another person comes in with a flute. And so forth. The piece is simple and initially forgettable, but once you've heard it a second time, the song reaches into the alcoves of your mind and it all comes back to you. The long ending is lovely, as though the hermit has finally found friends.\"Star of Sirius\" This is the crowning moment of the album, one with beautiful twelve-string guitar and synthesizer. Phil Collins does a fine job singing on this one, and the vocal harmonies are not to be missed. The warbling synthesizer over the twelve-string guitar has become a staple sound by now. The middle section sounds like it came right out of a glorious classical piece. The chorus is exciting and amusing. The vocal melody is one of the most original and pleasing melodies I have ever heard.\"The Lovers\" Quiet classical guitar, reversed electric guitar, winds, and other soft instruments make up this one-and-a-half-minute instrumental piece.\"Shadow of Hierophant\" The previous piece only serves as a short introduction before a massive wall of Mellotron, electric guitar, and drums come crashing through. The female voice almost makes one forget he is listening to progressive rock, but opera instead. Once again, the Mellotron weighs heavily in this piece, as does Hackett's acoustic guitar work. Halfway, he institutes a great amount of tapping on an electric guitar laden with effects. Also once again, one may hear this as a piece that Peter Gabriel-led Genesis could have concocted, so it really shows Steve Hackett's contributions in his former band, It showcases him more, though, which is perhaps why similar songs were not included in Genesis records. It's a brilliant work, all said."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Thursday, November 20, 2008",
      "rating": 4,
      "text": "Quite the voyageSteve Hackett's debut is very much likely to soothe anyone who has ever been a fan ofGenesis. LikeChris Squire's sole solo album,Fish Out Of Waterwas called ''The lostYesalbum'', this one quickly falls under the same comparison for the other progressive giants for the 70s. As many people know, Hackett was a somewhat outspoken force in the band and it only became apparent just how much Hackett brought to the table for the band when he leftAnd Then There Were Three, some might say. Hackett'sGenesisbuddies just about all show up with the exception of Peter Banks and Peter Gabriel, and while the album definitely does not sound like aGenesisalbum in its purest form, it certainly has some moments where it comes close. The nice and most surprising thing about the album is just how much energy this album has. Many people may have a problem withGenesisand their lack of 'rocking' moments, but on this album no such thing can be said, even if the serene moments do exist on the album.The best parts of the album are the ones where Steve really wants to show some flash as a guitar player. The album opens with what's likely the best of these purely ambitious prog rock tracks in the form ofAce Of Wands, which is surprisingly fast, energetic and with enough pure rock power to put a lot of other bands to shame. Like many songs on the album, this one is an instrumental and like most other songs on the album it has a wonderful melody that is bound to get stuck in your head. These melodies are reprised later on in the album, revealing its true nature as a concept album.A Tower Struck Downis not as hard rocking or as fast as the opening tune, but it certainly makes for a great story telling device with the sampled sounds and chantings which make it truly malevolent. This song is bookended by the two-part, brief but calm instrumentalHands Of The Priestesswhose mood makes for a surprising contrast to the other songs on the album.Of course, Steve's compositional prowess also shows through on the album.Star Of Siriusis likely the best example of this, and arguably the best song on the album. Phil Collins makes an appearance on this track on the microphone, but he does so in his dreamyTrick Of The Tailvoice, which when mixed with Steve's soundscapes makes for a crazy-good track ripe with melody, symphonic bombast and familiarity thanks to the reprisal ofAce Of Wands. Other songs which follow this kind of structure are also on the album, but both of them are a lot more toned down.The Hermitends off side one impressively, and on side twoThe Loversis voiced gently by Sally Oldfield and makes for a very tranquil track. The album ends with the storm-gatheringShadow Of The Hierophant, a somewhat repetitive song which is simply a build to its peak and then a decline into silence signaling the end of the album. Used more for mood than anything else.In the end Steve Hackett has created an emotional and technically impressive ride which will thrill fans of his other projects and interest just about everyone else. This album is considered a symphonic classic for a reason, and while not essential is certainly deserving of a strong 4 stars of sirius out of 5. Very much recommended."
    },
    {
      "reviewer": "progrules",
      "date": "Posted Tuesday, January 27, 2009",
      "rating": 3,
      "text": "Several years back I checked out most of the songs on this album and I remember mainly one thing out of that experience: I couldn't understand why almost everybody is so enthusiastic about this debut by Hackett. Ok, the whole thing isn't really bad or poor but it's really somewhat pale compared to the first 8 albums by Genesis. And that's what's bugging me really. You would expect if someone like Hackett leaves the band due to difference of (artistic) opinion , he would at leasr come up with something truly great. But that's not quite the case I feel.The opener Ace of Wands is one of the better songs and gives at least some hope. I would give this one 3,75 stars probably. Next Hands of the Priestess pt.1 stars with beautiful flute but I'm underwhelmed with Hacketts guitar performance (3,5). A Tower Struck Down sounds like a flat copy of Crimsons Red to me. Nothing impressive about this track, maybe the funny keysounds are nice but that's all (2,75). Second (short) part of the Hands of the Priestess is too short actually to have substantial impact and significance. Just ok (3*). The Hermit is a nice ballad but again it fails to impress me in any way. Hacketts vocal performance tells enough in this respect. Oboe and flute towards the end save the song somewhat (3,25*). Star of Sirius starts in the same vein but mainly (again) the vocal contribution destroys the fun for me. I do like the keys and they prevent me from really hating this song. All in all just not good enough for a high rating despite some nice melodic moments (3,5*). The Lovers is the second very short track starting with acoustic guitar later accompanied by mellotron. Ok but again: no more (3*). The closer Shadow of the Hierophant is the supposed highlight but is actually the biggest disappointment to me. The female vocals are not my cup of tea, maybe enchanting in a way like a sort of siren but somehow it puts me off a bit. What bothers me most is te eslow style of the song, it just drags on, there is no energy or captivating element as far as I'm concerned. If I compare this song to Cinema Show or Firth of Fifth for example this is simply a weak effort I have to say. Last 5 minutes make things even worse for me and I can only give some 2,5* at best I'm afraid.So that leaves an average of just above 3 stars and therefore I can only give this rating for Steve Hacketts debut. There are hardly any moments where he proves he's a great guitarist or songwriter. I'm in severe doubt if I will check out more of his material since this is the only album I own by him. Not recommended."
    },
    {
      "reviewer": "ghost_of_morphy",
      "date": "Posted Friday, June 19, 2009",
      "rating": 3,
      "text": "This is a classic prog album, well beloved of fans of Hackett and those who came to his solo work through Genesis. Yes, it launched a great solo career. Yes, it is a welcome breath of fresh air. But no, it isn't Steve's seminal album. Neither is it the mythical \"Lost Genesis Album.\" It's a good debut that promises much better in the future. Three stars (alhough it is only with a great effort of restraint that I can resist awarding 4..)Anyhow, track by track.Ace of Wands is a frenetic but unimaginative introduction into Steve's worlds of guitar composition and virtuosity. It's ok, but if this were all he had to offer, this would be a forgettable album, just as this is a forgettable track.Hands of the Priestess pt. 1 shows us what is in store for us lucky fans. Steve's brother John is an accomplished flautist, and tracks like this one and it's reprise prepare us for some of the truly great things that they will accomplish later.A Tower Struck Down is track that I find most interesting. This one lands firmly in progdom, but not in Genesis style progdom. Steve reaches out on his own and finds a most interesting mix of unusual time signature, weird sounds and effects, and nice composition. This foreshadows that we will hear later on Spectral Mornings in Clocks and Tigermoth.Hands of the Priestess pt. 2 has the virtues of the first part.The Hermit is an interesting and well-composed song. No more, no less. Nothing stellar here, and certainly nothing that raises the quality of the album.Star of Sirius is a song that is so hard to evaluate. One of the difficulties is Phil's vocals. Phil is still in his earliest vocal mode. This is before his aping of PG and belongs to the period when he was thought of as the angelic voice backing Mr. Gabriel. But here he is featured. I find that this style fits the song, but I also find it mildly annoying. Another difficulty is that this song is basically simplistic, except for the tempo changes. Brother John (an unintentional Lamb reference, I promise you) shows up in an interesting way on instruments other than the flute. Sharp tempo changes add a lot of interest, as does Hackett's bright and interesting performances. I like this track, but I sure can see where some people would be far less enthusiastic about it.The Lovers is mellow guitar for the first part and then mellow synth and guitar for the rest of it. It's a short and pleasing track, but hardly exceptional.Shadow of the Hierophant is obviously intended as the piece de resistance. It falls short. If there is one track on this album that reminds me of Genesis, this is it,, but it sure doesn't remind me of Genesis at their best. Still this does fit into the post-Gabriel style,. Sally Oldfield is an interesting choice of vocalist, and brother John is enthusiastically present once again. It's mediocre.Anyhow, what we are left with here is an album where about half of the time listening is mediocre and the other half foreshadows things much better. I suppose that if one considered what this album meant to prog in a historical sense, one could bump this up to four stars. But I'm giving it three."
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Monday, June 22, 2009",
      "rating": 4,
      "text": "The Missing Piece of GenesisSteve Hackett's Voyage of the Acolyte has often been called the missing Genesis album, and there are clear reasons why. Hackett's guitar had figured prominently in many of the band's best loved songs by some fans (including me). \"Return of Giant Hogweed,\" \"Dancing with the Moonlit Knight,\" and \"Firth of Fifth\" rely heavily on Hackett's carefully composed but also explosive lead guitar skills, and remain among the best tracks of the classic era. 1974's Lamb Lays Down on Broadway focused much more heavily on the storyline and vocals, and of all the musicians left in the shadows of that theatrical monster, Hackett probably suffered the most.During the time that Genesis was searching for singers, Hackett wrote and eventually released Voyage of the Acolyte. The album has some amazing music, sounds that both the Lamb and W&W onward could have used in greater quantity. At the same time, the compositions are not nearly as complex or mature as Genesis of that era. One wonders what heights could have been if the 4 could have successfully integrated Hackett. But it was not to be.Voyage of the Acolyte is the closest approximation, as this album features Phil Collins on drums throughout, and vocals on one track. In addition, Mike Rutherford adds bass on a few tracks, including some fuzz bass, something outside his usual tone. Critically though, Steve's brother John takes the keys, which while adding the perfect tonality and atmosphere, provides none of the virtuosic creativity Tony Banks gave to Genesis. John Hackett did, however, add some magnificent flute parts that matched anything on a Genesis album.Voyage's opening track, \"Ace of Wands,\" is a great example of what is good and bad about the album. Each composed section is superb, but the way in which they are arranged is simply poor. Sections return without development or variation and one transition uses an embarrassing explosion that sounds like a 1975 TV movie. Still, the sections are so good on their own merit, that I find myself returning to the album often.All of the flavors one loves in classic prog are here: complex multi-layered parts, flute interludes, mellotron, pastoral sections punctuated with aggressive rock. As such, this album superficially sounds amazing. Aside from a few bumps (the pop of the chorus of \"Star of Sirius\") the music is beautiful prog. The multipart \"Hands of the Priestess / Tower Struck Down\" is indeed prog at its best. Unfortunately, the epic \"Shadow of the Heirophant\" though beautiful, is actually one of the weaker songs on the album. Already overlong, the extended version provided as a bonus is simply pointless. (Of historic interest is the fact that \"Heirophant\" contains a tapping cadenza eerily like Eddie Van Halen's \"Eruption\" but predating it by 3 years on record. Steve Hackett's role in the expansion of the guitar technique is criminally underappreciated.)Though it has its weaknesses, this is a great album that belongs in most prog libraries. It's not Genesis, but close enough to satisfy any fan's need for more from that phenomenal group. Pick it up and enjoy!"
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Friday, October 16, 2009",
      "rating": 4,
      "text": "Hackett's first solo album is an astounding piece of music and shows ample proof of the major role he must have played within Genesis. Ace of Wands is an excellent upbeat instrumental composition with great riffs and more things going on then on other artist's full albums. Play the opening 30 seconds a bit heavier and you're inside an Opeth album. But after 2 minutes of balancing soft acoustic parts against heavy guitars, it goes in all sorts of direction. Folky, classic, moogy, funky, Genesisy. Everything passes on the catwalk and believe me, it works just fine.Next on is Hands of the Priestess. I don't know what priestess Hackett was thinking of, but given the soft porn leanings of this tune, it's not difficult imagining some of those priestesses and their hands. Yes a dirty mind is a joy forever :-)A Tower Stuck Down is entirely different matter. Dark, heavy, threatening, brooding, extravagant, stubborn. No way this could have ended up on any Genesis album. The last half minute of it has some slow picking that reminds me strangely enough of both the ending chords of Rush's Cygnus X1 and the intro for A Forest by The Cure. Or how very different styles of music sometimes come up with almost the exact same thing.The Hermit is another gentle piece. I like Hackett's voice here. Reminds me of that same subdued passion of Andy Latimer. After a reprise of the Priestesses, Phil Collins comes in to spoil the album with a bland performance on Star of Sirius. In the times of vinyl, I used to turn the record and place the needle right after this track to conclude the album with the stunning Hierophant.Majestic opening bars (that he must have stolen from Opeth again) lead into a nice folksy ditty sung by a woman who reminded me of the siren on Mike Oldfield albums. Hey look, she's named Sally Oldfield. We get 4 and a half minutes of superb sweeping guitars and mellotons, balanced against the acoustic parts. It flows into a moody guitar solo and ends with a 6 minute crescendo that blasts away Ravel's Bolero off the face of the planet. This is the one of the most stunning 6 minutes in rock music for me. It's subtle and colourful yet at the same time immensily dark and heavy. Majestic.Even disregarding Phil's annoying disruption, this is a true prog masterpiece. 4.5 stars"
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Monday, December 7, 2009",
      "rating": 4,
      "text": "Steve Hackett's debut album is also incidentally his first masterpiece!Although I consider myself a huge Genesis-fanboy this album actually works better for me than bothTrick Of The TailandWind & Wutheringbecause it has more of an even flow with some magnificent tops and no bottoms! In fact, I'll go as far as to say that this album's material is better than anything that Steve could have written if stayed on in Genesis.Voyage Of The Acolyteactually sounds more like the Gabriel-era albums than the once that Genesis was producing at the time. I think that it has a lot to do with John Hackett and his flute playing that always worked magnificently well with Steve's guitar. The best example of that isHands Of The Priestess Part Iwhere the two create a superb atmosphere with so little, plus the melody is just brilliant.Still, it'sShadow Of The Hierophantthat completely steals the show. It's probably my favorite song from all of Hackett's solo-carrier and an excellent album closer.***** star songs: Hands Of The Priestess Part I (3:28) Shadow Of The Hierophant (11:44)**** star songs: Ace Of Wands (5:23) A Tower Struck Down (4:53) Hands Of The Priestess Part II (1:31) The Hermit (4:49) Star Of Sirius (7:08) The Lovers (1:50)Total Rating: 4,37"
    },
    {
      "reviewer": "friso",
      "date": "Posted Sunday, January 3, 2010",
      "rating": 3,
      "text": "The debut album of Steve Hackett sees him fully attached to the early Genesis tradition of progressive rock - albeit with less song-writing and more instrumental parts. Sally Oldfield sings on two classical music influenced songs and Phil Collins sings on the more typical symphonic prog suite 'Star Of Sirius'. To me none of these compositions sound quite finished or particularly well performed; often resulting in summations of ideas - rather than well though out structures. An example; the last track 'Shadow Of The Hierophant' has a great ending theme that ends up wasted by a lack of context or function. The sound of the record is fine and I guess most fans of Genesis and symphonic prog will still enjoy this record, but I didn't feel at all bothered not owning it anymore."
    },
    {
      "reviewer": "Atavachron",
      "date": "Posted Sunday, May 30, 2010",
      "rating": 4,
      "text": "Some musicians see things as they are and ask 'Why?' Steve Hackett sees things as they could be, and asks 'Why not?'He's always had this approach. For Hackett, it's rarely about what he should be doing but what hecouldbe doing. Not what was expected of him, but what he might get away with considering the liberal musical era and the opportunities afforded him through the success of Genesis. After all, 1975 was an enlightening year for him and many others in the professional rock community (both Eric Clapton and Jimmy Page among others were in the midst of serious drug withdrawl, Clapton chronicling this period on his461 Ocean Boulevard) and somehow through the haze of smack-tinctured eyes and coke-eaten septums, astonishing music was being made. By almost everyone.For Genesis, a British institution, major changes were occurring. Peter Gabriel left to pursue his own directions and the band tightened-up musically, going on to release at least four more excellent LPs (two with Hackett who himself would leave in '77 after the greatWind & Wuthering). It makes the timing of this, Steve Hackett's first self-led effort, both right and unexpected in that it was made before this master axeman left the band. Some will point to similarities with Genesis' music here, of which there certainly are several, and perhaps at the time that worked against the record. But in today's context it works just fine if you've a taste for progressive rock at the very height of its whole maddening marvelousness. Plus we get to hear what makes a really good solo project so compelling, so full of new liberties and ideas previously undiscovered, unneeded or discouraged. The value of the singular vision in contrast to the equally valuable group effort, and why one member of a band is so significant to how that unit sounds and operates. And it's among Hackett's very best work.Of course he got some very good help. Phil Collins' shamelessly confident skins bop open 'Aces of Wands', totally prog, packed with sheet-pressed layers of Hackett's rounded lines, mellotrons, what sounds like an Arp synth on sci-fi lead, and trooper Mike Rutherford taking no prisoners on bass. The 12-string acoustic is out for romantic part 1 of 'Hands of the Priestess', bucolic and gentle, a good balance to the opener, and Wettonesque pounder 'A Tower Struck Down' with its extra bass parts and unsettling rhythmic lurches continues the constant redirection. A nice attempt at neoclassical in 'The Hermit' reminding of the Selling England days, tarnished slightly by our host's medium singing but kept aloft by his subtle arrangement, extending into sister piece 'Star of Sirius' with a welcome Collins on voice for a lively number peppered by Hackett's laserbeam fills. Another well-placed acoustic interlude before twelve minute closer 'Shadow of the Hierophant' spotlighting Sally Oldfield's heady soprano, ominous battlements from the band, and Steve Hackett's massive mountains.Not comparable to his following releases, this will be a grower for some and an instant love for others. A remaster would be even better. Nice one, Steve."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Monday, November 29, 2010",
      "rating": 4,
      "text": "An awesome album coming at a time of uncertainty for the GENESIS crew, Voyage of the Acolyte contains some strikingly sensitive and beautiful guitar-based atmospherics not unlike that of ANTHONY PHILLIPS on his soon-to-arrive Geese and the Ghost (also with important contributions from MICHAEL RUTHERFORD and PHIL COLLINS). (I find it interesting that neither of these two gems contains any help from keyboardist Tony Banks.) While there is a cohesive flow and consistency to this album--feel and mood---there is something a little muddy in the recording/engineering that always left me feeling a bit frustrated--I wanted to hear the distinctive contributions of all the instruments but they always felt a bit too quiet or muddled. Also some of the sections--as beautiful as they are--are either repeated too formulaically or go on a bit too long. I liked the album a lot back in the day--played it quite a bit--and still play \"Star of Sirius\" and \"Shadow of the Heirophant\" from time to time. It's just recorded too quietly (for some instruments). IMO, Steve's best solo work of the 70s-80s is on his third album, Spectral Mornings."
    },
    {
      "reviewer": "kenethlevine",
      "date": "Posted Wednesday, December 1, 2010",
      "rating": 3,
      "text": "On the local FM station back in 1975, perhaps 1976, they announced that they would be playing the solo album by the guitarist for GENESIS. My reaction as a naive 16 year old was, \"What, Genesis has a guitarist?\" The instrumental aspects of the group's sound were so dominated by Tony Banks that even some of Hackett's delicate work could have been accidentally construed as keyed rather than fretted. But, no matter, yes indeed Genesis had a guitarist, a fine one at that, but a composer and songwriter he was not, especially in 1975.As if to accentuate his strengths and shortcomings simultaneously, \"Ace of Wands\" busts out of the gate like a bull in heat. It is shortly tamed, but the major impression of incompleteness is thus established early and reinforced throughout. It's ALL enjoyable enough, whether delicate (\"Hands of the Priestess\") or harder edged (\"Tower Struck Down\") but none of it outstanding. The best of the lot is \"Star of Sirius\", which suggests future tracks like \"Entangled\", but lacking that piece's cohesion. \"Shadow of the Hierophant\" is an even better/worse example - the mellotron theme is simplistically lovely and hypnotic, but how many times do we need to hear it? Worse, even SALLY OLDFIELD cannot impart much distinction to the vocal parts in between. While I enjoy it well enough,, it is neither valid as a song nor as an epic, a sonic Amazon hand in hand with a compositional dwarf. Already twice as long as it has any right to be, the bonus material includes an extended playout version! Nuff said.\"Voyage of the Acolyte\" was released at a time when the members of GENESIS were still nurturing each others' powers while holding weaknesses in check. Hackett was still writing and producing better material within the tightening shackles of the band. Nostalgia aside, modern bands like HOSTSONATEN and ERIS PLUVIA improved upon the pastoral images herein, while Hackett himself refined his writing, composing and even vocal skills over his lengthy voyage. Nonetheless, this is a good effort from a man deserving of his many acolytes and accolades."
    },
    {
      "reviewer": "colorofmoney91",
      "date": "Posted Monday, April 11, 2011",
      "rating": 3,
      "text": "I'm a huge admirer of Steve Hackett's guitar playing, both solo and within the context of Genesis. I'm not really a huge fan of Genesis as a whole, though, or symphonic progressive rock in general, but Hackett is always a worthy listen.The music here is very, very above par symphonic progressive rock based around the guitar. Besides early Yes, this is the best symphonic progressive rock album I've ever listened to. The variation here is terrific, and ranges extremely. It's all beautiful, powerful, and well written and strongly accentuated by the synthesized symphonic sounds. I'm confident that any fans of symphonic prog would find this interesting as well as any guitar aficionados."
    },
    {
      "reviewer": "Tapfret",
      "date": "Posted Sunday, May 8, 2011",
      "rating": 5,
      "text": "The \"Missing\" Genesis AlbumSub-genre: Symphonic Progressive Rock (Holds true to form)For Fans of: Genesis, Bands that bridge the gap between Symphonic Progressive and New AgeVocal Style: Clean male mid-range to operatic femaleGuitar Style: Very lightly distorted rock sound to warm vintage classical guitar.Keyboard Style: Everything from Mellotron to Moog/ARP shaped synth to natural piano sounds.Percussion Style: Standard rock set.Bass Style: Standard rock.Other Instruments: Bells, Harps, Cello, FluteYou are not likely to enjoy this album if: You have an aversion to medieval, renaissance and sylvan themes.Summary: This reviewer is not much of a historian when it comes to the split up of Genesis. It is my understanding the music inVoyage of the Acolytewas written as material for Genesis. That being said, it is hard to find a way this music would have fit in the Genesis library. At times, especially when you hear the vocals of Phil Collins, or the very familiar rock guitar work of Hackett himself, the pieces seem to fit together. But the overriding fantasy theme was a split from the direction that Genesis itself was going. Additionally,Voyage of the Acolytestands out from Hackett's subsequent work; where his next few albums tend to be more piecemeal work,Voyage of the Acolyteholds together cohesively as a single concept. As a matter of fact, it sticks out as one of the most important concept albums in Symphonic Progressive Rock history.From start to finish, the word that most immediately springs to mind when thinking about this album is 'beautiful'. It is difficult to maintain the level of contrast exemplified in this album without sacrificing any sense of flow. Oftentimes attempts are made to adapt medieval themes to rock music, with results that turn out 'campy' to say the least. This album avoids the pitfalls of its less attractive stepsisters. Hackett not only brought the material to make this happen, but also assembled just the right carpenters to shape the material into the construct that he wanted.Final Score:Voyage of the Acolyteis a top 10 album in my collection and an essential piece to any Symphonic Progressive Rock collection. Everything about this problem is attractive. The writing, the playing, the recording quality, even the cover and sleeve art are attractive. There's no question that this masterpiece album deserves five out of five stars."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Thursday, June 16, 2011",
      "rating": 4,
      "text": "It makes sense that VOYAGE OF THE ACOLYTE is dubbed ''the album that Genesis never recorded''. Obvious to most prog fans is that it is Steve Hackett's album (many point to him as a key figure in the 70's Genesis sound, as do I), but also that Rutherford and (Phil) Collins help out. I can draw a few comparisons to this album and THE GEESE AND THE GHOST, Ant Phillips's first solo record, in that both had held the guitar position in Genesis and Mike and Phil contribute on both records. Their solo albums will appeal to fans of different eras of Genesis; if Phillips's spoke more to the TRESPASS junkies, the ones who like albums like FOXTROT might find this more rewarding.I can hear some of the Genesis sound in this, but VOYAGE OF THE ACOLYTE has its own sound in a way (I guess THE GEESE AND THE GHOST does as well, something I failed to mention in that review). Steve Hackett's guitar sound is the defining characteristic here; it always had something unique about, most notably heard on the wacky opener ''Ace of Wands''. Much of the album is guitar-centric; many of the tracks are either entirely based around acoustic melodies or they have sections pulsated by gentle, acoustic passages (think ''Star of Sirius'').The singing is at best okay; Hackett himself has the best vocal performance on the album on ''The Hermit'' (why does Camel come to my mind when I hear that song?), not that Phil or Sally Oldfield are horrible, but their performances come off as dry to me. The opening third of ''Shadow of the Heirophant'' levels the actual beauty of the piece as a whole; the mellotron- drenched ending really defines symphonic music without an actual symphony much like King Crimson's ''Epitaph''.I got this album and Ant Phillips's debut at the same time, so I find myself comparing the two rather often. I rate VOYAGE OF THE ACOLYTE higher because this has more appeal to the symphonic prog fans as well as having more rocking sections. Other than the beginning third of ''Heirophant'' and ''The Lovers'' to an extent, VOYAGE OF THE ACOLYTE is quite solid. Definitely will appeal to the fans of classic Genesis."
    },
    {
      "reviewer": "baz91",
      "date": "Posted Friday, June 17, 2011",
      "rating": 4,
      "text": "Since this is Steve Hackett - the then-guitarist of Genesis - we're talking about, it's easy to have high expectations of his debut solo album. Sadly however, whilst this album is certainly unique and interesting, it's perhaps not the classic that you'd expect.On the Genesis albums, Hackett had never been much of a standout guitarist, in the way that Steve Howe or Robert Fripp had been, but had instead been content to work mainly in the background, letting Tony Banks take the lead on most of the solos. Sure he let out the occasional guitar solo, e.g.Firth of Fifth, but never anything too monumental. His solo album would then surely be a chance to hear his talents in the spotlight? Not so. Here we see a man who takes his music deadly seriously, and writes music for orchestral instruments, with the occasional prog rock twist.I've always enjoyed solo albums for the line-ups on the album. 'Voyage of the Acolyte' is no exception, as Hackett manages to bring Phil Collins and Mike Rutherford from Genesis to play on drums and bass guitar respectively. Whilst Collins has now become the anti-christ of prog, back then he was known for his impressive drumming ability, and it shows here. Rutherford had been even more of a background man in Genesis, and even though he still is in the background here, there's no denying that he can be heard more on this album. Also appearing is John Hackett, Steve's younger brother, on flute and synthesizer. John would go on to appear on most of Steve Hackett's solo albums. A number of other guest stars appear, but I shall get to them later.The album begins cleverly with the full-on prog instrumentalAce Of Wands. It's clever in the sense that any proghead who'd picked the record up and started the first side would instantly be drawn in by the sensational intro drum fill. In the first four seconds of this album, you are immediately transported into a world of proggy wonder. Since purchasing this album, there's always been a little button I can press on my iTunes menu to hear that wonderful fill. The rest of the song isn't that bad either. There are soaring electric guitars, synthesizers and flutes, all blended into a beautiful melodic whole. In my opinion, this is the best track on the album.Next up is an acoustic track,Hands of the Priestess, Pt. 1. This is where the album starts to get dull. Very little happens in this track, and it feels like filler. However,A Tower Struck Downchanges all this. The electric sounds are brought back for a dark instrumental. Strangely enough, this is the most Genesis-y the album gets (e.g. the riff that begins at 1:17). Unfortunately, it starts to get a little repetitive after a while. Suddenly, in the middle of the track, there is a recording of a person coughing, and then a recording of people shouting 'Sieg, Heil!' before an explosion. The rest of the track is quiet, and we are left wondering what on earth that was all about.Hands of the Priestess, Pt. 2picks up from where part one ended. This part is slightly more interesting, as it reprises a riff from the end ofAce Of Wands.The Hermitis a very dull song indeed. The main feature of this track is Steve Hackett singing, which is hardly that impressive. He actually reminds me slightly of Camel's Andrew Latimer. The track is dominated by acoustic guitar, but features oboe and flute too. A very pretty song, but also dreadfully dull.Over to Side 2, we start withStar of Sirius, a song which features Phil Collins on vocals. His voice has been double tracked, giving a very strange effect. Those familiar with later Genesis may find the familiarity of his voice helps them to get into this song. It is a song with verses and choruses, but it is definitely progressive, as there is an instrumental that is very reminiscent ofThe Hermiton Side 1. The chorus is actually quite catchy and I do enjoy this song every time I put it on. Doing research for this album lead me to an amazing discovery: John Gustafson of Roxy Music and Quatermass plays the bass on this track, in place of Mike Rutherford.The Loversis another short and dull instrumental, in lieu ofHorizonsfrom 'Foxtrot'. Perhaps the only intersting point is that it uses a short snippet from the next track.The final track on the album is in fact Hackett's longest solo track to date.Shadow of the Heirophantstands at an impressive 11:43, but when listening to it, one realises that there's hardly 5 minutes worth of music, as this is actually a very repetitive song. Essentially, there are two parts to this track, the six-minute 'main part' and the mammoth six-minute 'outro'. In the main part of the song, We hear guest star Sally Oldfield (sister of Mike Oldfield) use her stunningly beautiful voice. Her voice reaches the highest notes with seemingly little effort. The instrumentation is a blend of mellotron and electric guitar for the non vocal parts, and acoustic for the main part, which overall gives a very powerful and \"important\" feel to the song. The outro, as already mentioned, is six minutes long, and consists of the same riff repeated over and over, in lieu of The Beatles'I Want You (She's So Heavy). It gets louder and louder until eventually fading away towards the end. While this is certainly a grandiose exit, one can't help but notice that the riff doesn't feel quite right. In other words, whilst being a very good riff, it's not quite as satisfying as, say, theW�rmsegment ofStarship Trooper. On the remastered CD, there is a 17 minute extended studio version of this song, which essentially extends the outro to 11 minutes, as well as increase the volume of Collins' drumming. If you're quite the fan of the outro, then this will be a huge bonus, but otherwise, there is hardly any reason to listen to this version.Kim Poor was the artist responsible for the beautiful yet disturbing paintings on the cover and in the gatefold. The CD remaster is extremely good, as it not only includes both paintings, but actually extends the gatefold painting to it's full size, essentially giving us more than the vinyl sleeve. Hackett and Poor would marry, and she would do all his artwork, following a trend that Robert Wyatt and Alfreda Benge had set. Also included on the CD is a live version ofAce Of Wandswhich is vastly inferior to the studio version, but a nice touch all the same. This is a worthy purchase for all fans of Genesis, who'd like to see Steve Hackett in a different light."
    },
    {
      "reviewer": "Marty McFly",
      "date": "Posted Wednesday, September 28, 2011",
      "rating": 4,
      "text": "A classic, an album from golden era of Prog, Steve Hackett in the best shape, but most of all, the best presentation of his acoustic work crossed with Genesis style music (but after all, he is Genesis).Voyage of the Acolyte brings many melodies. Not cheap, not wonderful, but rather intriguing, the ones that gets under your skin. Yet it is also an album where few elements spoils the whole a bit. However, after every listen I get a feeling that this album wants to be loved. So gentle, so variable, so pleasing in every sense.Even the littleThe Loversis a bit interesting, even it is just a filler. And being to understand exact mood featured on trackHands Of The Priestess, Part Iwould be also fine. I never seem to get it right, it always puzzles me. In a good way.Nevertheless, I have some problems withA Tower Struck Down, but even it has its moments. Not much though.Shadow Of The Hierophantis a reprise of album's theme.4(+), for a great visionary, harmed only by 10% of bad parts + some repetition."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Thursday, October 6, 2011",
      "rating": 4,
      "text": "Recorded by Steve Hackett with some Genesis pals in tow whilst the band were deliberating over their post-Gabriel direction, Voyage of the Acolyte is a brilliant showcase for Steve's skills - both as a guitar player and as a songwriter. I don't think it's a classic from beginning to end - I usually end up tuning out during the somewhat lukewarm \"la la la la\" vocal section on Star of Sirius - but it's packed with great music, from the super-complex Ace of Wands to the magnificent outro to Shadow of the Hierophant. Any fan of Hackett-era Genesis should make this their first stop in touring Steve's solo discography."
    },
    {
      "reviewer": "Bj-1",
      "date": "Posted Tuesday, November 1, 2011",
      "rating": 5,
      "text": "One of the best and most characteristic progressive rock albums ever made, and Steve Hackett's finest moment as a composer. At it's best it surpasses Genesis, and at it's worst it's still around the same level as them. The music is very adventurous and imaginative with excellent use of contrasting moods and themes, Steve was (and still is) a brilliant writer and somewhat underused in Genesis so this album really made my day on first listen. The CD didn't leave the player for a month and the music is still as fresh now as it was back then. The musicianship have to be mentioned as well with bandmates Mike Rutherford and Phil Collins doing the rhythm section and brother John Hackett and John Acock on flute and keyboards respectively. Returning to a more song-oriented format on further releases, this is one of Hackett's most unique and rewarding albums, and absolutely essential for any starving proghead, preferably with a crush on Genesis. Highlights include the brilliant \"Ace of Wands\" and \"Star of Sirius\", the latter being sung by Phil Collins, two rollercoaster rides with splendid music. Essential."
    },
    {
      "reviewer": "Seyo",
      "date": "Posted Thursday, November 3, 2011",
      "rating": 5,
      "text": "No doubt, Hackett's solo debut was and still is a wonderful record capturing all the instrumental and composing ideas Steve had accumulated during his GENESIS tenure but was prevented to \"sell\" them to the band-mates. So he decided to go solo. But this is very much GENESIS-sounding album, and if you are a fan of Gabriel-era GENESIS you should definitely get \"The Voyage of the Acolyte\"!There are lots of beautiful instrumental passages, pastoral feel of guitar solo, acoustic strings, mellotrons and flutes, symphonic arrangements, and above all, diversity. \"Hand of the Priestess\" carries the fine melodic snippets of what was probably left from the material Hackett composed for GENESIS album \"Selling England..\", while \"Tower Struck Down\" is an abrasive heavy guitar attack resembling some dark KING CRIMSON aspects. The highlight is perhaps \"The Star of Sirius\" with Phil Collins handling the lead vocals and is a typical multi-part progressive track of the GENESIS canon. Being an exceptional guitar player Hackett is much less of a vocalist, so \"The Hermit\" although nice ballad is probably the least strong track on the album. Another magnum opus is the closing \"Shadow of a Hierophant\" with female lead vocals by Sally Oldfield and some really wonderful weeping sound of Hackett's guitar and his brother John's flute. Of course, the opener \"Ace of Wands\" is a memorable instrumental composition and a furious starter to this lovely record.Absolutely essential to all listeners of \"symphonic\" type of classic prog.PERSONAL RATING: 4,75/5"
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Friday, November 25, 2011",
      "rating": 4,
      "text": "First solo album from Steve and the only one released while still a member of Genesis. His reason for making this album (and later leaving Genesis) was he felt that not enough of his ideas were being used by the band. Some call this a 'lost Genesis album' and while I see where they are coming from I don't really agree. Some of the music here does sound like Genesis, while some of it is (gulp!) even better than Genesis! Both Collins and Rutherford appear on the album as well as other people, some more well known than others.The first half of this album is almost flawless. Generally I find a lot of the music too acoustic- y for my tastes. The use of synths here is more interesting than most of what Tony Banks was doing at the same time. The two best songs here, \"Ace Of Wands\" and \"A Tower Struck Down,\" are excellent tracks and, realistically, there is probably only 2 or 3 Genesis songs better than these two. That's how good they are. In fact, I would say that the last 2 minutes of \"Ace Of Wands\" is better than anything Genesis ever did. There, I said it.Opening the album with a drum fill and a guitar run, \"Ace Of Wands\" wastes no time getting to business. This track features some of Hackett's best guitar work on the album. Love the flute-like synth playing mixed with bells...awesome sound. I just love how it abruptly changes after 3 minutes to a face-paced section with acoustic guitar strumming and later some of Steve's trademark finger-tapping style. The two-part \"Hands Of The Priestess\" which segues between the other songs on side one features acoustic guitar, flute, Mellotron, backwards sounds as well as some mournful electric guitar. Good as segues but nothing special on their own.\"A Tower Struck Down\" is probably the single best song here and a lot darker and sinister sounding than almost anything Genesis did. Great interplay between the instruments. Love the sequencer pattern that appears after 2 minutes, very hypnotic. For a few seconds it gets interupted by random noises and then gets drowned out by a crowd yelling \"Steve Hackett!\" although it sounds like \"Sieg Heil!\" instead. Synth-generated thunderstorm sounds and then gorgeous Mellotron strings, followed by repeated minimal guitar. Fantastic song.\"The Hermit\" features Steve's own pedestrian vocals. Mostly acoustic guitar with some strings and some flute. Sort of a letdown after what came before but still a decent song. Phil Collins does lead vocals on \"Star Of Sirius.\" Starts off with acoustic guitar and Phil's multi-tracked vocals being joined by Mellotron. Nice synth melodies during the first half of this song. Oddly enough, this song does not sound very Genesis-y. Some vibraphone leads to the main upbeat portion of the track featuring acoustic guitar strumming and 'nah, nah, nah, nah' vocals.In the middle it gets dark sounding before some flute brings the sunshine back in. More synth melodies and vibraphone before the upbeat section returns. Probably Collins' best drumming on the album. \"The Lovers\" is a less than 2 minute instrumental that sounds like the first half is being played backwards during the second half. The almost 12 minute epic \"Shadow Of The Hierophant\" features Sally Oldfield (Mike's sister) on lead vocals. Very symphonic prog sounding. I'm not the biggest fan of Sally's voice but at least she can sing better than her brother (ha!). This is the longest song and it tends to lose my attention. Some cool finger-tapping from Steve; hard to believe this is from 1975 not 1985. The last part that builds up is the best part of the track.Hackett made a lot of great songs on his own but his albums were never very consistent. Voyage is probaly the most consistent of them all (although admittedly I haven't heard anything post-80s from him). This was recorded after Gabriel left Genesis and shows that, sooner or later, Genesis were going to end up a trio eventually anyway. This is worth it just for those two great tracks (you know which ones). I'll give this a 3.5 rounded up to 4 stars."
    },
    {
      "reviewer": "Matti",
      "date": "Posted Monday, April 2, 2012",
      "rating": 5,
      "text": "This much-reviewed album is fondly admired by Genesis fans, and IMHO it's among the finest solo efforts of any (former) member of an acclaimed band. Quite an achievement for a debut! Made during the hiatus followed by Peter Gabriel's departure, it writes a crucial additional chapter in the story of Genesis. Worth noting is that Hackett collaborated with both Phil Collins and Mike Rutherford, and Collins also sang on one of the album's standout tracks, 'Star Of Sirius', perhaps paving way for the decision to become the lead vocalist for Genesis. The other guest vocalist is Sally Oldfield, whose high angelic voice is a perfect match with the delicate, romantic and symphonic music on the nearly 12-minute closer 'Shadow Of The Hierophant'.Taking its inspiration from the Tarot pack, the album is full of pastoral beauty with lots of acoustic instruments (brother John plays flute). Naturally Hackett also takes advantage of his chance to give the leading role to his masterful guitarism: the energetic instrumentals 'Ace Of Wands' and 'A Tower Struck Down' seem a bit too evident in that sense, but they give some kick amidst the soft and ethearal stuff (namely the dreamy isntrumental 'Hands of the Priestess' in two parts). 'The Hermit' is the most melancholic track, sung tenderly - and with an exaggerated vibrato - by Steve himself. The flute solo is lovely.On behalf of Genesis, I believe we all are grateful that Steve didn't leave them at this point. If you enjoy the more pastoral side of Genesis (e.g. on Wind & Wuthering), this is a must."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Saturday, October 20, 2012",
      "rating": 4,
      "text": "\"Voyage of the Acolyte\" is the pinnacle of Steve Hackett's genius in many fans' eyes, and rightfully so as it boasts some of his most celebrated material. Any Hackett fan is enamoured with awesome tracks such as 'Ace of Wands', 'Star Of Sirius' and 'Shadow Of The Hierophant'.Many cite this as the missing Genesis album and it is easy to see why when you look at the lineup on the album. Steve Hackett plays electric & acoustic guitar, Mellotron, harmonium, bells, autoharp, vocal, effects, and he is joined by brother John Hackett on flute, Arp synthetizer, bells. But the real surprise treat is the addition of Mike Rutherford on bass guitar, bass pedals, Fuzz 12-String,and Phil Collins on drums, vibes, percussion, vocals. The collaboration feels more Genesis than one might imagine, and there are stirring performances from John Acock on Elka, Rhapsody, Mellotron, harmonium, piano and the beautiful tones of Sally Oldfield on vocals.'Ace of Wands' is a very melodic instrumental with delightful keyboards and of course Hackett is brilliant on lead guitar. This one has appeared on many concert setlists for good reason; a simply stunning start to the album. 'Hands of the Priestess Part I' is next, with a mystical feel and some gorgeous Mellotron and acoustics. The flute is dreamy as are the chimes; some of the most beautiful pastoral music I have heard.'A Tower Struck Down' is dramatic music with nice buzzing synth lines,rutherford's violent bassline, and odd meters with choral voices adding to the mystical flavour. It even has \"Sieg Heil!\" shouts at the end and explosions; a war of ideas, and then Mellotron swathes followed by low guitar tones. This is one of the proggiest tracks on the album. Followed by 'Hands Of The Priestess Part II' with more lovely flute and medieval sounds.After all the instrumental work, vocals soon enter the album. 'The Hermit' has the vocals of Steve Hackett echoed and phased in the studio, with a medieval lute. The flute passage is a gorgeous augmentation to end it.'Star Of Sirius' gives Phil Collins a chance to show he can sing. It is a peaceful song and has multi harmonies to disguise Collin's real voice; perhaps Hackett was worried about this. The music is keyboards and acoustics at first, then it builds into some nice melodies and definitely sounds like Genesis.'The Lovers' is a short transition with acoustic tranquillity, similar to 'Horizons' in some ways, except it feature backwards keyboards. 'Shadow Of The Hierophant' features the golden crystalline tones of Sally Oldfield, always a delight. It is the longest track at 11:44, and perhaps the masterpiece of the album. Oldfield's vocals lend a Celtic quality to the music as always, such an accomplished vocalist, and the flute and chimes are mesmirising.One of the greatest Hackett albums ever, \"Voyage of the Acolyte\" is a delight from beginning to end, proggy and with virtuoso musicianship throughout. The songs and themes are based on Tarot, that never interested me, but I am very interested in the musicianship. Hackett proves he is going to make a solo career one day with this debut. He not only proves he will make it but he shows the other members of Genesis how it is done with that inimitable prog edge."
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Friday, November 9, 2012",
      "rating": 4,
      "text": "'Voyage of the Acolyte' - Steve Hackett (8/10)The break-up of the progressive Genesis is one of the quiet tragedies of rock music. While the band technically lived to fight another day well into the eighties and beyond, the pop- oriented style was a world away from the bombastic prog epics they were first known for. In a sense, Genesis became a different band with the same name, and while I'm sure there are many out there who prefer the 80's pop- American Psycho's Patrick Bateman, for one- I'll always remember the band for their contributions to prog. Although Peter Gabriel's departure was the first nail in the coffin, it was Hackett's decision to leave that set the band's transformation in focus. Although the Genesis guitarist's solo debut \"Voyage of the Acolyte\" was released and recorded while he was still in the band, it is clear here that the main band was no longer scratching Steve Hackett's creative itch. With the same playful, cinematic guitar work and symphonic structures that defined much of Genesis' best work, paired with the fact that Steve is backed up here by fellow bandmembers, \"Voyage of the Acolyte\" may be seen as the route Genesis would have taken, had Hackett been given full control instead of Collins. Taking his distinctive style one step further, \"Voyage of the Acolyte\" comes close to bridging the gap between the archetypal rock band and symphonic orchestra. It may not feel as smooth as the refined masterpieces of Genesis proper, but Hackett's first foray into the solo realm is indeed spectacular.There's no surprise when \"Voyage of the Acolyte\" bears a strong resemblance to Genesis. Much like an orchestral symphony, the mood and style is complex, without ever being jarring on the ears. I read a comment once where it was said that Hackett was a master of the subconscious, and it certainly rings true here. In spite of (or perhaps because) the music is largely instrumental, there is a more otherworldly atmosphere here than the Gabriel-fueled romps through the farce of British working class society in early Genesis. The album art (painted by his wife, if I'm not mistaken) is a perfect counterpart to the mood. As always, Hackett's guitar tone is deep and meaty, and his playing reserved, melodic and rarely showy. It's well-assumed that the guitar element would play a heavier role here, but Hackett pays good consideration to the music as a whole. The synthesizers are allotted some of the most beautiful melodies on the album, and though Hackett's guitar is always doing something in the works, he seems less excited to sport his skills, and more enthusiastic about letting others spread their wings. Especially for the solo album of a guitar player- this is pretty rare. Suffice to say, there are no blistering guitar solos or longwinded 16 bar blues jams. Narcissistic musicians and listeners will no doubt feel alienated by this approach.\"Ace of Wands\" is a perfect way to open the album. Almost as were it an energetic overture of sorts, it is a highly dynamic instrumental piece that runs the spectrum from Celtic- influenced prog grooves to classical arrangements and the odd touch of ethereal atmosphere. The next three tracks run together as a longer piece, with \"A Tower Struck Down\" offering a near King Crimson-esque tension to contrast the relative lightness of \"Hand of the Priestess\". Thus far, \"Voyage of the Acolyte\" has been an entirely instrumental trip, and the lack of vocals gives Hackett the room to exercise his composition skills to their full potential. With the great success of this instrumental material in mind, it comes as something of a dull shock when Hackett's own voice is heard on the melancholic acoustic piece \"The Hermit\". The accompanying cello (performed here by Nigel Warren-Green) is a pleasantly dark accompaniment to the baroque sound of Hackett's acoustic arrangement. The vocals, however, feel quite ill-fitted for the sound. Although Hackett is not a poor vocalist by any means, his croon feels dry, muffled, and even poorly produced compared to the excellent instrumentation. \"Star of Sirius\" is arguably the most poppy tune here. Perhaps coincidentally, Phil Collins offers his voice here, and though his vocal delivery is much more effective than Hackett's on \"The Hermit\", the music runs into a similar problem; the production feels less professional than it did when the music was purely instrumental. It's as if \"Voyage of the Acolyte\" is self-aware that the instrumental material thus far is superior, and wants to draw a bolder line between the two. The result is that \"Voyage of the Acolyte\" comes across as a bit of an uneven record, at least relative to its studio success.\"The Lovers\" is a short acoustic interlude, the likes of which we have seen before from Hackett on \"Foxtrot\"s own \"Horizons\". Being little more than a slow exercise in fingerpicking, it's largely benign. However, it's given the great honour of being the extended introduction for \"Shadow of the Hierophant\", the mandatory prog epic that closes off the record. It's here where everything comes together; all of Hackett's scattered pieces coalesce into something monstrous, beautiful, alien and intimate. Although it flirts with the eleven minute mark, \"Shadow of the Hierophant\" is a surprisingly minimalistic composition, relying largely on two motifs to get by, one soft and vocal-driven, the other more anthemic and proggy. It may have felt slightly longwinded, had it not been one of the most beautifully composed and performed things Steve Hackett has ever touched. Thanks in large part to guest vocalist Sally Oldfield's incredibly pristine voice, \"Voyage of the Acolyte\" forgives its slightly weaker midsection and delivers something straight out of a world of fantasy. Sally's voice really cannot be overestimated here, her vibrato and floating quality gives her the voice the semblance of an angel. Fused with Steve Hackett's classical ambitions and moderate Celtic influences, it's something really wonderful. The repeating final section does tend to feel a tad overextended by the end, but there's no mistaking that \"Voyage of the Acolyte\" leaves its best for last; really wonderful stuff.It will no doubt be exciting for someone to listen to Steve Hackett's debut, especially if they're any fan of the progressive-era Genesis. If Genesis could be seen as an earthy form of progressive rock, then \"Voyage of the Acolyte\" is somewhere between that and the aether, where Yes have claimed their perch. For whatever reason, the album feels uneven in the way it was recorded. It certainly opens and ends on its strongest notes, and while there is a consistent beauty throughout the music here, I cannot help but feel that the album could have been even better, had the flow come across a little more smoothly. It's not perfect, but it's some of the most vital Hackett's creativity has ever felt."
    },
    {
      "reviewer": "tarkus1980",
      "date": "Posted Saturday, January 19, 2013",
      "rating": 4,
      "text": "In retrospect, making a solo album at this point in time might have been a somewhat jerkish move on the part of Steve. In the wake of Peter Gabriel's departure from Genesis, the band was in a bit of an uncertain place, and one could argue that everybody in the band should have been focusing all of their energies on figuring out how the new look Genesis was going to move forward. Instead, almost as soon as theLambtour was over and Peter was officially out of the band, Steve took the opportunity to spend a month recording his debut solo album, and his involvement in relation to various aspects caused him to miss early rehearsals forA Trick of the Tail. Feelings couldn't have been too hard at the time, though; while Tony Banks is nowhere to be found, Mike Rutherford handles the bulk of the bass guitar work, and Phil Collins contributes all of the percussion and even sings on one of the tracks. Who knows, maybe Mike and Phil decided that they couldn't risk any bad blood on the part of Steve, so they decided it would be a good idea to help him out, or maybe they were eager to get back to playing non-Lambmaterial together as soon as possible.This is a 1000% prog rock album. Five of the eight tracks are instrumental, the song names all reference Tarot cards, the lyrics might as well be sung in French, and everything about the album screams out THIS IS SERIOUS MUSIC FOR SERIOUS LISTENERS. From a certain perspective, it's a far more concentrated dose of prog rock on the whole than any Genesis album to that point; yes, Genesis albums had their fair share of \"serious\" music, but they also had a tendency to lighten the mood at just the right times (the lighter songs are often an irritant for Genesis fans, but I think the consistent of inclusion of such material was one of the great strengths of the Gabriel era of Genesis). On this album, the music may sometimes get gentle, but it never remotely approacheslightweight, and this both helps and hurts the album. Steve was still a little bit away at this point from his future tendencies to mix things up, that's for sure.Still, this album makes for a delightful listen, and part of this is because the sonic texture is far more varied than on a given Genesis album. Aside from the standard instrumentation, Steve's brother John contributes flute, and there are contributions from others on oboe, English horn and cello. There's still plenty of keyboard - Steve wasn't going to abandon one of the most important foundations of solid art rock just because Tony didn't want to help out - but the keyboard parts are very much a part of the ensemble, as opposed to an entity showing much personality (which, for better and worse, Tony Banks' keyboard parts always had). The star, though, is clearly Steve's guitar, and my does he take advantage of his new freedom. If you've ever felt any sense that Steve was underused relative to his abilities in Genesis, then the opening \"Ace of Wands\" will reinforce that feeling something fierce. Yes, the song is more than just a guitar showcase; all of the various parts are memorable, and there are solid sequences where the majestic keyboards become the focus and the guitars fade into the background. Ultimately, though, the song's most notable features come from its rapid dash from guitar lick to guitar lick, some electric and some acoustic, with Steve mixing speed and minimalism in the way only he could and showing a stronger guitar tone than on most of his Genesis work.\"Hands of the Priestess I\" and \"Hands of the Priestess II,\" which sandwich \"A Tower Struck Down,\" show off Steve's skills at making gentle instrumental music (whereas \"Ace of Wands\" and \"A Tower Struck Down\" show his skills in making energetic instrumental music). The first part features John's flute and Steve's guitar going back and forth on an atmospheric melody over a soft acoustic part, and the second part brings out a happy exchange of flute, English horn and guitar, with a momentary reprise of one of the themes briefly played in the middle of \"Ace of Wands.\" \"A Tower Struck Down,\" in contrast, would be a borderline heavy number if the guitar and the bass didn't sound so goofily wimpy (which is all the stranger given that there are two people playing bass in the song); I like the song, and it has multiple interesting sections (and some GREAT atmospheric keyboard parts in the middle), but the song almost sounds unfinished in spots (in contrast, the version onGenesis Revisited IIdecades later sounds fantastic).The first vocal on the album comes from Steve on \"The Hermit,\" and while he's no great shakes, he's definitely not bad either, though to be fair the vocal melody (a fairly nice idea repeated over and over) doesn't require much of him. The song itself is quite lovely, though; the melody goes nowhere, but it's an atmospheric nowhere, and the arrangements (especially the fantastic solo by the oboe or English horn, I admit I'm not 100% which) are very pleasing to my ears. \"Star of Sirius\" is a more upbeat acoustic ballad, this time featuring Phil on vocals, but Phil is basically just another layer in the delightful atmosphere whenever he sings. No matter, the slower parts are beautiful, and the faster parts give another opportunity to hear Steve doing his speedy minimalism thing oh so well.After another instrumental, the classical-guitar-turns-into-ambience of \"The Lovers\" (only 1:50), we come to the album's finale and defining track. \"The Shadow of the Hierophant\" (which has enough contributions from Mike that it warranted a songwriting co-credit) is about as pompous as prog can get without crossing a suckiness line, and all the better for it. The first half (the vocal half) is basically two ideas alternating back and forth; a fantastic slow guitar line supported by STRONG keyboards, and an acoustic ballad with Sally Oldfield singing lyrics I still don't remotely know after owning the album for a very long time (aside from an occasional \"Has the moon eclipsed the sun\"). Honestly, I don't care that I don't know the lyrics; the singing is so lush, and the vocal melody so beautiful, that I'm perfectly willing to let the song have the same effect on me it would have if I was listening to something from an opera (where I wouldn't know the words because I wouldn't speak the language). Once the \"song\" portion ends, Steve breaks into the most emotionally charged 40-second tapping sequence I can imagine, before pulling out a brief guitar melody that rivals anything he did with Genesis, and the ending sequence begins. Oh, that ending sequence. It's just one relatively simple theme, repeated over and over (starting on solo vibes before the guitar comes in), building into a more and more dramatic arrangement, over the course of five minutes. I listen to it, and I know it's not much, and I know on a certain level it's a giant put-on, but it's just such a giant steam-roller of sound and power and that I can't get myself to care. It's one of the best stretches in Steve's career, that's for sure, and it helps make the track into one of the best of Steve's career.On the whole, this is also one of the best albums of Steve's career, but I'd still say it falls a smidge short of greatness. It's just a touch short of genuinely classic tracks, and it has some stretches (like in much of \"Tower\") that don't sound quite right, and quite honestly it sounds much closer to a generic prog album than it does to the sort of album that Steve would be making later. But if it doesn't quite make it to greatness, it's still awfully close. Fans of 70s Genesis, and 70s prog rock in general, should be all over this."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Wednesday, March 18, 2020",
      "rating": 5,
      "text": "Review N� 322\"Voyage Of The Acolyte\" is the debut solo studio album of Steve Hackett and was released in 1975. \"Voyage Of The Acolyte\" is also the first solo album to be released by any member or ex-member of Genesis. \"Voyage Of The Acolyte\" was releasead before \"The Geese And The Ghost\" and \"Peter Gabriel (1 ? \"Car\")\" of Anthony Phillips and Peter Gabriel, respectively, both released in 1977, \"A Curious Feeling\" of Tony Banks which was released in 1979, \"Smallcreep's Day\" of Mike Rutherford which was released in 1980 and \"Face Value\" of Phil Collins which was released in 1981.Steve Hackett invited to participate on his debut solo studio album two of his fellow members of Genesis, in those times, Rutherford and Collins, and some other fine musicians too. So, the line up on the album is Steve Hackett (electric and acoustic guitars, mellotron, harmonium, bells, autoharp and effects), Mike Rutherford (bass guitar, bass pedals and 12 string fuzz-bass), Phil Collins (vocals, drums, vibes and percussion), John Hackett (flute, ARP synthesizer and bells), John Acock (Elka synthesizer, mellotron, harmonium and piano), Sally Oldfield (vocals), Robin Miller (oboe and English horn), Nigel Warren-Green (cello), Percy Jones (bass guitar) and Johnny Gustafson (bass guitar).\"Voyage Of The Acolyte\" has eight tracks. All tracks were written by Steve, except track three written by Steve and John and track eight written by Steve and Rutherford. The first track \"Ace Of Wands\" is a great opener for the album. It has a violent entrance with a very complex Steve's guitar work, and it has also great individual performances by Collins on drums and by his brother John with a very aggressive flute work. The result is a promising track with great some parts. This is one of the best tracks on the album. The second track \"Hands Of The Priestess I\" is a short, very calm and beautiful acoustic piece of music with the unmistakable Steve's guitar style, very well accompanied by his brother's flute work. The third track \"A Tower Struck Down\" is the most unusual song on the album. It has a very dark style, and is somewhat unexpected. It's a less melodic song, more experimental and that reminds me King Crimson, especially due to the way how the mellotron was used. It remains another great track but it's the least accessible number from the album. The fourth track \"Hands Of The Priestess II\" is the smallest song on the album and is a kind of a remake of the first part of \"Hands Of The Priestess I\". It's a very beautiful and melancholic song with some nice keyboards, and one more time, we have a beautiful John's flute work. The fifth track \"The Hermit\" is another calm, soft, beautiful and melancholic song on the album, but this time with Steve's vocals. Who knows Steve well, knows he isn't a vocalist and that he hasn't properly a great voice. However, on this song, his voice is very decent and pretty and is very well accompanied by a great guitar work. I particularly like very much the combination of the acoustic guitar work and great keyboards. The sixth track \"Star Of Sirius\" is the second lengthiest song on the album and is also one of the best, most diverse and complex tracks on the album. This is the track that many say it's a Genesis' song. It has Collins singing and practically everything on the song sounds like Genesis. It's extremely atmospheric, but also goes though a few upbeat sections. The seventh track \"The Lovers\" is the other smallest song on the album and is also another classic mellow acoustic nice track. It's a track perfectly in the same vein of \"Horizon\" of \"Foxtrot\". The eighth track \"Shadow Of The Hierophant\" is, in my humble opinion, the great epic, the highest point on the album. This is really a majestic closer to it. Some of you wrote that think this track is too long and that makes of it a boring song. I completely disagree with that opinion. This is, for me, a fantastic, memorable and beautiful piece of music, a real masterpiece, with the beautiful and superb voice of Sally. I think this musical piece is strongly influenced by Johann Sebastian Bach, the German classical Baroque composer. That isn't surprising, because many of we know the Steve's passion by this classical composer.Conclusion: \"Voyage Of The Acolyte\" marks an extraordinary beginning of an ongoing career. Many fans consider this his finest work. I remember this release has shocked many fans in those times. Genesis had lost their front man and supposedly their music mastermind too. So, the future of the group seemed uncertain. Was Steve's solo debut another indication that the band was breaking up? Being the first one to release a solo work surprised many people because on Genesis, he always seemed to be the most unobtrusive of all. \"Voyage Of The Acolyte\" is the best debut solo album released by any member or ex-member of Genesis. It's, in many ways, almost a lost Genesis' album, because it features Collins and Rutherford, because it comes out in the wake of Gabriel's departure from the group and also because there are many similarities with the music sound of Genesis. In my humble opinion, \"Voyage Of The Acolyte\" is at the same level of \"A Trick Of The Tail\" and \"Wind And Wuthering\", and is also something more progressive and innovative than these two albums. So, \"Voyage Of The Acolyte\" is a wonderful masterpiece that doesn't deserves less than 5 stars.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Tuesday, August 22, 2023",
      "rating": 4,
      "text": "In the midst of uncertainty about the future of Genesis due to the resignation of Peter Gabriel after the conceptual \"The Lamb Lies Down on Broadway\", Steve Hackett decides to release his first solo album, \"Voyage of the Acolyte\". Freed from the limits and conventions that being part of a band often demands, but at the same time counting on the participation of his bandmates Phil Collins and Mike Rutherford, Hackett relies on the mysterious secrets hidden by the characters of the Tarot cards, to give the album a significant halo of mysticism and depth.From the nervous \"Aces of Wands\" and its voluble moods, where Hackett's aseptic guitars yield and recover spaces in constant synchrony with the synthesizers and Collins' anxious drums, \"Voyage of Acolyte\" combines moments of diaphanous appearance as in the two \"Hands of the Priestess\" and its celestial acoustic arpeggios and fragile flutes, or the aching \"The Hermit\", with the forcefulness of the genesian and robust \"A Tower Struck Down\" and the gentle bipolarity of \"Star of Sirius\", sung by Collins and immersed in relaxed landscapes tinged with lively moments, a hint of the immediate future of post Gabriel Genesis (\"A Trick of the Tail\" and \"Wind of Wuthering\" for instance).However, the track that unites all the traversed paths into one is \"Shadow of the Hierophant\". Discarded by Genesis during the recording process of \"Foxtrot\", the piece combines beautiful arpeggios, the soprano voice of Sally Oldfield, sister of the tubular musician, with an instrumentation that grows in intensity led by the keyboards until the end. One of the best of the album and probably also of Hackett's solo discography.\"Voyage of the Acolyte\" is not only the debut album of Hackett, one of the most representative and influential guitarists of the genre, but the beginning of his extensive solo career.Excellent.4/4.5 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "albume3e5.html",
  "last_parsed": "2025-05-18T00:25:42.534865"
}