{
  "album_title": "NURSERY CRYME",
  "artist_name": "Genesis",
  "artist_page_link_local": "artist681a.html?id=1",
  "year": 1971,
  "rating_value": 4.42,
  "rating_count": null,
  "review_count": null,
  "genre": "Symphonic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/1/cover_183462112008.JPG",
  "tracks": [
    {
      "number": 1,
      "title": "The Musical Box",
      "duration": "10:24",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "For Absent Friends",
      "duration": "1:44",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "The Return of the Giant Hogweed",
      "duration": "8:10",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Seven Stones",
      "duration": "5:10",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Harold the Barrel",
      "duration": "2:55",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Harlequin",
      "duration": "2:52",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "The Fountain of Salmacis",
      "duration": "7:54",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "lucas",
      "date": "Posted Monday, November 3, 2003",
      "rating": 5,
      "text": "The first Genesis album featuring Phil Collins on drums. There are at times very dark sections, close to hard rock (listen to the giant hogweed and the musical box) but also acoustic tracks such as 'for absent friends'. Overall, this a dynamic album, with grandiose vocals and subtle music (the structure of the song 'seven stones' is as complex as classical compositions). To my mind, the first great Genesis album."
    },
    {
      "reviewer": "maani",
      "date": "Posted Tuesday, January 6, 2004",
      "rating": 4,
      "text": "First, it's \"Cryme,\" not \"Crime\" (even says so on the cover...). The Musical Box and Fountain of Salmacis are about as good examples of \"progressive rock\" as have ever been written, and album overall is an excellent, early example of well-conceived \"progressive rock.\" As important, it is also a very good example of the progression of a particular group: it is a perfectly placed pivot between Trespass - which was good, but less \"mature\" - and Foxtrot, which was better conceived and more \"mature.\" Finally, anyone who is not \"grabbed\" by the opening of \"Hogweed\" is probably never going to understand \"progressive\" music."
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Monday, February 2, 2004",
      "rating": 5,
      "text": "All my dear colleagues reviewer did such a fine job to describe this extraordinary chef d'oeuvre that I don't think that there is much more to say except maybe that my fave is Musical Box and that Seven Stones is underrated. Every single one of these tracks is an absolute delight with Collins singing lead (but not credited) for the very quiet Absent Friends.I just wish they had gotten out this album with an extra track called Happy the Man which came out at the time. Quintessential Genesis!!!!"
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Saturday, March 6, 2004",
      "rating": 5,
      "text": "Play me old King ColeThe follow up to Genesis firstrealalbum \"Trespass\", \"Nursery Cryme\" represents a giant leap forward. Phil Collins and Steve Hackett were now on board completing theclassicline up.The opening \"Musical Box\" is a wonderful mini rock opera, with nursery rhyme influences mixing with bombastic keyboards and drums. It really is a true prog classic, and essential for anyone new to the genre wishing to find the essence of early 1970's progThe gentle Phil Collins led song \"For absent friends\" provides a brief breathing space before the wonderfully heavy and menacing keyboard introduction to \"The return of the giant hogweed\". Genesis collective imagination runs riot on these showpiece tracks, creating sounds and structures which at the time of this album's release were unique.On side 2 of the LP, \"Seven Stones\" and \"The fountain of Salmacis\" both have strong Mellotron played by Tony Banks. \"Seven stones\" has one of thepurestmellotron solos you're likely to hear, while \"Fountain..\" has an almost symphonic sound complementing a mythical story.\"Harold the barrel\" is a brief but amusing interlude about a \"Well know Bognor restaurant owner\", who threatens to jump from a tall building. \"Harlequin\" is really the only superfluous track on the album, quaint but disposable.In all, one of the major albums in prog history, full of enterprise, imagination, and great music."
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Monday, March 15, 2004",
      "rating": 5,
      "text": "Another simply perfect progressive rock recording from early GENESIS. \"Nursery Crime\" of course contains fan fav \"The Musical Box\" (which is again one of my all time fav's, like so many of you out there). Once again songs are very emotive in nature and you will not find more pleasing progressive rock anywhere. Once again Tony BANK's Mellotron/organ sounds create a perfect landscape for the rest of boys to add their brilliant musical additives to. This is essential progressive rock and certainly has been one of my all time most treasured recordings."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Thursday, April 1, 2004",
      "rating": 4,
      "text": "The beginning of the true \"Progressive era\" by the early GENESIS, after the first two immature or incomplete albums, this issue was characterized by the original epic number \"Fountain of Salmacis\" and the powerful \"The Giant Hogweed\". Anyway you don't have to forget the other songs and, in particular, the mythical \"The Musical Box\", a stunning mini-suite, whose final crescendo is simply incredible!This was the first essential issue, even though the production was not at the top (as usual at that time). It never minds once again, your \"prog collection\" must include this one!!"
    },
    {
      "reviewer": "greenback",
      "date": "Posted Thursday, April 8, 2004",
      "rating": 4,
      "text": "To compare \"Nursery Cryme\" to the next album \"Foxtrot\" is very embarrassing, because \"Foxtrot\" is just simply PERFECT! Well, one thing is sure, I won't give 5 stars for \"Nursery Cryme\". Nevertheless, fer sure the album deserves a high rate!The record is full of majestic mellow moments, followed with darker aggressive parts, full of fast drums and incisive guitars. This record is not very shiny, and the sound is rather gross and coarse. The weakest point is IMO Collins' unrefined drums and exaggerated cymbals strokes. I noticed that HACKETT's electric guitar has many strange effects; plus, the keyboards are rather dark. I like the omnipresent delicate acoustic guitars. GABRIEL's voice is very simple, and sometimes he seems to directly sing in your ears! \"For Absent Friends\" and \"Harlequin\", featuring Collins' excellent vocals, are strong points of this album: the miscellaneous melodic acoustic guitars sound like the beginning of \"Supper's Ready\", and the overall sound is less dark, more shiny.\"The Return Of The Giant Hogweed\" sounds interesting when the piano begins and when the electric guitar sounds like a violin! I like the early CRIMSON-esque \"Seven Stones\": WOW! The flute, the floating intense mellotron: the song is VERY catchy! \"Harold The Barrel\" is the only joyful moment of the record: funny and very rythmic! The only epic track which I really like from beginning to the end is the very air changing \"Fountain of Salmacis\", despite it is still rather dark and coarse. The bass sounds very bottom and like carton paper at the end (2 consecutive notes). The contemplating backing vocals at the end are excellent.Rating: 4.5/5"
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Tuesday, April 20, 2004",
      "rating": 5,
      "text": "I started with Genesis in my quest for mind-blowing prog. You listen their records and you move on. Normal. Lately, I pulled Nursery Cryme from the cd rack thinking:\" Okay, they were good but, that good? I mean, the prog world is big and they can be topped easily, it's basic probability...\" Well, after many more listens, i'm sorry but THEY ARE THAT GOOD. What were the chances that a great showman with a fond for drama, a cosmic guitar player, a versatile and professionnal bass player, a classical keyboard wonder and a utterly great drummer/vocalist get together? Very low. On top of that, any of those were more than 22 years old! Man, before 22 years old! So creative and mature. Even Yes, Rush or Pink Floyd didn't top that. I'm sorry, but at 22 a guy is still as stupid and spotty as he was at 18. Guys usually don't grow up (mentally) that fast. Good lord, talk about beating the musical odds flat! Genesis founded their definite sound in Nursery Cryme. The sound is strangely complete, even with the new crew. Phil Collins is (to me) the reason why it gelled so well. The same reason why it gelled when Ringo Starr joined the Beatles: humility and good humor. Genesis needed to loose a bit. Hackett is not the type of guy to loose up (maybe with a keg or two). He's a typical Englishman. But not Collins. Bristish accent but Benny Hill attitude. A great mix of talent without the head in the clouds. Musical Box (enough to create a play but only 10 minutes), Giant Hogweed (Dream Theater's great inspiration), Seven Stones ( less known but rewarding) and the Fountain of Salmacis (mellotron grandeur). All over-the-fence classics, at least 5, with even at first, typical Genesis signature. Plus, the album benefits the buzz of 'better producer with new dynamic and new friends', without the money factor that ruins a lot of bands... so there's a lot of place for innocence and the craving for signing behind a mask. Collins-Hackett-Rutherford-Banks-Gabriel...a combination too good to be true and that will probably never be repeated ever again... by kids so young."
    },
    {
      "reviewer": "daveconn",
      "date": "Posted Thursday, April 22, 2004",
      "rating": 4,
      "text": "The first great GENESIS album? They had clearly crawled beyond the pretty cages of \"Trespass\", fueled by the imagination of fairy-tale-fed minds. And yet for every audible precedent (the role-playing vocals of \"Harold The Barrel\") is an antecedent (the timid, Trespass-like opening of \"The Musical Box\"). I've always taken \"Nursery Cryme\" as an album in transition, sometimes straying far into the woods yet dropping breadcrumbs back to \"Trespass\" lest they lose their way. The addition of Phil COLLINS and Steve HACKETT does change the sound of GENESIS, but no more than Peter GABRIEL's heightened sense of drama or Tony BANKS' increased use of the mellotron.The wonder of \"Nursery Cryme\" is that the band so quickly lost their self-consciousness, diving headlong into their art. Writing a song like \"The Return of The Giant Hogweed\" took guts as much as talent, as did \"The Fountain of Salmacis\". It's on these heavier tracks, epic in tone, where a window into \"Foxtrot\" is found. Listeners will quickly hear elements of \"Get 'Em Out By Friday\" in the tale of the poisonous plant, while \"Salmacis\" taps the same rich mythological vein that has provided the setting for subsequent masterworks.Yet \"Nursery Cryme\" isn't all elastic nightmares: \"For Absent Friends\" is one of their prettiest songs, while \"Harlequin\" is the sort of medieval poesy you'd find on Anthony PHILLIPS' \"The Geese And The Ghost\". As good as these tracks are, it's the sublime \"Seven Stones\" that stays with me, a song that would make my short-list of classic GENESIS works. The balance of light and dark tones (and you can credit COLLINS and HACKETT for much-needed contrast) makes \"Nursery Cryme\" a more ambitious album than \"Trespass\". Compared to a \"Foxtrot\" or \"Selling England...\", this record may suffer from a little stiffness, but it's greatness in the act of creation."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Saturday, May 1, 2004",
      "rating": 5,
      "text": "Along with Foxtrot this album shows Genesis at the peak of creativity, the band had already joined the incredible Steve Hackett, and a great drumer but lousy vocalist as Phil Collins.Even though there's not a dramatic change since Trespass, this album shows a more mature band that had already developed a mysterious and atmospheric sound that was their trademark until W&W (even though this sound was more evident until Foxtrot), mostly because of Steve Hackett's absolutely unique guitar and Peter Gabriel's amazing voice.The Musical Box is one of the best songs from Genesis catalogue, the music grows in intensity until they reach an explosion of energy, the lyrics are incredibly complex and imaginative. Other masterpieces are Fountain of Salmacis and the sarcastic Harold the Barrel.The weakest song IMO is \"For Absent Friends\" a filler sung by Phil Collins, not as bad as More Fool me, but absolutely out of place in this masterpiece.A true gem that every progressive fan must have."
    },
    {
      "reviewer": "Proghead",
      "date": "Posted Sunday, May 2, 2004",
      "rating": 5,
      "text": "This album still sounds much like their previous album, except not so somber. And of course, \"Nursery Cryme\" marked the change in the lineup that will define them for the next few years. And that's the presence of a permanent drummer, Phil COLLINS, and of guitarist Steve HACKETT (since Anthony PHILLIPS had a problem with stage fright). The music is stronger, more upbeat, and full of great classic stuff like \"The Musical Box\", \"The Return of the Giant Hogweed\", and \"The Fountain of Salmacis\". I really can't understand why \"Halequin\" gets trashed on, because I find it an amazing acoustic ballad. \"For Absent Friends\" is the first song Phil COLLINS sings lead on, and it's hard to believe what he'll be doing 10-15 years later (like on \"No Jacket Required\" or \"Invisible Touch\"). \"Harold the Barrel\" finds the band having a sense of humor, something they never had on \"Trespass\". I remembered when I first bought this LP back in 1993, I kept imagining the girl on the cover with the croquet mallet was Peter GABRIEL himself, and the head she was about to strike was Phil COLLINS.I was awfully impressed with \"Nursery Cryme\", since I had my fill of '80s GENESIS by that point, and frankly sick of it, and it was refreshing to hear music that was very far removed from the plastic, synthetic, digitized sound of \"Invisible Touch\", and it was still GENESIS (of course, GABRIEL and HACKETT were long gone by the time of \"Invisible Touch\"). Classic album, in my book."
    },
    {
      "reviewer": "Hibou",
      "date": "Posted Sunday, May 2, 2004",
      "rating": 4,
      "text": "What more can I add about this legendary album: it made history and is considered among the top that helped pen the term 'progressive rock'. If Lewis Carroll had written horror stories for children and some musicians had decided to put them to music, \"Nutsery Cryme\" is what they would sound like. The eccentric lyrics, delivered with a child-like innocence by Peter Gabriel, are a bone-chilling experience. And the music, alternating between the melodious and the downright chaotic, is a perfect complement to it. This is the first 'real' GENESIS album in my books. For details, simply read what fellow reviewers say below. As far as I'm concerned, every track on it is a gem."
    },
    {
      "reviewer": "richardh",
      "date": "Posted Thursday, June 10, 2004",
      "rating": 4,
      "text": "Musically this is a big leap from Trespass with the introduction of Collins and Hackett clearly adding greater weight to the proceedings.Served up are 3 classic prog songs in 'Return Of The Giant Hogweed','The Musical Box' and 'Fountain of Salmacis' which show the distinct and highly original Genesis sound already developing apace.However the rest of the album is not quite up to this high standard and with the lifeless production generally dragging things down (horrible drum sound!) I have to give this a 'Scrooge like' 3 stars only."
    },
    {
      "reviewer": "Peter",
      "date": "Posted Monday, June 21, 2004",
      "rating": 5,
      "text": "In 1971, prog doyens Genesis released their third album -- and first true masterpiece -- NURSERY CRYME. The band's sound, songwriting, and lineup had matured and solidified at this point, with definitive Genesis guitarist Steve Hackett steps in for the regrettably stage fright-stricken Anthony Phillips, and superlative percussionist and secondary vocalist Phil Collins replacing John Mayhew on drums. With NURSERY CRYME, the tremendous promise of the excellent (if a trifle uneven) forerunner TRESPASS was now made manifest, and appreciative fans were treated to some of the most imaginative and hard-hitting music to yet emerge from the evolving genre of progressive rock.The album has the perfect balance of raw, almost scary power and contrastingly airy beauty that makes early Genesis so compelling. For my tastes, each of the seven songs here is a fully-realized winner. Longstanding fan favourite \"The Musical Box\" (which served as the inspiration for the terrific Paul Whitehead cover art), from its ethereal opening, to its explosive ending some ten minutes later, contains all the necessary elements of a quintessential Genesis track: Hackett's guitar is simply spellbinding, Gabriel's voice is by turns delicate and dauntingly powerful, Banks' church-like organ sound is masterful and moving, and Collins' drumming, especially his cymbal work, is particularly adept. Factor in great lyrics, some nice flute from Gabriel, and Rutherford's room-shaking bass and bass pedals, and you have all that one could reasonably desire in a classic Genesis track!After the thunderous climax of \"The Musical Box,\" the Collins-sung ballad \"For Absent Friends\" offers a welcome, calming and nostalgic respite, admirably showcasing the new drummer's considerable vocal abilities. Then, the science fiction-themed \"The Return of the Giant Hogweed\" witnesses a return to grandiose song structure and creepy, storytelling lyrics, as ambulatory, revenge-bent predatory plants strive to exterminate the human race that had foolishly sought to \"enslave\" them.The next track, \"Seven Stones,\" is a dignified and burnished gem of a song which, replete with mellotron, deals with deliverance from earthly danger through the supernatural agency of seeming chance. Collins' drums, and Rutherford's bass are notably good here.\"Harold the Barrel\" reveals a Genesis that are able to combine black humour and pathos, as Gabriel and company don multiple personas to tell the tragi-comic tale of a browbeaten restaurateur who manages to retain his dignity only through effecting his own demise.The following song, the lovely and sparkling \"Harlequin,\" has long been a personal favourite. This shorter piece finds Gabriel and Collins harmonizing in very nice fashion atop a simple and pretty tune founded upon twelve string, and tastefully understated bass, keyboards and drums. Beautiful!Finally, on \"The Fountain of Salmacis,\" the band delve into the fertile inspirational ground of Greek mythology, relating how, through divine intervention, the demi-god Hermaphroditus and a lustful naiad (or water nymph) were \"strangely merged -- forever to be joined as one,\" thus explaining the origins of the dual-sexed biological oddities known to science as hermaphrodites. The lyrics are pure poetry, while the music, with sweeping mellotron and percussive bass, imparts a fittingly epic feel, and brings this terrific recording to a majestic close.Thus, I give NURSERY CRYME the highest possible rating of five well-deserved stars, and exhort all fans of classic progressive rock to experience (or re-experience) one of the stellar works of the art form. NURSERY CRYME represents Gabriel-era Genesis at its resplendent best, and is, in my considered opinion, every bit as essential as the more frequently-cited favourites FOXTROT and SELLING ENGLAND BY THE POUND. Brilliant!"
    },
    {
      "reviewer": "Chris S",
      "date": "Posted Monday, July 5, 2004",
      "rating": 5,
      "text": "The Musical Box and The Fountain of Salmacis alone give this album a five star rating, but it a remarkable prog album in every sense of the word. Absent Friends shows what talent the voice of Collins has. Hackett's guitar contribution so much more inventive than Anthony Phillips. Harlequin is beautiful too. A really consistent effort even taking into account the bombastic Hogweed track."
    },
    {
      "reviewer": "James Lee",
      "date": "Posted Sunday, July 18, 2004",
      "rating": 4,
      "text": "I'll never forget hearing \"Nursery Cryme\" for the first time- I went to a high school classmate's house after classes on a typically grey upstate New York late-winter afternoon and smoked pot (for the third time, but this was only the second time I actually 'felt it'). Devouring half a bag of pizza-flavored 'Combos' was most likely not the album's fault, but the memorable, transcendant experience wasn't solely caused by the THC.No need to restate what everyone knows; \"Nursery Cryme\" is where the 'classic' line-up of the band and the resulting development of GENESIS' characteristic musical signatures happens. It's not the quantum leap that we saw between their first and second albums, but more akin to the difference between YES' \"Time and a Word\" and \"Fragile\"; the new members brought enough inspiration and skill to hasten the pre- existing development of the others' musical explorations. To put it simply, it was the difference between 'good' and 'great'.\"The Musical Box\" singlehandedly shows us what the new line-up had to offer; while the opening minutes seem like a honed continuation of the best parts of \"Trespass\", once the harder section kicks in it is unlikely you'll further mistake the two albums. The band has obviously shed some of the timidity that veiled most of the previous album in mist- the lyrics are also more direct, and conversely more adventurous. Gabriel is still hiding in the mix more often than not, but to his credit he's more likely to make a dramatic and emotional outburst like the demanding plea in the song's climax- which Hackett's double- tracked guitars punctuate nicely. Not only an impressive percussionist, the newly added Mr. Collins demonstrates his admirable vocal work on \"For Absent Friends\". Though brief, it is a fine example of the sometimes buried emotional capabilities that let GENESIS rise to the top of the progressive pack- another facet being the unsettling but contagious humor that we first see clearly in \"Harold the Barrel\". \"The Return of the Giant Hogweed\" is another daring (and often succesful) attempt at a long musical tale, which also contains some interesting guitar experimentation among the generally harder sounds. The tenderness that begins \"Seven Stones\" is but one of the evocative moods that the band sketches in the song's duration; the more truncated \"Harlequin\" furthers the pastoral quality and achieves in less than three minutes what much of \"Trespass\" had stuggled to portray. Finally, \"The Fountain of Salamacis\" links a number of disparate elements, from the jazzy drumming to the symphonic crescendos, into a cohesive and flowing whole. Oddly enough, while it brings the album full circle with the approximate style of the opening tack, the piece itself seems to lacks some closure; the final rolling climax sounds a bit like an add-on.This exemplifies my only real concern with the album; like the other two that make up classic GENESIS trio of albums, the musical moments are stellar but somewhat interchangeable; there are many passages on \"Nursery Cryme\", \"Foxtrot\", and \"Selling England by the Pound\" that feel like they could be extracted from their respective songs. I can imagine the band coming up with a musical idea and throwing it into an existing song, or needing to fill a section and shuttling through various ideas to see what will work. That's relatively standard practice, especially among the more democratic bands, but for some reason it seems more apparent here than elsewhere. Minor misgivings aside, this is almost an essential disc- perhaps slightly less so than the two that follow, but still highly recommened for any comprehensive progressive rock collection."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Tuesday, August 24, 2004",
      "rating": 5,
      "text": "What an album! Yeah ... this album represents my first introduction to the band as my big brother, Henky, at that time in 70s gave me a tape of this album plus a local music magazine AKTUIL that featured the band. He told me:\" This is the music that you should listen to. Enjoy this tape while you're reading this article!\". WOW ... what an instruction man! I followed his instruction ... and ... ghuszzzz .... \"The Musical Box\" BLEW my mind man! What sort of music these guys were playing? I just didn't get it, really. But I was amazed with the organ intro of this track. Even though this track was bit hard for me to absorb, it's not an upbeat music probably, but I did appreciate the uniqueness of music this band had produced.That was not the end. The more I played the tape, my ability to absorb this album had grown significantly and I did enjoy almost any single track but \"For Absent Friend\" (as it was not rocking). \"The Return of The Giant Hogweed\" was really strange kind of music for me at that time. But I appreciated the composition. One track that made me CRY was \"The Fountain of Salmacis\" uuugh .... mannnnnn .... brilliant songwriting!!!Am so fortunate that my brother had taught me the \"right\" direction of the kind of music that I should love. Once I love this album, I can enjoy many many albums in the vein of progressive rock. It's a MASTERPIECE. It's not a question of whether I'm too generous or not with rating, but definitely this album is FIVE STAR. Rating 5/5. Gatot Widayanto, Indonesia."
    },
    {
      "reviewer": "Guillermo",
      "date": "Posted Thursday, October 7, 2004",
      "rating": 5,
      "text": "This was the first GENESIS` album that I have listened in early 1979. This album has a better recording than \"Trespass\", with a better sound for the drums, particularly. This album is strong and energetic. There is a good balance between the music of the band and the stories and the theatrical vocals of Peter Gabriel. My favourite songs are \"The Musical Box\" (one of the heaviest songs from Genesis), \"Seven Stones\" and \"The Fountain of Salmacis\". This album has a stronger presence of the Mellotron, which is used very well in \"Seven Stones\", and particularly in \"The Fountain of Salmacis\". Phil Collins shines in this album. This line-up sounds very good. The band sounds as a whole team by contributions of all the members. A very good album."
    },
    {
      "reviewer": "The Prognaut",
      "date": "Posted Monday, November 22, 2004",
      "rating": 4,
      "text": "Since everything has pretty much been said regarding this thirty-three year old chapter in the pages of prog history now, far beyond my desire of describing what I've been listening to in here for a long time, I rather tell you about how I discovered the sound of GENESIS. Certainly, \"Nursery Cryme\" was my first revelation to the never-ending world of magic and imagination of the British quintet guided by chameleonic Peter GABRIEL. Back in the early decade of the nineties, when I was barely 16 years old and still getting indoctrinated to the study and appreciation of progressive rock, I got this 1971 production as a \"B\" side to a mixed tape that contained several of the so-called \"best of prog rock\" prologues to those days and the enchantment of GENESIS upon me irremediably started from the moment when I flipped the tape over and into the cassette recorder and \"The Musical Box\" kicked off. The feeling still lingers on and even still, I get the creeps, just like the first time I ever played it.That opening scene, went on for over ten minutes, which I enjoyed one by one. Ever since I listened to Peter GABRIEL's voice for the first time, it got carved in the back of my mind instantly. I even tried to impersonate the peculiar pitch of his voice. And even though, my English wasn't all that good back then as I presume it is today, I managed to learn the lyric to the song by heart. From the first set of strings played in the beginning to the last chord twanged off here, my senses got sucked in the execution entirely, leaving no room for me to move or to completely understand what I just gambled on to listen to, and I knew moments later, that I lost the musical challenge by winning over a whole new sensation.Then, very softly, \"For Absent Friends\" came and went, throughout the melodic sound of tuned up guitars, preparing the expectation for the upcoming track on the tape. And some entrance I must say, \"The return of the Giant Hogweed\" has never gone out through the door in my head ever since. The flabbergasted and compassed sound of the electric guitar held in hand by master Steve HACKETT cages the sound of what appeared to be a drum kit struck by Phil COLLINS. The song follows a lineal, devouring stream just to the point where a soft piano, displayed marvelously by skillful Tony BANKS, breaks into the scene and everything becomes mighty challenging to the listener from there and onwards the end of the road for the song.So far, the album was running exquisitely intriguing to my ears I must say. Then, \"I heard the old man tell his tale.\". Imperturbably, while ventilating the remaining air in the room, \"Seven Stones\" took the fourth step onto the next episode of this album. The sacred sound of a lonesome mellotron revealed what was going to be quite an epopee. Like depicting the sound of breaking waves through the story carefully described over the lyric to this piece, the shyness of GABRIEL's hiding flute develops the plot right in the middle of the song, gathering together the notes of an impromptu organ and a blindly perceived bass, mystically handled by Michael RUTHERFORD. The instruments are maneuvered simply delightfully, and each one of them provides the proper amount of solemnity the entire composition claims for. Unrepeatable display of accompaniment, just like that.\"Harold the Barrel\" is the suitable opportunity for Peter GABRIEL to finally go into character. Throughout the three lasting minutes that describe this playful relate, the anchorman of the band experiences ten different changes of costume. A fresh act that deserves nothing but complete appreciation. The instrumentation here is rapidly distilled, where the impatience and desperation of a drum kit that keeps the beat, the piano that's stricken incessantly and a guitar that shows up every now and then, are the proven facts of how enjoyable a short composition could get. At its turn, \"Harlequin\" balances the frame with notes of tranquility that detach from the strings of a beholding acoustic guitar.The epilog to this marvelously composed and arranged masterwork, provides the proper disclosure for the last six chapters related in here. \"The Fountains of Salmacis\" describes, in one single take, what this third album by GENESIS is all about. Providentially, every instrument collapse into an avalanche of emotions, discharging such energy that can barely be put into words. It was until this closing scene, where I could wrap my senses into some musical voraciousness. I got completely blown away the first time, and I still get to this day where I'm here before you in the shape of an undeserved review to a majestic piece of work. The fact of me acting so viscerally and daring to rate it four stars only, is due the lack of understanding I had back then towards the band to the conception I've got now, built through the years of listening to the sound of GENESIS. Meaning, I could've numbered it five starts, given it the masterpiece feature, but back then I didn't know there were such incredible albums to come after \"Nursery Cryme\", making GENESIS surpass all the possible expectations they might've set upon their reaches and upon themselves as prominent musicians. This album certainly has been projected as an incentive to so many generations, to so many bands and to so many side genres besides progressive rock. Proudly, an excellent addition to any musical collection."
    },
    {
      "reviewer": "Bj-1",
      "date": "Posted Thursday, December 2, 2004",
      "rating": 4,
      "text": "An improvement over their previous \"Trespass\" album. Anthony Phillips and John Mayhew quitted after \"Trespass\" but was greatly replaced by Steve Hackett and Phil Collins. Like on \"Trespass\", the production remains muddy and thick, but the music is highly enjoyable and impressive. \"The Musical Box\" is the best track here along with the closer \"Fountain of Salmacis\". You can cleary tell here that Genesis have found their true style here, and the dynamic songwriting and the excellent musicianship is great throughout.Peter Gabriel's theatrical lyrical style also had came more clear here, with tracks like \"Harold The Barrel\" and \"The Return of The Giant Hogweed\" being excellent examples of this, and together with the strong and adventurous melodies it's clear here that this band was something unique at their time. There are no really weak spots on this album musically, all of the tracks are enjoyable, though the shorter tracks might be considered as \"filler\" for some people, but I think those tracks add a very nice charm to the album as well as being good breaks after the more violent styles of the longer tracks. The only thing that I truly don't like with this album is the production. 4.5/5"
    },
    {
      "reviewer": "el b�thy",
      "date": "Posted Monday, December 20, 2004",
      "rating": 4,
      "text": "An absolute must have in any prog rock collection!At first I really did not get this album. Yes, I thought it had a few good songs and yes, Gabriel does sing very good. but \"what's so special about it?\" I asked myself. Well, it took me some time, but one day it just made click and .woooow!!! Great feeling, fresh ideas (for the time anyway), terrific lyrics, superb singing but also something else. Musical Box! Talk about a SONG! My absolute favorite Genesis song, it has everything, great ideas, the vocal melodies, and although the instrumentation was not polished enough, at least not as we know Genesis would get, I really like the rawness of it, and of course every time I hear Gabriel siings \"and I touch the waaaaaaaaaall\" uuuh. goose bumps all over. Absolutely, positively THE song of the album and their career.The rest of the album is also very good; I specially like the shorter For Absent Friends and Harlequin, but no song some close to the Musical Box!"
    },
    {
      "reviewer": "slipperman",
      "date": "Posted Friday, January 7, 2005",
      "rating": 5,
      "text": "Somehow the entire vibe of 'Nursery Cryme' evokes the weird underbelly of Victorian culture, a little of which is depicted in the artwork. It's definitely got an \"old-time-y\" feel, while also being a shining example of a band pressing nowhere but forward. A true prog masterpiece that I can't find any fault with.The addition of Phil Collins on drums and Steve Hackett on guitar brought the band to a whole new level, Hackett's wide array of effects only beginning to reveal themselves on this album. In Collins they gained an effective back-up vocalist as well as a stellar drummer. It's him on \"For Absent Friends\", is it not? It's rarely discussed or revealed, more people claiming 1973's \"More Fool Me\" as his first lead vocal for Genesis, but this song seems to show otherwise. (He's also all over \"Harlequin\".) \"For Absent Friends\" is an innocent enough track, a mild rest-stop between the ultra-dramatic intensity of \"The Musical Box\" and regal \"The Return Of The Giant Hogweed\". \"The Musical Box\" is to this era of Genesis what \"The Knife\" was to the 'Trespass' era, a definitive piece, perfectly written and totally convincing. Gabriel takes on the characters with ease, and I much prefer this studio version over the way the vocal was treated live--I feel like Gabriel went too far with the old man's cracking, croaking voice in the song's final moments. Sure, he was getting totally into character, but it seemed to be at the expense of the magnificent melodies he creates here.Other gigantic Genesis epics are here in the form of \"The Return Of The Giant Hogweed\" and \"The Fountain Of Salmacis\". Tony Banks really lays down solid foundations on these awesome tracks, getting the most out of his limited keyboard arsenal (which exploded in size in the band's next phase!). The synergy of the Rutherford/Hackett team takes off marvelously inside these songs, Rutherford owner of one of the best bass sounds in prog at this time.Solid and slightly more sensible (less manic?) tracks appear too. \"Harold The Barrel\" is a fun and nutty romp, Gabriel at his eccentric tale-telling best. \"Seven Stones\" is an underrated song, one they should've played long into their career, a stirring tune that recalls the melancholy of 'Trespass' in the best way. \"Harlequin\"'s vocal harmonies carry an almost Crosby, Stills & Nash tone to them. \"Yuck!\" you might say, and I might too if the song didn't expand outward to add another comforting bit of color to this already well-rounded album.It's strange that Tony Banks says they were disappointed with this album once they'd completed it, feeling they hadn't progressed far enough from 'Trespass'. While the link between 'Trespass' and 'Nursery Cryme' is closer than that of 'From Genesis To Revelation' to 'Trespass', the tunes are all brighter and more dynamic, everything just a little more involved and complex. The instrumentation is allowed to shine thanks to their ever- improving skills and the lift in production quality--still raw at this point, but there's such charm to John Anthony's work, it suits the material well. So I'll have to disagree with the master, this is no let-down, just one of the best Genesis albums you'll ever hear."
    },
    {
      "reviewer": "memowakeman",
      "date": "Posted Monday, March 14, 2005",
      "rating": 5,
      "text": "My favorite Genesis album so far, no matter how good are Foxtrot or Selling England, no matter Supper�s Ready or Firth on Fifth, Nursery Cryme has been the album that caught all my attention and made me fall in love with this band (obviously Gabriel era).The music here is excellent all te members playing really well and making a more mature sound than Tresspass, maybe this is the album that started all, i mean the one that woke up the monster and shows the band in their highest and most beautiful moments.The Musical Box is a magnific song simply amazing, where Hackett�s guitar is simply outstanding, this is the first song and my favorite, imagine that the first songs shows a promising album, here is true, the album as a whole is magnific, the other songs i love are \"Giant Hogweed\" and \"Fountain of Salmacis\" both are memorable songs, the shorter ones are also great songs, a masterpiece."
    },
    {
      "reviewer": "Eetu Pellonpaa",
      "date": "Posted Friday, April 1, 2005",
      "rating": 4,
      "text": "To me this is the second best album by this band along with the \"Trespass\". I simply love the aesthetics and moods they have managed to create to the best peaks of this album. The highlight for me is \"The Fountain of Salmacis\", maybe the best song they have done. There's great mellotrons and bass lines on it, and the composition is wonderful, describing the Greek tale of Naiad Salmacis attempt to rape Hermaphroditus, evoking divine intervention to merge both characters to entity of both genders. There are some pretty unique arrangements in it, like two similar verses with different lyrics (this effect was pioneered on their first album). \"The Musical Box\" and \"The Return of The Giant Hogweed\" are also marvelous tunes, holding some calm sequences and mostly roaring with aggression. The themes for lyrics are also quite personal, album cover design reflecting this quasi-Victorian feeling. Especially the inner part of the gatefold sleeve with lyrics and decorative illustrations is in my opinion really beautiful. As an album wholeness, there are some shorter song slightly unbalancing the overall quality ? an observation I believe many enthusiast Genesis listener might not agree."
    },
    {
      "reviewer": "con safo",
      "date": "Posted Wednesday, April 13, 2005",
      "rating": 5,
      "text": "An essential album for any genesis fan. After Trespass, Genesis had taken many leaps forward, and though not fully matured as they would become on later albums, \"Nursery Cryme\" is still an exceptional album with a couple minor quirks.The album opens with one of my favourite Genesis songs \"The Musical Box.\" Everytime i hear this song my mind is blown. It starts slow, eventually reaching an almost orgasmic climax that words fail to describe. Hackett's guitar work is unparralelled, and Gabriels original writing style and rich voice are fantastic.The next track is probably the most unneeded on the record, \"For Absent Friends\" is a short ballad featuring Collins on vocals. Nothing Spectacular. \"The Return of The Giant Hogweed\" opens with some of the coolest keyboards ive ever heard, immediately engaging. The story behind the song is a far fetched tale of giant plans exacting their revenge on the human race. Classic Gabriel.\"Seven Stones\" is one of the most under-appreciated songs on the album. I personally really like the song, and the chant like vocals are very chilling. Great drum work by Collins in this one. \"Harlequin\" is another softer ballad featuring some good vocal melody. Again, nothing groundbreaking.The final track, \"Fountain of Salmacis\" is an atmospheric track that truly takes you to another world. Very intense buildup, and an awesome concept.Overall a great album with a couple quirks, but definitely worth your money."
    },
    {
      "reviewer": "NJprogfan",
      "date": "Posted Friday, April 22, 2005",
      "rating": 5,
      "text": "What a difference two musicians make. After the sublime \"Trespass\", with the addition of two new artists, Genesis breaks out with the blueprint for neo-prog and the Italian movement. One gets the feeling when 'The Musical Box' starts up that it's more of the same. Wrong! When Hackett's guitar kicks in it's a whole new sound for the band. Sure, there are leftovers from Trespass, (For Absent Friends, Harlequin; both beautiful btw) but the rest broke new ground and they didn't look back. Banks mellotron work on the album is extraordinary. On 'Seven Stones' it's beautiful and sad, on 'The Fountain of Salmacis' it's majestic and on 'The Return of the Giant Hogweed' it's thunderous. I'm sure by that time (1971), the mellotron wasn't used as magnificently since 'In The Court of the Crimson King'. Funny, I've been listening to this album for years and I just now noticed how much Phil Collins sings, be it backing Peter or totally up front. It's the true beginning of their signature sound; theatrics, aggressiveness, and beauty. So many other bands tried to emulate them, but really...do they compare? And for some, their best work is still ahead...Folks, this album is monumental and important. It deserves the five stars easily."
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Sunday, May 22, 2005",
      "rating": 4,
      "text": "Symphonic Prog at its finest. Peter Gabriel and Company really had improved since their introduction into the music world. Gaining two crucial members on this album, Steve Hackett and Phil Collins, this is the beginning of the most popular Genesis era. The playing is solid by everyone, but the sound quality mars the album from total perfection.The album opens with a fan favorite, the Musical Box. Going through many different shifts and tempos, this song is one of the best songs Genesis has to offer. The keyboards and guitar create a perfect blend that set a great mood. This is one of the first Geneis albums to feature the classic Genesis sound. Heavy keyboard usage and incredible vocal lines create the ultimate Genesis songs. Other songs worthy of mention are the Return of the Giant Hogweed and the intricate and immaculate Fountain of Salmacis. Steve Hackett is a great addition, he would provide some of the best ingredients into the Genesis mix in the years to come.Overall, this album is a landmark achievement for Genesis. The musicianship is great, the lyrics are great, the artwork is great. The only problem I had when I first approached the album was the sub-par sound quality."
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Tuesday, June 14, 2005",
      "rating": 4,
      "text": "When Steve Hackett joined Genesis the sound of the band dramatically changed. Hackett has always been a fan from Mr. Fripp so he decided to put a more agressive element to the more acoustic sound on \"Trespass\" on which Anthony Phillips does a good job but Hackett has lots more to offer. On the opener \"The musical box\" Hackett delivers a fiery guitar solo in the end that suits perfect to the dramatic climate in the final. So welcome Mr. Hackett, there you are! Other great songs are \"The return of the giant Hogweed\" (who dare to say that Genesis sound like softies..?), \"Seven stones\" (wonderful keyboards, vocals and shifting moods) and \"The fountain of Salmacis\" (one of the best tracks ever recorded). I rate this album for five but four stars because not every track is at the level of aforementioned top notch compositions, I prefer \"Foxtrot\" as their best record in those years (69-73). Nonetheless, on \"Nursery cryme\" Genesis prooved their hugh potential."
    },
    {
      "reviewer": "Eclipse",
      "date": "Posted Wednesday, July 6, 2005",
      "rating": 5,
      "text": "Maintaining the same fairy-tale feel found on their previous masterpiece, Trespass, here we have a less dark album but still magic and more pleasant to listen to. The cover art reflects exactly the content of the album, it has that story book feel and is a travel to the land of phantasy. Did anyone realised that the ground here also appears smaller on the Foxtrot cover? And that the opening track is quoted on Willow Farm? Actually, Nursery Cryme and Foxtrot are my absolute GENESIS' faves, both deliver top quality emotional music in an amazing epic delivery, something that only good old 70's symphonic prog could magically deliver to us.The album opens with \"Musical Box\", an embryo of \"Supper's Ready\" in terms of structure. This song contains several different faces, from the mellow parts until the quasi-metal middle section being exciting and relaxing at the same way. This is the first REALLY amazing GENESIS' song, and thing tend to only get amazing from here too. \"Return of Giant Hogweed\" follows a short Collins' sung ballad and is also a great epic with a sci-fi theme attached to it. Once again Gabriel shows how versatile he can be with his voice, at the same way he did on \"The Knife\". With its classical music influenced intro, the song has fantastic parts and shows a high level of maturity of the band members in terms of compositions. \"Seven Stones\" kicks in and it is the most moving moment of the album. It has a tear-producer mellotron solo at the ending courtesy of amazing Mr. Banks and, like \"Harlequin\" (a short acoustic piece placed before the closing epic), shows great vocal harmonies by Phil and Peter. \"Harold the Barrel\" is an embryo of \"Willow Farm\" and \"Battle of Epping Forest\", a funny trakc with a ironically tragic content within it. A cool song that has a nice piano part at the ending to flow well on \"Harlequin\". The closing song, \"Fountain of Salmacis\", is literally a class of mellotron and guitar. The band mates are playing their instruments amazingly well and Gabriel shows nice levels of voice here. It has a groundshaking guitar solo at the middle with clearly strong classical music accents, and this song apparently inspired ANGLAGARD on the second song from their album Epilog.Overall a fantastic album that makes an excellent sequel to Trespass and shows how strong the band's ideas could become. For me, Trespass, this one and Foxtrot work as one full album together, all magic and honestly don't have one single minute of weakness in them."
    },
    {
      "reviewer": "Seyo",
      "date": "Posted Monday, July 25, 2005",
      "rating": 5,
      "text": "On the occasion of my 100th review I want to pay tribute to my first prog album I ever listened and adored.Yes, it is \"Nursery Cryme\" and I can still remember the pure magic it radiated from my cheap cassette player of that time and even cheaper Chinese tape on which this album was recorded. Actually it was only 30 minutes side of a C-60 tape, featuring only \"the best of\" NC: The Musical Box, Giant Hogweed, Harold the Barrel and Salmacis, chosen by a friend who owned the LP record. It was amazing experience and I was immediately taken by the odd silent-loud passages and emotional voice of Gabriel in \"Musical Box\". It was around 1980-81 and I was about 16 years old.Later on I would slowly discover the rest album songs and the genius of Hackett's guitar solo screaming, the pastoral 12-string and fuzzed bass of Rutherford with Collins' backing voice and jazzy drumming, and the eerie Mellotron and Hammond with strange Hohner keys by the virtuoso Banks. What a music!The Gabriel's lyrics are the subject of their own. Although not a native English speaker, I could still feel and sense (albeit not entirely understand) the poetic, epic, satire and horror of his tales that were just like taken from an ancient medieval myths and fairytales.This is very close to the classical music played with electric instruments. GENESIS arguably recorded subsequent better produced and composed albums with stronger concepts, but for me it all started here. From then on I dived into the exploration of wonderful world of different styles of \"progressive\" and \"avantgarde\" music and I still keep myself busy!I am aware this is rather personal review and maybe not so \"objective\", but nevertheless all the beginners in prog research are very much advised and highly recommended to approach this timeless masterpiece."
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Sunday, August 7, 2005",
      "rating": 4,
      "text": "This is the first Genesis album with the classic lineup, and the album in which they have found their sound. The moments of boredom (at least for me) of Trespass are not found here, and Steve Hackett provided great guitar playing that was not heard in the previous album.Musical Box Begins the album strongly and is in my opinion the best Genesis song until Selling England By The Pound. It starts softly, serene, and atmospheric with Nursery rhyme (hence the title of the album) influences, and later starts transforming into many different styles and moods including an amazing hard rock explosion. The finale is majestic, legendary, and has what I would call the Best Peter Gabriel vocal workout ever. 10/10For Absent Friends is a short pretty piece used that helps the album flow.The Return of the Giant Hogweed is an dynamic symphonic epic in which Tony Banks does his best to dominate the music with good organ riffs and Hackett is prominent with an electric guitar. 8.5/10Seven Stones is a pretty, yet not too memorable song that recalls the Trespass album. 6/10Harold The Barrel seems like a little play with Gabriel doing the character voices about a man about to jump off a building. The lyrics are amusing, yet the song feels out of place. 5.5/10Harlequin : Another pretty yet not that memorable song, but it prepares you for the last track. 6/10Genesis ends the album with one of their most creative and intense songs in their catalogue. They can create glorious moments with just that simple organ riff and its mellotron washes, and they composed smartly like that in all the rest of the song. The end result is a glorious emotional, and superb epic that finishes the album in a strong note. 9.5/10Get this album just for the 3 epics only, that is already enough. Unfortunately, this album is a little spotty for me, and I skip a few of the tracks sometimes. They will get better in their next 3 albums.My Grade : B+"
    },
    {
      "reviewer": "Starette",
      "date": "Posted Wednesday, August 31, 2005",
      "rating": 5,
      "text": "Nursery Cryme was the first Genesis abum I ever got. I write about it as if it were some years ago, really it was only a few months. After hearing The Fountain of Salmacis- I knew I had to get more, my ears had fallen in love with the song and since then, my love of Peter Gabriel-era Genesis has only grown more! This album is *almost* as good as Selling England by the Pound. In some parts- it's even better (I'm thinking of Return of the Giant Hogweed in comparison with the Battle of Epping Forrest). Therefore I still have their 1973 album as their highest in my ranking; this 1971 one is down by ONE step. But I cannot emphasize what a slight and shallow step that is.The Musical Box: Does it not strike you as odd that one of the best songs in the history of Progressive Rock just so happens to be about the rape of a little girl by an old man? In fact- the story's more complex than that: 9-year-old Cynthia chopped 8-year-old Henrys' head off with a croquet mallet then, when she found his music box which played 'Old King Cole'- his spirit appeared from it and turned into an old man. He then proceeded to rape her till his Nanny found them both and killed them by hurling the Music Box itself at them....good grief, WHAT a *screwed-up* idea! It's the best of its' kind I tell you- you can almost hear the Police inspecting the Genesis' band-practice- room for drugs. Such a disturbing theme for a song...and yet, I wouldn't mind playing it to my children. Peter Gabriel has the golden gift of being subtle, NOT explicit in his lyrics. The piece begins with an eerie acoustic guitar and Peter Gabriel's 'old-man' voice...or at least it seems he's putting on another kind of voice: if one listens carefully, they find there's a whiny and croaky touch to it. The playful flute, in duet with the guitar, give the music an old-fashioned taste and also suggest the conventional music heard by children when they hear a nursery rhyme sung at pre-school. A childs world is what the song conveys. Hence the song-name. Hence the album-name too. The flowing guitar is heard till drums, flute and guitar strum a few chords together in the same slow, changed rythmn and there's no other way to describe this certain chordal progression that's used apart from, well, VERY 1970s! It's fantastic and it has an air of romance about it, or a comforting air: as the chords have changed from low and minor (the \"sad\" key) to high and major (the \"happy\" key). After this sudden change in time-signature and melody, we have Phil Collins drums pick-up on a more complex and ever-changing beat, Tony Banks on his organ and the electric guitar: these three instuments build-up the song together for a while. Aah- the guitar riffs in this song- this part is really all about how cool Steve Hackett is!- A member we don't pay enough attention to. Not forgetting Mike Rutherford either, of course. The guitar riffs have an orgy (so to speak) for a long time- so lets all jump around as if we're in a mosh-pit again! Suddenly, everything is calm like the start of the song- only an acoustic guitar and Gabriel's voice to charm us. \"I've been waiting here for so long...and all this time has passed me by...\" The organ and drumbeat gradually lead up to what is essentially the 'catharsis' of the whole song: \"Why don't you touch me? Touch me, Touch me, TOUCH me NOW! now! now! now! NOW!\" If you know the song, you find it hard to get that bit out of your head for a while after even thinking about it. How can a song about a rape be so good? I don't know if this has ever made you wonder but it's certainly got me thinking.For Absent Friends: This song is just plain CUTE. It's more a song for children than us. A song I can play to my fundamentalist-christian neighbours WITHOUT offending them in one way or another. This is the first example of Phil Collins and his simple-formatted songs that I ever heard. Therefore: I like Peter Gabriel-era Genesis MUCH more. This song probably has a deeper meaning behind the lyrics but Honestly! It takes more than an acoustic guitar and a repeated melody to emphasize that meaning, let alone be 'progressive'. Pretty pop-tune but not very catching. More fool Me is his better effort.The Return of the Giant Hogweed: This is another one of the best songs on the album. The very START is memorable- Steve Hackett strikes you with a solid and fact-paced guitar-riff. Tony Banks plays the havard-organ at its coolest (I don't think I've ever heard an organ stretched to that extent before- synchronised beat and stacatto chords hitting the keyboard.) The melody is rather jazzed-up and with good use of falsetto in Gabriel's voice too. Especially when the Giant Hogweed are taking out their revenge on the Londoners who stole them from the Russian Hills: \"Mighty Hogweed is avenged. Human bodies soon will know our ANGER.... Kill them with your Hogweed hairs, Heracleum MantegazziANI....\" and here is my favourite bit: all instruments change chords at the same time as one another in the most powerful, head-banging, changing-beat and complex chordal progression Genesis will ever use! Nothing can top it, and if anyone sees the Belgian TV 1971 studio-concert of Genesis- you'll see how infatuated the gorgeous young Peter Gabriel is, himself, with this part! So much that he pretty-much dances with the microphone-stand, as you do.Seven Stones: This song actually took time to grow on me but when it did- I saw how it was one of the most peaceful songs in the world. The idea of there being 'seven' of something is such a cliched-convention- seen from both a biblical view and in greek mythology and elsewhere. At first this sounds like a beautiful love-song but, listening to the lyrics, it's about an old bastard. And he is one HELL of a bastard! He laughs at the worlds' despair and steals money from the farmer- for crying out loud! \"The old man's guide is chance'. I suppose the point of the song is to show that the man is 'old' but he acts as if he's 'young', or vice versa. This is a melancholy song that adds up to crescendoes and changes key everytime the chorus comes round. The line \"and the changes of no consequence will pick up the reigns from nowhere.\" adds a pleasant element of surprise to the song, in the way that it's presented. Watch out for the mellotron with the angry-sounding guitar at the end. The swinging-of-moods in this song sounds fantastic.Harold the Barrel: This song is rather Broadway with the piano playing hony-tonk style. It's the 'comic-relief' of the album- not one of my favourites but still enjoyable. Amongst the up-beat dance of it all- the piano does a few peaceful and slow, almost eerie solos. I mentioned before that this song was comic-relief but I just had a good look at the lyrics and now I'm beginning to wonder...as it appears to be about a restaurant owner who served up his own toes for tea, got hunted down by the police and is, by the end of the song, about to commit-suicide by jumping off a building...or maybe about to turn himself in to the police as there's nothing else he can do. Now, I have no idea what story Genesis based this one on but, either way, drama is incorporated into this song and done very well. This is one of those Genesis songs in which the band members sing as different characters in a plot: \"We're all your friends- come on down and talk to us son.\" \"You must be Joking!!\" \"Take a running jump!\" The soft and echoing piano chords, almost depressing in a way which makes up empathize with poor Harold, are great for leading on to the next song..Harlequin: For a while I thought Phil Collins did the main vocals for this as falsetto is used all the way through. This song is dreamy, floating, ethereal- the lyrics take us to another world and they set a calming scene for us. Arpeggiating guitars and gentle hi- hat drumming used. There's also a guitar chordal-progression and rythym during the chorus which is so 70s and reminds me of Battle of Evermore by Led Zeppelin (hopefully I'm not alone in thinking this). A Harlequin is an actor with a mask- not that it has much to do with the actual song but I thought I may as well point that out. This song is not legendary but it does make a good lullaby.Fountain of Salmacis: BRILLIANT!!! This is the first Genesis song I ever heard and it still gives me ear-gasms when I hear it: I don't think the spell will ever wear-off! The rising- falling-rising crescendo-decrescedo-crescendo-catch that Tony Banks has on his equipment have our attention immediately as does his jumpy keyboard-riff. Mellotron- use is excellent. Collin's drumming and Rutherford's bass are reminiscent of 60s jazz during the verse- and that's the kind of Jazz I actually *appreciate*. Greek Mythology! This song tells the story of Hermaphrodite- a young man who was lusted-after by a nymph called Naiad and who eventually became part of her in a fusing-of-the-genders miracle brought about by the gods. As a university student with Classical Studies as a major: I'm all for the story behind this song (\"Hermaphrodite- son of gods!\") Therefore, one of the first songs to get me into Prog has one of my favourite things written all over it- extremely exciting! Again- Genesis have put their theatrical talent into one of their songs and sung as different characters in a plot. Hermaphrodite: \"Away from me cold-blooded woman, your lust is not mine.\" Naiad: \"Nothing will cause us to part! Give me your guide..\" (sorry if any of those lyrics were inaccurate- corrections are more than welcome) And Steve Hackett shows his gorgeousness at the transition from song to typical-progrock-dance-sequence. The whole songs slows down at \"Both had given everything they had..\" This is a classic. Admit it.Remember- if you don't give music the chance to grow on you them you're not a very good listener of Progressive Rock. But this isn't the type of album that has to grow on you: this album BEGS you to listen! Apart from S.E.B.T.P,and possibly The Lamb Lies down on Broadway, no other Genesis album has quite matched this masterpiece."
    },
    {
      "reviewer": "Progbear",
      "date": "Posted Sunday, September 11, 2005",
      "rating": 4,
      "text": "The band continues on their forward course of progress. This one benefits from fresh blood. There was nothing wrong with Anthony Phillips' guitar playing, but Hackett's guitarwork is much more rock-oriented and authoritative. And he could do the folk-classical thing like Phillips, too. Collins, with his intricate jazzy leanings, was a marked improvement over the more pedestrian stylings of John Mayhew. And his distinctive backing vocals would become an important ingredient in Genesis' sound.Genesis' full-blown prog rock sound arrives fully-formed here, with the epic-length \"The Musical Box\" and \"The Fountain of Salmacis\", plus the mini-opus \"Seven Stones\", all stone classics. Much of the rest of the tunes are cameo folkie numbers resembling the works on TRESPASS. The exceptions being \"Return of the Giant Hogweed\" and \"Harold The Barrel\" which are more comical tunes. Unlike ELP's joke tunes, which feel forced and phoney, these songs show a lot of the band's personality just as much as the more \"serious\" ones.This was the first full-length Genesis album I ever heard, and it was an unforgettable experience. Definitely the start of the big things for them."
    },
    {
      "reviewer": "Prognut",
      "date": "Posted Friday, October 14, 2005",
      "rating": 5,
      "text": "With Collins and Hackett on board this sill be the golden line up of the GENESIS that all of us will love for ever!!!!!!!!!!!!! This one started the golden era for them. Progressive, Progressive, Progressive!! This one was the second album I bought, and \"Musical Box\" has been a track that always has been in my heart, becoming one of the classic GENESIS songs!! For some fans, not the prog-head, will require several listen to digest."
    },
    {
      "reviewer": "Atkingani",
      "date": "Posted Saturday, November 12, 2005",
      "rating": 5,
      "text": "A CLASSICAL work! I bought the vynil near Xmas 1972 (after saving hardly) as a gift for myself and never regret it.The four longer tracks are amongst the best prog-rocks ever:'The musical box' must be classified simply as unforgettable. If some distracted souls seek for a real progressive piece, show them this song. The engagement begins with the first chords and crosses the track in its entirety, ending in a surprising way. Singing and playing combine to make an almost perfect piece.'The return of the giant hogweed' contains all the darkness we should expect from a classical Genesis work. The way the music and lyrics flow make us think about the smallness of beast-man. Awesome!'Seven stones' is the crown's hidden jewel; but also shining and splendid. Probably the easier-to-hear of the album's longer songs but always keeping inside a good surprise like a gold insertion into a diamond. Brilliant.'The fountain of Salmacis', also the ending song, is one of the best finishing acts of a progressive album ever. There remains a sensation of emptyness after the farewell, a never ending will to get more and more and more...For the shorter tracks 'Harold the barrel' is amazing and also frightening and 'Harlequin' is quite pleasant.Gabriel continues in his peak (due to last for the next 4 years) and other band members are almost in the same level. Hackett and Collins (as a drummer) were real fine additions.Minus 0.25 star for 'For absent friends', only a filler. Total: 4.75 => 5; consequently reaching the masterpiece realm."
    },
    {
      "reviewer": "AtLossForWords",
      "date": "Posted Sunday, December 25, 2005",
      "rating": 4,
      "text": "Genesis' Nursery Cryme is not often given the amount of praise that the two suceeding albums Foxtrot and Selling England by the Pound do. Nursery Cryme is a slightly different composition from Foxtrot and Selling England by the Pound, but is no less of an album.Nursery Cryme has three Genesis classics, Fountain of Salamics, Return of the Giant Hogweed, and of course The Musical Box, which will forever be a reigning classic of the Progressive Music world. The shorter songs like Seven Stars and Harlequin also add to the quality of this album. It's in the shorter songs that proove an album's value. Nursery Cryme may not have the twenty mintue epic of Supper's Ready, but the overall song to song quality of Nursery Cryme is something to be recognized."
    },
    {
      "reviewer": "belz",
      "date": "Posted Wednesday, February 8, 2006",
      "rating": 5,
      "text": "4.5/5.0I would like to add something new, but what more to say about this masterpiece? This is a classic, along with Foxtrot and Selling England by the Pound. Personnaly, my favorite track is NOT \"The Musical Box\" although this is a great track. I prefer the rest of the album, as it is more soft and less commercial, with great keyboards and everything. That said, the whole album is great, from the beginning to the end. I do not consider this to be as good as Camel or Caravan, but this is a matter of taste at this level of music quality. Highly recommended!"
    },
    {
      "reviewer": "The Crow",
      "date": "Posted Friday, March 24, 2006",
      "rating": 4,
      "text": "Well, well... Maybe this will be sound strange for many people, but I have to say that I think that \"Nursery Crime\" is weaker than \"Trespass\" in my humble opinion. Reasons...First of all, I think that Steve Hackett was not yet totally adapted to the sound of this band. The contrast with Anthony Phillips is evident, and if I had to choice between the guitar sounds of \"Trespass\" and \"Nursery Crime\", I prefer \"Trespass\"... Of course, Steve Hackett made a great work on \"Nursey\", but sometimes is a little too strong and less variated than the Phillips's work, and he was not able to use the acoustic guitars so well. It has very much experimentation and heaviness, but for the style that Genesis were offering in the beginnings of the 70's, I think that the work of the previous guitarrist was more idoneous, more soft and with strong contrasts. This thing changed with \"Foxtrot\", fortunately. But on the contrary, Phill Collins is obviously better drummer than John Mayhey, so the band improved in this way.But after that, I have also to say that I love this strange sounds that Mr.Hackett's got from his guitars here... Like in The Musical Box, the solo in the middle of the song Is just great, strange, experimental... The use of distorted guitars is magnificent. And the end of this song has also another great guitar tune, with a solo that remerbers me to Brian May! Possible influence here?The general style of \"Nursery Crime\" is stronger than \"Trespass\", following the steps of The Knife. Is a less delicate, more direct album. And maybe less intrincated too. The song Harold the Barrel is a good example for that. Simple and direct symphonic rock act, offering a glimpse of what Genesis will do in the future in their short tracks. The guitars have a great protagonism in this album. While in \"Trespass\" the keyboards and Gabriel's voice were the keynote, Steve Hackett had the most relevant role in the album. I miss a stronger presence of Tony Banks and Mike Rutherfod here...Another memorable pieces of this album are The Return of the Giant Hodweed (is a tapping what I hear in the beginning of the song?) a definition of rock progressive in it's purest form. And Seven Stones and The Fountain of Salmacis are good too. For absent friends and Harlequin are good transition songs too... But sorry, I can't find here a song as good as Stagnation, with it's marvellous keyboard solo. Maybe The Musical Box is in the same level, but don't surpasses it.Conclusion: an obligated album if you like the 70's prog, but in my opinion, \"Nursery Crime\" is a transition between the great efforth of \"Trespass\", and the marvellous things to come..."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Thursday, April 6, 2006",
      "rating": 3,
      "text": "First, the good news. The creativity and imagination on this album is without peer, intriguing and surprisingly original for 1971. There are different sounds and rhythms on every song and the lyrics are wildly fantastic and deceptively intricate. The bad news is that the production quality is very low and embarrasingly juvenile. Even with the newer remastered cd I just got it sounds muddy and overly disjointed at times. I take into consideration that this was only their 3rd studio album and it featured two new members in Collins and Hackett and I give them a lot of leeway because of it. But there's really no excuse for the awful engineering and the producer's overseeing of the album as a whole. Yes put out \"The Yes Album\" and ELP released \"Tarkus\" at the same time and both of them are outstandingly tight arrangement-wise and truly high- fidelity. So where do I rank this one? It still possesses some of the best tunes in prog rock, especially \"Musical Box,\" \"Giant Hogweed,\" and \"Fountain of Salmacis.\" Peter was still finding his voice but his artistic enthusiasm still shines through and Phil's amazing drumming keeps the album on the up and up througout. But, again, the sound is amateurish and puts me off every listen and it's not something I can totally hold against the band members. It just seems like someone in their organization could have realized that other bands in their niche of music were turning out records that were revolutionizing studio techniques at that time and they could have sought out better producers and engineers to work with. Still a classic, but nowhere near SEBTP, The Lamb or even TOTT. Take this one with a grain of salt."
    },
    {
      "reviewer": "fuxi",
      "date": "Posted Sunday, May 21, 2006",
      "rating": 4,
      "text": "Not one of Genesis' mature masterpieces, perhaps, (I always fall asleep during 'Harlequin' and 'The Fountain of Salmacis', in spite of those mellotron crescendos) but still a fascinating album. 'The Musical Box' is one of the most powerful pieces in the Genesis canon, but I'm in two minds about its original (unremastered) version. On the one hand, I'll agree with some reviewers that the performance on GENESIS LIVE sounds rawer and more powerful; on the other, it's lovely to hear part of the piece played on acoustic instruments. When I bought the remastered version of this album a few years ago, I hoped Peter Gabriel would be turned up in the mix during the MUSICAL BOX finale, but alas, I just don't get it, he is STILL drowned out by Tony Banks's organ - why? why? why? why? why?"
    },
    {
      "reviewer": "chessman",
      "date": "Posted Saturday, July 29, 2006",
      "rating": 4,
      "text": "The third album from the band, and the first to feature the 'classic' line-up of Gabriel/Banks/Hackett/Collins/Rutherford. This is one of my favourite Genesis albums. Every track is a gem and worth listening to. All the melodies and atmospheres are incredibly strong here, and the classic Genesis Olde English timelessness is present in copious amounts. The Musical Box became an instant classic, starting with the beautifully subdued guitar work of Hackett and intense vocals of Gabriel. The piece builds wonderfully, moving from the sort of tune you may indeed find in a musical box, to a full blown power stomp at the end with Gabriel in his best form, singing over wonderful keyboard work from Banks and nicely inserted guitar lines from Hackett. And this is just the opener! The brief but beautiful 'For Absent Friends' is another superb piece, evocative of the era, and also noteable as being the first Genesis song Phil Collins was to sing lead on. In fact the vocal harmonies on here are very strong indeed and the lyrics are very poignant and powerful. 'The Return Of The Giant Hogweed' was, for a long time, the closing song at Genesis shows, usurping 'The Knife' if my memory serves me correctly. A typical humorous piece from the band, it is one of those tracks they were able to effortlessly throw into the mix to diffuse any accusations of too much pomp and prog. The keyboards here are intricate, and work well with the likewise intricate guitar work. Hackett and Banks were starting a symbiotic relationship here that was to help define the band's already tight sound. The build up is performed in mock-serious mode and one can't help laughing, once one realises the jokiness of the lyrics. 'Seven Stones' is a more concise song, and probably more indicative of the period than most, with wonderful organ and mellotron work, and a memorable melody sung by Gabriel. Again, it is almost humorous, but at the same time, can be construed as poignant. Brilliant stuff. (Again, nice guitar from Mr Hackett, who took over Ant Phillips's role seamlessly). 'Harold The Barrel' is probably my fave track on here. Steeped in the old music hall tradition, it is best listened to through good speakers, or headphones, as there is much going on here in both channels vocally. It is very, very funny, with both Gabriel and Collins obviously enjoying themselves. And the ending, with Tony Banks's brilliantly restrained piano notes dropping into the song as it finishes, is just perfect. 'Harlequin' is another favourite of mine, and maybe the least known track on here. But it is a lovely short piece, with nice guitars from Hackett (and Rutherford I suspect) and nice harmonies again from Collins and Gabriel. A lovely melody this one, and one that brings out the feminine side of the band. Finally comes the magnificent album closer, 'The Fountain Of Salmacis', another track best heard through good speakers or headphones, as there are two different lines sung in each channel at various times. This is grand pomp, but very enjoyable. The mellotron really comes into its own here, adding oodles of atmosphere behind Gabriel's impassioned voice. Already his storytelling ability was incredibly strong. And the end is, of course, very memorable for the wonderful closing orchestral-like keyboard chords, overlaid with a very unique (for the time) guitar line from Hackett. Or course, like all early Genesis albums, this one is not the best recorded. I have the remastered version, but even on here the drums are not the loudest or clearest, though Phil's ability on them is obvious. And the bass is sometimes a little murky, or punchy. Nevertheless, this is another seminal album from a classic band. And the cover is one of the best covers they had too. One of my two faves in fact. (The other being 'A Trick Of The Tail.) A must have for prog fans. Not quite a masterpiece, but damn near it."
    },
    {
      "reviewer": "Cristi",
      "date": "Posted Sunday, August 20, 2006",
      "rating": 5,
      "text": "Nursery Cryme is the first Peter Gabriel era Genesis album I listened more than 10 years ago. After having listened only to pop-rock era Genesis, Nursery Cryme was the most pleasant surprise, the album totally blew me away. It's one of the greatest, best things I have ever heard. The Musical Box is one of the most impressive songs ever; I didn't know (when I first listened to it) that Collins could play drums so brilliantly. Hackett's solos all over the album are simply amazing, outstanding (I'm lacking superlatives to describe his guitar playing on The Musical Box, Fountain of Salmacis or The Return of the Giant Hogweed). Tony Banks superlatively plays piano, mellotron and organ. Another thing I didn't know at first was that Rutherford was/is such a great bass player. Last but not least, Peter Gabriel deserves being called \"the Voice\" of prog.My favourite songs are The Music Box, Seven Stones, Fountain of Salmacis and Return of the Giant Hogweed; not that the others arn't good, but the mentioned above songs are masterpieces of prog, music at its best.The Peter Gabriel era Genesis albums are \"easy\" to be reviewed, one word is enough:masterpiece(s)."
    },
    {
      "reviewer": "Australian",
      "date": "Posted Saturday, September 2, 2006",
      "rating": 4,
      "text": "\"Nursery Crime\" is in many ways an advancement of Genesis's previous album 'Trespass', and in terms of musician ship \"Nursery Crime\" is slightly more advanced. I believe this extra touch is brought by guitar noir Steve Hackett who displays his amazing talent on this album very well. Anthony Phillips is in no way a bad guitarist, and I wonder what would have become of Genesis if he had stayed in the band. Anyway let's not think what might have been and look towards the future, and past.\"Nursery Crime\" has the same epic concepts which are characterized by song lengths, lyrics and instrumental passages as Trespass. The epic nature blossoms forth here on songs such as \"The Musical Box\", \"Return of the Giant Hogweed\" and \"Fountain of Salamics.\" There is also a slight quirky fell to some of the other songs, the track that comes to mind as being most prominent is \"Harold the Barrel.\" This sensation is not bad, as it provides something different thought the course of an album.The opener to \"Nursery Crime\", \"The Musical Box\" has gone done as one of the best symphonic songs around with its quiet, floating melodies which can quickly change to retribution and thunder. The song opens quietly with a beautiful floating melody accented by acoustic guitar, flute, a keyboard line and airy vocals. The tempo soon increases as the tension beings to mount, it just keeps increasing before the giant crash happens and chaos ensues. Steve Hackett shows in this loud section why we regard him as one of the best. There is a lull in the music as Peter Gabriel sing of the blues artist King Cole before the loudness re-occurs. The ending of \"The Musical Box\" is something to be envied, its hard to describe. Next up is a short tune called \"For Absent Friends\", the song is played on guitars and it is an effective interlude between long songs.\"Return of the Giant Hogweed\" is one of the more interesting songs on \"Nursery Crime\", whether it is the name or the fun beginning- it is a catchy song. It is about animals called \"Giant Hogweeds\", one day an explorer captures one and the other Hogweeds go looking for revenge. The story sounds viable and proggy, but the way the band executes the plot is very interesting - a good listen. Up next is \"Seven Stones\", a song which I started off hating and is now my favorite from the album. The song is full of lush melodies and the harmony vocals and keyboards enhance the song that extra mile. The last minute or so is one of the best moments of \"Nursery Crime\" - very epic.Following \"Seven Stones\" is another great and catchy song, \"Harold the Barrel.\" The entire song - especially the chorus melody sticks like superglue, it is just a very entertaining song. It is similar to Return of the \"Giant Hogweed\" in its sound, but \"Harold the Barrel\" is less chaotic. Next up is \"Harlequin\" which is reminiscent of \"For Absent Friends\" in my opinion. The whole song consists of quiet guitar and keyboard backing and floating vocal harmonies. It is a very effective song and when listened to in the right mood is very meaningful. Last of all is\" Fountain of Salamics\" which is one of the epic structured (not in length) songs on \"Nursery Crime.\" The song opens with string Mellotrons and synthesizers before going into a positively haunting vocal and instrumental passage - a very good closing song which ends \"Nursery Crime\" on an epic note.1. The Musical Box (4/5) 2. For Absent Friends (4/5) 3. The Return Of The Giant Hogweed (4/5) 4. Seven Stones (5/5) 5. Harold The Barrel (5/5) 6. Harlequin (4/5) 7. The Fountain Of Salmacis (5/5) Total = 31 divided by 7 (number of songs= 4.42857 = 4 stars Excellent addition to any prog music collection\"Nursery Crime\" is without a doubt a classic Symphonic Prog album and harbors all elements of the genre. For me it is one of the very best Genesis albums and indeed one of the best in all progressive rock - not as good as 'Trespass' though! I'd recommend \"Nursery Crime\" to all Symphonic prog fans and secondly to everyone else, it's a good listen. The secret, as with most Symphonic albums is to not over listen the material."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Wednesday, October 11, 2006",
      "rating": 3,
      "text": "Considered one of Genesis's first masterpieces by many, and the first with the traditional lineup, Nursery Cryme offers us a mixture of styles that shows them becoming creative songwriters. Some of the songs range from a typical prog sound, to an almost prog metal sound in \"Return of the Giant Hogweed\" to more or less playful \"nursery\" music, almost folk like in songs like \"Harold The Barrel\".I am satisfied with around half of this album, as unfortunately their are some being fairly mundane and uninspiring. The tracks that interest me the most are the opening track, 'Hogweed, and the ending of Seven Stones. The beginning of Hogweed instantly reminded me of Classic Nintendo, a la Megaman. Don't ask me why I get that feeling, I just do, you'll understand the connection if you are familiar with the game.However, their are parts of this album which I'll never understand, and it's probably because I am not a Genesis buff and didn't grow up around the band. Harlequin is so lukewarm it's almost impossible to like. Salmacis is a song which just never really drove home with me, and I don't really get what everyone sees, or rather hears in it. It's pretty typical prog, but nothing too special in my book.Overall a better Genesis album than Foxtrot, but lacking in some of the more cultivated songwriting of SEBTP. Bass on this album is really hindered by poor production, a word of caution to those like me in the high-tech era."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Friday, December 29, 2006",
      "rating": 5,
      "text": "Like a few other Genesis albums, I purchased the vinyl version of this one in 74. There are important changes in the line-up : Steve joined on the guitar and Phil on drums and backing vocals.The opening song \"The Musical Box\" is one of my top three favourite from the band (together with \"Watcher of the Skies\" and \"Firth of Fifth\"). It is also one of my fave all time all genres. It inspired the layout for the cover sleeve.The universe of the band is all there : intriguing text (sexually oriented), smooth passages, brutal guitar solo from the new guitar player Steve Hackett. They will, little by little create a world of weird characters in some of their songs. On this one, little Henry's head was cut off by Cynthia. And, ooops, he died.Little Cynthia found a Musical box playing \"Old king Cole\" two weeks after the event. Little Henry reappeared but was ageing quickly. Till the moment that he was physically an old man, a strange temptation grew into his mind (and elsewhere). He tried to rape her. The screams alerted Nanny from the Nursery and when she saw the scene she threw the musical box at Henry and destroy both of them (Henry and the box).This track will allow Peter to develop his wonderfull acting skills on stage (with the simulation of the sexual act in the finale : Now! Now! Now! Now! Now!). A brilliant and splendid song.The short \"For Absent Friend\" is the only weak number. Phil is the lead vocalist. Since it lasts only for less than two minutes, it is OK (even if I always press next while listening to \"Nursery Cryme\" now).The last track of side one \"The Return of the Giant Hogweed\" is a great song (specially on stage). It is another \"war\" track in the same style as \"The Knife\". Quite hard rocking music with dark lyrics \"Mighty Hogweed is avenged. Human bodies soon will know anger. Kill them with your Hogweed hairs\". It is indeed a very mighty song. The closing section is just awesome and extremely powerful. Superb, really.Side B opens with \"Seven Stones\" which is IMO one of the most underrated amongst Genesis repertoire : nice flute passages, beautiful melodies and fantastic mellotron. It is one of my fave from this album (in my top four to be precise). I quite often listen to it, even now.\"Harold the Barrel\" is a rather strange track. The universe of Genesis with his strange characters is building rapidly. It's the story of a restaurant owner that left his family of three alone. The crowd is chasing him and Harold only wish he would be sailing to avoid them.Scary text : \"Harold the Barrel cut off his toes and he served them all for tea\" ! The song is quite brutal, but at times very melodious. Full of humour, fantasy and strenghts.\"Harlequin\" is a little acoustic and na�ve number. Nothing fancy. It is the second weak track of this album. I also have the tendancy to skip it while listening to this great album.The closing number \"The Fountain of Salmacis\" is the second best here IMHHO. It is a fantastic prog song with the most brilliant mellotron section I have ever heard. The story is is bizarre, filled with several characters as well: the narrator, Salmacis and Hermaphroditous (son of Hermes and Aphrodite).Some nymphs were growing him in secret. During a walk, Hermaphroditous got lost and \"his strenght began to fail\". A fountain then appeared to him. \"A liquid voice called : son of gods, drink from my spring\". Salmacis desperatly wants them to only make one : \"Unearthly calm descended from the sky , And then their flesh and bones were strangely merged ,Forever to be joined as one\".This description of the song is based on the lyrics.There is a lot of symbolic and beauty in \"Fountain\". I have always be in love with the huge mellotron played in this song. It is quite phenomenal. I was quite happy to see it played live during their 1977 tour (while they were four).I rate this album 5 stars.This review has been edited on 28th October, 2009."
    },
    {
      "reviewer": "Chris H",
      "date": "Posted Monday, February 19, 2007",
      "rating": 5,
      "text": "Love at first listen. Not something you hear too often is it? Well I haven't said it very often. \"Nursery Cryme\" is one of the very few albums that captivated me right from the first time I have ever heard it. This was the first album to be made with the full \"classic\" line-up on board, and that made for an excellent show here.What better way to open up an album with one the best songs of your career? There is no better way. Genesis do that right here with \"The Musical Box\", the 10 minute mini- epic that starts this journey into a musical heaven. The opening is an amazing quiet, subtle piece of music with great flute playing and a real nice chord progression. The vocals continue in a soft manner until around six minutes in when everything breaks loose and some organized chaos ensues. Banks uses his keyboards as sort of a staircase on which the climax rises. Truly an impressive track. \"For Absent Friends\" is a solo vocal by Phil Collins, and although i do detest the man's voice I have to admit this song is a very guilty pleasure for me. It has a very 'old days of Britain' feel to it and there is some great work on the keys. \"The Return of the Giant Hogweed\" is a much heavier song than its predecessor, and this is evident right from the beginning. It opens up with Steve Hackett and Tony Banks 'racing' their respective instruments and soon slows down for an amazing vocal performance by Gabriel. One of the best of their career actually.\"Seven Stones\" is the concept song of all concept songs. The mellotron creates a nice opening atmosphere while the whole song is played purposely out of tune. It makes for a nice and energetic number that somehow manages to fall into place perfectly. \"Harold The Barrel\" is when they first unleash their terribly tricky humor on the masses, and although many don't understand the underlying message this is probably the most accessible song on the album. It is also one of my personal favorite Genesis songs of all time. \"Harlequin\" is the next song, and every time it starts I think it is Jon Anderson singing a song off of Yes' debut album. This is an amazing harmonization between Gabriel and Collins and everyone seems to miss the importance of the 12 string in there, which really brings the song together. \"The Fountain of Salmacis\" ends the album with a bang! Steve Hackett is at his very best here in the album closer, and he delivers one of the greatest studio solos of his career with Genesis. This one song is worth buying the album for, let me put it that way.Usually I end my reviews with a paragraph to sum everything up or justify my rating or something of that sort but I really can't do that with this album. This is a masterpiece beyond words. You cannot even begin to describe what is projected on this album. The only way to understand to listen for yourselves."
    },
    {
      "reviewer": "Certif1ed",
      "date": "Posted Tuesday, February 27, 2007",
      "rating": 5,
      "text": "DEFINITIVE MASTERPIECEIf someone were to ask you that old chestnut \"What is Prog?\", well, here's the perfect answer.No other album so succinctly gathers together all of the \"elements\" and packages them into such a cohesive and genre-defining form as this. As a whole, it's darker than \"Trespass\" right from the cover - a young girl in Victorian dress playing croquet with human heads.While \"Trespass\" came almost as a bolt out of the blue, with King Crimsons' and Genesis' own debut offerings as the only real precedents, \"Nursery Cryme\" is the full-on realisation of the potential of \"Trespass\" - it fills in the blanks, dots the i's and crosses the t's.Much of this is thanks to the drumming and vocal contributions of Phil Collins - and yes, his vocal contributions really do make a difference for the better here. The addition of Steve Hackett brings a new \"bite\" to the music - although it's on later albums that he produced guitar work that stands out as innovative and technically thrilling, his leads here range from the achingly sublime to the snarling and intense, and his rhythm work adds a heavier and darker edge than \"Trespass\" ever had. As a consequence, the music rocks as hard as \"The Knife\" more often.Everything else is down to the development of the three remaining founder members; Mike Rutherford's rhythm and bass section drive like never before, Tony Bank's restrained and melodic keyboards verge on the wizardly - yet still showing the massive potential that would be realised on later albums - and Peter Gabriel takes his already masterful style to the next level, with a greater range of vocal styles and characterisations.But above this, above the individual skills of the players, lies something far greater.In Barbershop quartet singing, there is the concept of the \"Ringer\", otherwise known as the fifth voice. This is produced when the 4 vocal parts combine successfully - the music that is produced takes on a character all of its own, dependent on the feeling and teamwork of the singers.And THAT is what makes Nursery Cryme so great.It's like Genesis took big lumps of music, as a tangible material, moulded it all together, then each pulled and stretched their own invidual mouldings and created an ensemble that comprises a perfect whole. Nothing is there for its own sake, as filler, or an excercise in ego - it's all an essential part of a greater cause.It's a real pity about the production, which is little better than on \"Trespass\", and some might find the occasionally ragged execution annoying BUT, what really stands out, is that the 5 musicians produce this \"Ringer\" - a 6th voice, if you will, that IS Genesis.As a concept, the album works really well - you can see it as simply a collection of somewhat adult nursery rhymes, you can explore the intricate lyrical relationships between the songs, or you can analyse the individual songs to see their parts in the overall suite - it's all there, but, for a change, I won't do that for you :O)One of the most striking thing about the music as a whole is its purely organic nature - one tends not to hear the individual sections, but an unfolding musical journey that makes some mysterious kind of sense.\"Musical Box\" is, perhaps the pinnacle of this style of writing, everything else on the album paling very slightly in its wake.The wonderful, impressionistic musical painting of the underlying story that relates exactly to the cover is simply gripping - if you've bothered to take the time to familiarise yourself with the grisly yet tenderly emotional details of this story - and the musical transitions showing passage of time and intensification of feeling are virtually perfect for what they are - not a note to change. Maybe I'd be a bit more restrained with the panning of the lead guitar, and quite a few other production details, but never mind the production, listen to the MUSIC.After the sheer intensity of \"Musical Box\", \"For Absent Friends\" fits the overall musical scheme as a gentle transistion. Lyrically, we are taken away from the domestic drama in a single household to a village community at large. Of course, like the layers of the onion, there's more to it than that, so I won't spoil your fun!Kinda like a symphony structure, the slow 2nd movement is followed by a much faster and heavier 3rd movement that closes side 1 of the vinyl. Continuing the lyrical perspective, \"Return of the Giant Hogweed\" pans out again to a more global story. In case you were wondering,Heracleum mantegazzianiis the latin name for the plant of the title...\"Seven Stones\" is a slower respite from the intensity of \"Hogweed\", but is crammed full of subtleties and nuances, and simply packed with beautiful, arcing melodies with a strongly nostalgic feel. Things tend to happen slowly in this song, so if you're looking for an adrenaline-fuelled ride, look elsewhere. For those who are prepared to invest the patience and just relax, this song opens up like a flower (a flower?).\"Harold the Barrel\" is the oft-commented on melodrama, a very, very clever piece of writing, with pseudo-leitmotifs musically interpreting the characters and their states of mind perfectly. It's a mini-masterpiece in itself - I've heard many albums with fewer musical ideas than this song.\"Harlequin\" would seem, on the surface to be insubstantial - but again, it fits the overall structure; We've had a mellow introduction to the 4-part suite on side 2, followed by a hectic rush of drama, and now we chill for a few minutes before the big event. This song carries echoes of some of the \"From Genesis to Revelation\" material, and is a song of hope.We finish with \"The Fountain of Salmacis\", whose domain lies, appropriately and ultimately with the Gods. A fitting conclusion to such a great album, the instrumental section is a marvel of musical engineering.Trouble is, once it's finished, you just want to hear \"The Musical Box\" again...Truly great, should be #1 all the time. Even though it's not the best produced, executed - or even the best Prog Rock album ever made, it's still the best composed Prog Rock album, and the most representative of the genre.If you don't already own it, what are you waiting for?"
    },
    {
      "reviewer": "russellk",
      "date": "Posted Saturday, March 24, 2007",
      "rating": 4,
      "text": "With this album GENESIS signaled to the world that they were capable of music worthy of anyone's time. Certainly this album is worthy of yours.Melodic themes of beauty intertwine with moments of drama: driving rhythms counterpoint quiet acoustic and keyboard sections. But 'Nursery Cryme' is greater than the sum of its parts. It exhibits all of the necessary ingredients of the progressive sensibility. These are melody, complexity, meaning, quirky humour and consideration of the shape of the album. This last idea is crucial: albums without progressive sensibility were merely a collection of songs. Progressive albums took care in the placement of tracks, as the album was designed as a single listening experience. Humour is also an essential part of the progressive sensibility, acting as a balance to the pretentiousness of many of the musical and lyrical themes. Melody and complexity need no explanation.This album does have flaws, however. The overall playfulness and zaniness obscures many of the serious messages in the lyrics, which is a pity. While GABRIEL remained a part of the lineup, GENESIS never found an appropriate balance: on every album there are times when the lyrics made listeners cringe. 'Hasn't got a leg to stand on,' GABRIEL sings in 'Harold the Barrel'. Doesn't work for me, sorry, though I enjoy the playfulness of the song.'The Musical Box' is regarded as a classic, and rightly so. This track alone ensured the album would be a success. The other 'epic' tracks, 'Fountain of Salamacis' and 'Return of the Giant Hogweed', do not reach the same heights. It is left for the shorter tracks to carry the album, and I find beauty in each of them. I particularly treasure the maligned 'Seven Stones'.The other serious flaw is the production. This is the first album with the classic line-up, but they are not equally treated. PETER GABRIEL and TONY BANKS stand out in the mix, while the other three are muted. Even the recent remastered version doesn't deliver sound quality of the standard the music requires.An album already in the collection of every fan of classic progressive music. It's not quite essential that all others listen to it, and this is not the one GENESIS album you need. But I'm sure you'll enjoy much of what you hear."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Friday, May 25, 2007",
      "rating": 4,
      "text": "\"Trespass\" was such a placid and tranquil album with Gabriel playing the flute more than he ever would again. His vocals didn't vary much either. Enter Phil Collins and Steve Hackett and I think we see a more confident band. Gabriel suddenly is very theatrical with his vocals, and we get a lot of bombastic passages that are usually contrasted with the mellow ones. \"Trespass\" was fairly consistant while I find \"Nursery Cryme\" has some better songs but also songs i'm not thrilled about. Overall I have to rate the latter album a notch higher than \"Trespass\" mainly on the strength of \"The Musical Box\" and \"The Fountain Of Salmacis\". What I love about this record is how intricate and complex it is. It really requires your full attention in order to enjoy all the delicacies.\"The Musical Box\" is such a triumph for the band. The fragile vocals, delicate guitar work and warm flute, all give weight to the words \"Play me my song...\". 4 minutes in we get pulsating synths as the soundscape explodes. Check out the amazing guitar ! And the passionate vocals after 9 minutes. \"For Absent Friends\" has Phil on vocals. This is such a reflective, heart warming song with intricate guitar melodies to go along with the touching vocals.\"The Return Of The Giant Hogweed\" has harsh vocals at times and bombastic instrumental workouts. It all settles down and this contrast will continue. Some incredible piano 5 minutes in as the song ignites a couple of minutes later and rages on until it's over. I confess to not being a fan of this one,not enjoying the vocals and loud sections at all. The mellotron is nice though.\"Seven Stones\" is where Collins' presence is really felt behind the drum kit.The floods of mellotron only add to the melancholy of this underated tune. \"Harold The Barrell\" is an uptempo, silly song, with fast paced vocals. Don't like it. \"Harlequin\" has reserved vocals and such an intricate and delicate soundscape. Brilliant ! \"The Fountain Of Salmacis\" has a really good melody with waves of mellotron. Great synth work later. It's like this song slowly builds to a climax several times as it plays out. I still can't pick which one I like more between the first song or the last song. Both are masterpieces !4.5 stars for the album."
    },
    {
      "reviewer": "progaardvark",
      "date": "Posted Friday, June 15, 2007",
      "rating": 5,
      "text": "If you read through all of this album's reviews on Prog Archives, you'll find one thing that most reviewers have a common opinion about: that this is nothing less than a five-star masterpiece. This is the album that brought Steve Hackett and Phil Collins into the fold, thus completing what is considered their classic line-up. Although Phillips and Mayhew were quite wonderful musicians, they are clearly overshadowed by Hackett and Collins.Following the multiple movements in Trespass' \"The Knife,\" Genesis includes three songs in this style on Nursery Cryme: The Musical Box, The Return of the Giant Hogweed, and The Fountain of Salmacis. These three songs were ground-breaking in 1971 and are now considered hallmarks of symphonic progressive rock. Indeed, very few bands have approached the emotion, musicianship, and originality of these three classics.But what about the shorter songs on Nursery Cryme? Well, they're quite wonderful in themselves, making this album such a treat to listen to. From the Mellotron-drenched Seven Stones to the hilarious Harold the Barrel, Nursery Cryme has got something for every symphonic prog lover.Nursery Cryme is simply an essential masterpiece. Just read the other reviews here. Easily five stars."
    },
    {
      "reviewer": "1800iareyay",
      "date": "Posted Friday, June 29, 2007",
      "rating": 4,
      "text": "Nursery Cryme is where the gods truly smiled upon Genesis and blessed them with it's greatest lineup. Drummer Phil Collins and guitarist Steve Hackett join the fray and waste no time proving they belong. Gabriel's lyrics range from depressing to silly, often within the same song. Rutherford and Banks shine once again. Gabriel has one of the best voices in prog, and he proves it throughout.\"The Music Box\" is the highlight of the album, and Steve Hackett makes history by pioneering both tapping and sweep-picking in the solo. Eat your heart out Eddie Van Halen. The lyrics sound like like the words to some burlesque tavern song, as Gabriel displays his twisted wit. \"For Absent Friends\" is a filler track that allows Phil to take center stage. The Return of the Giant Hogweed\" is Peter's take on environmentalism, where plants rise up to take revenge against their human slave masters. \"Seven Stones\" features great vocals from Peter. \"Harold the Barrel\" is this album's multiple character song, with Gabriel going through dfferent roles rapidly in its brief span. Tony has some great piano here. \"Harlequin\" is a very minimalistic song with a great harmony between Gabriel and Phil. The light 12 string, bass, and keys make this a lovely tune. The album closes with another mini-epic, \"The Fountain of Salamcis.\" Tony's mellotron and Phil's incredible drumming are the defining aspects of this song, but it features great performances from everyone.Nursery Cryme set in motion Genesis' classic era that would go on to influence countless progressive bands of all sub-genres. It isn't as stunning as Selling England By the Pound, but it comes close and is, to me, better than the resulting Foxtrot. You're not a fan of prog without this album.Grade: B+"
    },
    {
      "reviewer": "ghost_of_morphy",
      "date": "Posted Sunday, July 15, 2007",
      "rating": 3,
      "text": "This is Genesis's most overrated album. Sure, it's good. Some of the songs border on greatness. But there's nothing that's truly essential here, let alone a masterpiece. 3 stars for the first effort from the classic lineup.The Musical Box (4.5/5): I'm always happy to hear Peter grab the flute. This is the kind of mini-epic that Genesis usually does well on. This is a well executed attempt, and their songwriting will mature. Steve and Phil both do an excellent job of showing why they should be considered upgrades here.For Absent Friends (3.5/5): This always struck me as filler, but as really GOOD filler. Some nice lyrics and a rare fondly sentimental vocal performance.Return of the Giant Hogweed (4/5): Together with The Musical Box, this is the other reason to listen to the album. An earlier reviewer has said that if you don't \"get\" the introduction to Hogweed, you don't \"get\" prog. Certainly this song stretches all kinds of limits.Seven Stones (2/5): I don't like this one much. It's a plodding song that seems to lack a lot in creativity and relies far too much on the keyboards.Harold the Barrel (3.5/5): This one is hardly a masterpiece, but it's a witty performance and really shows The Gabe's versatility.Harlequin (1/5): The world didn't really need to hear this song. The ensemble vocals just don't work here, and that and the guitar work is what this song is all about.The Fountain of Salmacis (3/5): There's a lot of nice subtleties to listen to on this track, but the song just doesn't grab you like The Musical Box does."
    },
    {
      "reviewer": "Dim",
      "date": "Posted Sunday, July 15, 2007",
      "rating": 4,
      "text": "Why dont you touch me?!I consider this album to own the very first Progressive rock epic, and also lay down the first path that would shape prog for decades. Really, this is not Genesis' best album, but is absolutely essential, to any/everyone who takes their prog seriously.The musical box- Maybe the most important ten minuetes of progressive music out there. This song shows PG's creativity to it's full extent, absolutely no boundries. Starts very simple, but like all great Genesis songs, it has many climaxes, ending in a guitar solo each time, but the greatest moment is the glorious and triumphant closing section. Peter plays himself as an old man and talks aout how frustated he is with a girl until the point of screaming in frustration. 5/5For Absent Friends- Filler. vocals by Phil, and guitar by one of the three twelve string players. Pretty, but nothing to shake a stick at.3/5Return of the giant hogweed- At first I could not take this song at all, I thought Peter's voice with Tony's driving organ was very stupid sounding. After a couple more listens though, I found the instrumentation fun to listen to and Peter's lyrics being very creative, especially with his otherwise angry sounding voice. Alas, the recording quality ruins any hope of a perfect listen. 4.5/5Seven Stones- A very underated song, with very nice mellotron and vocal harmonies. Just about everything fall's into place, the chorus' is particularily catchy, and the lyrics are typical Peter Gabriel. PG's voice can be much more... convincing though.4.5/5Harold the barrel- Good filler. Funny and with a jonty piano. Not much more though.4/5Harlequin- Filler? I dont actually pay much attention to this song actually, good vocals, good guitar harmonies. Not much else once again. 3.5/10Fountain of salmalsis- Very nice song, kinda inconsistent, but very experimental. It has some Jazz, some organ, some Tapping, and everything under the sun. The instrumental section is very good, especially the drum's.4.5/5One song with a five star rating, but still absolutely essential."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Monday, July 30, 2007",
      "rating": 3,
      "text": "A genuinely well-done and entertaining album that features everything that everyone likes about Genesis and is a great snap-shot of progressive rock's early years-- an unlike some of the band's later albums, is actually played with enthusiasm. Gabriel's dramatic lyrics and trademark vocal deliveries shine throughout, with the instrumentalists turning out understated but well-executed performances. The proto-typical feel to this album goes over well, with its mood and vibe carrying its momentum where the member's playing ability might sometimes cast doubt on the group's early ability to put together a cohesive album. Although very dated , \"Nursery Crime\" has enough fun to please most anyone who enjoys a classic sound, but to be fair it is not as well composed or elaborate as some of the band's later albums. Three solid stars.Songwriting: 3 Instrumental Performances: 2 Lyrics/Vocals: 3 Style/Emotion/Replay: 3"
    },
    {
      "reviewer": "kenethlevine",
      "date": "Posted Tuesday, August 7, 2007",
      "rating": 3,
      "text": "Maybe if I had heard the balance of this album as often as I heard \"The Musical Box\" before I \"got it\", I would rate this as the best album ever, but that isn't gonna happen 30+ years on. Familiarity is just as likely to breed contempt, and my main issue with early Genesis was the general tweeness of the lyrics as well as the production values which resulted in certain passages exploding and others retreating beneath base white noise levels.So we have the Musical Box, one of the most perfectly constructed and powerful songs in prog history, featuring vocal passages mostly low and mysterious, and instrumental breaks increasing in intensity until finally even Peter Gabriel has to cut loose at the end. The wordless sections are so refreshingly dominated by Mr Hackett's quirky expressions rather than the overused organ, and the ending is a master stroke.Then what? Not much frankly. The best sections of \"Hogweed\" seem patterned after the Musical Box but not as effectively, and from there it's mostly downhill until the \"Fountain of Salmacis\", which sufficiently redeems the recording to place it firmly in the three star band. Salmacis features the best mellotron on the album and is also more poetic than most of the intervening songs, but it is far from a classic.With Nursery Cryme, Genesis began to lay the foundation for a whole school of symphonic progressive rock, a school in which some pupils would surpass the teachers, in short bursts of quality if not in longevity. Several later albums would show improvement on multiple levels and, although few individual works can match \"The Musical Box\", this album would not be my first recommendation to younger prog fans or older ones who have lived under a rock since 1968. It's not a cryme, but more of an imperfect work of philanthropy to the musical world."
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Monday, August 13, 2007",
      "rating": 4,
      "text": "Somehow Nursery Cryme never really caught my imagination. The first album to have the classic Genesis line up that included Steve hackett and Phil Collins is, songwriting and performing wise, a masterpiece. However, the recording quality is poor and the group would deliver much better material in the forthcoming years. So, compared to Foxtrot or Selling England By The Pound, Nursery Cryme pales. Ok, it does inlcude some of their all time classics, and at least one song, The Musical Box, that is worth the price of the CD alone.Still I don�t hear it from beginning to end with the same pleasure as any other of their records of the time, including From Genesis To Revelation and Tresspass, A Trick Of The Tail and Wind And Wuthering. Again, this is a personal opinion. Most of the songs are great. And maybe if I hear a remaster edition I may change my opinion a bit. My original LP and the CD copy I have contains the original recording mixes which I think sucked much of the tunes life.And yet it is a essential buy for any prog fan. Genesis with Peter Gabriel had something magic all the time, even when they were not at their best."
    },
    {
      "reviewer": "apps79",
      "date": "Posted Sunday, October 14, 2007",
      "rating": 5,
      "text": "For the third Genesis album the line-up changed once more.Drummer John Mayhew quit (and little had been heard around him until his death in 2009) and he was replaced by the talented figure of [Artist721], while guitarist [Artist5520] also left the group because of his stage fright during the lives and Genesis welcome [Artist3555] of [Artist17426] in the most succesful line-up of the band.The new members even contrivuted both compositionally and with singing parts in ''Nursery Crime'', which was released in November 71' originally on Charisma, featuring again an eccentric cover by Paul Whitehead.Genesis developed their style even further with ''Nursery crime'' and the album opens with the fantastic ''The Musical Box'', actually the first complete epic of the band, an incredible journey through the world of Acoustic Folk and Progressive Rock, highlighted by the mellow acoustic passages, the powerful organ runs and the theatrical performance of Gabrierl next to his delicate flute parts.The short ballad-esque ''For Absent Friends'' features the first ever vocal performance of Collins with Genesis, while ''The Return of the Giant Hogweed'' became an all-time classic, having a sound close to ''The knife'' with more evident symphonic sections.Plenty of incredible organ flights, grandiose Mellotron waves and piano interludes by Banks with dominant guitar riffs by Hackett offer again a unique exprerience.''Seven stones'' is an underrated piece of high-quality music in Genesis' books, a lovely mix of flute-based lyrical music with dramatic organ/Mellotron-based breaks and a superb atmosphere towards its end.The humurous ''Harold the Barrel'' has sort of a Cabaret feeling, a welcome addition to soften things a bit before the entrance of the folkish ''Harlequin'' and its dreamy all- British atmosphere with the excellent vocal lines of Genesis' members.The closing ''The Fountain of Salmacis'' is just another example of how good Genesis were on producing long and imaginative music pieces.Smooth Symphonic Rock with great guitar work by Hakett and (yes, again) another monumental performance by Banks on Mellotron and organ along with a superb rhythm section.''Trespass'' was just so beautiful but with ''Nursery Cryme'' Genesis moved a step closer to perfection.High-class musicianship, among the most valuable treasures in Progressive Rock's history and a band finally establishing its name among the greatest of the style.Extremely highly recommended and a must-have for any prog fan's collection."
    },
    {
      "reviewer": "Nightfly",
      "date": "Posted Saturday, November 10, 2007",
      "rating": 5,
      "text": "Although Genesis showed signs of great things to come on their previous album Trespass, it was Nursery Cryme which also heralded the arrival of Phil Collins on Drums that they really began to make their mark. In fact without Collins Genesis may not have developed into the dynamic band that they are here. Despite the musicianship and compostional skills of the other members it was Collins explosive drumming that gave them that extra edge to develop their Symphonic Prog into the complex structures on this album.What we get here is three long pieces and four shorter tracks. It's the longer tracks that are the album highlights starting in fine style with The Musical Box, amongst the favourites of many fans, myself included. The song starts quietly, moody and atmospheric with some nice guitar arpeggios until Hackett chimes in with some powerful chords followed by Banks on Keyboards and the band explode into the fantastic instrumental mid section before taking it back down for Gabriels next vocal part and then we're off again. The ending has a beautiful slow build and some fantastic vocals from Gabriel. Can it get any better than this? Well not quite but they have a good try.The very short For Absent Friends is next and is pleasant enough evoking the mood of a cold Sunday early evening in England very nicely. Quickly we're into another highlight, Return of the Giant Hogweed which is one of the bands heavier moments but it still leaves plenty of room for the band to display (what was to become) their trademark dynamics and has a very powerful ending.The next three tracks aren't quite as memorable but still worthy of inclusion, particularly Seven Stones with some lush keyboard sounds from Banks but the final epic, The Fountain of Salmacis closes Nursery Cryme in fine style with it's mythological lyric content and more superb dynamic playing from the band. Awesome stuff!"
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Thursday, November 15, 2007",
      "rating": 5,
      "text": "\"Nursery Cryme\"is the third full-length studio album by UK pop/rock and progressive rock actGenesis. The album was released through\"Charisma Records\"in November 1971. It�s the successor to\"Trespass\"from October 1970 and it features two lineup changes since the predecessor. Touring in support of\"Trespass\",Genesisbegan to realise thatJohn Mayhewmaybe wasn�t the most suitable drummer for the band and their music. He would leave soon though and be replaced byPhil Collins(in August 1970), who brought a completely different approach to rhythm and drumming with him. Guitarist and founding memberAnthony Phillipswas the first to leave though, as he wasn�t satisfied with the direction of the band�s music, and because many of his songwriting ideas were rejected and therefore didn�t make it unto\"Trespass\". It took the band a while to find a suitable replacement but in late December 1970, they auditioned new guitaristSteve Hackettand he joinedGenesisin January 1971.If\"Trespass (1970)\"was a giant leap forward from\"From Genesis to Revelation (1969)\"and more or less a complete transformation ofGenesissound,\"Nursery Cryme\"was a quantum leap forward in quality from its direct predecessor and the establishment of the high quality progressive rock thatGenesiswould produce on this and the next couple of albums. The inclusion of the two new members have an immediate impact on the band�s sound and it�s as ifGenesisfound the missing pieces of the puzzle to boost their creative forces. Both in terms of songwriting and in terms of working as a band unit.\"Nursery Cryme\"features seven tracks and a total playing time of 39:09 minutes andGenesistake the listener through the three longer epic tracks\"The Musical Box\",\"The Return of the Giant Hogweed\", and\"The Fountain of Salmacis\"and the four shorter pieces\"For Absent Friends\",\"Seven Stones\", and\"Harold the Barrel\", and\"Harlequin\".Collins, who some years down the line, would become the lead vocalist forGenesis, makes his lead vocal debut on the short, acoustic, and mellow\"For Absent Friends\", but other than that it�sPeter Gabrielwho sings lead vocals on the remaining tracks on\"Nursery Cryme\"(although\"Harold the Barrel\"is actually sund as a duet byGabrielandCollinswith their vocals layered).\"Nursery Cryme\"features several interesting and even humorous lyrical themes which bring the right amount of mystique and both dark and uplifting atmospheres to the recording. The dark Victorian horror story of\"The Musical Box\"are comlimented perfectly by the adventures and craziness of songs like\"The Return of the Giant Hogweed\"and\"Harold the Barrel\".The instrumental part of the album consists of organ, mellotron (which was new in the band�s sound), piano, bass, electric and 12-string guitars, flute, drums/percussion, and many beautiful harmony- and choir vocals.\"Nursery Cryme\"is a dynamic release and although it�s predominantly a mellow, pastoral, and beautiful album, both\"The Musical Box\"and\"The Return of the Giant Hogweed\"feature louder and even somewhat heavy parts. The album was produced by John Anthony with David Hentschel working an the assistent engineer, and although the sound production suits the music, it is arguably a bit rough around the edges and not all instruments sound equally great in the mix. The electric guitar tone is for example not particularly clear or well sounding, but again the album ultimately features a sound which suits the material.\"Nursery Cryme\"is the firstGenesisalbum featuring their \"classic\" era lineup and it�s also the firstGenesisalbum in their most well known progressive rock period (1971-1974). Despite a few issues with the sound production, it�s through and through a high quality release and a 5 star (100%) rating is deserved."
    },
    {
      "reviewer": "clarke2001",
      "date": "Posted Saturday, November 24, 2007",
      "rating": 4,
      "text": "Still they're invincibleI'll take the deepest of the breaths: if ever an album was balancing between four and five stars, this is the one.Seven tracks, three of them absolute masterpieces, four of them highly enjoyable. The masterpieces are, of course, \"The Musical Box\", \"The Return Of The Giant Hogweed\" and \"The Fountain Of Salmacis\"- it's not a coincidence they are also the longest tracks here, the epics. But I don't love them just for the sake of being epics. They're delicate yet powerful. They are telling a story. They ARE a story. I used to wave my hands (I still do), alone at home, listening to my MP3 player cranked up to the maximum, imagining I am each of the band members, playing with them...my role in the band will change with the next musical passage. And that's all I'm going to say about it. I'm not going to describe you my brain washed with the tides of Mellotron, the gurgling guitars, sincere drumming, tear-jerking Gabriel's vocal delivery or the lyrics, although I could knit a story just about the lyrics...but I'll move to the next paragraph, and give a word or two to the other four songs.Let's use the coinage \"non-masterpiece\" instead of \"weaker\", shall we? Alright then. The four non-masterpieces are gorgeous in its shortness and great in its gorgeousness \"For Absent Friends\". \"Seven Stones\" and \"Harlequin\", nothing short of beauty and memorable guitar passages. And some pseudo-madrigal vocal section. Incredibly catchy \"Harold The Barrel\"; it could easily fit next to the QUEEN or ELTON JOHN back in a day. I admit, the piano riff borrows (coincidentally?) a chord progression of that LOVIN' SPOONFUL thingie \"hot town, summer in the city\" but what the heck, it's entertaining anyway.As I've said this one is balancing perfectly between 4 and 5 stars. As this facility is not supporting 4,5 ratings, I will go (sigh) for four stars, but this reflects more the reviewing policy and the overall tensions of the site and my personal opinions about it (less than about the album itself).The album is essential for any serious music collector. Not having it in your collection is a cryme :)"
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Wednesday, February 20, 2008",
      "rating": 5,
      "text": "Review 10, Nursery Cryme, Genesis, 1971Another very strong album with weak moments, and a mixture of progressive giants (The Musical Box & The Fountain of Salmacis), interesting softer pieces (Harlequin & For Absent Friends) and a couple of lighter more amusing ones (Return of the Giant Hogweed & Harold The Barrel). With Collins on the drums and Hackett on guitar, the classic line-up is complete, and the use of Collins' vocal skills on The Musical Box and Harlequin is inspired.The Musical Box is my favourite Genesis song, from the hypnotic acoustic interplay of the opening to the final flourish it stands out. The lyrics are 100% Gabriel's style: innovative, somewhat fantastical and very refreshing. The opening is a relatively delicate acoustic thing, with the vocals done by Gabriel and Collins (with possibly the rest of them) providing harmonies and additional vocals throughout. After the first 'Play me my song...here it comes again' chorus, it moves into another slightly more complete acoustic part with more flute, building up to a repeat of the 'Play me my song...here it comes again'. Suddenly, Hackett's guitar and then a powerful organ riff. Dominant drums, cymbal clashes, a shriek, amazing guitar solo, and suddenly quieter again, yet keeping all the build-up and power. How the hell do you make something like that? Gabriel's vocals enchant and drive the song at this point with music essentially provided to support him him, and then the power returns, the guitar bursts into control, the drums break loose, yet stay perfectly under control. Everything continues to build up, and then turns quiet again, seamlessly, delicate guitars, counter-harmonies mesh with Gabriel possessively, and then the organ returns. Almost church-organ, this time, building up and driving in cooperation with the drums, the song's concept builds to its climax (\"Now now now now now!\", Hackett slowly works his way into the mix, ending up with a part every bit as dominant as those already there, and the finale is somehow enough to end this amazing song with absolutely no feelings of disappointment. As you may have guessed, my obsession with this is unhealthy. Both very prog and very rock. I love it. Also, it's a great song for air organ...For Absent Friends is a short, quiet song, with a soothing vocal from Collins and tasteful acoustic guitar interplay. Lovely.Return Of The Giant Hogweed is perhaps the best example of how Genesis shifts between brilliant and unconvincing to me. The concept is utterly silly, which works quite well, but I generally don't like the vocals. Hackett shifts between frequent additions over the top, and a nice fuzzy guitar . Similarly, Banks here is difficult to stomach, since his organ additions shift between brilliant background work and a gaudy form of dominant bombastic vaguely Rush-like thing that becomes repetitive throughout the course of the song. In the end, it seems that Banks is responsible for both the great and the annoying sections of the track, with his piano making the second half of the instrumental section and leading up to the great end, and his over-the-top organs being too much for me.Seven Stones has a very strong mellotron-and-bass start, with vaguely folk-ish lyrics about the vagaries of fortune (sound like Banks lyrics to me, but I'm not sure), tasteful bass, excellent drumming from Collins, a powerful chorus with a soulful vocal. Very good solos from banks, good flute parts, memorable keyboards throughout. Hackett's contributions are pretty typical of his style: not dominant in the mix, but always adding something special. A very good track.Harold The Barrel is great fun for me. What I think is Hackett sounds more like a sax than a guitar, Banks' piano shifts between amusing to a prettier, more reflective tone at the right moments. Collins fits in perfectly, moving between standard beat-drumming to something a little more energetic whenever he can. The bass additions are great, and the mixture of Gabriel's sarcasm and vocal dexterity and the harmonies and the various vocal effects. Probably my favourite of the lighter, supposedly humorous Genesis pieces.Harlequin is something different again, a very moving Gabriel-and-Collins duet with surreal lyrics and some subtle vocal interplay, the acoustic part changes frequently, and has a lot more direction, in my mind, than that on Dusk, while Hackett's few additions on the electrics are perfect. In my mind, an experimental and enjoyable piece, which grows on me with every listen. An unsung masterpiece.The Fountain Of Salmacis is another progressive beast, though in a different vein to the album's opener, not necessarily less of a rocker, but somewhat more sweeping and grandiose, with more vocal effects and a more consistent style compared to The Musical Box's build-up. It begins with the keyboard theme of the piece, fading out into a lush soundscape and a bass-and-Gabriel-backed vocals with a mythical theme. Mellotron chords or melodies changing constantly in the background, occasional Hackettry, vocal effects that drive home the theme, powerful guitar and keyboard solos and a surprisingly effective expression of the two-part conversation, the story, the battle of wills between Hermaphroditus and Salmacis, and the final merged creature. A powerful emotional and musical triumph.The end result of this album is an extremely good impression after every listen, and though I'm reluctant to allow my third-favourite album by a group, and one with a large, weaker song, the fifth star, I have to admit that the overwhelming majority of great material is a match for Selling England By The Pound and Trespass. Furthermore, I keep finding new aspects of the music, or noticing effects and background parts that I didn't really notice before, something not evident on Trespass. Although on a personal level, Trespass and Selling England By The Pound touch me much more deeply, they don't really challenge me as a listener like Nursery Cryme does.Rating: Five Stars (the extended flaw that is Return Of The Giant Hogweed has some great moments, and there are, in my mind, four six-star tracks here)Favourite Track: The Musical Box"
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Wednesday, March 12, 2008",
      "rating": 5,
      "text": "This Genesis album was the first one to really change my opinion about the band! Since I already previously heard Selling England By The Pound and Foxtrot I only listened to Nursery Cryme as my last farewell to Genesis. In result I became a huge fan of the band! The Musical Box is my all time favorite song, only Cinema Show comes close. It has such a great flow and the story gives me goosebumps practically every time I listen to it! After listening to Nursery Cryme I decided to give the other albums another shot and I changed my opinion about them as well, even to the extend of Selling England By The Pound becoming my favorite Genesis album! But it was all thanks to the brilliance of Nursery Cryme!***** star songs: The Musical Box (10:24) For Absent Friends (1:44) Seven Stones (5:08) Harold The Barrel (2:59)**** star songs: The Return Of The Giant Hogweed (8:09) Harlequin (2:53) The Fountain Of Salmacis (7:54)Total Rating: 4,52"
    },
    {
      "reviewer": "Gooner",
      "date": "Posted Friday, April 11, 2008",
      "rating": 3,
      "text": "Compositionally speaking, this is a mixed bag. Definitely a transition album since Trespass stands on its own, but Foxtrot and Selling England By The Pound refined and perfected the formula on Nursery Cryme. _Fountain Of Salmacis_ is probably one of the finest examples of the use of the mellotron. The only thing that holds this LP back from exploding is the muddy sound and production, which was corrected on Foxtrot."
    },
    {
      "reviewer": "Garion81",
      "date": "Posted Tuesday, May 13, 2008",
      "rating": 5,
      "text": "\"Let me introduce our new members\"Following up the well conceived Trespass Genesis now has to solve a couple of problems first. The first one being finding a better drummer one who will drive the band to be more powerful. Exit John Mayhew and enter Phil Collins. Check! Next to replace departing guitarist Anthony Phillips. What to do? Look in the Melody Maker and find Steve Hackett. Check! Ok that is out of the way one the album.The album carries some of its melancholy moments from Tresspass but now they become more dark emotions as in the opening prog rock classic The Musical Box. The moment this song hits its first instrumental break you know we are on to something. Collins drums kick in and Hackett's guitar wails while Banks organ gives the impression something wicked this way comes. The second song shows Phil can sing as well as he and Peter reverse roles and Phil takes the lead and Pete the backing. Very short at 1:44 nothing to write home about. Next comes the great opening of Return of the Giant Hogweed. Genesis makes this weed seems like it the most sinister monster ever conceived (Ok maybe conceived over a couple of joints again). Great song and I especially like the \"dance\" section. Seven Stones sounds something left off of Trespass. A nice airy feel that has an explosive ending with Phil and Steve flexing that power again with Tony's mellotron setting the tone. Harold The Barrel is a nonsensical Monty Python Beatles style song. It reminds me of ELP's songs like The Sheriff. Harlequin is much like Seven Stones and then we get to The Fountain of Salmacis. This is dusk with stronger themes and powerful sections that drive this haunting story to its conclusion.All in all this is great album a huge historical prog statement and the open door to more greatness to come. To some it may sound dated and for sure could use a remaster but this is what it is all about. 5 stars"
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Saturday, July 19, 2008",
      "rating": 4,
      "text": "The first album with the classic line-upWith this album Genesis fulfilled the promise of their previous album, and what in improvement it was! The wonderful guitar playing of the amazing Steve Hackett is here heard for the first time and so is Phil Collins expressive drumming and some wonderful vocals as well. The Musical Box is a masterpiece with very interesting Neo-Classical guitar and keyboard work. For Absent Friends is a very nice ballad sung by Phil. The Return Of The Giant Hogweed is this album's The Knife (or a better comparison: Battle Of Epping Forrest). Seven Stones is probably the song here that is most similar to the Trespass material in both sound, style and quality. Which means good, but not more than good.Harold The Barrel is the only song on this album that I don't like very much. I find it a bit silly to be honest, and though it is clearlymeant to besilly, I just don't seem to \"get\" it. Harlequin is a short and mellow song, it sounds a bit like a nursery rhyme. The album closer Fountain Of Salmacis it took me a long time to get into, but now I really like it.Overall, a very good album. Highly recommended for any Prog collection."
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Saturday, August 2, 2008",
      "rating": 5,
      "text": "Finally great Genesis!Huge progress from the previous release - Trespass.Nursery Cryme set the beginning of one perfect progressive rock band,that will last till the departure of Steve Hackett.For me it is stupid to seek a big difference between the albums from Nursery Cryme to Wind and Wuthering.I believe that at this time the quality is almost the same and it is the highest possible.All albums in that period are masterpieces.And this begins from here.The first perfect album by Genesis,followed by five more.That's why we call Genesis great band - because it has six diamonds in its discography.There aren't many other bands with that achievement. The tradition for making long epic songs already begins with Nursery Cryme.Songs like The Musical Box,The Return of the Giant Hogweed and The Fountain of Salmacis show this.First of many 5 marks fro Genesis."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Sunday, August 31, 2008",
      "rating": 4,
      "text": "Phil Collins? Didn't he do a lot of stuff for Disney?Long before Genesis hit the 80s, and long before Phil Collins went off on his own to do... various things... Genesis recruited some new blood to perform on their third album. Most people know that their first album,From Genesis To Revelation, flopped miserably and their second album,Trespass, is considered one of progressive rock's pinnacle albums, and actually put them on the road to... making money, so this third album was going to need to be even better than their second. And it was. Playing no small part in this act is the two newest members of the band, Steve Hackett and Phil Collins, whose presence (and lack thereof) would be blamed for the later progressive shortcomings of the band. Strange that they'd joined at the same time, no?For many people this is where Genesis really came into their classic era, and I'm one of those people.Trespassmay be one of the most important prog albums in the history of the genre, but it still sound like a band searching for a sound to call their own. While that album had moments of sheer brilliance, this album simply is sheer brilliance. Every song on here is simply wonderful, and it has some of Genesis's finest moments in their discography. It may not be their absolute pinnacle, but they were nearing the peak with this release.One of the songs that really needs noting right off the bat is the song that made many many people wonder over the years how this could possibly be the same band that releasedInvisible Touch.The Musical Boxis a fine piece of progressive music that, at 10 minutes, can compete with any of the pomp-prog epics that would come out over the next decade. A slow start finally kicks into gear with emotional vocal work from Gabriel and soaring instruments from every angle. The story itself is highly amusing as Genesis recites the story of Old King Cole as depicted on the cover art.The other songs on the album are also great, to different degrees. Some of the more comical (in an eggheaded way) songs serve as the other main pieces to the album.The Return of The Giant Hogweedfeatures wonderful keyboards and incredibly serious vocals, considering the subject matter, from Gabriel.The Fountain Of Salmacisuses greek mythology and progressive rock to tell the story of Hermaphroditus and the nymph with a certain degree of humor.Harold The Barrelis the start of a long line of songs from the band attacking society, this one highly comical and yet somehow disturbing nearing the end. Fast and frantic, this is one of the better, shorter songs from the band.Harlequinis a beautiful piece with delicate melodies from every member and Gabriel's soft voice taking charge to make for a very pretty song whileSeven Stonesis another beautiful piece that has a very melancholic tone to it.An excellent album, and definitely one that should be in just about every prog rock collection. Genesis had some better moments, but this is really where the classic era began for them, so if you fancy any of their masterpieces this one will appeal to you without a doubt. If you're hesitant about starting with the band this is also a fine place to start since it is quite approachable. 4.5 stones out of 5! Excellent prog rock."
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Tuesday, September 9, 2008",
      "rating": 4,
      "text": "This album has so many reviews that is hard for me to come with more information and thoughts that is already said before, but because i have this album for quite some time and most important thing, i enjoy it very much , why not a review. The real start for Genesis is this album, the line-up now is completed and remains this way for more than 4 years. Enter Steve Hackett on guitar and Phil Collins on drums and ocasionally backing vocals. What a choice Banks and Rutherford made when they announce the new members, excellent of course. The music is more mature like on Trespass more symphonic, more everything than the previous album. The ideas and arrangements here are worthy of having this album because is among the best Genesis records ever, and maybe the best with Gabriel on voice, at least for me. Three pieces from Nursery cryme stands as ones of the major contribution to progressive music and i mean:The Musical Box, Return of the giant hogweed and The Fountain Of Salmacis (personaly among my favourite piece from Gabriel era, and from Genesis music in general), the rest are also simply great. This is a Genesis classic no doupt, and a classic of prog music in general. 4 stars, not a masterpiece but close enough. I remain to Trick of the tail to be the most accopliced, chalenging and intristing Genesis album of all time. Recommended"
    },
    {
      "reviewer": "progrules",
      "date": "Posted Friday, December 26, 2008",
      "rating": 4,
      "text": "One of the few Genesis albums I still had to review and one reason for this is that I've been in doubt for the rating for a long time now. The choice is between 3 and 4 stars once again. There's only one way to solve this problem and that's certainly not push it forward in time constantly. I will have to deal with it and that's by rating song by song and see what the average is.The opener (Musical Box) is one of the first songs I got to know of this band and is the highlight and that will be no surprise. Always felt this is one of their very finest and I noticed almost every reviewer feels this way. Simply a case of 4,75 stars to me.Second (For absent Friends) is a short and insignificant song and gets no more than 2 stars for the effort.Third song and second epical one is a classic once again and one I have a soft spot for because it was on Genesis live and I always liked that entire album. Good symphonic composition. 4,25 stars.Next in line is Seven Stones, a more than average song for Genesis standard with nice melodic inventions but not an outstanding song (3,5*).Harold the Barrel is an up tempo fast and short track, accessible and nice but again no highlight (3,25*).Harlequin is even slightly shorter but different in style, more of a ballad. Ok but less in quality to me (3*).Fountain of Salmacis is the third longer song of this album and also the least of this trio. Still one of those songs Genesis is expert in, both in composing as in execution. But this one is a bit sloppy compared to most of their epics through the years (3,75*).Ok, I'm not kidding here but it's exactly 3,5 on average but I will have to be fair: the longer tracks are the best and are strongly above this average and fill almost 2/3 of the timespace of this album. So I can only round this up to 4 stars but this is obviously not one of my very favourite Genesis albums."
    },
    {
      "reviewer": "lazland",
      "date": "Posted Tuesday, January 6, 2009",
      "rating": 5,
      "text": "This is a masterpiece, and fully deserving of five stars. I remember with great affection buying the vinyl LP with the fantastic gatefold sleeve and pouring over every detail - just the personnel names in print were enough to send one into rhapsody. And then to the music itself.Musical Box remains for me the finest Genesis song of any era, and whilst Phillips was undoubtedly missed, any doubts about Hackett were blown away by his performance on this and subsequent tracks. Gabriel's masterly evocation of a love unfulfilled, why don't you touch me plaintively bemoaned, still has the power to move and shock.I really like Phil's vocals on For Absent Friends, a lovely portrayal of times gone by. Hogweed is simply great fun, something that could only come out of England/Britain, I think. Wonderfully quirky and, certainly at the4 end, menacing.I still get blown away when I hear Gabriel singing the Despair that tires the world passage on Seven Stones, featuring some excellent mellotron work by Banks, the finest performer of most peoples favourite instrument!Harold the Barrel is again a wonderfully quirky and amusing song which tells a story in unique fashion.Harlequin is another beautiful ballad - by God, Gabriel has a lovely voice and is used to full effect here, backed by some lovely acoustic guitar work.The album closes very strongly with Fountain of Salmacis, featuring the strongest burst of guitar work I think ever recorded in the middle of a song. Hackett's solo is simply stunning, and is, again, backed up by excellent keyboard work by Banks. Greek myths are timeless, which is why, I think, this track still entertains and informs.All in all, an absolute classic and an essential purchase for any progessive rock collection."
    },
    {
      "reviewer": "crimson87",
      "date": "Posted Sunday, April 5, 2009",
      "rating": 4,
      "text": "This was my least liked of the Gabriel albums , I couldn't see why it was so highly rated on the site. The production is muddy , the long songs aren't that good and on top of that there are some short numbers that seem pointless. Luckily , listen after listen I started to realize that this record is as good as any Genesis prog record , and if I am in the right mood I may consider it the best the band has recorded.Nursery Cryme is probably the most agressive record Genesis has released ( by Genesis standards) The drumming here is powerful , and the guitar riffs are quite unusually loud for Hackett. Of course the best song of the bunch is the opener , The musical box which may be one of the best 5 songs this guys created. Gabriels characters are very well performed , and there are some strong mood variations alonside the 10 minutes this mini epic lasts. From subtle vocal harmonies , to cruchy riffs this song has it all. \"For absent friends\" is the first song Phil Collins sings with the band , but unlike \"More fool me\" the tune does not feel out of place in this album. Then we have the second long number of the record: \"Hogweed\" continues the fairy tale-like mood \"Nursery Cryme\" has right from the very beggining with a typical Hammond riff and then it builds up based on very steady drumming and it has an impressive ending , probably the most powerful in any Genesis record.The fourth track is my favourite of the record and a sadly forgotten number. \"Seven stones\" features strong Mellotron lines by Tony Banks which fit really well with Gabriel's dramatic vocals , his singing here is one of the highlights of the record. This song alone is worth the price of 5 epics at least even if it's really short by progressive rock standards. Right after that we have the much maligned 3 minute tracks \" Harold the Barrel\" and \"Harlequin\". Both tracks , while not masterpieces , ain't bad at all. The first one is hilarious and really cynical , while the second one is really gentle , very PFM like. The record closes with another mini epic called \"The Fountain of Salmacis\" . Lyrics here are based on greek mythology. Starts with a sudden burst of the old Mellotron , more or less announcing the epic climax this song has. Good old Melle won't go until the song is over , and that can't be a bad thing. When the nymph merges with Hermaproditus the tune becomes more and more dramatic. Phil Collins does his part delivering a really solid performance behind the kit.Overall , \"Nursery Cryme\" is a very good record once you get used to the weak production it has. It may even be a masterpiece... who knows?"
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Friday, May 29, 2009",
      "rating": 4,
      "text": "Genesis was becoming a more formidable progressive rock act, but they would reach their zenith over the span of the next three albums. With this album, they established quite a bit a credibility, and while I was unimpressed the first two or four times I heard it, the music gradually weaved its way into my subconscious, and I found myself needing to hear this grand achievement again. I would compare this album to Yes's Fragile simply because there are a few long and essential Genesis pieces on it, but they are interspersed with somewhat weaker material. What's more, this album has one of the worst productions in progressive rock music. The vocals are swamped in the mix, and \"muddy\" is an adjective most often used to describe the sound. At times the vocals sound isolated, but perhaps that is to good effect given some of the themes of the songs. Any fan of Gabriel-era Genesis should get this album in his collection, although he probably already will have it.\"The Musical Box\" Layers of gentle guitar and quiet vocals begin this bittersweet masterpiece. Steve Hackett's weepy guitar sets the tone for the song as Gabriel sings the haunting words. The story behind them is ridiculous at first glance, but something about them resonated with me on a visceral level. There's a menacing change of pace after a while as the sound fills out: Tony Banks comes in on organ, the bass rumbles, and the guitar is heavier and shrieks into a solo. There's a brief soft section that bridges the harder rocking ones, masterfully inserted as the protagonist sings a haunting nursery rhyme. The part that follows the second torrential segment is hands down one of the best moments in all of Genesis. The inflections in Peter Gabriel's vocals are perfect given the context of the song, and as the organ rises back in, he begins singing so pleadingly, its impossible to not feel sorry for the character. \"Why don't you touch me?\" he cries.\"For Absent Friends\" Under two minutes, this little ditty is a quaint acoustic piece with Phil Collins on vocals. It's a pleasant enough song.\"The Return of the Giant Hogweed\" Things get a lot heavier, with this alarming track that has two lead guitars, one low and one high, panned on both sides. Gabriel sings with a fair bit of vitriol as he tells a bizarre story about a hogweed that takes over the country. The riff during the verses is extremely inventive, and Mike Rutherford does a remarkable job in the background. The soft tinkling of the piano provides an excellent backdrop for the bass and lead guitar to work over during the instrumental section. After a short vocal bit with some of Gabriel's strangest vocals, there's a fiery and thunderous conclusion.\"Seven Stones\" This beautiful song reminds me very much of good Seals and Crofts. Despite his youth, Gabriel's voice sounds aged as he reaches in the falsetto range and even as he sings naturally. The strings at the end are mesmerizing and gorgeous.\"Harold the Barrel\" Here's a frantic song with amusing lyrics and giddy piano playing. It describes a restaurant owner who has apparently had enough of goes up to a window ledge. As a last resort, when his mother comes to the scene, she tells him his shirt is dirty and there's a man there from the BBC.\"Harlequin\" Another gentle folk song, this one is nothing incredible, but it is at least very pretty and warm.\"The Fountain of Salmacis\" The other great achievement on the album is this amazing song. Swells of Mellotron wash over a stark organ three times before the singing begins. The story is that of Hermaphroditus (son of Hermes and Aphrodite in Greek mythology), who unwillingly blends with the naiad Salmacis, thereby explaining the phenomenon a person displaying both male and female sex characteristics. This piece has Rutherford at his absolute best; I often find myself focusing on the bass line during the verses. But the singing is so very hard to ignore also! This is probably my favorite song on the album, even though on some days I find myself yearning to hear the first one more."
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Monday, June 22, 2009",
      "rating": 5,
      "text": "Slow Burner that will Eventually Capture You with its BrillianceI went into this review fully expecting to give this album 4 stars and talking about how it was basically Foxtrot's little brother. Foreshadowing greatness, but still undeveloped. Fortunately, as is my habit before reviewing an album as complex as this one, I take several deep, fresh listens. It was only when I did this for this particular review that I realized what a treasure this album is. My main experience with this album was in my first rush of prog about 15 years ago, and at that time this one just didn't grab me in the same way SEBtP did. Now, my experience is quite a bit broader, and more importantly, I've become very familiar with the excellent album Trespass.Nursery Cryme is not the lesser version of Foxtrot, but rather is the transition between Trespass and Foxtrot. Again, the presence of Anthony Phillips was a huge part of the Trespass sound, and he played a part in the songwriting for Cryme. At the same time, Phil Collins and Steve Hackett are now on board, and the band seems to be brimming with excitement as both members' performances are full of energy, and both are given quite a bit of room to shine. Hackett's powerful leads dominate \"Return of Giant Hogweed,\" while Collins' jazzy virtuosity is all over the entire album but is especially impressive on \"Hogweed\" and \"Fountain of Salmacis.\"Thinking of the album looking backward instead of forward, the ethereal voices on \"Seven Stones\" are the last sign of the debut album's feel. But what is also preserved is some of the best melodic sense of the Peter Gabriel era. \"The Musical Box\" sounds more like later albums with Gabriel following his characteristic melodic contours while spinning his story telling. But \"Harold the Barrel,\" \"Return of Giant Hogweed,\" \"Fountain of Salmacis,\" and the Collins vocal piece \"For Absent Friends\" all have hummable melodies that are distinct to the individual songs. Collins' vocals are used to better effect than any album up until he takes over the lead on Trick of the Tail. The short \"Harlequin\" sounds like it was taken straight off of Trespass.In fact, the only weak part of the album (which unfortunately affects everything) is the production. Collins' vocals are recorded and mixed very poorly. The whole mix is a little muddy and dull, leaving the band sounding a bit amateurish. At the same time, the low-fi recording makes the disc sound almost live, like a good soundboard recording rather than a true studio disc. The looseness and energy are captured despite the sound being less than sharp.If you read through the reviews here, the theme I've brought up recurs fairly often. That is, a somewhat weak first impression but deepening appreciation with multiple listens. I do admit that there is nothing here that totally transports me to another world like \"Supper's Ready,\" \"Carpet Crawlers\", or \"Firth of Fifth\" but this is an album with very consistent high quality, incredible energy, and deserves its place among the Genesis masterpieces."
    },
    {
      "reviewer": "J-Man",
      "date": "Posted Thursday, September 17, 2009",
      "rating": 4,
      "text": "This is the third album from my favorite classic prog band, Genesis. I love this album dearly, but they still had not perfected their sound with all this new talent that entered at the release of this album. Being the first album with Steve Hackett and Phil Collins, they sure had an excellent lineup at this time through \"The Lamb Lies Down on Broadway\". True this is my least favorite album of Genesis' classic lineup, but considering every other one I gave 5 stars, that isn't saying too much.With that said, this album is awesome! With 7 tracks, it contains some short and longer pieces. It is noticeably more geared towards folk at times, as well as containing some of Genesis' most hard rock sections. The general breakdown is, this contains 3 masterpieces, one great song, and 3 sort of unmemorable ones. Considering the three masterpieces take up the bulk of the album, this is an excellent album.The only real problem is that the recording quality is Genesis' worst. They were never known for having great recording quality, but this is exceptionally bad for them. It was recorded on 8-track, so I shouldn't expect too much anyway. Here's an in-depth summary of the songs, but I'll try to keep it short, being that there are so many other reviews on the site.THE MUSIC:\"The Musical Box\"- A classic progressive rock song. When people think of Genesis, or even prog rock in general, this song is what they think of. It starts as a beautiful acoustic section with light vocals from Peter Gabriel. It later has distorted guitars, mad drumming, and heavy organs. In one of the guitar solos, it is actually one of the first references of the guitar technique \"tapping\". The ending is awesome, as is this whole song.\"For Absent Friends\"- A short little acoustic song with Phil Collins on vocals. Nothing too memorable, but it's alright.\"The Return of the Giant Hogweed\"- This starts out with a nice riff that makes for a nice opening. This is kind of a mix between heavier bands like Deep Purple, and the Genesis we all know. It does have some heavy use of organs and distorted voices by Peter Gabriel. The use of flute actually gives this almost a Jethro Tull kind of sound at times. An excellent song!\"Seven Stones\"- Somewhat of a ballad, but a beautiful song. The strings ad a nice touch, and Peter Gabriel's voice sounds great here.\"Harold The Barrel\"- A lighthearted almost ragtime song. It is very piano driven and has some catchy melodies.\"Harlequin\"- Another more folky acoustic song. It's not particularly great, but it's a good enough song.\"The Fountain of Salmacis\"- The closing masterpiece of the album. The use of Mellotron is superb here, as is the organ. I really love everything about this song, from the contrasts between dark and light and the excellent jam session near the middle. It has some great use of the flute among some pretty heavy guitar, organ, and bass playing. A masterpiece of progressive rock!This is full of memorable songs, but has a few songs that are pure filler. Sure it's not as good as Foxtrot or The Lamb, but then again there are few albums that are. If you are looking to get into early Genesis, this is a great album, but I recommend Foxtrot first. This is still an excellent album with some of Genesis' best work.4 stars."
    },
    {
      "reviewer": "Marty McFly",
      "date": "Posted Saturday, September 19, 2009",
      "rating": 5,
      "text": "I like this one, that's for sure. But there's one thing about it. It's not instant catcher, or at least is not for me. I first heard \"Selling\", then \"Foxtrot\" and that was it. I was satisfied and wasn't seeking more these days. This album is not as melodic and attractive for normal listener (I mean that it is attractive, but not as much. It's hard to compare anything with \"England By..\", because almost everything will be over-shaded), but it has solid structure. As shown inMusical Box(OK, add \"The\" before it), this song is tender, with many calmer parts. It's tender, but not fragile. After repeated listens, you'll probably start loving it, as I do now.And these ideas. Maybe it wasn't good idea to start with their best material before moving to previous records, but that's it. I think that a lot of people did the same, at least those who weren't living in these times. As I can see, there are three, mid-length epics. Funny thing is that when you compare two songs with similar style (to some extent) and name, \"The Musical Box\" and \"The Cinema Show\", even total count of chars is the same.The Return of the Giant Hogweedis true epic and perhaps the most well known song from \"Nursery Crime\". Or tremendous songSeven Stones(in fact, just six of them are tremendous, the last one is shocking, rebellious and completely insane). OK, it's not insane, but I know one song that is,Harold the Barrel, which reminds me much of certain parts of \"Suppers Ready\".5(-), these things are here. And I'll probably listen this album as much, or even more than previously mentioned two more famous brothers. Because it's not so well known by me, it's something I still didn't get tired of. This is like almost grown child that will mature with Selling Foxtrot.EDIT: After repeated (many, many, many) listens, I found out that this record is even better than I thought before. And that it's unfair to compare it with their best ones, because I wasn't assuming that they can do for example 4 masterpiece rated albums. I do know and must admit that it's right.To the hell with pessimism, let's enjoy musical ecstasy of late part (minute or two) ofCinema Show, what a masterpiece."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Saturday, September 19, 2009",
      "rating": 4,
      "text": "Genesis finally carved their niche with their third album. It's a most original and wide-ranging affair with excellent vocals, intense playing and the best album cover of the year.The success is for a great deal accomplished by the new recruits Hackett and Collins. On the preceding Trespass Genesis showed great promise but lacked the technical skills and energy to make their music come alive. Here, Collins and Hackett injected the music with the required power boost and added impressive dynamics into the stew. The quiet parts are soft and fragile; the loud parts rock your socks off. Especially on the Musical Box and the Giant Hogweed, we find Genesis radiating with enthusiasm and sheer pleasure at what they are doing. Also Seven Stones and the Fountain of Salmacis do not disappoint. Soaked in mellotrons they provide a nice romantic counterbalance against the forceful tracks that preceded it.Unfortunately, to reach the 40 minute mark they added some filler. With just one other accomplished track instead of those 3 dreary sketches they might have got themselves a 5-starrer. But no fuss, that was just around the corner."
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Thursday, November 12, 2009",
      "rating": 4,
      "text": "The classic line-up beginsFrom Trespass through The Lamb, legendary proggers Genesis laid forth a 5-album streak of some of prog's most beloved classics. Trespass was their breakthrough masterpiece and established the band's lush sound built around guitar and keyboards, and lead by the dramatic and passionate voice of Peter Gabriel. Unfortunately, guitarist Anthony Phillips, who was the heart of the band at this time, was having unbearable issues with stage fright. It became so bad that he felt he had to leave the band. It's a shame because as good as they were anyway, they were a better band with Phillips in the fold. The band used the departure of Phillips to shop for a new drummer figuring they would handle both personnel issues at once. Enter Steve Hackett and Phil Collins....and so begins the next chapter which was a continuation of their most significant creativity.Several changes occurred in the sound between Trespass and Nursery. First and foremost was Banks stepping to the forefront with much more emphasis, the folksy medieval charming-ness of Phillips no longer in the way. Hackett brought with him a more confident and somewhat heavier lead in the rock sense, the bold leads of \"Musical Box\" are melodic and powerful. Second was the undeniable control and finesse that Collins brought to the kit. As great as I feel Mayhew was, and I personally prefer his style, there is no doubt that progressive rock fans enjoyed what Collins brought to the sound, let alone the eventual vocal prowess. Nursery Cryme would keep the English whimsy of Trespass but feel more Victorian than Middle Ages, more rock than woodsy, more feisty than breezy. \"Musical Box\" was and remains an absolute high point of the band with its top notch songwriting and good fun.\"Hogweed\" is another step upward in rock intensity with furious bashing by Collins and chunky fuzzed out guitars melded beautifully to Banks keys and even occasional remnants of Gabriel's flute. \"Seven Stones\" is a grand vocal piece that recalls Trespass in mood and softness, with flute and pastoral ambiance. Here's a prime example of Collins overplaying though, a song where I'd prefer Mayhew's style. \"Harlequin\" is another luscious but mellow track that could have been on Trespass, with glorious vocal harmonies, serving as the perfect introduction to the third classic of Nursery Cryme. \"Salmacis\" is another fan favorite with imagery of water that is mimicked in the sound, the dreamy part from the beginning which recurs sounds exactly like a dark pool of rippling water would look to the eye. Brilliant concoction!I love the confidence Tony Banks exhibits here and I feel with Phillips departure it was his show despite the more popular and acclaimed Peter Gabriel in front. Cryme is another classic album that leads the competition of the day: easily a better album than Meddle and a bit stronger than The Yes Album."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Saturday, December 12, 2009",
      "rating": 3,
      "text": "Meh.This is the first album by the complete \"classic\" Genesis lineup. And I'll have to admit, the songwriting is very good. But as usual, the performances always leave me wishing for more. I just don't hear the band pushing the music to the stratosphere. That's why this band will always be second tier prog to me. It doesn't appear to be for lack of trying. Banks and Hackett put in their fair share of solos. They just leave me flat.The Musical Boxhas some nice sections, but kind of lame lyrics (maybe they're just too British for me).The Return Of The Giant Hogweedis memorable.Harold The Barrelis a listenable uptempo song.The Fountain Of SalmacisI like the most on this album. It's a good closer, as it almost makes me forget the shortcomings of the rest of the album."
    },
    {
      "reviewer": "The Sleepwalker",
      "date": "Posted Wednesday, December 23, 2009",
      "rating": 5,
      "text": "Nursery Cryme is Genesis' third studio album. New to the band are two members that would be very important to the unique sound of the band: guitarist Steve Hackett and drummer Phil Collins. Nursery Cryme is often said to be inferior to future releases like Foxtrot and Selling England By The Pound, but I think this album shows the band at their best. The album features several epic pieces and also some shorter pieces. These shorter pieces often are described as \"filler\" by many people, but I feel that they contribute to the album's quality by adding some softer moments between the epics.\"The Musical Box\" opens the album with a gentle intro. This epic song features many different parts, so it's no surprise that after several minutes the power of it gets unleashed. The striking and fuzzy guitar soloing by hackett, the powerful organ by Tony Banks, Phil Collins magnificent drumming, it all sounds fantastic. Peter Gabriel's vocals are very emotional as well, and the sum of these things makes \"The Musical Box\" an absolute masterpiece. \"For Absent Friends\" is a soft and brief break, sung by drummer Phil Collins. The song gives the listener a chance to calm down after the epic opener and before another epic piece, \"The Return Of The Giant Hogweed\". Though not as overwhelming as \"The Musical Box\", this song still is fantastic. The intro is one of the most convincing intros I've ever heard, having an intense strength. Also, the piano part and the guitar solo after the five minute mark are absolutely lovely. \"Seven Stones\" is another great song, though it's not one of the short songs and not an epic as well. It's a calm and pretty accesible song, very rich of organ. This is definitely not the best song on the album, but it's a very good one indeed.\"Harold The Barrel\" is an unusual piece. Peter Gabriel narrates the story of a man that's on the point of jumping down from a building. Just like Gabriel would do in the future, on Selling England By The Pound, he makes use of different kinds of voices in the song. This isn't a masterpiece obviously, but a fun song definitely. \"Harlequin\" is a soothing and lovely song, serving the same use as \"For Absent Friends\". The albums closer is the third epic, the astounding \"Fountain Of Salmacis\". The song opens with mysterious mellotron sounds, followed by a verse, which is full of Mike Rutherford's excellent bass playing. Everything about this song sounds so good, making it one of my favorite songs ever. The song is fairly straight forward for its length, though the second half features a superb organ and guitar climax. Also the ending of the song is incredibly powerful.Nursery Cryme is a masterpiece for sure. It features some of Genesis' best moments and because of the shorter, softer songs the album has a very fine flow. The three epics on this album are among my favorite songs ever made, and in my opinion are superior to songs like \"Firth To Fifth\" and \"Watcher Of The Skies\", which are favorites among many Genesis fans. This album deserves nothing less than five stars."
    },
    {
      "reviewer": "friso",
      "date": "Posted Thursday, January 14, 2010",
      "rating": 5,
      "text": "I'm not that big a fan of Genesis, but I like Trespass and its follow-up Nursery Cryme. Especially on this album the band plays progressive rock that actually does have moments when the music rocks. The band also sounds quite lively, as if the album was recorded live in the studio. Peter Gabriel's story telling and moments of intimacy with the listener are also very effective here. The production of this album has a distinct warm lof-fi sound, that works great for the moods of the album. Phil Collins is introduced as the new drummer and joins the instrumental section is accentuating every theme. I myself prefer the more stable framework and timing that John Mayhew provided on Trespass. To my ears Collins' drumming is a bit chaotic and too much up front. The song-writing on Nursery Cryme is very good throughout and after catching the listener with opening lines of 'The Musical Box' you're in for quite the ride. 'The Return of the Giant Hogweed' is one of my favorite songs of the band; it has a great story in which Gabriel would introduce singing different 'roles' with different moods in a song. This theatrical approach is so often sorely lacking in the band that try to mimic Genesis."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Sunday, April 4, 2010",
      "rating": 4,
      "text": "''The Musical Box'' ought to be one of those songs one person must be required to have listened to in order to earn ''prog fan'' credentials. It's one of the first prog pieces I've heard way back when I was first getting into the genre; that classic soft intro to hard and heavy middle to epic conclusion sounds great to me even if countless other bands make this structure sound terribly forced.''The Return of the Giant Hogweed'' and ''The Fountain of Salmacis'' are nothing to scoff at either; the subject matter might be corny, but the grandiose majesty of the instrumentation more than makes up for it. Rutherford and Collins really let their instrumental talents known on these pieces, but to most proggers, Hackett's spider-like guitar work and the mellotron infestation of the ''Salmacis'' are the highlights (and I certainly can't disagree).''Harold the Barrel'' is a massively overlooked track that manages to cross a wicked sense of humour with a spellbinding musical performance that takes many twists and turns. ''Harlequin'' and ''Seven Stones'' are nice tunes, but practically unmemorable. ''For Absent Friends'' does it for me better for its relatively short length and Phil Collins's vocals which are quite restrained here.Magnificently epic barring slight production faults, but the compositional quality is what makes NURSERY CRYME one of those elite classic of progressive rock."
    },
    {
      "reviewer": "EatThatPhonebook",
      "date": "Posted Tuesday, April 27, 2010",
      "rating": 5,
      "text": "9/10\"Nursery Cryme\" is one of the great albums of Progressive Rock.In 1971, Genesis release their first masterpiece, \"Nursery Cryme\", an album that went down in history as one of the finest Symphonic Prog releases ever. After 40 years, the album has not lost any of it's magic, and continues to stun new and old fans.\"Trespass\", the sophomore LP, gave a much more clear vision of how Genesis will become: it's melodies, it's atmosphere, were typical of the band's style that is known today. But with \"Nursery Cryme\", the maturity level is complete, giving a wonderful mix of atmospheric passages and beautiful, haunting melodies. What clearly improved compared to the sophomore LP is the musicianship, much more precise and detailed, without ever having any goofs. \"Foxtrot\", the next album released the following year, will have some of the best and most original musicianship that has been heard in any piece of music, so it's just wonderful knowing that \"Nursery Cryme\" Genesis have barely started in stunning the audiences. The slower passages are very present in the album, very frequently accompanied by Peter Gabriel's intimate vocals, or some additional instrumentation such as flute or mellotron. These calmer moments are kind of a trademark for this album in particular: the enlivened moments are here, but they still have a somewhat similar feel to the slower ones.\"Nursery Cryme\" might just be the most delicate, intimate, playful album Genesis have ever released: however, like it was previously mentioned, the maturity is here, so the innocence is exquisitely mixed with haunting, beautiful moments, that suggest quite the opposite, especially in the opening track \"the Musical Box\", now regarded as one of the great tracks of the band. \"Nursery Cryme\" is a dare-to-open box of toys, that any child can open, but his innocence will be gravely endangered, as there is in it the adult world. It's almost like a coming-of-age album: You will not be the same, when you have properly listened to this masterpiece.The magic seems to never end in these 39 minutes, but they pass so quickly, you wish they were more. The ten minute opener \"The Musical Box\" is probably the most haunting, complete, and eclectic song off the entire album, featuring slow, mysterious moments, and bursts of guitars, keyboards, and intense drumming. It simply has it all, with an incredibly thought provoking structure. \"The Return Of The Giant Hogweed\" is the most theatrical song off the album, very brave, with enchanting melodies, and a gigantic sound as well,that will even terrify you in some moments. The shorter songs, from the interlude \"For Absent Friends\" to another perfect song, \"Harold the Barrel\" and the gentle \"Harlequin\". \"The Fountain Of Salmacis\" and \"Seven Stones\" are other complex, seven minute songs that provoke and move at the same time, making both of them, like all the other songs here, priceless experiences.The power of Progressive Rock is that an album itself can bring you to a fantastic, surreal world. The universe of \"Nursery Cryme\" is one of the most vivid and credible ones: one of the great albums of Symphonic Prog, a masterpiece that hasn't aged a bit, and probably never will be."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Sunday, June 6, 2010",
      "rating": 4,
      "text": "Given the historical significance and the sheer creativity that went into this album, I think it has to be either a 4 or 5 star album. Given the production limitations and some unevenness in content, I'm going to be conservative and go with 4 stars, though I could also support a \"must-have, essential\" classification.Great albums often start with great cover art, and the illustration of a girl croquet-ing heads about a field is one of the best in prog in my opinion.How about the music? Well, it's certainly creative and ambitious. In other words, quintessential prog. However, it sometimes comes across a bit disjointed. Take The Musical Box: there's plenty of good melodies, and you have to love the rousing finale, but the stops and starts tend to hurt the song's momentum. My favorite here would be Salmacis, with blissful mellotron, a well-told story, some nice guitar-work, and some great stuff by Collins. A true team effort, in writing and performance. This is what I would look for more of in subsequent works, and fortunately I would get it!The bottom line is that once you make the crossover into prog, it's only a matter of time until you pick this up, and when you do, you won't regret it. Nursury Cryme certainly led to more greatness and even higher highs for the band and individual players, but does not quite reach masterpiece status."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Thursday, June 10, 2010",
      "rating": 5,
      "text": "A pandora's box of prog delicacies; Mother Goose laid the Golden EggThird time for Genesis and they finally got it right. Everything that was great about \"Trespass\", namely their classic album closer'The Knife'was captured on every track. \"Nursery Cryme\" is the first Genesis masterpiece and what an incredible improvement it is from the first two albums; the band hit their peak with amazing compositions such as'Musical Box'and'Seven Stones'or'Fountain of Samalcis'. The Genesis lineup here is the most revered with Gabriel, Rutherford, Banks, Collins and Hackett. The production is wonderful with intricate mixing of instrumentation and Gabriel's vocals are kept back blended in with the music rather than overbearing as on \"Trespass\". Each track tends to create an atmosphere and tell a story that is captured by the beautiful iconic cover illustration that is an enigmatic collage of all things Genesis.'Musical Box'is a marathon of dark and light shades, a consistent pulling of tension and release, with musical virtuoso as never before heard by the band.'Musical Box'is a dynamic exploration of symphonic pomp prog. They are undisputed on this track and it remains one of the all time treasured masterpieces of Genesis and indeed prog history. The chord progressions are intricately executed with a dozen or so melodies and time sigs pastiched over one another to create a soundscape montage. Gabriel pleads,\"Play me Old King Cole, That I may join with you, All your hearts now seem so far from me, It hardly seems to matter now.... Play me my song, here it comes again\".The references to Lewis Carroll echo the album artwork, and there are huge dollops of black humour and an enchanting Gothic mystical fragility. The flute is sweet and beautiful, and it plays over a dark tirade of Rutherford's heavy bass and Hackett's guitar. Gabriel is pastoral with flute and gentle vocals for the first section and then it builds to the dramatic blast of fire that explodes and rains down over shadowy volcanoes of molten mellotron. The time sig changes as a swell of organs and Hackett shines in the lead break, the sound cascades down from speaker to speaker teasing the ears, like an aural torture device. Then it settles as the'Old King Cole'nursery rhyme is sung. It could be pretentious but it sounds moody and serious. Gabriel gets intimate on,\"The clock tick tock on the mantelpiece and I want you to feel... and I know how to touch the wall.\"The music detonates into huge bombastic phased organ waves that crash down on the beach as a thunderclap of drums and bass blast the hemispheres. It lulls into an unnerving quiet guitar picking as the vocals state,\"she's a lady and she's got time, brush back your hair, and let me get to know your flesh.\"The church pipe organ presents a religious feel and the drums tend to build and then a huge swell of pipe organ drowns out Gabriel begging us to touch him now. This completes an absolute blitz of song structures within songs and it coincides with the final paroxysm of energy from Hackett and Banks trading off perfectly with stop start ruptures of sound. This track is, in a word, unparalleled.'For Absent Friends'is a short ballad or transition between two brilliant tracks. Phil Collins takes the driver's seat with warm vocals as lead singer in a prophecy of his later involvement when he would transform the sound of Genesis. The lyrics are full of religiosity, and obscure twisted dogma;\"Inside the archway the priest greets them with a courteous nod. He's close to God. Looking back at days of four instead of two. Years seem so few. Heads bent in prayer for friends not there.\"It makes a nice resting place for tranquillity and a stream of calm waters before the storm rages.The clouds of thunder roll as'Return of the Giant Hogweed'crashes in. It begins with a mesmirising angular riff and then the wondrous chord structure to signal in the verse;\"Turn and run, Nothing can stop them, Around every river and canal their power is growing. Stamp them out, We must destroy them. They infiltrate each city with their thick dark warning odour\". Gabriel is passionate and sneering as he belts out the verses and utters chilling warnings such as,\"Waste no time, They are approaching. Hurry now, we must protect ourselves and find some shelter, Strike by night, They are defenceless. They all need the sun to photosensitize their venom.\"Only Genesis could include words like 'photosynthesize' in their lyrics. The Hammond sounds are articulated by bursts of energy ignited from Hackett's blazing guitar. It lulls in to a quiet passage that builds gradually into a heavy riff. The time sigs are all over the place and consistently change in this exploration of progression. There is a repeated pattern of song structure verse to verse and the instrumentation finally drives into a break with some complex patterns with flute, organ, corrosive fuzz bass and striking guitar in a fractured musicscape. The piano chimes in as all goes quiet and the threat of more chaos is imminent. There is a lovely keyboard solo here with a quirky rhythm and distorted lead guitar. The melody is transformed into dark textures and the sound becomes aggressive and more intense. The threat of the music is echoed by the threat of the Giant Hogweed on it's spiteful quest for revenge against the human race. The nightmarish imagery taken from a B grade sci fi movie perhaps, is perfect fodder for Gabriel to showcase his theatrical abilities;\"Botanical creature stirs, seeking revenge. Royal beast did not forget. Soon they escaped, spreading their seed, preparing for an onslaught, threatening the human race.\"In concert of course he would have a ball dressing up as botanical semi-crustaceous metamorphosed lunatic creature and he revelled in the unreality of his psychotic altered universe. The music mimicks the horror tale alarmingly, even to the point of retelling its own story with funeral marches and music hall waltzes, a sound of ridiculed terror. Looming metrical changes make dark clouds cover the landscape with shadowy clouds as we draw to a close this masterful piece of music.'Seven Stones'has lovely melodic passages with Gabriel taking control over the thickly layered organ and guitars. The music is allowed to breathe as instruments die down and a piccolo sound is heard and Gabriel on flute. His story telling qualities are exemplary on this track;\"Tinker, alone within a storm, And losing hope he clears the leaves beneath a tree, Seven stones Lay on the ground.\"As the song progresses Gabriel tells the strange tale of the\"Sailors, in peril on the sea\"and\"The Captain turns the boat\"and the\"Farmer, who knows not when to sow\". It is a nursery style again in line with the thematic title. This song truly grows on you with each listen, especially the wordless chorus sections. The way the vocals augment the music is incredible and the instrumental break here is alight with sweeping mellotron creating an uplifting atmosphere that dominates and builds higher into the clouds to meet the sun rays of very emotional string orchestrated sounds. It is a majestic quality that only Genesis can maintain. The mellotron ends this and the final product is one of the most beautiful Genesis classics.There is still a tongue in cheek thread on songs such as'Harold The Barrel'which paved the way for such storytelling epics as'Supper's Ready'. The honky tonk piano will remind one of ELP's'The Sheriff', equally out of place as this. Gabriel is delightful as he shoves it up the suits of an organised criminal inquest. A\"Bognor restaurant-owner disappeared early this morning\"and the hunt is on giving Gabriel license to channel all sorts of whimsical characters, such as the Man-in-the-street who suggests\"it's disgusting, Such a horrible thing to do, Harold the Barrel cut off his toes and he served them all for tea...\"It would be crude if not for the biting satirical delivery. Gabriel is truly sardonic on lines such as\"You can't last long, Said you could'nt trust him, his brother was just the same.\"Gabriel continues to mock the stereotypes of autocracy and Harold's demise is never determined but we hear from his wife, the man on the spot, man on the council, lord mayor and the ridiculous Harold who states\"If I was many miles from here, I'd be sailing in an open boat on the sea, Instead I'm on this window ledge...\"Will he jump? We never find out. This is reminiscent of all the Gabriel fuelled parodies on the English idyll, no longer a pastoral pastiche but a worldly attack on how the English behave; even with mocking phrases,\"we can help you... you must be joking, take a running jump\", Gabriel sneers. It reminds me of 'Willow Farm' section of'Supper's Ready'or especially'Get 'em Out by Friday'.'Harlequin'is more like the pastoral folky feel of \"Trespass\", a style that would be shed completely as the band matured thankfully as they were always better heavy and bombastic with Gabriel unleashing his fury and antagonism. Here Gabriel is withdrawn and gentle and harmonious with other voices blending in a dreamy way. The lyrics are sugar sweet and balladic but there is an edge that things are surreal and dreamlike.\"harlequin, harlequin, Dancing round three children fill the glade, Theirs was the laughter in the winding stream, and in between. From the flames in the firelight.\"If this were not so short I would have thought it would feel like a filler or throwaway but it is a nice change in direction. I would not rate it as a highlight but there is nothing wrong with some acoustic picking and harmonies from Genesis occasionally in small doses.'Fountain of Samalcis'is another outstanding track and begins with a beautiful volume swell of mellotron ominously building like a jet plane swooping past, perhaps like a fountain rising and falling. Gabriel tells the weird surreal story and the track builds with glorious mellotron orchestrated in a symphonic crescendo by Banks. The story is a retelling of the Greek myth about an Hermaphrodite and yet it is captivating to reinvent the age old tale, a musical theatrical powerhouse. Gabriel brings the story to life with his excellent vocal prowess, perfection of intonation and pronounced tone that is stirring and evocative;\"As the dawn creeps up the sky, The hunter caught sight of a doe. In desire for conquest, He found himself, within a glade he'd not beheld before... Where are you my father, Then he could go no farther, Give wisdom to your son, Now lost, the boy was guided by the sun\". The violining of Hackett's guitar is masterful and he plays some angular riffs in this that are repeated as a hypnotic motif camouflaged by Banks soft key pads. Gabriel chimes in with\"as he rushed to quench his thirst... A fountain spring appeared before him And as his heated breath brushed through the cool mist, A liquid voice called Son of gods, drink from my spring\". The bassline is notable of Rutherford. An interlude of soaring guitar ensues, with strong rhythmic shapes from Collins on percussion, a strange brew of bombastic glory. The bassline pulses stronger and some cathedral pipe organ is heard. I love this part and it continues to build to the next verse and the music answers Gabriel in turn. Pipe organ flourishes follow and a staccato organ that sweeps across a layer of frenetic bass and chaotic drumming. It fades for a time and builds with the huge organ swells like sunlight bursting through dark clouds, rays of light across the horizon. There is a grand finale with simmering elegance that shoots rays of light at the end to culminate in an apocalyptic crescendo. Masterpiece track to complete a masterpiece album.In conclusion, ladies and gentlemen this is a classic legendary album that raised the bar for 70s prog, and subsequently this led to \"Foxtrot\" and \"Selling England By the Pound\" which are even better by comparison. Genesis were at the peak of their powers with this lineup and they were to enjoy some incredibly prolific years in the music scene until the final decision for Gabriel to seek out greener pastures. The grass has never been greener though with the 70s Genesis sound; an indelible trademark style and a lineup that could be termed as lightning in a bottle."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Thursday, September 16, 2010",
      "rating": 4,
      "text": "ANT has left the building, but not his music, not his sound, not his spirit.Welcome, Phil! Welcome, Steve! Won't you please stay for a while? I think we can do some interesting things. We may not make a lot of money or become very famous but we'll definitely show them something . . . different!. . . I hope . . . I think.Five star songs: The flawless and dramatic, \"The Musical Box\"; the gorgeous and poetic \"Harlequin\" (my second favorite Peter Gabriel vocal next to \"The Lamia\"); and the epic mythological tale, \"Fountain of Salamacis.\"Four star songs: \"The Return of the Giant Hogweed\" and \"Seven Stones.\"Three star song: \"For Absent Friends\" and \"Harold the Barrel.\"Overall rating: four stars; an excellent addition to any progressive rock music collection."
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Monday, December 13, 2010",
      "rating": 3,
      "text": "The band's third album but first with Collins and Hackett. Like the previous two, the production here is not too good. In all three cases it sounds like the band were on a low budget and had to rush the recordings. All the live versions of the songs here sound better than their studio counterparts. It is often claimed that Genesis were a big influence on many French and Italian prog groups. To some extent maybe, but I think that influence is exaggerated. One place this album was an influence was in heavy metal. Hackett was one of the earliest guitarists to do finger-tapping, and his playing in general is closer to what you would hear in '80s and '90s metal than in '70s rock. Banks also puts his electric piano through a fuzz-box creating a guitar sound. The twin guitar attack(with only one real guitar) was an influence on later bands like Judas Priest and Iron Maiden.\"The Musical Box\" is probably the single best song Genesis ever made. I haven't heard a live version that was not better, however. Anthony Phillips co-wrote this song before he left the group. Beginning with organ and the part that goes \"I've been waiting here for so long\", starts one of the best moments in all prog. Truly classic stuff there. \"For Absent Friends\" = filler. \"The Return Of The Giant Hogweed\" is another classic. Great dueting of Hacket's guitar and Banks' electric piano. Everything about this song is just great. I like how near the end Gabriel's vocals are recorded at a different speed, giving him a deeper voice.\"Seven Stones\" is perhaps the most underrated / undervalued / underwhatever song Genesis ever did. I like the part with harmony vocals and bass pedals. That part leads up to one of the greatest Mellotron solos ever. \"Harold The Barrell\" is a good song. Almost has a late 70s/early 80s New Wave-ish type vibe. A rare glimpse of humour from this band at this early stage. The piano at the end reminds me of the first album for some reason. \"Harlequin\" is better than \"Friends\" but not by much. Sounds like a leftover from Trespass.\"The Fountain Of Salmacis\" begins very majestic with good organ and the Mellotron. I love what the rhythm section is doing when Gabriel starts to sing. Later Collins does some jazzy drumming. A rare example of a jazz influence in Genesis' music. This song features some metal-like guitar soloing from Hackett. A really good album overall, but the superior live versions of these songs almost makes this album obsolete. They really found themselves on this album but would go on to write better songs and have better sounding albums. 3 stars."
    },
    {
      "reviewer": "colorofmoney91",
      "date": "Posted Friday, April 8, 2011",
      "rating": 2,
      "text": "Nursery Cryme is the first Genesis album that displays their true classic-era sound that was still in development on Trespass. Like most all Genesis albums, I found this album to be an amalgamation of good and bad. Personally, this is one of my least favorite Genesis albums, but there are still some nice tunes here.\"The Musical Box\" starts out the album on kind of a boring note, with just Gabriel's voice accompanied by light keys and guitar. But then a mash of manic rock suddenly rushes in and seems very abrasive to my ears. This is one of the most random sounding tracks in the Genesis catalog.\"For Absent Friends\" is a nice acoustic ballad that reminds me of something by John Denver, but obviously less country influenced. Otherwise, I'd probably hate this track, but it comes off as sounding very soothing. But, it doesn't offer up enough in structure to be significant in any way.\"Return of the Giant Hogweed\" is a classic track in the Genesis catalog, and the first impression of this track is always good, but I always feel this track goes downhill whenever Gabriel starts singing. I feel like this would be much better as an instrumental. This track is overall quite heavy and wouldn't sound out of place on Trespass, and is very bass heavy.\"Seven Stones\" is a quaint and softer styled track, and it doesn't really offer much variation other than a speeding up temporarily. This is one of the most forgettable track on the album, though there is some nice mellotron atmosphere near the end.\"Harold the Barrel\" is one of the best tracks on the album, and starts off with a fun and bouncy rhythm accompanied by Gabriel's vocals that come off sounding like someone's senile grandmother. I really enjoy the staccato keys throughout the song. Short, but sweeter than most on this album.\"Harlequin\" is a pretty and quirky sounding tune with Gabriel's outrages vocals being far more subdued than normal, and it sounds nice. This song would be way better if there was some kind of variation, but nothing really develops. It's still beautiful though.\"The Fountain of Salmacis\" is without a doubt the best track on this album, which makes this album the ultimate save-the-best-for-last example. With a strong mellotron intro that forshadows \"Watcher of the Skies\" on the next album, the track soon sets off with rhythmic bass thumping and fantastic mellotron lines. There is a very aggressive keyboard solo in the middle of the song that gives way to another fantastic few lines of bass. There is soon a random theme that appears that gives off a haunted house kind of feel, but it actually works fairly nice on this track.I've found that the classic Genesis albums generally have at least one track that is absolutely great, which happens to be \"The Fountain of Salmacis\" on this album. Unfortunately, every other track has always been highly forgettable in my opinion. I've come to assume that Genesis' brand of quirky symphonic prog is just not something I enjoy as much as most reviewers on this site, but this is a classic album by a classic band and I suggest that anyone interested in prog at least give this a listen for good measure."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Monday, July 18, 2011",
      "rating": 5,
      "text": "The first Genesis album to feature Phil Collins and Steve Hackett opens with The Musical Box, which is a fantastic showcase for both performers' unquestionable musical skills, and then continues in a louder, more confident, and more daring mould than Trespass. The acoustic pastoral style of the previous album, with its medieval atmosphere, has developed into a strange style which retains its pastoral roots (especially on songs like For Absent Friends) but adopts a more Victorian atmosphere, with musical boxes, malevolent hogweeds acquired by long-ago explorers, explorations of classical myth (as on the Fountain of Salmacis) - a favourite subject for the Victorians - and a bit of Dickensian social commentary on Harold the Barrel all contributing to the strange atmosphere of the album.Another unique album from Genesis in a style they'd never quite revisit, which is both highly satisfying in its own right and points the way to the approach they'd take from Foxtrot to The Lamb Lies Down On Broadway, Nursery Cryme deserves to be part of any prog collection."
    },
    {
      "reviewer": "rogerthat",
      "date": "Posted Friday, May 31, 2013",
      "rating": 4,
      "text": "Nursery Cryme is the album where the most illustrious lineup of Genesis comes into being, with the arrival of drummer Phil Collins and guitarist Steve Hackett. This is the album where they begin to find their voice and despite poor production produce many moments of brilliance.The new arrivals certainly have a significant role to play in the transformation of the band. Collins and bassist Mike Rutherford hit it off right away and combine superbly to add much needed meat to the rhythm section. The difference is most evident on the seriously groovy Return of the Giant Hogweed. While the track swings delightfully, it is also heavy and crunchy and Hackett's guitarwork accounts for this. Over the years, Hackett's fondness for King Crimson and, especially, Robert Fripp's approach to the instrument, has been evident and on this album too, he lends some bite and menace to the band's sound. And, being unable to yet (or at any time) truly impose himself on the band, his fascination for heavy music is curbed such that it fits into Genesis's generally playful approach. There is early evidence of his partiality to tapping as also his ability to play shimmering leads that touch the soul (Fountain of Salmacis).All of which also opens up options for the band in terms of composition. Genesis are now able to shed their somewhat meek, muted approach and confidently forge their own sound because Collins and Hackett have the wherewithal to execute it (well, at least THEIR parts anyway). It is a sound that could be described as 'very British'. Though there are moments where they evoke Jethro Tull (Hogweed again) or Black Sabbath (Musical Box), both of which are blues based bands, Genesis's music is essentially very un-American. Whatever elements of American music they may have internalized are also fused with classical music and filtered through British theater until their style appears to bear a very limited, if any, connection to American music. They are probably unique in that sense among the big prog rock bands, in contrast to Yes's fondness for Simon & Garfunkel or Emerson's for jazz. And probably more like the less popular Van Der Graaf Generator.Indeed, like VDGG, they rely heavily on drama and, in turn, on lyrics. Whereas Yes, ELP or Jethro Tull necessarily allowed plenty of room for soloists to show off their skills, Genesis's tracks give the appearance of being very tightly composed with the lyrical theme dictating the flow of music. Where they differ from VDGG is in avoiding dissonance, having more direction and being more light hearted. It is thus not difficult to see why the two bands had a close association for some time in the early 70s; they both enacted theater while the rest played to big American arenas.Speaking of theater, Peter Gabriel too differs in many respects from his namesake Hammill. He tends to be less overwrought and relies more on humour. He also has greater limitations in terms of range or power. At this point, he has perhaps not fully realized his potential and lacks the assurance with which he commanded the ambitious material of Lamb Lies Down on Broadway. The band too have not yet fully aligned the music to Gabriel's strengths.How much of this is his own doing is hard to tell but a track like Musical Box just seems to be a bit beyond his reach. He attempts valiantly to summon up a crescendo on emotion on the climax \"Why don't you touch me now?\" , but I feel largely unmoved because his voice doesn't seem to obey his command other than getting to the notes correctly.The production too drags down the band, despite their best efforts to rise above it. I don't mind the relatively thin sound so much, but even the mix sounds, well, confused. The saving grace is the simply awesome dynamic range but that again is largely the band and less on account of the recording quality.Still, consideration has to be made for the consistent quality of composition and performance on this album. Though I could do without either of the three short tracks, they are not bad. All the longer tracks are good and Musical Box, Salmacis and Hogweed are quite brilliant, if not all the all way through then surely in patches. Even as the band explores diverse styles, the overall sound is unified and cohesive and conveys the feeling of listening to an album rather than a collection of tracks.Four stars for a rocksolid effort that marks the beginning of a wonderful streak of great prog albums from a great prog rock band."
    },
    {
      "reviewer": "FragileKings",
      "date": "Posted Monday, September 22, 2014",
      "rating": 5,
      "text": "Genesis was for a long time the band my friends liked in the 80's. I could never see the appeal, though \"Mama\" was kind of cool for its uniqueness among Top 40 pop tunes. I had no inkling of what Genesis had been in the past. If I had, I surely would have become a fan of the band a least for this album and the follow up, \"Foxtrot\". As it stands now, nearly thirty years since I first became familiar with the band, Genesis, \"Nursery Cryme\", \"Foxtrot\", and \"Selling England by the Pound\" stand out as a trio of some of the greatest examples of classic progressive rock, in my opinion, and are as essential as the trio of Yes albums, \"The Yes Album\", \"Fragile\", and \"Close to the Edge\".Imagine a song with a background story, where the lyrics of the song are the events that occur at the end of the story. A young boy and a young girl approaching puberty go out to play croquet and she knocks his head off with the mallet. She calmly returns to her room and opens a musical box that played his favourite song, \"Old King Cole\". As she does, his spirit appears as an adult version of the boy and the spirit confesses his love and lust for the girl. Though he has only just been struck dead moments before, his spirit has waited the equivalent time of many years for the moment to be able to get to know her flesh, as it says. The song lyrics are entirely the words of the spirit. What they don't tell us is how the story ends. The nurse comes in, sees the spirit, and throws the musical box to the wall, destroying it and making the spirit vanish. What a concept!The music to this story, \"The Musical Box\" is an adventure in itself. A very delicate beginning with clean electric guitars and Peter Gabriel singing softly, almost as if trying not to disturb a still water's surface with his voice and words. There's a beautiful part where a flute comes in and joins the guitars while Phil Collins keeps the percussion swift but soft. The shadow of a cloud passes over the music before it returns to its delicateness. \"Play me my song,\" sings Gabriel and Collins adds, \"Here it comes again.\" Then the music assumes a build in aggressive tone; the real drums and Tony Banks' organ warns that things are about to go crazy and with a scream, Hackett's guitar tears into a solo with the rhythm section galloping along. The song truly rocks here and it's no surprise that young future guitarists such as Edward Van Halen went to see Genesis live back in the day.At this point we are hardly halfway through the first track and it continues with abrupt changes between the sad, unrequited desire of the boy's spirit and the more menacing aggression of its attempt to fulfill that desire. The song concludes with the aggression of a heavy prog band and the flourish of a symphony. A remarkable composition!I also immensely enjoy \"The Return of the Giant Hogweed\" not only for its bizarre tale of Russian hogweeds threatening the existence of humanity on the British Isles but also for yet another example of a rock ensemble achieving fantastic things with their music. Here we are introduced to Hackett's finger tapping technique that he would use on a few Genesis songs, perhaps to greatest effect on \"Supper's Ready\" from \"Foxtrot\", a technique that the above mentioned young Van Halen would rework and turn into a classic guitar solo on his future band's debut album. \"Hogweed\" also features some premier music of this era of Genesis, including flute and piano, a beautiful classical piano break by Banks, some truly awesome music for guitar, piano, and drums, and Gabriel's theatrical vocal style which captures the mood of the story.\"The Fountain of Salmacis\" is the third song in this mould of story told to incredible music. Though I personally don't enjoy it to the level of the two previous songs, it is still nevertheless a grand composition and once again features the finger tapping of Hackett, this time more pronounced as a guitar break.The rest of the album is rounded out by shorter songs of varying appeal. \"For Absent Friends\" is a short and sweet and very English tune about an old couple who step into a church on a Sunday afternoon, a simple vignette of a moment in the lives of two English folk. \"Harold the Barrel\" is a vigorous and action-packed song about a restaurant owner who causes much calamity in town when he stands on a window ledge in preparation to jump. The music is fast and involved, and Gabriel and the band's vocals used to great effect in capturing this frantic tale. \"Seven Stones\" features lots of keyboard work on organ and Mellotrone by Banks. Gabriel seems to have some difficulty reaching the high notes here but this is still a very good example of a shorter progressive rock song, and I see this as being the precursor to \"Can-Utility and the Coastliners\" from \"Foxtrot\".The only track that eludes settling into my memory is \"Harlequin\". Though I've heard it several times I can never recall the tune later. And \"For Absent Friends\" I don't usually choose to hear when selecting songs for mixed playlists. But the rest of the album is truly fantastic. I know many people see \"Nursery Cryme\" as the least impressive of the three albums, with the Genesis genius culminating in \"Selling England\"; however, I hold this album as my favourite and only just barely above \"Foxtrot\". A truly brilliant piece of work this album is and a must have!"
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Wednesday, September 23, 2015",
      "rating": 3,
      "text": "Another album, another major change for GENESIS on their third release NURSERY CRYME, however this one was significant. This was the album that saw Phil Collins replacing John Mayhew on drums and likewise Steve Hackett replacing Anthony Philips due to his stage fright. As can be expected with 2/5 of the band having changed the guard, a new band sound also emerged. While \"Trespass\" was a very ethereal album with only one track really rocking out, NURSERY CRYME takes on the characteristics of a fully developed symphonic prog sound complete with acoustic guitar intros and plenty of contrast with more bombastic rock on some tracks. While this album was not very successful upon its release, it has become a major prog staple and deemed one of the best GENESIS albums. This is one of those albums that everyone else in the universe seems to love but for me personally i have never been able to get into it no matter how hard i try.So just what's going on here for me to dislike one of the most classic and beloved prog albums of all time. Well, just about everything here seems off. While i absolutely love \"Trespass,\" i just don't feel like GENESIS really got a consistent sound together with this lineup until \"Selling England By The Pound.\" This album starts out beautifully with the gorgeousness called \"The Musical Box,\" a Victorian fairy story about two children in a country house where a girl cleaves off a boy's head with a croquet mallet and ultimately gets her comeuppance when she discovers the boy's musical box which upon opening it is haunted by the boy's spirit and begins to age quickly. Cool dark stuff and all and after wondering why this song pleases much more than the rest of the album i found out that this tune was actually written as an instrumental called \"F#\" by Anthony Philips and simply adapted to the fairytale. This one works brilliantly for me but the rest of the album doesn't as much. So this is really the only track that i absolutely love.I just can't stand the slower tracks like \"For Absent Friends,\" \"Seven Stones\" and \"Harlequin.\" The other tracks i do like are \"The Return Of The Giant Hogweed and \"The Fountain Of Salmacis.\" The remaining track \"Harold The Barrel\" is OK but really doesn't set my world on fire either. Overall, this is an unbalanced mix for me. The songs i really like are excellent but the rest just leave me feeling let down to varying degrees. While Peter Gabriel takes a more theatrical stance on this album and rock elements are more prevalent, it's really the songs themselves that seem lackluster. The lyrical content seems to be ok, but i can't connect with the musical compositions. While most of the time i can listen to an album enough and connect to it merely by hearing it from the band's point of view, on NURSERY CRYME i just keep finding certain elements irritating and wanting to change the chords and song structures. It doesn't help that the production is below brilliant but that isn't really an issue for me if the music itself is of a highly entertaining value. Sorry fans of this album. This is really one of the few prog classics that i dislike more every time i hear it save the few tracks that really do hit me the right way. Give me \"Trespass\" over this any day."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Friday, October 23, 2015",
      "rating": 5,
      "text": "Review N� 28In my humble opinion, Genesis had various musical periods. The first period includes their debut studio album \"From Genesis to Revelation\" in 1969. It's a kind of a pre-record of them with the following line up: Peter Gabriel, Tony Banks, Anthony Phillips, Mike Rutherford and Jonathan Silver. The second period includes their second studio album \"Trespass\" in 1970. It had the same line up with the exception of Silver who was replaced by John Mayhew. We can call it Phillips' era. The third period known by Gabriel's era corresponds to their golden progressive age. The line up was Gabriel, Banks and Rutherford with the replacement of Phillips by Steve Hackett and Mayhew by Phil Collins. It includes their third, fourth, fifth and sixth studio albums, \"Nursery Cryme\" in 1971, \"Foxtrot\" in 1972, \"Selling England By The Pound\" in 1973 and \"The Lamb Lies Down On Broadway\" in 1974, respectively. The fourth period begins when Gabriel left the band and includes their seventh studio album \"A Trick Of The Tail\" in 1976, which is for some the first neo-prog album in history, and includes also their eighth studio album \"Wind And Wuthering\" in 1976. This was Hackett's era. The fifth period begins when Hackett left the band. It includes their ninth studio album \"...And Then There Were Three...\" in 1978. I call it Banks' era. The sixth period was Collins' era. It begins when they turn into a more or less a pop group. It includes their tenth, eleventh, twelfth, thirteenth and fourteenth studio albums, \"Duke\" in 1980, \"Abacab\" in 1981, \"Genesis\" in 1983, \"Invisible Touch\" in 1986 and \"We Can't Dance\" in 1991, respectively. The seventh and last period begins when Collins left the group, and the remaining band members Banks and Rutherford decided to release one more studio album, the fifteenth and probably last studio album, \"Calling All Stations\" in 1997.\"Nursery Cryme\" has seven tracks. The first track \"The Musical Box\" is the lengthiest track and is the first great song on the album. It's an epic, which became as one of the most famous musical pieces of Genesis, acquiring the status of one of the band's symbols. It was frequently featured, in their live repertoire, even when the band has become less progressive. Curiously, it includes an accredited writing contribution by their former member Phillips, because begins with an instrumental piece written by him, when he was a member of the group. The album cover is also a depiction of the story of the song. The music begins calm, and grows in intensity until reach an explosion of energy, accompanied by excellent lyrics. The second track, \"For Absent Friends\" is the smallest track on the album and is the first of the two songs from the band to be sung by Collins, while Gabriel was the lead vocalist of the group. The other is \"More Fool Me\" on \"Selling England By The Pound\". It's a short acoustic ballad with beautiful lyrics, a nice guitar duet and good double vocals. This is a great song but weaker than the rest of the album. The third track \"The Return Of The Giant Hogweed\" is with \"The Musical Box\" the two great epics that dominate the first side of the album. It's a bombastic song with theatrical lyrics and with all the things that made of Genesis a so innovative group in the 70's. These two musical pieces became two of the major attractions of their live performances. The fourth track \"Seven Stones\" is a beautiful song full of mellotron and it's also, in my humble opinion, the best track after their three epic tracks. It shows Gabriel's great and unique voice and Bank's masterful keyboard work. The fifth track \"Harold The Barrel\" is a song with interesting lyrics, is somewhat funny, is very rhythmic and provides a joyful moment on the album. It's a fantastic tune, sounding slightly like a medieval British folk song. The sixth track \"Harlequin\" is a song that harmonizes the voices of Gabriel and Collins, providing a very beautiful short folksy piece with nice vocal harmonies. It's a beautiful song, at least pretty, in the Genesis' vibe. The last track \"The Fountain Of Salmacis\", is for me, the great gem of this album. It's one of the songs most played live by the band, or by their members when they are performing as solo artists. The theme is around a story, based in the Greek mythology. Musically, it's a song with great energy, which collapses into an avalanche of emotions. It features everything that was great and unique, in that Genesis' era.Conclusion: In my humble opinion, \"Nursery Cryme\", has three great masterpieces \"The Musical Box\", \"The Return Of The Giant Hogweed\" and especially \"The Fountain Of Salmacis\", three excellent tracks \"Harold The Barrel\", \"Harlequin\" and especially \"Seven Stones\", and a very good track \"For Absent Friends\". I really think that \"Nursery Cryme\" is a transition album, being better than \"Trespass\", but being slightly less good than their three following albums. Compared with \"Trespass\", it has better production has some better musical pieces and has also the presence of Hackett on it. So, \"Nursery Cryme\" is a very important album to the group. It represents undoubtedly the beginning of the new line up of Genesis and represents also the starting point, of a real absolutely amazing career.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "Magnum Vaeltaja",
      "date": "Posted Monday, March 14, 2016",
      "rating": 4,
      "text": "Following the charming, enchanting release of \"Trespass\", Genesis found themselves looking to forge on forward after the departure of subdued guitar personality Anthony Phillips. With the addition of Steve Hackett and Phil Collins, Genesis had created their classic lineup that we know and love and \"Nursery Cryme\" is the first document we have to show off their prowess and ability. Although Hackett's style is far more flamboyant and dynamic compared to Phillips', Nursery Cryme once again finds Genesis right in their prime element, painting idyllic pictures of quaint English scenes based in domestic reality, but with a slight fantasy twist, with Peter Gabriel delivering melodramatic storytelling over top. And on Nursery Cryme, all of these elements fall into place absolutely perfectly in one tight little 10-minute package: \"The Musical Box\".Genesis' career tour-de-force, I don't believe that there is any one track in the band's canon that captures what they were capable of more fully and effectively. An oddly dark track, it's hard to believe that a mini rock opera about pedophilic ghost rape can be pulled off so convincingly, let alone become a classic of the genre. Let me just say that it's a good thing that it was only lighthearted Genesis that tried to tackle this idea, and not King Crimson or Van der Graaf Generator! Talk about traumatic experiences... Anyhoo, even if the subject matter of the song is a bit morbid, you wouldn't think it with the way that all of the classic Genesis elements play out. The song opens with the delightful Hackett fingerstyle work that would grace the string of albums to follow. Peter Gabriel and Phil Collins exchange gorgeous vocal harmonies, and a touch of flute is thrown in now and again, never to wow or demand your attention, but to serve the timbral blend of the song. Magical as those first 4 or so minutes are, it's not until Hackett cranks up the ol' electric that \"The Musical Box\" truly attains its legendary status. While Genesis can never be accused of being unable to write pretty acoustic pieces, they've never really had any strength in writing bombastic or energetic music. But \"The Musical Box\" is a true exception to that rule; Hackett's two solos in here may very well be one of the hardest rocking sections of symphonic prog ever put to record. The same can be said for the song's rousing, cathartic crescendo, but there's no sense in trying to put it in words. You simply have to hear it to appreciate the power.After one of the most dynamic openings in prog, the band takes an about face for the Collins-led \"For Absent Friends\". Most people discredit this song as \"filler\", probably because it's short, but it really is a delight. Genesis were really at their strongest when they were writing softer acoustic music, and this is a prime example. A quaint musical daydream, there's nothing awe-inspiring about this little tune, but it's actually quite a beautiful, contemplative piece that doesn't demand a whole lot. And within the context of the album, it serves as essential breathing room before the first side's closer, \"Return of the Giant Hogweed\". The album's \"heavy\" track, I feel that the song is actually quite a step down in terms of energy from \"The Musical Box\", and certainly compared to \"The Knife\" off of \"Trespass\". But then again, does music always need to be so serious and heavy? Certainly not, and \"Hogweed\" retains a certain sing-along characteristic to its sound, even while Hackett plays some of the most distorted licks of his career. And while the bulk of the song is actually quite tame, the dramatic ending does stand out as a particularly exciting piece of Genesis' catalogue that would go unmatched on future albums.After a very strong first side, side two is a bit of a step down, but enjoyable nonetheless. \"Seven Stones\" is a song that Genesis fans try to validate as much as they can, calling it the most \"underrated\" or \"underappreciated\" or \"overlooked\" song on the album, but if it really were as good as the fans claim, then it would be just as famous as \"The Musical Box\" or \"Hogweed\". In reality, it's just a decent, short ballad that isn't especially moving, unless you're a total sucker for the mellotron, in which case the ending should be quite a delight. Afterwards is \"Harold The Barrel\", which I will skip each and every time I put the album on. It's not necessarily an awful song, but it might just be the most infectious earworm I know of, so unless you want it stuck in your head for weeks at a time, it's probably expendable. It also gets the infamous credit of being the first Genesis \"comic relief\" track, the scourge of Gabriel-era albums. Unlike \"The Battle of Epping Forest\", though, at least \"Harold The Barrel\" has the benefit of being only 3 minutes long, so it doesn't bring the impact of the album down quite as much. Following ol' Harry, though, is another track that I really do believe is overlooked. \"Harlequin\" is a return to the style of \"For Absent Friends\", except Gabriel and Collins harmonies are even more exquisite on this number. As I've always maintained, Genesis' forte was in their acoustic work, so while my interest for the extended symphonic tracks on \"Nursery Cryme\" has waned over time, the grace and charm of numbers like \"Harlequin\" has only grown.The album closes with one final long song, \"The Fountain of Salmacis\". Once you get past the gimmick of the mellotron volume swells, there is still quite a bit to enjoy here. It seems that Genesis really put all their eggs in one basket with \"The Musical Box\", so the energy level is quite low by this point in the album, but that doesn't mean they were uninspired. Peter Gabriel's lyrics here are taken straight from Greek mythology, and his way with words really makes what would be an otherwise forgettable piece of instrumental music shine as a piece of fantasy magic.So while it's not a perfect album, \"Nursery Cryme\" is still a piece of the Genesis discography that I feel can make itself at home in any prog fan's collection, if not just for \"The Musical Box\" alone. I would also highly recommend either this album, along with \"Selling England By The Pound\", as the perfect introduction to the band's music. In all, this may not be a genre-defining masterpiece, but it is a symphonic prog classic. 4 stars."
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Wednesday, November 21, 2018",
      "rating": 3,
      "text": "I'm surprised that this album is held in such high regard here in PA (number 12 on the Top Albums of all time!). I think it is the worst of the classic Genesis period (and even Trespass is much better).The famous \"The Musical Box\" (rating 7.5 / 8) is a song that starts slow, subdued, intimate and stays in this mood (monotonous at times) for almost 4 minutes; then comes the rock instrumental part, where the musicians show off their virtuosity, and Collins (more than Hackett) proves his worth, characterising the Genesis sound with his jazzy rhythm. The track goes on for up to 10 minutes, alternating beautiful instrumental progressions with stunted sung pieces. Overall, it does not take off, never reaching a climax.\"For Absent Friends\" (6.5) is an acoustic piece of less than two minutes, beautiful in its singing, but without development. \"The Return of the Giant Hogweed\" (rating 8) starts with a nice rock rhythm in which Banks and Collins give their best. It lacks a melody, everything is based on a rhythm that continues very pompous; after 5 minutes the song pauses, the rhythm becomes slower and the sound intimate; but then it ends with a pompous ending. It is the best song on the album, but something is missing to consider it an absolute masterpiece. End of side A.\"Seven Stones\" (rating 7.5/8) is a 5-minute ballad with a good progression in which romantic epic moments and rock moments alternate with many changes of rhythm. \"Harold the Barrel\" (rated 7+) is a pop song, with the atmosphere of a variety song. It shows Peter Gabriel's ironic/satirical streak. The three-minute song 'Harlequin' is the worst song on the album, being cloying (rating 6+). The last song, 'The Fountain of Salmacis' (rating 7.5) closes the LP. It is the third long song (8 minutes) after Musical Box and Giant Hogweed, and like the other two is pompous and magniloquent. Gabriel's vocals are strangely in the background, Banks' keyboard, as usual, drives the music (again more rhythm than melody); in the instrumental parts the bass solo can be heard.The album is not very inspired: on a melodic level it is definitely inferior to Trespass. It requires very careful listening and on the whole does not linger in the mind, it is too elaborate and forced in many parts. There are good songs, but they are not true masterpieces (not even Musical Box). The technical expertise, especially in the instrumental parts, partly compensates for the poor melodic vein. I think this record is very overrated, probably because it is the first with the line-up most beloved by Genesis fans. In my opinion, it is a transitional album: after the excellent Trespass, a linear, inspired, compact, melodically beautiful album, Nursery Crime tries new paths (which will be developed in the following albums) by focusing less on melody and more on technical rate. Where Trespass is melodically sublime in its epicness, Nursery Crime is very pumped up thanks to frenzied rhythms: therein lies the difference between inspiration and technique.Average song quality: 7.29 Album rating: 7.5. Three stars."
    },
    {
      "reviewer": "Kempokid",
      "date": "Posted Saturday, February 2, 2019",
      "rating": 4,
      "text": "While not as much of a stark jump in terms of sound and quality from 'Trespass' compared to the difference between that and 'From Genesis To Revelation', I do find this album to be in some ways, more significant with what steps were taken. The most apparent change is the increase of musicianship present here, with a great deal of it due to this being the album in which both Steve Hackett and Phil Collins made their first appearance. Along with this, while similar in sound to 'Trespass', this album is much more mature in general. Each song feels more distinctive, and it's clear that this is a much more ambitious effort in general, with 3 songs clocking in at over 8 minutes, each without a moment wasted. Furthermore, there is definitely a sense of comfort here, no uncertainty that you could find in parts of 'Trespass', allowing the band to sound more fun in the process, while still maintaining high quality.The album opens boldly ad powerfully with 'The Musical Box', which is just as great as is generally considered by fans of the band, that is to say, this piece is amazing. I love the opening few minutes of it, with its absolute beauty, with Gabriel's voice sounding excellent, especially during the chorus. The constant build up past these first few minutes is what really impresses me though, with what begins as a light, folksy melody developing into a highly energetic instrumental passage, all dying down before crescendoing a second time, this time even more spectacularly until the song explodes. 'Return of the Giant Hogweed' is the other song that I would consider to be the high point of the album, taking a slightly heavier, more energetic approach in the vein of 'The Knife', all the way down to an intro that sounds fairly similar, this one just containing more guitar. Despite the fact that the sound mixing is quite thin, and that 'Genesis' in general is a light sounding band, this song still manages to contain an incredible amount of intensity and power, but still manages to be such a fun track at the same time. This also features some of Gabriel;s more interesting lyricism that borders on absurdism at points, and while this is explored more later, I do find this to be one of my favourite examples of it, mostly because of the somewhat amusing imagery it provides. The final epic on the album, the closer 'The Fountain Of Salmacis', while not quite as amazing as the other two, still manages to be an excellent track. It's a much more beautiful track in general, with the instrumentation at points being much more focused on creating particular soundscapes or capturing emotion. This provides sections of the song in which I feel as if I could just melt and be carried away by the music. The one other track which I find extremely noteworthy is the short, amusing 'Harold the Barrell', which is the song that accentuates the fact that the band was finally becoming much more comfortable with their music and was finally able to have some of their personality shine through. Unlike the consistently awful and often talked about humour pieces by 'Emerson, Lake and Palmer', this feels much more natural, as if it is a part of the band rather than something just tacked on. This isn't even mentioning the fact that it's wonderfully catchy and generally enjoyable to listen to, and while not the best composed, I do love what it represents in terms of 'Genesis'' evolution.Despite the absolutely immense praise I have for the high points of this album, I can't overlook the few flaws this album has. For one, 'For Absent Friends' and 'Harlequin' are throwaway filler without anything particularly special about them. I also find the song 'Seven Stones', while overall very pretty, to simply be somewhat unmemorable and bland. As a final note, I do find the mic in general to be quite uneven in parts, with the bass almost always being barely audible, along with the sound for the majority of the tracks ('The Fountain of Salmacis' being a big exception) being quite thin.There is no doubt in my mind that this is a great album, with some tracks being nothing short of breathtaking, and these high points made this album a hard one to score for me. On one hand, there were so many moments which blew me away, but on the other hand, there were certain tracks or moments which felt unnecessary or dull. In the end I've gone with a 4 star rating as opposed 5, simply because I do find that the album's listening experience is somewhat centred around waiting for the next amazing track, rather than simply taking in and enjoying what is going on, leading to the conclusion that while cohesive in sound, the album isn't as tight a listening experience as it could have been. I absolutely love this album, and I highly recommend it if you're one of the few who hasn't delved into the work of 'Genesis'.Best songs: The Musical Box, Return of the Giant Hogweed, The Fountain of SalmacisWeakest songs: For Absent Friends, HarlequinVerdict: This is where Genesis definitely began to gather steam, with more refined and ambitious compositions, along with allowing their personality to flourish, all with great instrumentation. While I personally find it it be slightly patchy, I still find this album to be well worth listening to."
    },
    {
      "reviewer": "patrickq",
      "date": "Posted Saturday, March 2, 2019",
      "rating": 3,
      "text": "As guitarist Steve Hackett and drummer Phil Collins had recently joined the band,Nursery Crymeis the first Genesis album with the classic lineup. So it's not much of a surprise, at least in retrospect, that this album far surpassesTrespass, their prior effort.But while the opening number (and fan favorite) \"The Musical Box\" makes this clear almost immediately, it's also evident - - again, in retrospect - - that the new Genesis is still a work in progress. \"The Musical Box\" is an early highlight of the band's discography, but it would be surpassed several times over the next two albums. Like \"The Knife,\" the standout track onTrespass, \"The Musical Box\" is nicely noisy and ragged, and this seems to be part of an evolution toward a more symphonic sound they will approach onFoxtrot(1972) and achieve onSelling England by the Pound(1973). That sound would still employ plenty of dissonance, but with a bit more polish.Nursery Cryme's closing number, \"The Fountain of Salmacis,\" is similar to \"The Musical Box\" insofar as its production on record doesn't quite match its ambition.But the sci-fi of \"The Return of the Giant Hogweed\" and the drama of \"Harold the Barrel\" represent substantial improvements overTrespass, not only in composition and performance, but in variety. \"Hogweed\" even bests the similar \"Get 'em Out By Friday,\" which would be released the following year onFoxtrot. Similarly, whatever the band would aim for on \"Time Table\" (also fromFoxtrot), they seem to have already achieved here, far more elegantly, with \"For Absent Friends.\" What makes \"Time Table\" and \"For Absent Friends\" similar goes beyond their nature as relatively placid songs, at least compared to the songs before and after them. They're both also commentaries on the passage of time - - something that doesn't seem necessary more than once per album.Nonetheless, two more such songs are included onNursery Crymein the forms of \"Seven Stones\" and \"Harlequin,\" and neither is nearly as good as \"For Absent Friends.\"On the whole,Nursery Crymeis a good, though uneven album, a record of a rapidly-improving band."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Wednesday, July 29, 2020",
      "rating": 5,
      "text": "In Nursery Crime, Genesis�third album, Steve Hackett and Phil Collins joined the group with the guitar and the percussion, respectively. With them, the arrangement of the group that made the most iconic disc of Genesis was complete. Hackett and Collins� incorporation was vital to hone the band�s musical proposal. The lyrics, at once mythic and fantastical, worked out primarily by the prolific Peter Gabriel, took Genesis to the progressive rock Olympus.The album initiates with the monumental Musical Box, a fiction of the Victorian England in which Henry�s spirit (an 8- year-old child murdered by 9-year-old Cynthia) returns to haunt his murderer. The song is undoubtedly among the greatest Genesis creations: a 10-minute symphony of diverging rhythms that concludes with an exuberant ending. The album continues with a respite: For Absent Friends, a slow ballad sung by Phil Collins. Nonetheless, Nursery Crime surprises us yet again with the amazing The Return Of The Giant Hogweed, a song about a carnivorous plant that breaks havoc in London.The album continues with Seven Stone, a demonstration of the mastery of the mellotron by Tony Banks. Despite being a great song, it hasn�t transcended as much as other compositions. After that, both the suicidal Harold The Barrel and the ballad Harlequin are interesting pieces that don�t surpass the 3-minute mark. Further down the album, The Fountain of Salmacis is a fine portrayal of Hermaphrodite�s origin. It is an excellent closure for Nursery Crime, a must- have album in the musical library of all the Genesis admirers and all the progressive rock listeners."
    },
    {
      "reviewer": "A Crimson Mellotron",
      "date": "Posted Saturday, August 14, 2021",
      "rating": 5,
      "text": "'Nursery Cryme' is the 'secret' Genesis masterwork, the first big stellar work of grandiosity and pretentiousness, of lavish and all-out symphonic prog, of unmistakable identity, their undisputed achievement that marks the beginning of the 'golden age' of progressive music, and I for one, love it to death. Released in November 1971 and recorded in Trident Studios in London, this impactful record was (un)surprisingly a massive hit in Italy, and subsequently became an obvious influence on the local progressive rock scene, that gradually gained momentum until it exploded a year later. Today, this fact might not seem that unbelievable, as the album (in my opinion) has a cult following in Europe; but this leaves one wondering what was wrong with the British back then? Didn't they like their prog emotive and masterful? Or they were too blues-oriented? This is, of course, a side note, not to be taken too seriously.Clocking in at 39:26, this is, most interestingly, the shortest Genesis album ever released, so it has to be noted that its 'compactness' is definitely an aspect to be taken into account when assessing 'Nursery Cryme' as a very straight-to-the-point masterpiece. Not too well received initially, it is puzzling to me that still to that day there are 'professional' reviewers (most of which should be journalists, as we presume) that neglect not only this album, but this very stage of Genesis' career as weak, pretentious (assign negative connotations here), and over the top. However, this record has fortunately and deservedly received the admiration of the prog fans, which is what matters more.Most importantly, this is the first Genesis album with the classic 70s lineup of Peter Gabriel, Tony Banks, Mike Rutherford, and then-newcomers Phil Collins and Steve Hackett; Virtually the best thing that could happen to the band was the addition of the latter two to the band. The material is, in my humble opinion, some of the strongest of the whole early 70s period that has ever been released, full of classics that still sound flamboyant, impressive, very bold and very original (maybe the strongest aspect of Genesis' 70s sound, their unmistakable originality!). 'The Musical Box', 'The Return of the Giant Hogweed', 'Seven Stones' and 'The Fountain of Salmacis' are staples in the genre that have their righteous place in the prog pantheon, with their bombarding musicality and elegance, their masterful and lovely emotivity, the gorgeous playing of each band member, and the strikingly evocative vocals of Gabriel. The shorter songs on here, 'For Absent Friends', 'Harold the Barrel' and 'Harlequin' are no less impressive, all showing different sides of the band, very memorable, enjoyable tracks that are certainly fan-favorites of many people, with 'Harold the Barrel' being especially quirky and compelling.To conclude, one can simply say that 'Nursery Cryme' is a genuine masterpiece - a stark and original album, very provocative and evocative, inspiring and compelling, masterful and rich in sound, texture, tone, and a certified classic."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "albumd708.html",
  "last_parsed": "2025-05-18T00:12:53.715586"
}