{
  "album_title": "HATFIELD AND THE NORTH",
  "artist_name": "Hatfield And The North",
  "artist_page_link_local": "artist651a.html?id=147",
  "year": 1974,
  "rating_value": 4.25,
  "rating_count": null,
  "review_count": null,
  "genre": "Canterbury Scene",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/147/cover_45306892013_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "The Stubbs Effect",
      "duration": "0:23",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Big Jobs (Poo Poo Extract)",
      "duration": "0:36",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Going Up to People and Tinkling",
      "duration": "2:25",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Calyx",
      "duration": "2:45",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Son of \"There's No Place Like Homerton\"",
      "duration": "10:10",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Aigrette",
      "duration": "1:38",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Rifferama",
      "duration": "2:56",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Fol De Rol",
      "duration": "3:07",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Shaving Is Boring",
      "duration": "8:45",
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "Licks for the Ladies",
      "duration": "2:37",
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "Bossa Nochance",
      "duration": "0:40",
      "is_sub_track": false
    },
    {
      "number": 12,
      "title": "Big Jobs No 2 (by Poo and the Wee Wees)",
      "duration": "2:14",
      "is_sub_track": false
    },
    {
      "number": 13,
      "title": "Lobster in Cleavage Probe",
      "duration": "3:57",
      "is_sub_track": false
    },
    {
      "number": 14,
      "title": "Gigantic Land-Crabs in Earth Takeover Bid",
      "duration": "3:21",
      "is_sub_track": false
    },
    {
      "number": 15,
      "title": "The Other Stubbs Effect",
      "duration": "0:38",
      "is_sub_track": false
    },
    {
      "number": 16,
      "title": "Let's Eat (Real Soon) (single)",
      "duration": "3:16",
      "is_sub_track": false
    },
    {
      "number": 17,
      "title": "Fitter Stoke Has a Bath (single)",
      "duration": "4:35",
      "is_sub_track": false
    },
    {
      "number": 18,
      "title": "Extra bonus track on 2009 Esoteric remaster",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 18,
      "title": "Your Majesty Is Like a Cream Donut Incorporating Oh What a Lonely Lifetime",
      "duration": "6:08",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Monday, February 2, 2004",
      "rating": 4,
      "text": "A Canterburian supergroup made from members of Matching Mole (guitarist Phil Miller), Egg & Khan (keyboardist Dave Stewart), Caravan (bassist Richard Sinclair) and GonG (drummer Pip Pyle) - and amazingly enough no-one from Soft Machine- Hatfield (for short) certainly made two of the most transcendental albums in the genre, starting with the self-titled debut in 73. Taking their name from a traffic panel somewhere North of London, the South-of-London combo chose a pink-filtered picture of an unremarkable suburb and added some savage scene of pillage in the clouded sky, a symbol that remains a mystery to this writer even today. On top of the famous Robert Wyatt appearance in Calyx, the group benefits from the help of the Northettes (a trio of female singers that includes Spirogyra's Barbara Gaskins), some sax from Henry Cow member Geoff Leigh and a un-credited Didier Malherbe (source: the Calyx site and the innergatefold picture) of GonG on flute.One can see this album as a variance of a concept album with not one but two book-ending tracks: the electronic pieces called Stubbs Effect and more ex-centric (because asymmetric) Big Jobs, where Sinclair announces the colour signing about \"the song to begin the beginning, a few arbitrary notes, which they try to make sound right and that their music on their latest Lp will please us and should certainly be a laugh\" in a very Wyatt-esque manner. Another way to look at this album is as if two giant nameless suites (one per album side), since all tracks are melted into in each other (from Stubbs to Rifferama and from Fol De Rol until Other Stubbs) and it's pretty difficult to see where each song starts, even, if the Cd certainly made this easier.Describing Hatfield's music is rather difficult other than saying it fits the Canterbury mould that we know today without sounding like any other band in that category. It's definitely not rock music anymore (like Gong or Caravan), it's not Jazz (through the bossa nova) either, but to call it jazz-rock is only partly satisfying because applicable only 15% (roughly) of the time. Mostly instrumental, but when sung it is either stunning or completely silly lyrics, often courtesy of drummer Pip Pyle (humour-wise, Hatfield is typically Canterburian), the quartet is simply amazing with mastery of their respective instruments and the numerous tempo changes and tricky time sigs are simply head-twisting and can be a bit of a repellent for the normal attention span.. There are some remains from Caravan, sometimes from Egg or Gong, but you mostly have to look at the future National Health to have an idea of what they sound like. Little wonder since three of the four Hatfield will be involved in NH. To make matters worse, the album is filled with short unpredictable songs that generally don't respect any rules and end up melting into each other, much like the superb Wyatt-conscious Calyx leads directly into album-climax Homerton. Another strong track is Shaving Is Boring, which grabs a space rock (ala GonG) repetitive rhythms and Caravan soundscapes (the organ theme seems from Grey & Pink) and later on Bossa Nochance is a clear wink at Caravan's rhythms.Hatfield is probably the first of the three most difficult groups to \"dig\"/get into after or with Gilgamesh and National Health and are an acquired taste that comes with multiple listens. The Virgin reissue comes with a non-album single of which both sides are sung by Sinclair, the Fitter B-side will find its way on the next album in a different version. These two stick out a bit from the rest of the album (different sound), but there is nothing shocking either. The new Esoteric label \"remastered\" reissue brings a two more bonus tracks (, more like work-in-progress), but present on TRC as well in the Mumps track, and the booklet has been revamped. While on the scale of the site and prog's greater spectrum, this first Hatfield album might not be essential, in the Canterbury skyline circles, it certainly is."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Friday, April 2, 2004",
      "rating": 5,
      "text": "A great reference for the whole school of Canterbury. Bands such as A TRIGGERIND MYTH and ISILDURS BANE have taken a lot of inspiration from this band, in the recent times. Well actually the score should be inferior, but its importance is as much remarkable as the best \"jewels\" from Canterbury!!Highly recommended!!"
    },
    {
      "reviewer": "greenback",
      "date": "Posted Saturday, April 10, 2004",
      "rating": 4,
      "text": "This is the first album from Hatfield & the North. This album is very progressive, and it has the Canterbury subgenre. There are TONS of typical electric piano parts. There is also the typical Canterburian wah-wah organ, which occurs on some Caravan's albums too. The keyboards played by Dave Stewart mostly consist in melodic series of short notes, as reveals the omnipresent electric piano. The drums are very complex and never the same. The special male & female backing chant definitely give a unique character to the album. Richard Sinclair's lead vocals are OUTSTANDING, as always. \"Rifferama\" has a series of weird wah-wah effects applied on dirty organs and inoffensive electric guitars riffs through VERY fast and funny elements, which should remind Frank Zappa's complex and fast music. Robert Wyatt's singing on \"Calix\" are very delightful. The epic \"Son of \"there's no place like Homerton\"\" has beautiful & graceful celestial female backing vocals; this track has a strange final bit consisting in dissonant horns improvisation-like a la King Crimson's \"Lizard\". \"Aigrette\" has awesome complex vocals arrangements a la Pat Metheny. \"Shaving is boring\" starts with an impressive moog and bass combination; it continues with a bit too experimental and disorganized for my taste; however, the second part of the track is AWESOME: it has the structure and style of Caravan circa \"In the land of grey and pink\": it is also the case for the mellow \"Lick for the ladies\", and for \"Big jobs No 2\". \"Lobster in cleavage probe\" has beautiful & graceful celestial female backing vocals. The best track of this record is definitely \"Gigantic land-crabs in Earth takeover bid\": it gradually reaches quintessence, as all the instruments are perfectly synchronized inside a fully interlocking Canterburian texture.Rating: 4.5 stars"
    },
    {
      "reviewer": "Trotsky",
      "date": "Posted Sunday, February 13, 2005",
      "rating": 4,
      "text": "The world of Canterbury prog was a pretty incestous one with groups like Caravan, Soft Machine, Gong, Delivery, Egg, Matching Mole, National Health, Khan and Gilgamesh all sharing members, and as such Hatfield And The North might seem to be \"just another Canterbury\" supergroup. It's a little hard to describe the two lovely mid 70s albums crafted by Richard Sinclair (lead vocals/bass), Phil Miller (guitar), Dave Stewart (keyboards) and Pip Pyle (drums) as ground-breaking because these musicians came to the band with a well-established blueprint for music-making (albeit one they had all contributed to). There is however, little doubt that they are among the most memorable recordings to emerge from the scene ...This fascinating debut is an hotch-potch of brief \"sound effect\" tracks like The Stubbs Effect, a handful of charming jazzy ditties like Going Up To People And Tinkling, Lobster In Cleavage Probe and the punchy Rifferama, and two monumental jazz-rock anthems written by drummer Pyle called Son of \"There's No Place Like Homerton\" and Shaving Is Boring. The album is largely instrumental although there are a fair amount of wordless vocals flying around (contributed by Sinclair, Canterbury icon Robert Wyatt as well as a trio of female singers that includes Amanda Parsons). Henry Cow's Geoff Leigh also drops in to add a few brassy touches.As you might surmise from the titles of some of the tracks, Hatfield And The North aren't the sort of group to take themselves too seriously, but the standard of musicianship is extremely high with Stewart (mainly in electric piano mode) leading the way most of the time. What's more, the album is superbly paced, so that the music ebbs and flows perfectly to sustain one's interest. Psychedelic swirls, goofy humour, elegant jazz-rock, Sinclair's mournful singing (the Big Jobs songs have great melodies!) and the odd moment of controlled passionate playing are all present in acceptable doses.Hatfield And The North's subsequent album The Rotter's Club is generally given more attention because of the presence of the group's greatest work Mumps on that album, but this album matches it for quality. The CD features the wonderful Let's Eat (Real Soon)/Fitter Stoke Has A Bath single as bonus tracks, and they just add to the fun. ... 78% on the MPV scale"
    },
    {
      "reviewer": "Andrea Cortese",
      "date": "Posted Tuesday, August 9, 2005",
      "rating": 3,
      "text": "I love Richard Sinclair's opera (and vocals) in Caravan, expecially in their best album In The Land Of Grey And Pink. I was sad to see he soon leave that band and so, after listening to something of him in Camel (in particular the album Breathless) I picked up this album by Hatfield and the Noth. I did not expect this as \"difficult\" (elaborate and jazzier sound, rich of noises and sound effects), but after listening to it many times, something good for me I have found: the bonus track Let's Eat (Real Soon), Rifferama and Shaving Is Boring. I thik it'll be better for me to pick up also The Rotter's Club and only then write a more accurate review on it."
    },
    {
      "reviewer": "NJprogfan",
      "date": "Posted Monday, January 16, 2006",
      "rating": 4,
      "text": "Canterbury is a strange bird indeed, and this album is typical of the style of prog I enjoy second to symphonic. Starting off rather softly, most of the songs melt into each other and if you weren't watching you wouldn't notice. It's not until you reach the middle section starting with 'Son of There's No Place Like Homerton' that things start to kick some butt with horns blazing and the Northettes harmonizing. It just kills. Then 'Aigrette' leads into 'Rifferama' and again you get some killer grooves, just plain awesome. But the best track to these ears is 'Shaving Is Boring' starting off very softly, it builds a krautrock-like groove very subtly then melds into a space rock/psych monster! One of the, if not the best Canterbury song ever written! The album proper ends with more of the same harkening back to earlier songs on the album. The CD boasts two additonal bonus tracks which was a single A & B sides. Both are extraordinary with Stewart's sweet voice, like a warm cup of chocolate on a blustery winter day. If you are thinking about trying out a Canterbury style prog album you couldn't go wrong with this one. A solid 4.5 album hampered only by the slow start."
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Thursday, March 2, 2006",
      "rating": 4,
      "text": "The Canterbury scene was really defined by the debut album by HATFIELD & THE NORTH which remains today a pure classic progressive rock album. What is amazing is that every musician is so strong and this album feels so cohesive and not a tone of soloist going for it. Every track is a real treat and by composition showcases the extreme talents of this band. EGG's Dave Stewart's plays some brilliant organ and keyboards here while Richard Sinclair's bass and vocal work tightly contributes. Also one must take note of Phil Miller's guitar playing and Pip Pyle's drumming which get to unfold over the album and sound in perfect fit. HATFIELD also included the vocal harmonic trio of Barbara Gaskin, Amanda Parsons and Ann Rosenthal) who were referred to as the \"Northettes\". In many ways this album represents Canterbury's answer to VAN DER GRAAF GENERATOR mixed with GENTLE GIANT. The album is an assortment of 15 tracks all interwoven making this a concept-like piece."
    },
    {
      "reviewer": "belz",
      "date": "Posted Wednesday, March 29, 2006",
      "rating": 4,
      "text": "4.2/5.0This is one of the most difficult review I had to write. I had quite an headache deciding between 4 stars and 5 stars, as this is a milestone of Canterbury music, with many members playing with other well-known groups like Matching Mole, Gong, Caravan or Soft Machine, all great bands. \"Hatfield and the North\" is somehow a 'superband' allowing itself to play a bit more on the wild side of progressive music, that is, experimental jazz. This is always a risky experiment because if it is easy for masters of experimentation to achieve harmony it is far more difficult for an harmonist to successfully experiment.That said, as much as this album is experimental and jazzy, the Canterbury touch is still there and there are some magic in many songs there. Of course, this is an album you have to listen from the beginning to the end, a bit like Camel's \"The Snow Goose\" or other albums alike.Overall, this is a wild bird as some other reviewers rightly pointed out. Don't throw it away after one listening; after some listening it gets clearer and really this is a complicated but very good album!4.2/5.0"
    },
    {
      "reviewer": "Raff",
      "date": "Posted Tuesday, April 18, 2006",
      "rating": 4,
      "text": "Definitely no easy listening album, this one. A grower indeed, something you have to listen to repeatedly and with a good deal of concentration. Four superb musicians (true masters of their craft), jazz-tinged, experimental compositions, angelic female vocals and contributions from such greats as Robert Wyatt of Soft Machine fame... Heaven for some, hell for others. Hatfield and the North are certainly not everyone's cup of tea. For one thing, they don't take themselves seriously enough - just look at titles like \"Gigantic Land Crabs in Earth Takeover Bid\" and \"Lobster in Cleavage Probe\". Then, the music has more shifts and time signature changes than most people's attention span can cope with, and most of the tracks are instrumental.The first Canterbury supergroup didn't last long, which is a misfortune, seen the quality of both this debut album and, especially, its magnificent follow-up, \"The Rotters' Club\". The good news is that they've very recently reformed with three- quarters of the original lineup (no Dave Stewart, I'm afraid, but the others are all there). However, way back in the early '70s, they would have deserved to be much more successful, even if their complex, intricate brand of jazz-rock blended with uniquely English humour and nonsense is definitely an acquired taste.There are quite a lot of tracks listed on the record's sleeve, though it is practically impossible to see where one ends and the other begins - they flow seamlessly into each other, forming a continuum which challenges the listener's powers of concentration in a way the traditional song format does not. As such, it is not easy to mention individual tracks, although there are obviously some which stand out, notably the 10-minute-plus \"(Son of) There's no Place Like Homerton\", where a beautiful vocal interlude courtesy of The Northettes is followed by wildly blaring horns. \"Calyx\" features delicate vocal harmonies from Robert Wyatt; while \"Fol de Rol\" starts with Richard Sinclair humming nonsense words and then launching into an incredible bass solo. As a matter of fact, those who think prog bassists begin and end with Chris Squire and John Wetton should take a listen at both Hatfield and the North's albums in order to get an earful of truly spectacular bass playing - a perfect foil to Pip Pyle's intricate drumming patterns. However, it's a pity that Sinclair doesn't get as many opportunities to display his equally stunning vocal talents. Whenever he opens his mouth, I get shivers down my spine, especially when he reaches for the lower tones. Under his deceptively well-mannered, quintessentially English enunciation lies a strain of haunting sensuality which is quite unique in prog.If you want background music, don't even think about buying this album. If you want to keep both your ears and your mind engaged, don't hesitate. Highly recommended."
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Saturday, September 2, 2006",
      "rating": 5,
      "text": "Cheers to the debut album of Hatfield and the North, one of the most accomplished Canterbury acts ever. Band formers Richard Sinclair and Dave Stewart already bore an interesting pedigree, as well as their partners Phil Miller and Pip Pyle. The band's main goal was just to create good music both amusing and cleverly arranged, with a jazzy flair that provides a special swing to the main melodic themes and the subsequent jamming. Scatological humor is evident from some explicit titles, as well as the self- referring lyrics and the intended puerile chanting of 'Fol de Ral'. Positive mood recycled through an exciting musical vision, this is all that Hatfield and the North is about. Regarding the band's sound, the electric piano and the bass guitar happen to be the most consistently featured instruments in the mix, which doesn't mean that Miller can't have noticeable room for leads and harmonic phrases. Miller isn't really loud, yet his musical personality is quite distinct within the spectrum of Canterbury melodic facet - IMHO, his best solo is comprised in en 'Gigantic Laud Crabs in Earth Takeover Bid'. Pyle's typical percussive dynamics is, in no small degree, a basic ingredient for the energetic feel that the band seeks for both the calmer and faster passages of the album. The repertoire consists of two continuous series of tracks, sequenced as if there was an intention of keeping the fun working: the first series starts like the second one ends, with a tone generator sequence. Robert Wyatt's vocal interventions in 'Calyx' are simply eerie, portraying a captivating magic, and so are the Northettes' efforts in en '(Son of) There's no Place like Homerton' and 'Lobster in Cleavage Probe'. 'Rigrette' and 'Rifferama' show some very interesting interaction between organ and guitar. The maximum energy is found in 'Shaving is Boring', which includes a magnificent spacey sequence that seems to float in the air as some sort of imaginary vision that fills every spot in the atmosphere: imagine a cross between the most bizarre side of Soft Machine's \"Third\" and your typical Gong electronic explorations and you can get the picture accurately. The guitar and organ effects that go passing by on and on enhance the lysergic mood, while the rhythm section sustains the whole thing with infinite precision. All this muscular display is carried out by the band without losing a single ounce of its performative elegance - formidable! The CD edition brings two bonuses, 'Fitter Stoke has a Bath' and 'Let's Eat (Real Soon)' sound to me a bit closer to what Caravan used to do in their first albums, and that's a curious thing, since the reason why Sinclair left Caravan was that he wanted to do something different. The first of these bonuses will reappear in a more sophisticated guise in the band's sophomore effort. In conclusion, \"Hatfield and the North\" is an exquisite gem of Canterbury, a musical delicatessen that deserves to be labeled as a real prog masterpiece. No less can be expected from this assembly of masters.[Review dedicated to the memory of Pip Pyle]"
    },
    {
      "reviewer": "fuxi",
      "date": "Posted Tuesday, November 28, 2006",
      "rating": 5,
      "text": "It's comparatively rare to find progressive rock that's virtuosic, jazzy, poetic, delicately melodious, homely, humorous, unpretentious, unflashy, neo-classical, pastoral and absurdist all at once - but Hatfield and the North were all those things, and more.If you're American and you've never heard these musicians, imagine a good-humoured, non-misanthropic Zappa using only British vocalists, and you're close.From time to time I've had my doubts about Hatfield and the North or other Canterbury bands from the same period, because my favourite Dutch novelist (Geerten Meijsing), a keen jazz lover, once described their style as 'puppet show music'. To be honest, parts of this album do sound a bit like that, and not just because of the march-like melodies or Dave Stewart's electric piano; I guess it has something to do with the influence of Igor Stravinsky - after all, he wrote his most charming ballet score (PETRUSHKA) about a farcical puppet show.But any fleeting doubts I may have when I play this album are soon dispersed, because the music keeps moving constantly. It's a delightful sm�rg�sbord of styles: in a brief period of time you're taken from chirpy music-hall style singing to crisp electric guitar solos, delicate flute salads and angelic girl choirs. A marvellous concoction!"
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Monday, August 20, 2007",
      "rating": 5,
      "text": "Talk about an all-star cast ! Even the guests are all-stars. Namely Robert Wyatt formerly with SOFT MACHINE and Geoff Leigh from HENRY COW. This was Richard Sinclair's first band after he left CARAVAN and he teams back up with Phil Miller who had left CARAVAN an album earlier than he did to join MATCHING MOLE. Of course Robert Wyatt was in MATCHING MOLE as well. Dave Stewart came from EGG via KHAN and Pip Pyle came from GONG. Although there are 17 tracks including the 2 bonus songs(an a & b side single released in 1974) the songs actually blend into each other all the way through giving the impression of one seamless track. I have to agree with fellow reviewer Andrea Cortese that this is a difficult listen (at least the first half is) and while I prefer the more melodic follow up \"The Rotters' Club\", I have to say this blows me away. The musicianship is second to none here and it's very challenging and complex instrumentally to say the least.\"The Stubbs Effect\" is a short piano intro while \"Big Jobs (Poo Poo Extract)\" is a pleasant song where we get vocals for the first time. \"Going Up To People And Tinkling\" is a jazzy little number with outstanding drums and bass work. \"Calyx\" features Robert Wyatt doing vocal melodies throughout. \"Son Of \"There's No Place Like Homerton\"\" has some great keyboard play as well as female vocals, flute and lots of horns late. \"Aigrette\" is led by drums, bass and vocal melodies. \"Rifferama\" is more uptempo with some good guitar.This song really stands out from what has gone on before. \"Fol De Rol\" is relaxed with vocals, but \"Shaving Is Boring\" is anything but relaxed. This Is fantastic ! Such an intense, driving number with some good guitar and organ late. Check out the fuzz too.The next three songs are laid back with vocals and they seem to blurr together as one before we get to \"Lobster In Cleavage Probe\". This one has female vocals, flute, gentle keys and guitar before becoming more urgent later. Great section ! The tempo picks up late. \"Gigantic Land Crabs In Earth Takeover Bid\" really impresses me with the aggressive guitar that goes on for quite a while. Nice. The two bonus tracks would have fit well on \"The Rotters' Club\", actually \"Fitter Stoke Has A Bath\" is on the followup but it's a longer version. The best vocals on this record are on \"Let's Eat (Real Soon) while Phil gives us some great guitar on \"Fitter Stoke Has A Bath\".I love this record, it's adventerous and challenging and it's also essential listening for Canterbury fans."
    },
    {
      "reviewer": "Atavachron",
      "date": "Posted Monday, September 10, 2007",
      "rating": 3,
      "text": "The Hatfields were a fine band that represented a musical middle ground between the sophistication of National Health and the more relaxed sounds of Gilgamesh, and featured the cream of the Canterbury crop. This, their first, can be inconsistent but the good cuts are excellent and showcase both Dave Stewart's learned keys and guitarist Phil Miller's penchant for jazz. At ten minutes, 'Son of There's No Place Like Homerton' is the epic here, with careful phrases from Stewart, playful horns that brighten things and is filled with many changes in direction, Miller's guitar responding in turn with ornate intertwinings of organ, electric piano and Richard Sinclair's bass. And 'Rifferama' is an upset little number, almost avant garde, with fuzz-rock meeting light jazz in a most strange way. 'Shaving is Boring' has a mellow start but becomes a driving jazz-rocker with a tangibly live feel, accenting just how well the core of this unit could play together, Pip Pyle's insistant and sporadically changing drum lines, a good dose of space toward the end and much playfulness, and 'Gigantic Land Crabs in Earth Takeover' finishes in a chaotic jam. Granted, there are moments on this album that remind of the soundtrack to a bad 1970s movie, with keyboards trapped in some sleazy images flickering on the screen and enough wah-wah to date this old thing with dispatch. But don't let that stop you from enjoying one of the better bands from the illustrious school of the Canterbury, though the word is that their next, 'Rotter's Club', is superior. And points for the great cover... how many faces do you see?"
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Friday, March 7, 2008",
      "rating": 3,
      "text": "\"Hatfield and The North\" is the eponymously titled debut full-length studio album by UK progressive rock/jazz-rock act Hatfield and The North. The album was released through Virgin Records in February 1974. Hatfield and The North formed in mid-1972 by members and ex-members of Delivery, Gong, Caravan, and Matching Mole. All accomplished musicians who had already tried a lot of different things and had experience with recording and touring.Hatfield and The North play an experimental progressive rock style with strong jazz-rock/fusion leanings. Caravan and to a lesser degree Soft Machine are obvious references, but Hatfield and The North found their own niche of the Canterbury progressive rock sound. It�s predominantly focused on the instrumental part of the music, or at least on many of the tracks featuring vocals, the voice is almost used as an extra instrument. Bassist/lead vocalist Richard Sinclair, who had just come out of a stint with Caravan has an easily recognisable voice and singing style, but the album also features a guest performance by Robert Wyatt (Soft Machine, Matching Mole) on the \"Calyx\" track, which is quite memorable. In addition to Wyatt guesting, the songs \"Son of 'There's No Place Like Homerton'\" and \"Lobster In Cleavage Probe\" feature a female choir.The structure and tracklist of the album is a bit unusual with many shorter tracks and a few longer ones. 15 tracks and a total playing time of 46:11 minutes. Some of the tracks aren�t even a minute long and some quite frankly sound a bit unfinished (or musical ideas born out of jamming, but never finalized in terms of adding finished compositional elements), but some seque into each other to form longer musical structures and make more sense in that context. As the case for example is with the four opening tracks of the album which work like an intro phase to the 10 minutes long \"Son Of \"There's No Place Like Homerton\" (which features quite prominent use of saxophone and some flute is also heard). Although the music is often nice, laid-back, and mellow semi-jazzy progressive rock, it�s not easy listening music by any means. The band toy with time signatures and various timbres and dynamics which require attention from the listener.The album features a soft, organic, and detailed sound production, which perfectly suits the material. To my ears it�s quite brilliant production work. Upon conclusion \"Hatfield and The North\" is an incredibly well performed and well produced release, but the compositional part of the album is lacking coherence and a lot of the album simply sounds like the band noodling along to unfinished musical ideas. Thankfully they are musicians on such a high level that even random musical noodling ends up sounding great. A 3.5 star (70%) rating is deserved."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Thursday, January 28, 2010",
      "rating": 4,
      "text": "I've never been the biggest Canterbury fan, altough I do have a smattering of Camel, Caravan and the like in my collection. I've always found the meandering melodies and all-too-British lyrics not to my taste. But for Hatfield And The North, I make an exception. This album transcends the above mentioned traits with a jazzy feel and clever compositions. The only drawback to me is Richard Sinclair's thin and mostly too light vocals.Many of the songs blend together, giving it an epic feeling, and sometimes making it difficult to tell when one song ends and the next one begins. But it all flows so well that it doesn't matter. Keyboardist Dave Stewart to me is the key to this album's success. His complex playing drives the music better than in any other group I have heard him.A truly great addition to any collection."
    },
    {
      "reviewer": "EatThatPhonebook",
      "date": "Posted Wednesday, April 14, 2010",
      "rating": 5,
      "text": "Even the first time I listened to this I was amazed and my mind was blown. Hatfield & The North was a supergroup, formed by Sinclair(Caravan), Miller(guitars, from Matching Mole), Pyle (from Gong, drums), Stewart(Khan, keyboards). Their first album is one of the best Canterbury albums of all time. The album contains all the elements that made the Canterbury Scene so great: nice melodic and romantic moments mixed with complex arrangements in the instrumental parts. All the songs are connected to each other, so it sounds like it's formed by one long song. But, if we consider all the songs separated from each other, we have 15 marvelous pieces, where the music, similar sometimes to the soft machine's \"tiny virtuousness\" in the very brief songs, flows like rarely an album does. Absolutely essential, being one of the best Canterbury albums ever. Enjoy and listen carefully!!"
    },
    {
      "reviewer": "The Quiet One",
      "date": "Posted Tuesday, June 15, 2010",
      "rating": 5,
      "text": "Canterbury and the NorthOut of the classic Canterbury Prog bands, Hatfield & the North seems to be buried by Caravan's happy prog, The Machine's jazziness and Gong's trippiness. However, there's really no explanation for this since Hatfield & the North were another top-notch band with a unique style which combined the easy-listening but still sophisticated music of Caravan with lots of nonsense and an essential jazzy flavor. With Richard Sinclair at the front with his unique voice and overlooked bass playing, and Dave Stewart on the keys, you've got here one of the most enjoyable supergroups music history has ever gave us.Their debut is no less than fascinating, having a spectacular flow that, alike many Soft Machine albums, the whole album is connected one way or another, meaning that from one tune to the other there's at least a tiny relation and makes the album far more jointed than albums that have ten or so absolutely un-related songs.This album delivers the listener from simply pleasurable melodic sung tunes like 'Big Jobs'(both parts), 'Calyx', 'Aigrette' and 'Licks for the Ladies' to intricating structured songs with lots of shifts and with very impressive musicianship like 'Son of There's No Place like Homertorn', 'Gigantic Land-Crabs in Earth Takeover Bid' and 'Shaving is Boring'. However, I recommend the listener not to detract from the longer tunes since the enjoyability of those tunes comes along with the addition of having heard those lovely short tunes I mentioned first.There might be no 'Nine Feet Underground' or anything in the vein of 'Third', but still this debut album gives me the same, or sometimes even more, amount of enjoyment than those other classic Canterbury Prog albums give me. The music of this group is so tasteful and sophisticated that I can't see anyone with a good taste in music not liking this, though I've got to say I've known people who simply dislike the music written by Canterbury musicians.A flawless masterpiece with no real highlight other than the album itself as a whole: if you're a fan of Jazz Fusion/Rock check this out, Hatfield & the North makes a unique twist from that genre. Also, anyone interested in Canterbury Scene, this is indeed a very good start."
    },
    {
      "reviewer": "frippism",
      "date": "Posted Saturday, October 9, 2010",
      "rating": 5,
      "text": "Of all the super-groups, Hatfield and the North is probably the only one that isn't at all disappointing at all. In fact they are not only not disappointing, but actually rather good... Or really good... Or wonderful. The Canterbury super group featuring some rather incredible musicians (Dave Stewart of Egg and Khan-Keyboards, Phil Miller of Matching Mole- guitar, Pip Pyle of Gong- Drums... RIP Pip, and Caravan's Richard Sinclair on bass and vocals), and manage to create a mix of what I would try (rather badly) to describe as Caravan's humor and melody with Jazz/Fusion touches and an almost King Crimson like experimentalist side (Yeah that made sense...).Hatfield's first album is a rather magical affair. All the songs are more or less stuck to each other and unless you work hard at checking the name of each song with every listen you probably know each song as \"that part in the album\". But the album kicks off with the nice and short \"Stubbs Effect\" and goes directly into this jazzy little jam (\"Going Up To People And Tinkling... yay!). This evolves into \"Calyx\", with Canterbury celebrity superstar Robert Wyatt. Wyatt provides an excellent vocal melody, which evolves (I'm going to use the word \"evolves\" a lot in this review) into the first epic track: \"Son there's no place like Homerton\". The affair is a pretty and quirky... affair, with those who are called \"The Northettes\" singing backup vocals (to a great effect). The song develops to a few directions with a bunch of time changes and that fun stuff, and eventually (here it comes...) evolves into probably the most melodic song. Ever. Aigrette shows off Phil Miller's talent of writing unbelievably melodic short songs (also exemplified in the next album). Aigrette is absolutely delightful. This thing oozes out this melody to which Richard Sinclair sings beautifully. Probably my favorite short track from the album. I can go on and on about all the short songs, but my laziness is becoming stronger with each second. Worth to mention from the other shorts is \"Fol De Rol\" with its cool telephone gimmick (You'll understand when you'll listen to the album). The second epic: \"Shaving is Boring\" is another great song and pretty experimental. The band... experiments with a lot of different sounds, and there's really awesome part when everything just stops and you hear someone running up and down a hallway opening doors and each of them has a different song in them until he finds the one door that leads to the next riff... That's just awesome. The album... evolves into another few instrumentals, and before you know it, you're done!This isn't exactly easy listening, though. The lack of actual \"songs\" makes the album a bit hard to digest in the first couple of listens. While it has the pleasant and light hearted Caravan-ish sound, it certainly is much more progressive than most Canterbury albums. Definite buy for anyone who enjoys progressive music, and very much for Canterbury fans. Awesome little masterpiece!"
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Friday, April 1, 2011",
      "rating": 4,
      "text": "First album from this Canterbury supergroup. Featuring former members of Egg, Caravan, Matching Mole and Gong. On this album we are introduced to the Northettes, female singers who usually do wordless vocals. Richard Sinclair does the main vocals and both his singing and bass playing here is an improvement over what he did with Caravan. Originally him and keyboardist Steve Miller (brother of Hatfield guitarist Phil) left Caravan to form this more jazzy group. Eventually Miller was replaced by Dave Stewart who brought along with him some unfinished ideas from Egg.All the songs are linked together and the whole album flows as one piece. It's more consistent in general compared to Rotter's Club, but that album's best moments are superior to anything here. It sounds like they spent a lot of time on this album. Apparently, they spent a lot of money on it as well; the band members owed money for decades after recording it. The MiniMoog is used here more than it is on RC. Sinclair likes to occasionally alter his voice for a word or two. The album begins and ends with sequenced piano-like sounds on MiniMoog. There are two \"Big Jobs\" songs. I like the first a little better but it's less than a minute. The second version is more of an actual song and is performed in a smoother way. It features a great solo on fuzz-organ or maybe even MiniMoog.The songs vary in length from 20 seconds to 10 minutes. \"Going Up To People And Tinkling\" has some chords here and there which forshadow the side-long \"Mumps\" on Rotter's Club. \"Calyx\" features Robert Wyatt on wordless vocals. In fact, this whole song sounds like one of the mellower and spacier Matching Mole songs. I'm not sure if Wyatt recorded this song before or after his accident; I'm assuming after. \"Son Of 'There's No Place Like Homerton'\" begins with some electric piano which reminds me of Soft Machine. Great drumming and organ work after 1 1/2 minutes, followed by some sax from Geoff Leigh. Not sure if he was still in Henry Cow at this point. This part sounds Zappaesque.Some electric piano arpeggios follow along with a little bit of MiniMoog. Guitar, bass and drums join in. Then the Northettes enter. The music stops and then some menacing Canterbury sounds before it gets more subdued. Northettes and overdubbed Geoffs finish it. \"Rifferama\" shows the group at it's best, jamming away in jazz-rock mode including some Gong-like sounds in the middle. \"Fol De Rol\" is one of the stand out songs. Sinclair and the Northettes sing scat-like gibberish in harmony. Interesting drumming from Pip Pyle. Nice wah-bass solo. Love the part where a phone rings; someone answers it and you now hear the singing on the phone!\"Shaving Is Boring\" begins with the person hanging up the phone. You can listen to this song here on PA. Perhaps the best song on the album. Constantly changes and goes through different sections. At one point you hear running and doors opening and closing; each door when opened plays a few seconds of earlier songs from the album. Great tones here from all the non-percussion instruments. Sounds like a little bit of Mellotron in there somewhere. Up to this point the album has been fairly strong. \"Licks For The Ladies\" and \"Bossa Nochance\" bring down the album's momentum. Closest thing to filler on the album.\"Lobster In Cleavage Probe\" features counterpoint vocals from the Northettes. About halfway changes to a jazzy instrumental section. \"Gigantic Land-Crabs In Earth Takeover Bid\" (you gotta love some of these titles) sounds a lot like Egg. Great playing from all. Most if not all CD versions feature the groups first single \"Let's Eat (Real Soon)\" as a bonus track. A very upbeat and poppy song, but would sound out of place on the album itself. This album could be a good introduction to the Canterbury Scene. It's definately one of the better albums in that sub-genre. Hatfield is a band that I wish made 2 or 3 more albums than they did. This is pretty close to a masterpiece but not quite. 4 stars."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Friday, September 2, 2011",
      "rating": 5,
      "text": "A true Canterbury supergroup, Hatfield and the North brought together the qualities of its various members previous bands - combining the whimsicality of Gong, the sense of humour of Caravan, the jazz-rock chops of Matching Mole and the complexity and flair of Egg. The group blend all of their musical styles perfectly to create a whole that is far greater than the sum of its parts, with a mood that ranges from the tranquil (Calyx, Fol de Rol) to the frenetic (Shaving Is Boring).The instrumentalists are at the peak of their game - Phil Miller's guitar playing and Dave Stewart's ever-charming keyboard are particular treats. On top of that, the band shows an appreciation for the use of the voice as an instrument; Richard Sinclair proves willing to make the most unusual voices as part of his singing, the Northettes add an extra layer to the music with their angelic backing harmonies, and pal of the band Robert Wyatt puts in a guest appearance on Calyx (marking, incidentally, his return to professional musicianship following the life-changing accident which put paid to Matching Mole). Finding a perfect balance between the jazz fusion direction explored by Canterbury elder statesmen Soft Machine and the more whimsical approach of the likes of Caravan and Gong, the first Hatfield and the North album is a vital album for anyone exploring the Canterbury style of fusion."
    },
    {
      "reviewer": "friso",
      "date": "Posted Sunday, January 8, 2012",
      "rating": 3,
      "text": "Hatfield and the North - s/t (1973)This is the first album by Hatfield and the North, for those who are interested in this sub-genre of prog a relatively well-known band. This time the who's who is made up of Richard Sinclair (Caravan) on bass and vocals, Stewart (Arzachel, Egg, National Health) on keyboards, Pip Pyle on drums and Phil Miller on guitar. There are some guest vocalists. A short contribution of Robert Wyatt on one of the first track and some female vocals of Barbara Gaskin (of Spirogyra, a psych-folk group you should check out), Amanda Parsons and Ann Rosenthal.The style of Hatfield and the North is perhaps best described as; the sound of Caravan with a large doses of noodling fusion. Optimistic in nature, but also a bit non-emotional. For those who already listened to National Health (which came later), the sound & style is almost the same here. There are no serious songs, almost everything is instrumental and even the parts with female vocals could be interpret as instrumental (due to fact the vocals are only used to sing notes). At playing instrumental compositions the band is really good, the performance of every-one involved is top-notch and the sound of the recording is clear an professional. Vinyl listeners might add some bass themselves, for without it the record sounds a bit too light.Now, I can see why a lot of people like this record. Great musicians, classic Canterbury style, great art-work. For me personally, this record doesn't offer too much. I like a lot of instrumental sections, but in the end nothing touches me and I find the record to sound a bit emotionless. The compositions sound intelligent and hard-to-play, but in the end the melodies and chord-progressions also sound a bit random like most later Stewart-related records. The psychedelic sillyness (phone rings, some-one takes it and the vocal line comes through the telephone) are an oasis in this desert of noodling, but I just can't help missing some concrete, emotionally driven instrumental parts or - even better - songs. Conclusion. Well played and professionally produced Canterbury classic, but not essential in my humble opinion (due to lack of replay and emotional involvement). Recommend to fans of the Canterbury sub-genre and jazz-rock/fusion. I'll go for the small three and a halve stars here."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Sunday, October 21, 2012",
      "rating": 4,
      "text": "'Hatfield and the North' is a stunning debut from the darlings of Canterbury. The album is a milestone of the genre and features some incredible musicianship from the likes of Dave Stewart of Egg and Khan on keyboards, Phil Miller from Matching Mole on guitar, Pip Pyle of Gong on Drums and Richard Sinclair from caravan on bass and vocals. Guests include Robert Wyatt singing 'Calyx'.The album tracks fly along at breakneck speed, 4 of which are less than a minute long, and it soon launches into a jazz improvisation on 'Going up to people and tinkling'. A great deal of Caravan and Gong's humour is injected into the music and it is wildly experimental throughout. In reality every track is glued to each other rather than a separate entity and it would have been interesting as one long suite rather than a bunch of snippets as it is. It certainly works well on CD without having the breaks a vinyl experience forced upon the listener.'Calyx' is Wyatt's vocal intonations, and not too bad overall. This is segued immediately into \"Son of 'There's no place like Homerton''. The sweet backing vocals are sung by \"The Northettes\" and it has a jazzy keyboard line and some wonderful sax; one of the best tracks on offer here, clocking over 10 minutes. The flute at 4 and a half minutes is a fabulous embellishment.'Aigrette' is a showcase for Phil Miller's guitar prowess and Sinclair's vocals; one of the highlights. 'Rifferama' follows with Miller's blazing guitar in all its glory and some manic vocals, including canned laughter at the end. I like the experimentalism and telephone section in 'Fol De Rol', and it has a Gentle Giant vocal technique.Another definitive highlight is 'Shaving is Boring' with experimental jazz sections and Krautrock nuances, running for 8:46. It has electronic keyboard melodies and changes signature almost at will. The cool effect of footsteps running flat out of someone in a corridor opening up a series of doors is fascinating. Each door that opens reveals a section of music and the protagonist opens each until the right riff is discovered; a very innovative playful moment of the album.Other tracks are instrumental based and very short at times, not as good as other tracks, though I love 'Lobster in Cleavage Probe' with the female angelic voices and chimes. It ends with the bonus tracks including the popular 'Fitter Stoke Has a Bath' driven by Sinclair's quirky style. Overall the album is essential Canterbury, though a bit hit and miss but then most Canterbury is. One of the greatest debuts in rock history, it is definitely worth hearing and ranks as one of the quintessential Canterbury albums along with 'The Rotter's Club'."
    },
    {
      "reviewer": "octopus-4",
      "date": "Posted Tuesday, April 23, 2013",
      "rating": 5,
      "text": "After having played in almost all the most important Canterbury's bands, the drummer Pip Pyle reforms his first band \"Delivery\" who had left years before after a hard discussion with the band's singer, with the Miller brothers but with Richard Sinclair just out of Caravan and the former Arzachel and Egg Dave Stewart. The story says that while they were going to a gig by car they have seen a motorway signal indicating to \"Hatfield and the North\". That's were the band's name is for.Just a bit of history, to say that this \"late\" Canterbury band is made of elements who have played in all the biggest bands of the genre, and in addition there's also the hypnotic effort of Robert Wyatt's vocals in one song.As in the Canterbury tradition, a jazz layer is mixtured with folk and psychedelic elements. Mushrooms and Trolls united with a strong instrumental jazz skill. All those elements together can be found on the longest track \"Son Of There's No Place Like Homerton\" which also in the title reminds to Caravan but with brasses in Soft Machine style and a high pitched choir which has a Gong flavor, but also to late Soft Machine, thinking to \"Land Of Cockayne\".There's a number of very short tracks and this is the main reason why I'm not writing a track by track review, but all the tracks fade one into the next so the album is not \"fragmented\". I think Pat Metheny has liked tracks like \"Aigrette\" and parts of it have later become standards in his soft jazz.It's a classic of the Canterbury subgenre created by what can be called a supergroup."
    },
    {
      "reviewer": "Wicket",
      "date": "Posted Sunday, June 16, 2013",
      "rating": 4,
      "text": "Foreword: The score for this album will only be relevant depending on if you're familiar with Canterbury Prog or not. I recommend going straight to the Verdict if you are unsure what to expect with this record.Now, I will not ever claim to be an expert on the unusual isolated realms of prog (Zeuhl, Krautrock, the Canterbury Scene and the like), but looking at the tracklist and the fact that Dave Stuart and Robert Wyatt make appearances here (both well known Canterbury prog rockers), the possibilities are endless when you're talking about a hive mind of Canterbury prog vets who know how to boggle the mind. Sure enough, they scrambled my brain with this record. And then some.Why all the songs are divided as such, I'll never know and never bother to question (why is the intro 30 seconds long with a 10 minute jam just shortly afterwards?), but the creepy tinkling intro gives way to a 30 second verse (\"Big Jobs\"), followed by a cool jam (\"Going Up To People And Tinkling\" [with a few guitar links that sound very Grateful Dead-ish]), and then another 2 minutes of men saying \"Ahh\" a lot (\"Calyx\"), all leading in to the 10 minute jam, \"Son Of 'There's No Place Like Homerton'\".Now, I am familiar with Soft Machine and the drug-crazed insanity that resulted in many of the early Gong albums, but as far as British drug-crazed insanity goes, \"Hatfield And The North\" might just take the cake. At least with Gong, many of the early albums followed a storyline. An insane story line, involving drugs (a lot), but a story nonetheless. This album has no story. No guidelines. No rules. Even during the somewhat sober 10 minute jam \"Son Of\", it's very much a free-flowing progression. The sax lines move without care or progress, the organ has a mind of its own, the drums have a very mechanical feel, even during some of the impressive solos and fills drummer Pip Pyle engages in.It really wasn't until this song that I could understand the point of this album. This band is a collection of prog veterans, a British supergroup of drugs, pornography and plenty of alcohol. \"Son Of\" broke open the chaos of the first five minutes by introducing order, a massive contrast to the first four tracks heard previously. Yes, it's not for everyone. But then again, drugs are not for everyone either, but that's another story entirely.I digress, \"Aigrette\" starts like a sort of spin-off of \"Son Of\", with the mindless shouts and singing of \"Calyx\". Once it bleeds into \"Rifferama\", though, the groove becomes infectious. It seems like everyone wants to rock out all at the same time, til the guitar takes center stage. Definitely one of my favorite tracks of the album. It still has the crazed, drug-hyped, spasticality of Canterbury prog with the groovy, infectious tone of classic 70's rock that everyone knows and loves.\"Fol De Rol\" takes a step back from the fast-paced insanity and slows down the jam, with the bass getting time to shine for 3 minutes. Love the telephone, though. The guy picks it up and the singing picks up where it left off, through the telephone. Nice little effect there. Luckily for fans of long jams, though, the fun continues with another long jam, this time 8 minutes long, with the amusingly named (and truthful) \"Shaving Is Boring\". Pyle picks up the pace a little bit with the drums, and Phil Miller pulls off some impressive licks on the guitar here. Though, I'm still confused about the samples of previous songs, then what sounds like a guy punching a radio, running over to another radio, turning it on to another sample, punching it again, and running away again. Odd. Still, it goes back into another jam. And that's nice.\"Licks For The Ladies\" is actually a misnomer. There are no real licks, here, just a ballad of sorts. \"Bossa Nochance\" is actually a continuation of that ballad. And, coincidentally, so is \"Big Jobs No. 2\". This sequence of tracks, then, is the first properly structured song on this entire album. And also, the last. Segue into the weirdly named \"Lobster In Cleavage Probe\", which mainly consists of a female chorus, til the guitars and synths plug in halfway into the track with skipping lines and up and down licks. Ominous bass lines pepper \"Gigantic Land Crabs In Earth Takeover Bid\" , headlined by a massively distorted guitar solo that sounds like a lick taken straight out of Buckethead's book 30 years prior. Then it suddenly settles down again, seamlessly bleeding in and out of this chaos/order philosophy. \"The Other Stubbs Effect\" is a continuation of the weird sparkly intro to the record which ends this set of tracks.Then you get to the bonus tracks, which aren't really bad at all. \"Let's Eat (Real Soon)\", funny enough, is the complete opposite of the previous song. A happy melody, a cool little verse, and a nice little synth lick with peppy drumbeats filling the whole track with life. \"Fitter Stoke Has A Bath\" is structured similarly, With a vocal line, a happy melody and lots of little licks and lines from synths, guitar and flute.VERDICT: This record is definitely not for the faint of heart. Of course, if you love Wyatt and Dave Stewart's works, and Canterbury prog in general, this will be a must have. Surely, then, if you are reading this review, you probably like Canterbury Prog and know what to expect, so my review will probably be misleading to both insiders and outsiders of the genre. In terms of sweeping melodic lines and beautiful song structures, this album is definitely, repeat, DEFINITELY NOT FOR YOU. It takes a bit of a stomach to appreciate the boundaries these guys are breaking and leaping beyond to create this record. As I said previously, this is mainly a free-formed collection of jams. The album focuses less on songwriting and more on sound sculpting. The Chaos/Order philosophy occurs many times throughout this record. This album gives no mercy upon its listener, so hopefully this review helps to prepare you for what you'd expect when popping this in a record player or iTunes.Then again, if it's still confusing for you, just think \"drugs\". It'll all make sense eventually."
    },
    {
      "reviewer": "Matti",
      "date": "Posted Tuesday, January 7, 2014",
      "rating": 5,
      "text": "This classic band - named after a road sign - is a good example of the way the Canterbury bands are inter-related through their line-ups. The group was formed in 1972 when Richard Sinclair and keyboardist Steve Miller left CARAVAN after their Waterloo Lily album, in order to join DELIVERY, in which already played Steve's guitarist brother Phil Miller and drummer Pip Pyle. Steve Miller was replaced first by Caravan's Dave Sinclair (so turns the roundaobout! At this point the group was re-named as Hatfield and the North). And when he eventually returned to Caravan, enter Dave Stewart from EGG! As a Stravinsky fan he brought some art music influences and as a player had to adopt a jazzier touch than before. The group soon found their unique style full of both challenging complexity and warm, witty humour, and was among the first artists in Virgin Records. The working on the debut began in November 1973 with engineer-producer Tom Newman.For any lover of jazzy Canterbury prog this band is absolutely essential. There are over a dozen of tracks (running times vary between 0:23 and 10:10), but the album flows smoothly and the seams are very unnoticeable. In this sense it reminds of early SOFT MACHINE (vols. 1 and 2). The sound is a bit different though, one could describe it as an airier and jazzier version of Caravan from 1971, featuring the elegant vocals of Richard Sinclair. Stewart has changed his organ tone of Egg into lighter approach favouring electric piano. Phil Miller's recognizeable guitar style brings thicker tones into the sound. A female vocal trio on few tracks brings yet another link to Stewart's, Miller's and Pyle's next band, NATIONAL HEALTH.Robert Wyatt's vocalise input on 'Calyx' is a certain Canterbury classic, and so is this whole instrumental-oriented album with many funny track titles such as 'Lobster In Cleavage Probe'. Perhaps the nicest song on the CD is 'Let's Eat (Real Soon)', originally appeared as a single. The album received some warm reviews, but the studio sessions (delayed by some technical problems) were more expensive than what the album sold. The follower album, equally recommendable The Rotters' Club actually made it into No. 43 in the charts, surprisingly. It also gave the name to Jonathan Coe's fine novel, in which progressive rock has a central part in its picture of the 1970's."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Saturday, April 26, 2014",
      "rating": 5,
      "text": "A great all-star group formed out of the ashes of Soft Machine, Caravan, Khan, and Matching Mole consisting of members Phil Miller on guitars, Pip Pyle on drums, Richard Sinclair on bass and vocals, and Dave Stewart on organ and piano with adjunct participation of Geoff Leigh on saxophones and flute, Jeremy Baines on pixiephone and the wonderful \"Northettes\" on background vocals (Barbara Gaskin, Amanda Parsons, and Ann Rosenthal). The album also featured on the fourth song the talents of guest vocalist Robert Wyatt before his paralyzing accident.1. \"The Stubbs Effect\" (0:23) (>>) 2. \"Big Jobs (Poo Poo Extract)\" (0:36) (4.5/5) 3. \"Going Up To People And Tinkling\" (2:25) (4.75/5) 4. \"Calyx\" (2:45) (4.75/5) 5. \"Son Of 'There's No Place Like Homerton'\" (10:10) soft, slow to develop, jazz; the protracted intro takes 90 seconds until we're finally launched into the fully developed song. The third minute shows the most mature and complex development of the album. This is serious! Things quiet down for the fifth minute--all Dave Stewart, until percussives, bass, and vocal ejaculations arrive. Then The Northettes interject their spell-binding magic starting at the five minute mark, calming, soothing the listener for over two minutes. An album highlight, to be sure. At 7:37 the band takes back the control with an enjoyable Todd Rundgren-like march. What started with little hope or promise turned into quite a little gem! (18.5/20) 6. \"Aigrette\" (1:38) (5/5) 7. \"Rifferama\" (2:56) (8.5/10) 8. \"Fol De Rol\" (3:07) (8.75/10) 9. \"Shaving Is Boring\" (8:45) what begins as quirky, squeaky jazz develops into a more serious fare. (16.5/20) 10. \"Licks For The Ladies\" (2:37) (4.25/5) 11. \"Bossa Nochance\" (0:40) (>>) 12. \"Big Jobs No 2 (By Poo And The Wee Wees)\" (2:14) Richard doing what Richard does best. (9.5/10) 13. \"Lobster In Cleavage Probe\" (3:57) amazing harmonic arrangement! (10/10) 14. \"Gigantic Land-Crabs In Earth Takeover Bid\" (3:21) fun jazz fusion. (9/10) 15. \"The Other Stubbs Effect\" (0:38)Total Time: 46:11The album is lots of fun, with lots of short collective explorations, lots of experimentations with editing and mixing. Richard and Robert (on \"Calyx\") are at the peak of their vocal confidences--though I wish \"The Northettes\" got a little more air time (like their amazing work on \"Lobster in Cleavage Probe\"). We get a preview of some of the sounds made famous on Edgar Winter's \"Frankenstein\" and Todd Rundgren's \"Adventures in Utopia\" on \"Rifferama.\" The album has only two longer songs, \"Son of 'There's No Place Like Homerton'\" (10:10) and \"Shaving is Boring\" (8:47), which are actually two of my least favorite songs on the album. I love the nonsensical tongue-in-cheek 'classical' vocal harmonies of \"Fol de Roi\" (3:09)--especially the \"call-in\" reprise over the telephone line at the end! There is great bass play throughout the album from Richard, as well as top notch guitar and drum play. The wide variety of keyboard sounds Dave Stewart was experimenting with on this album don't get much traction from him on successive recordings but are fun and interesting here. Not quite as jazzy or proggy as others from this sub genre. Still, there's a lot packed into this album. Check it out!Five star songs: 2. \"Big Jobs (Poo Poo Extract)\" (0:38); 4. \"Calyx\" (1:06); 5. \"Aigrette\" (1:39); 6. \"Rifferama\" (2:58); 11. \"Big Jobs No. 2 (By Poo and The Wee Wees)\" (2:16); 12. \"Lobster in Cleavage Probe\" (3:58), and; 13. \"Gigantic Land-Crabs in Earth Takeover Bid\" (3:22).A-/five stars; a minor prog masterpiece and a stellar example of the best of what the Canterbury Scene has to offer the Progressive Rock genre. A bit silly at times but otherwise this album stands up well over time. Not quite the type of album that draws me back as much as some others from the sub-genre, but definitely a good one."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Saturday, September 19, 2015",
      "rating": 5,
      "text": "The Canterbury Scene is without a doubt an incestuous one with virtually every representative band having members engaging in the ole switcheroonie with one another throughout the style's heyday in the 1970s. While many bands came and went, none would be able to exemplify this particular type of whimsical jazz-rock-fusion more than the supergroup HATFIELD AND THE NORTH. This band meant business and was in effect a culmination of all the Canterbury styles that came before. A sifted, refined and filtrated jazz-rock-fusion enigma that still sends shockwaves into the first-time listener by impregnating the casual progressive rock lover's ears with music so flirtatious and sublime that if one is not addicted to this particular brand of music yet, the gravitational forces of such magnanimous music will surely be the boon or bane to one's finances, for this particular album in general is one of my utmost gateway drugs into the extremities of the progressive rock archives and beyond the comfort zone from the more familiar and accessible sounds of Yes, Pink Floyd and Genesis. My bank account has never been the same since :PThis is one of those albums that really demands multiple listens for the magic to unfold. Upon first listen i was only dumbfounded. I was not at all accustomed to music like this. This takes the most adventurous of both the jazz and rock worlds and melds them together seamlessly which is a testament to the top notch musicians involved in this rarest of projects, one that is so daring and oblivious to contemporary trends that it actually succeeds in transmogrifying the listener's consciousness into a state of sonic bliss that feels as if it is taking place in a dream state or in an alien setting far away from the mundaneness of the every day world. While i would have never even dreamt of this existing in my top tier of musical pleasures upon first listen, this eponymous debut album with the equally magnanimous followup \"The Rotter's Club\" have only recently gained enough mojo to blossom into new musical arenas in my world, one where musical genres blur in a sonic firestorm that only tintinnabulates the most pleasant of musical expressions.Let me speak a bit about this unbelievable music. This is music for the gods and of the gods, for this is truly a prog supergroup of the highest level. This eponymous album comprises the absolute best in the Canterbury jazz-fusion scene and although the music itself focuses more on intricate instrumental prowess, there is more than enough comedic lyrical whimsy to suck the ego out of the transpositional chromaticisms and instead create a beautiful universal sound of surrender where the musical deities take the rei(g)ns and lead to one splendid sounding piece of work. The main players in this game are Phil Miller (Delivery, Caravan, Matching Mole), Dave Stewart (Arzachel, Delivery, Egg, Khan), Richard Sinclair (Wilde Flowers, Caravan) and Pip Pyle (Delivery, Gong) but the subordinate cast is JUST as essential for this brilliant soundscape which is deviously melodic with occasional touches of pure surrealism.These subordinate entities include Robert Wyatt on vocals, Geoff Leigh (sax, flute), Didier Malherbe (sax), Jeremy Baines (pixiephone, flute), Same Ellidge and Cyrille Ayers (vocals) and the beautiful enchantresses called the Northettes: Amanda Parsons, Barbara Gaskin and Ann Rosenthal. All the tracks connect like an early Soft Machine album and elements of all the contributing players unfold here into a frenzy of some of the most sophisticated music ever to exist in the rock world. HATFIELD AND THE NORTH just nails it. I have to emphasize that this is an acquired taste but just like triple IPA beer or certain stinky varieties of cheese, one that is well worth the effort. This kind of music is truly unparalleled at this point of time and still to this very day remains some of the most demanding yet satisfying music that exists. A veritable masterpiece of the ages that just hasn't been discovered by everyone yet. Inaccessible like the tombs of a long lost undiscovered Pharaoh but beckoning the progressive rock love to explore the nooks and crannies of some of the most sophisticated music ever. Can you tell? I love this one :O"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album2bc9.html",
  "last_parsed": "2025-05-18T00:21:43.456489"
}