{
  "album_title": "EMERSON LAKE & PALMER",
  "artist_name": "Emerson Lake & Palmer",
  "year": 1970,
  "rating_value": 4.24,
  "rating_count": null,
  "review_count": null,
  "genre": "Symphonic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/94/cover_3661524112011_r.JPG",
  "tracks": [
    {
      "number": 1,
      "title": "The Barbarian",
      "duration": "4:33",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Take a Pebble",
      "duration": "12:34",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Knife-Edge",
      "duration": "5:08",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "The Three Fates",
      "duration": "7:45",
      "is_sub_track": false
    },
    {
      "number": "a",
      "title": "Clotho (Royal Festival Hall organ)",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "b",
      "title": "Lachesis (piano solo)",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "c",
      "title": "Atropos (piano trio)",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 5,
      "title": "Tank",
      "duration": "6:52",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Lucky Man",
      "duration": "4:36",
      "is_sub_track": false
    },
    {
      "number": "2012",
      "title": "Stereo Mix -",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 1,
      "title": "The Barbarian",
      "duration": "4:32",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Take a Pebble",
      "duration": "12:37",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Knife-Edge (with extended outro)",
      "duration": "5:38",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Promenade",
      "duration": "1:30",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "The Three Fates: Atropos (piano trio)",
      "duration": "3:12",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Rave Up",
      "duration": "5:03",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Drum Solo",
      "duration": "3:02",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Lucky Man",
      "duration": "4:40",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Take a Pebble (alternate version)",
      "duration": "3:40",
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "Knife-Edge (alternate version)",
      "duration": "4:19",
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "Lucky Man (first Greg Lake solo version)",
      "duration": "3:03",
      "is_sub_track": false
    },
    {
      "number": 12,
      "title": "Lucky Man (alternate version)",
      "duration": "4:41",
      "is_sub_track": false
    },
    {
      "number": "2012",
      "title": "5.1 Mix -",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 1,
      "title": "The Barbarian",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Take a Pebble",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Knife-Edge",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "The Three Fates: Atropos (piano trio)",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Rave Up",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Lucky Man",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "7-18. High-Res stereo version of full Bonus CD",
      "duration": null,
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "The Owl",
      "date": "Posted Monday, January 26, 2004",
      "rating": 4,
      "text": "A rip-roaring great start! \"The Barbarian\" just makes you sit up and take notice, as do \"Tank\" and \"The Three Fates\"! Normally I can't stand a lot of Greg Lakes sappy tunes but \"Take A Pebble\" is a screaming exception (just needed a liittle editing though).Could've done without \"Lucky Man\" though."
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Thursday, February 5, 2004",
      "rating": 4,
      "text": "As far as I am concerned this one is the most honest and the least bombastic of their records and therefore my personal fave. Such a good album to start with that even ELP started with this one also .Take A Pebble is fantastic and so are Tank And Barbarian . It is hard to fault those three guys for having left their respective groups - Lake's choice to leave Crimson was disputable but valid and The Nice was a spent force and Atomic Rooster would go on to better things.Actually , if you can believe it my least fave is Lucky Man as it is relatively out of line with the rest of the album and that long Moog solo does not do much for me.If you are discovering ELP , this would be the perfect album for an intro and work through their discography chronologically untill..... you feel like it!"
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Monday, February 23, 2004",
      "rating": 4,
      "text": "Lucky menA bold statement for a first album, but given the supergroup tag instantly applied to ELP, this was perhaps to be expected.I love ELP's music, but almost every album includes a track or tracks I don't get. This album is no exception. There are six tracks in all, three on each side of the LP. \"The Barbarian\" is a great instrumental introduction, pacey, and accessible. \"Take a Pebble\" is a soft acoustic track with Greg Lake in fine vocal form,, and playing some wonderful acoustic guitar. The track includes a lengthy middle section which drifts into jazz piano, before returning to the main theme for the conclusion. While I have grown to love this track, I've always felt that an edited version without the piano section could sound better. Incidentally, the opening chords are actually played by Keith Emerson who is strumming his piano strings.\"Knife edge\" is reminiscent of Atomic Rooster's \"Tomorrow night\", the closest thing to a single on the album. \"The three fates\" is for me theAchilles heelof the album. It is a vehicle for displaying Emerson's keyboard prowess, but leaves me completely cold.\"Tank\" is a powerful instrumental, but in retrospect the showpiece drum solo was indulgent, and at best far too long. \"Tank\" and the last track \"Lucky man\" both featured a unique sound at the time from Emerson's moog synthesiser. It's hard to explain now, just howdifferentthe synth solos on these two tracks sounded when the album was released. Even today they send shivers up my spine.By all accounts, \"Lucky man\" was a late addition to the album, and did not take long to record. The version of the Synthesiser solo included was the first take. Ironic then that this is arguably the best track on the album.I have no hesitation in highly recommending the album, but feel free to skip through the odd track (or drum solo!)."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Thursday, April 1, 2004",
      "rating": 4,
      "text": "Well it's a stunning debut album, characterized by some unforgettable tracks as well as tepid or annoying episodes in the same time...\"Lucky Man\" as a ballad was a famous hit single, but it's totally out of contest, in comparison for example to the splendid \"The Barbarian\" or the Fugue inside \"Knife Edge\" ...instead the mini-suite \"Three Fates\" is a controversial idea by EMERSON alone and it's not always inspiring from the point of view of its composition, even though his skill is excellent as usual!! Recommended, despite of being essential in some circumstances only...\"Tank\" is another example of PALMER's great skill, but once again the composition is quite \"cold\" and academic as well!!"
    },
    {
      "reviewer": "greenback",
      "date": "Posted Thursday, April 8, 2004",
      "rating": 4,
      "text": "This is their first album. Progressive rock. The songs are rather varied and do not have the same style. The keyboards on \"The Barbarian\" have the typical TRIUMVIRAT sound. There is also on it electric guitar which I consider rather bland. ELP is not a band to listen for the electric guitar.Take a pebble is one of the best ELP songs: catchy piano, excellent lead vocals, loud and complex bass, subtle drums parts, the song can be mellow and progressive. \"Knife \"Edge\" has a fully distorted organ sound through keyboards solo. The piano on \"Three Fates\" is absolutely outstanding: Keith EMERSON is a virtuoso, that's obvious. \"Tank\" is an instrumental track full of fast bass, drums and keyboards. Unique. There is the mellow pop \"Lucky Man\" with simple acoustic guitar."
    },
    {
      "reviewer": "Carl floyd fan",
      "date": "Posted Monday, April 12, 2004",
      "rating": 4,
      "text": "This is an outstanding debut by one of the best prog rock bands of all time. The only question that comes to mind is: What is Licky man doing here? Its a little out of place and messes up the flow of the cd! Otherwise, this is a must buy record! Amazing!"
    },
    {
      "reviewer": "richardh",
      "date": "Posted Monday, May 17, 2004",
      "rating": 5,
      "text": "ELP get up and running with 'The Barbarian' as Carl Palmer ably demonstrates why he won so many drum polls. Then follows the majestic 'Take A Pebble' which has become one of the high points of ELP's music.Keith Emerson's piano work is exceptional ,well beyond the normal boundaries of 'popular music' while Greg Lake sings in his typical laid back style.Perfect. My least favourite track on the album 'Knife Edge' makes good use of Lake's deep baritone but I find the structure flawed and it lacks the usual fluidity I associate with ELP.'Three Fates' is a chance for Emerson to demonstrate his considerable skills and show off he does. Amazing piano and church organ! 'Tank' is very much a chance for Palmer to indulge his love of all things Buddy Rich and Emerson gets to have some fun as well.'Lucky Man' finishes the album on a highpoint with Emerson's powerfull moog solo. Overall this is a solid debut album that falls only marginally short of being a masterpeice."
    },
    {
      "reviewer": "Bj-1",
      "date": "Posted Wednesday, July 7, 2004",
      "rating": 4,
      "text": "Dark and mysterious, Emerson Lake & Palmer's debut album is one of the better prog albums that came out in 1970, displaying Palmer's impressive drumming and Emerson's fantastic keyboards. It kicks off with 'The Barbarian', with an aggressive bass guitar opening that sounds very reminiscent of what King Crimson was all about at that time, backed up with some furious keys and a frenetic rhythm section. A very good opener that eventually leads into 'Take a Pebble, a longer, more delicate track that effectively shows the bands melodic sensibilities, as well as Greg Lake's fine vocals and acoustic guitar playing, before the band goes into a jazzier conclusion halfway through the piece. 'Knife Edge' is another rocker with great riffing and yet another solid performance from Lake and should probably be the lead single here instead of the rather lackluster (IMO) 'Lucky Man' (though I can see why they chose that one instead to boost some sales ;) ), but 'Three Fates' is a brilliant showcase for Emerson's piano and keyboard virtuosity that move through three very distinct and different parts. Probably my favorite track here overall. 'Tank' features a fun and quirky intro before switching to a great drum solo by Palmer, the tune is a nice counterpart to the previous 'Fates'. The album overall actually feels more subdued than their later albums, with a nice balance between very good songwriting and virtuostic playing, while the next 'Tarkus' would go even harder and more overboard. Their debut remains a classic prog album, as well as one of the better introductions to the band. Highly recommended!"
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Sunday, August 22, 2004",
      "rating": 3,
      "text": "Emerson Lake & Palmer has a lot to say in their first record. 3 very young lads with a speciality each. But one in common: make enough noise to make you believe the're 5. This album stands out in a satisfying way: there's NO signs of fatigue in ANY tracks. No 'Are you ready Eddy?' or 'Crystal Bitches' (stupid name...).The Barbarian really gives the impression of a drooling bearded viking chasing you around with a rusty axe having the idea of bringing home your limbs as a trophy. One heck of a chase. There's a lot more of acoustic piano on this one; Keith giving his best shot on many tracks like Three Fates and Knife- Edge. Lake is charming us again with a beautiful gift in Take a Pebble. Relaxing, floating, country-style interlude and sets place for a lot of mental travelling, thanks to Greg's clear and magnificent voice. It's like a new King Crimson song in the old 1969 way.Don't expect grandiose extravangance like Brain Salad Surgery but also no signs of by-products a la Tarkus, making this record the only one like that in their repertoire.It's more serious, aggressive and challenging and yet, very less entertaining."
    },
    {
      "reviewer": "Certif1ed",
      "date": "Posted Thursday, September 2, 2004",
      "rating": 4,
      "text": "Essential - but I wouldn't recommend it...Although there is much evidence of creativity, an approach full of inspired drama and a wide range of great ideas, there are altogether too many flaws in this album for me to give it the full masterpiece status - which, to be fair, it practically begs for! That in itself is mainly why I do not give it the coveted award - generally the trio try too hard to impress, and not enough to write music of distinction.\"The Barbarian\" features Greg using a fuzz box which sounds very much like one I bought many, many moons ago - and was ancient then! Great, retro fuzzy sound, and intriguingly panned across the stereo, but somewhat ponderous.Keith then demonstrates how to play the organ with boxing gloves... I only jest slightly, for amongst the deliberate dischords, there is evidence of clumsy fingers and slightly poor timekeeping that makes a trained keyboard player such as myself balk somewhat. That said, there is much inventive keyboard work in this track, much of which reminds me of some of the early twentieth century French composers - and fine stuff it is too... except that it's a bit directionless and doesn't really gel into anything much.It's only when Greg swings the bass back into action with a bit more volulme applied that we are reminded that this track is entitled \"The Barbarian\". Palmer, of course, keeps things ticking away nicely with sensitive drumming crammed full of suble technical goodies and punctuation - although, on the whole, unremarkable, except for that gong!On the whole then, an opening designed to grab the listener's attention that does not really sustain it despite the increase in intensity, because of the lack of direction and the keyboard \"fluffs\".Moving on to \"Take a Pebble\", which apparently starts with Keith dragging a plectrum across the strings of a piano. Ineffectually for the opening, he changes to a more delicate motif, then steps around to the proper playing area of the instrument and produces wonderful rippling music of a sublime quality. In the meantime, Greg rolls out some fat root notes and Palmer produces fine, sensitive percussion... and then there are the vocals. I am not keen on this particular style of singing - and even less keen on the lyrics - so will leave it there before I upset the ELP fan base!Around the 3 minute mark, we get more piano ideas based around the rippling motifs - and, mysteriously, more of the piano string scraping, before an ultra-quiet acoustic guitar led section in a different key. This inexplicably builds to a hand-clap accompanied climax before subsiding again - presumably the idea here is to build a series of \"movements\", but a little continuity would be nice! Keith has the idea when he re-introduces the rippling piano, but stylistically develops it. One or two fluffs don't mar this section, which drives onwards, maintaining the French style I observed earlier. Palmer picks up a nice jazz rhythm, and Lake wanders coolly around the bass and the music develops naturally and easily for a while, but wanders a little here and there into uncertain territory. There is something of the King Crimson lurking in here - if only I could put my finger on it...\"Knife Edge\" is a bit of a mystery to me still - I like the crunchy riffing, and the quiet - loud - quiet - loud construction should resonate with anyone into Nirvana style grunge. Keith shows again why he should take those boxing gloves off, producing solo lines with more fluff than the average rabbit. The direction gets almost completely lost about midway, attempting to draw from Bach, but fortunately it's all pulled back together in a somewhat cacaphonous fashion full of technical tid-bits, and dramatically stirring in many ways - but a little too short of melody for me.The Three Fates section starts off with Keith donning heavy duty boxing gloves for his duties on the Royal Festival Hall organ, playing pretty much what he likes, with virtually no direction - believe me, I've played church organs, and know only too well the temptation to just pull out all the stops, stomp on the really low pedals and the swell and see what drops out - it all sounds very impressive, so you temper it with some softer noises in between. It only impresses me if someone can produce great music that way - listen to Saint-Seans organ concerto to see what I mean.Clotho is the youngest of the Three fates - the spinner and daughter of the night (OK, technically one of the oldest godesses in Greek mythology, and daughter of Zeus and Themis, but I digress). I would have expected less Bombast and more \"dark\", less showing off and more tempered, yet slightly out of control spinning in the music.However, the piano section that follows is full of Scriabin-like drama tempered with Debussy-esque soft chords and shows that Keith can find his way round a keyboard with both hands - very convincingly. He's also well played (as in the sense of well-read) - hark! Is that Beethoven I hear? After another burst of organ, we get a deliciously dischordant piano riff that builds up with bass and drums into a mesmerising section full of minimalist devices a la Steve Reich, and a peculiar rattlesnake noise coming from Palmer's direction - if only the rest of the album were at this kind of quality!Lachesis is the apportioner, decider of life duration for mortals, and Atropos the inevitable cuts the thread at the end of your existence so it's more difficult to have a preconceived idea for the music - but this works. Maybe I haven't heard the section beginnings and ends correctly, as this suite is well blended, but no matter - the first goddess is the only one I have issues with (musically...!).\"Tank\" features a drum solo. For us non-drummers it's OK on the first couple of listens, but gives me nothing lasting except a desire to skip past this bit every time I listen to this album - which is a trifle unfair on Palmer, as it is an excellent solo. I'm not sure what they were thinking when they wrote the section after the drum solo, as it is stodgy and generally horrible - especially that ridiculous shrieking... Sorry. I have nothing nice to say about this section.\"Lucky Man\" rounds off the album with a nice acoustic intro and more of those dodgy lyrics - although we can more easily take these as tongue-in-cheek. A standard kind of verse-singalong chorus structure makes a real contrast from the more progressive music which makes up the rest of the album - replete with FM rock guitar solo, it has to be noted! Pleasant enough, although the keyboard solo at the end is an odd touch... still, proves we have a geniune prog album on our hands - even if it's not a masterpiece!Worthy addition to your prog collection, but don't expect magic."
    },
    {
      "reviewer": "Watcheroftheskies",
      "date": "Posted Monday, September 6, 2004",
      "rating": 4,
      "text": "This is almost a required album to have. The instrumentals are rich, deep, complex and plentiful. What more do you want from a prog album? The Barbarian has some awesome drumming on it accompanied by very good music. You can almost feel the horses of the Mongols strafeing by you as you dodge their merciless blades. Well named song and proof from the start they are able to effectively paint a picture with music. \"The Three Muses\" is an excellent composition and shows off the keyboard playing skills this group has. Particularly, \"Atropos\" the piano trio. It is one of the heaviest piano songs I have heard, being very masculine and jagged. Lucky Man was always one of my favorite songs on the radio. The term 'lucky man' is first used in the song as a statement of envy but later as the 'lucky man' is called to war and is killed the statement, 'lucky man', morphs to sarcasam. You will find as you listen to their albums that in a few ways they are kind of morose. Which in my opinion is delightful and refreshing. Screw \"Peace dude\" how about saying \"People are dying for a pointless cause, fell happy now?\" it's a little more direct and snags upon the ugly truth of conflict a little better in my opinion. This is a great song on a great album. I would have given it 4.5 stars."
    },
    {
      "reviewer": "Fitzcarraldo",
      "date": "Posted Saturday, September 18, 2004",
      "rating": 4,
      "text": "An impressive first album from this trio, demonstrating a confidence and maturity that is, on reflection, not surprising given the previous experience of the band members. Listening to this album in the early 1970s it was not difficult to believe this band was destined to go far.'The Barbarian' is the trio's heavy interpretation of Bart�k's \"Allegro Barbaro\", which is itself sombre and 'barbaric' in feel. Emerson's piano and synthesizer playing really brings out the almost demonic feel of the piece, and Palmer's skill is also evident almost from the first bar. Quite an ambitious opener for a first album - the band clearly wanted to start with a bang.'Take A Pebble' starts with piano and the strumming of piano strings, and bass, introducing the rich timbre of Lake's voice, which is pleasing. He does not sing for long before the piece turns instrumental, with some very good piano and percussion from Emerson and Palmer. The instrumental then continues with acoustic guitar that, oddly (at least to me), sounds more like something one would hear in the Appalachians than from a progressive rock band. It's certainly very laid-back and pleasing, but I'm not sure this section of acoustic guitar fits particularly well into the piece as a whole. Then Emerson comes back in with piano - again very good - and the piece feels as if it's back on track. Palmer jumps in a bit later and the piece almost starts to feel like barroom jazz. There's a pause in the track and the piano then returns to reintroduce Lake's singing for a short while to complete the twelve-and-a-half minute track.'Knife-Edge' is the trio's interpretation of the first movement (Allegretto, Allegro, Maestoso) of Jan�ček's Sinfonietta for orchestra, Opus 60, but with the addition of Lake's singing. As with 'The Barbarian', this interpretation of a classical piece also works well. Emerson's keyboard sounds like a church organ, albeit a very funky one. This track is also heavy in places, but a real 'foot-tapper' (or should that be 'head banger'?), and the lyrics are manic and dark. Again I've got to say that Palmer's drumming is noticeably very good.'The Three Fates' (the goddesses Clotho, Lachesis and Atropos from Greek mythology) starts with 'Clotho': Emerson playing the Royal Festival Hall's organ, which is such an impressive, deep, ecclesiastical sounding organ with rich reverberation. Then piano replaces the organ for 'Lachesis' - very classically inspired piano - that is very pleasing indeed if, like me, you are a big fan of the piano. Part of this sounds a little Rachmaninov-like when Emerson speeds up (not that I'm comparing Emerson to the great Rachmaninov). 'Atropos' is a piano trio in which Palmer backs Emerson with some good and varied percussion. Again there is a slight jazzy feel to this. Actually, it also makes me think of some of the music in West Side Story, so perhaps it has a hint of the Latin to it.And then comes my favourite track of the album, 'Tank'. The clavichord-sounding synthesizer (or maybe it's a real clavichord or harpsichord?) sounds excellent, and the track fairly scuttles along until Palmer gives a two-minute solo that again shows this drummer's skill. And when the solo ends with the synthesized swishing from speaker to speaker and the marching, fat synthesizer with pounding drumbeat and high-pitched synthesizer dancing over the top almost like a flute, it's the absolute business. You could easily picture a formidable army marching relentlessly forward to this.The last track, 'Lucky Man', is a ballad by Lake with acoustic guitar leading and ironic lyrics. Although the song has a simple structure and the lyrics might be considered slightly pretentious, the tune and chorus are pleasing, and this is something to which I find myself humming or whistling along. Emerson's Moog synthesizer 'pyrotechnics' come in towards the end and the piece ends with just that and Palmer's drums.Well, what more can be said? The album is not a masterpiece although it is certainly a showcase for the playing skills of Emerson and Palmer, although less of a chance for Lake to shine than on their later albums. Emerson always borrowed heavily, and here a third of the tracks are the band's interpretations of pieces by classical composers. If you listen to the original pieces you'll see that the interpretations are actually quite close to the originals (and you'll also hear how good the originals are!), but at least the band has given them a good twist. To me, though, 'Tank' is the best track on this album (and much better than the version on \"Works, Volume 1\", but that's another story). Nevertheless, all of the tracks are good, and all three musicians produced an album that I still listen to some thirty years later, which says something."
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Friday, February 18, 2005",
      "rating": 4,
      "text": "What an excellent debut for this pioneer of prog rock supergroups! The talents of Emerson, Lake & Palmer are fluidly combined with their enthusiasm for this new project they were undertaking. Emerson basically continued to explore into his diverse musical interests (jazz, classical, rock, psychedelia) while assuming a prominent leading role; Lake felt much comfortable with the new band's melodic drive, while keeping a hard edge in a large amount of his bass parts; and Palmer, who was already a young veteran in the rock-blues scene, had and took the chance to expand his artistic vision and develop it with a clear disposition for pomposity. ELP's eponymous debut album was also one of the first ones to feature the Moog stuff in a rock context, a synthesizer that Emerson has already begun to experiment with during his last days with his Nice partners. Every single piece contained in this repertoire is great; as a whole, the selection showcases varied ambiences that result from the threesome's different individual interests converging into a unique, solid offering. The only minus point is a certain lack of cohesiveness in the repertoire, as a whole: there is no chaos here, and the listener can tell that the band members have a clear direction set in their minds, but I feel that the inner consistency is not totally achieved. This factor will soon be resolved properly in some of their following albums, which are absolute prog classics, indeed. Anyway, let's take a quick look at the repertoire itself. 'The Barbarian' starts with a wicked bass guitar riff by Lake, as a herald that briefly announces the storm of Hammond chord progressions delivered by Emerson: during the Dixieland-oriented interlude and the reprise of the initial motif, the trio sounds very tight and confident. 'Take a Pebble' shows a gentler side of ELP's music. Having been conceived as an acoustic ballad by Lake, Emerson takes it to a more sophisticated level, flirting with free jazz and Gershwin, while Palmer sustains his partners' performances with both sensibility and delicate precision. This song lasts 12 minutes, and it's definitely quite pretentious, but it's not overwhelming in its pretentiousness, mainly because the sense of reflectiveness that remains consistent from beginning to end helps the trio build a complicity with the listener: Emerson's piano passages that meander like a flowing stream, and Lake's country-inspired acoustic guitar solo are relevant for this matter. Then comes 'Knife Edge', a track that is quite paradigmatic of the ELP most habitual power-trio sound: aggressiveness and exquisiteness, both fused into one sonic source. 'The Three Fates' is a showcase for Emerson's virtuosity and passion: it displays its successive motifs on pipe organ, grand piano, and a Latin jazz oriented piano trio that closes down the track with a rough explosion. The exhibition of power and pomposity doesn't end, since 'Tank' serves as a vehicle for Palmer's exhibitionism: the jazz section and the bluesy section are intertwined by an effective solo (which includes some of Palmer's signature double gong banging). Thought less articulated than the previous tour-de-force, this one is much catchier, indeed. And then, as a closure, the unexpected hit single - 'Lucky Man'. Penned a few years ago by a teenager Lake who by then only dreamt about becoming a rock star, this is basically an acoustic ballad with a simple structure, with a conventional country-based electric guitar solo in the middle. But it is Palmer's precise drumming, Lake's occasional multi-layered vocal harmonies, and last but not least, Emerson's outstanding Moog solo in the final section, that take this track to a higher level. The sober beauty of the original idea is enhanced in a most superb manner: a great closure, indeed. As I stated before, the fact that the repertoire in itself is not entirely cohesive, keeps this record from deserving the perfect rating, but it comes close: and more importantly, it is a prelude of better things to come in the following three years."
    },
    {
      "reviewer": "frenchie",
      "date": "Posted Tuesday, March 29, 2005",
      "rating": 4,
      "text": "This one is for Karnevil 9, i hope he reads it. After some ELP bashing and being told not to listen to them by my friends i thought i would see what all the fuss was about. I only know about this bands sound and career from things i have read on this site, so i wasn't completely sure what to expect.I certainly didn't expect that lush distorted droning sound to kick off the album, that is really nice. There is some strong drum work here but i think it is ruined by some very over dramatic piano work, but i managed to sit through it, once the piano bit is over there is a lush roar that sounds likea dragon waking up and then some more distortion which sounds kinda heavy and evil! Definetly a good start, i am actually impressed by \"The Barbarian\". The bass and drum work is very well done!The vocals on \"Take a Pebble\" are pretty nice, somehow it sounds like a very unique sound that ELP have created very nicely here, and Greg Lake uses a different vocal style to King Crimson which is good because it is the start of a brand new sound and prog direction for each member, quite a big leap for a debut album, they have definetly kissed their previous bands goodbye! The piano work is a lot softer here, with some nice acoustics, which i prefer. I can't remember the last time i heard clapping and whistling in prog, how random, but it's here! The soft sound seems to lack direction, going through different acoustic and piano areas before it settles into a beautiful piano section. The thundering bass kicks in and all sounds good. This track can stretch on quite a bit, but i say, so far so good! There is a nice piano climax just before the 11 minute mark that leads back into some vocals, bringing this track to a brilliant close. The vocals are powerful and full of passion and emotion.\"Knife Edge\" has some really strong bass and keyboard work, perhaps a sound that i prefer. It can get quite frantic and then flow into more steady parts. The vocals work really well once again. The musicianship here is definetly strong and powerful, sometimes it can be scarily overdone, i prefer them in their less pretentious areas.The first three songs are excellent, but \"Three Fates\", the track that a very popular forum member is named after, let me down. This track is nothing but Keith Emerson making love to his keyboards for nearly 8 minutes. Sure he has talent but he is just showing off here, and it becomes boring. I managed to sit through this though, it gets interesting when the organ comes in but then it leads back into the same old drizzle. There is a really annoying sound, like someone is winding up a clock which quickly gets repetitive and irritating. I would suggest listening to this one or two times, if it still doesn't do anything for you then the skip button is all you need!\"Tank\" doesn't do it for me either, another let down, this is just some mindless drum work, followed by some uninterting tag ons from the rest of the band. ELP really overdo it here. \"Lucky Man\" definetly redeems this album with some nice vocals and acoustic work, yet it has a stupid ending which sounds like you are being chased by an ambulance or something!ELP are definetly talented as well as unique and original. Sometimes they can really overdo it and dont know when to calm down but at the end of the day this is definetly some strong, good and interesting work. Still, i can see why a lot of people make fun out of them! Overall, their are 4 really good pieces on this album, yet it is let down big time by \"Three Fates\" and \"Tank\". I think this album just scrapes 4 stars."
    },
    {
      "reviewer": "Snow Dog",
      "date": "Posted Tuesday, May 3, 2005",
      "rating": 4,
      "text": "This is a great debut album by any standard, but these guys were already experienced so its not such a surprise really! The difference that Lake and Palmer make to Emerson makes the sound streets ahead of anything that the Nice did. The opener, Barbarian, starts procedings and is a quasi classical piece with a jazzy interlude. Take a pebble is a beautiful song with an extended piano section. Knife Edge is a good enough tune, but I've tired of it a little now. Side 2 opens with The Three Fates which is basically another Emerson workout, followed by Tank when its Palmers turn. I love Tank, always did, and I love the drum solo, from then on the drums were the instrument for me. Tank fails for me when the music returns after the solo, its a bit weak and weedy! Luck Man brings up the rear and its as fine a Lake song there is, complete with debut Moog solo at the end, which I guess is a spine tingle moment for most ELP fans."
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Thursday, May 12, 2005",
      "rating": 4,
      "text": "Emerson, Lake & Palmer began their album career with this album. It begins and ends great. You get all the classic ELP elements tossed together and made into a mix that cannot be replicated. The album opens with The Barbarian, and it has easily one of the greatest intoductions I have ever heard, the distorted bass gives a great intro into truly one of the best Instrumentals in Progressive Rock. What you also get with this album is Keith Emerson playing his over zealous, incredibly intricate organ lines, making the feeling that he plays with Boxing Gloves. The next track, Take a Pebble, has all the elements of progressive gold, intricate bass, clever and catchy piano, intuitive and subtle drumming, and a great acoustic break. Knife Edge also carries on the same greatness that Take a Pebble has, great overall playing. The Three Fates is a Keith Emerson Keyboard solo that takes form in three types, Organ, Grand Piano, and what he calls a \"Piano Trio\". Tank is a Carl Palmer drum solo that is in the same vein as \"Moby Dick\" by Led Zeppelin and \"Toad\" by Cream. It begins with the entire group playing intricate lines, then the drums take the forefront and Carl Palmer shows everybody why he is considered one of the best drummers around. The album closer is often considered one of the best ELP songs around. Lucky Man has very tasteful guitar, and some very well written lyrics. The only gripe I have with it is Keith Emerson's solos, they just don't fit with the acoustics. And Carl Palmer's drumming is a little sloppy when he comes out of the drum fills. Overall, this album is a great debut. I recommend it highly."
    },
    {
      "reviewer": "Man With Hat",
      "date": "Posted Thursday, June 2, 2005",
      "rating": 4,
      "text": "What a debut! This is a really strong showing. The talent of all the members really is shown here. Palmer's drumming (esp. on Tank) is maddening. Emerson's playing is, as always, spectacular. Also, Lake has one of the best voices in all of music. The songs are all coherent and go well together. Personnal favorites include The Barbarian, Knife's Edge, and the aforementioned Tank. Knife's Edge is particularly great. Such passion is used in Greg's singing, and the bands performance. Truely a great piece of music. There are, however, a few moments that keep this album from being five stars. For example, The Three Fates. Parts of this song are dull and unexciting. Also, the second \"part\" of Take A Pebble. I find this to be uninspiered, and it drags the song down. Despite these moments, this is really a solid album. Less pretenous than the rest of catelogue and not to be overlooked."
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Thursday, June 9, 2005",
      "rating": 5,
      "text": "In the mid-Seventies it took a while before I started to appreciate the sumptuous progrock from ELP. It's also totally different from the music from Genesis that I appreciated in the Seventies. But gradually I got into the virtuosic progrock and Keith Emerson, the 'Jimi Hendrix of the progressive rock', became one of my progrock heroes. His keyboardplay is so impressive, on this album I like the church-organ sound, the sparkling piano-runs, the fat Moog sound, what a stunning sound and what a sensation it must have been to hear this music in those days! The interplay between the three musicians is breathtaking (\"Take a pebble\" and \"Knife edge\" are timeless masterpieces) although Carl Palmer is not my favorite drummer, a matter of taste. Very special was the mellow song \"Lucky man\" because of the melancholic climate, the warm vocals from Greg Lake and the spectacular finale, based upon a perfectly build-up Moog synthesizer solo, even inventor Bob Moog was highly impressed! ESSENTIAL!!"
    },
    {
      "reviewer": "Eetu Pellonpaa",
      "date": "Posted Tuesday, June 14, 2005",
      "rating": 5,
      "text": "This is a true masterpiece debut album! I like the more aggressive and artistic symphonic material which this band managed to create, but sadly many of their albums don't reach their full potential they could have managed to do. Luckily their fist album does it. The opener \"The Barbarian\" has quite cool fuzz bass on it, and it's a transition of BELA BART�K's piece. The following \"Take A Pebble\" is one of the most perfect progressive ballads. It's long, full of acoustic musical solo scores, which drift pleasantly from an idea to another like a summer day's dream. \"Knife-Edge\" brings back the violent moods with raw sounds, good riffs and fine rhythms. Two next numbers are solo scores, \"The Three Fates\" is for Keith and \"Tank\" for Carl. The drum solo is a difficult task, and this isn't very exiting, but OK performance still. \"Lucky Man\" is then Greg's composition, an acoustic ballad with weird synthesizers. As a total, these tracks create a real classic album!"
    },
    {
      "reviewer": "Seyo",
      "date": "Posted Saturday, June 18, 2005",
      "rating": 4,
      "text": "It is hard to say something new after so many reviews. This is good debut of the power prog trio, with highlights including \"Take a Pebble\", \"Lucky Man\" and \"Barbarian\". It still sounds fresh when listening today because the excesses of Keith Emerson are minimal here and Greg Lake is in full condition after leaving KING CRIMSON. Recommended even to those who don't like ELP."
    },
    {
      "reviewer": "NJprogfan",
      "date": "Posted Friday, June 24, 2005",
      "rating": 4,
      "text": "Incredible album which I would have tagged as a five-star masterpiece if it wasn't for one track. The album starts off with \"The Barbarian\", a dark and brooding piece of instrumental rock that kicks off the disc with gusto. Track two, \"Take A Pebble\" to me is their \"Moonchild\". A song that starts off very nicely with Greg Lake's beautiful voice and acoustic guitar but drifts into nothingness before returning to the beginning. Being the longest track on the album, it's just streched out for no reason, (did we really need to hear hand clapping?). Ahh, but the next track, \"Knife-Edge\" is classic ELP. Heavy organ and bass and singing from Greg from the netherworld. It rocks! A perfect prog song to blast from your car speakers with the windows down. How about that synthesizer bridge two minutes in. Awesome! A bonafide classic 5 minute prog song. \"The Three Fates\" is a showcase for Keith starting with the organ in part one, then the piano (I enjoy his piano work more than his organ), then the band joins in for part three. \"Tank\" is an excellent instrumental which showcases Palmer's drum playing. Very nice. Finally, the hit \"Lucky Man\" which includes, if you ask me, the most famous Moog solo/fade out in rock history. I'm not the biggest ELP fan, but you must admit after listening to this album that it's a fantastic first album with their best still to come. 3.75/4 stars"
    },
    {
      "reviewer": "NetsNJFan",
      "date": "Posted Thursday, July 14, 2005",
      "rating": 4,
      "text": "Emerson, Lake & Palmer were progressive rock's first 'super group', and their first album historically is a must have for prog rock fans. Musically, its merit is a bit more dubious. This album is enjoyable, but really just sets the table for ELP's much better works over the next three years. EMERSON LAKE & PALMER is mostly instrumental, and showcases Keith Emerson's brilliant keyboards playing. This is very much a heavy Organ and Drums affair, even flirting with hard rock, but Greg Lake manages to add enough soft touches to save this from being solely a Hammond Organ album. The album was an instant success, hitting number #4 in the UK and #18 in America (quite a feat, riding on the successful single Lucky Man).The album opens with an ominous tone, with \"The Barbarian\". This song features mainly the distorted (fuzzbox) organ of Emerson with some good drumming and excellent Bass lines from Lake. This piece is an (initially uncredited) adaptation of a composition by Romanian composer Bartok, and is an ambitious opening for the group. It is a very good dark instrumental in which each member shines and they really lay out their vision for the band. The next track is somewhat weaker. \"Take a Pebble\" starts off with rippling piano chords by Emerson and delicate percussion setting a soft but surreal mood. Greg Lake's voice enters the track, with typical pretentious ELP lyrical nonsense. It sounds good though. After the vocals we get some more piano, which is very good, but after this the piece deteriorates rapidly. This is ELP's first real 'Suite', and they have not yet mastered transitions between sections, so this piece comes of as rather disjointed, awkward and clumsy. It alternates between jazz piano from Emerson, too bizarre acoustic guitar and hand clapping. This goes on for a bit, and the music just kind of wonders with no real direction (reminiscent of KC another reviewer pointed out). It eventually closes out with the initial vocal melody full of typical ELP bombast. This is a very weak track in need of serious editing, and was utilized much better in the form of a medley with other more acoustic ballads. Luckily the next track an ELP classic, \"Knife Edge\", which adapts Janacek's Sinfonietta for Orchestra, Opus 60. This piece is similar to \"The Barbarian\", but is much more successful, featuring great vocals and decent lyrics from Lake. The piece even has a Fugue for piano in the middle, a real highlight. The repetition of the organ melody is excellent, coming directly after Lake's vocals. The next track is the worst, in my opinion, on the album. \"three Fates\" is really nothing more than a pure showcase for Emerson on piano and church organ. This piece technically is excellent but is completely devoid of emotion, and comes off as a rather good demonstration of talent, but not compositional skill. It plods along, but never picks up steam. The album closes strongly with two excellent tracks. \"Tank\" serves as Carl Palmer's showcases, and features on of the few drum solos on a studio album that works, and does not come off as overly indulgent. This is also the first real appearance of Keith Emerson's famed Moog work, which would have a much more prominent role in later albums. It sounds a bit dated now, but must have been spectacular in 1970. The album ends with the Lake ballad, \"Lucky Man\", a song Greg Lake wrote when he was 12. The song was included as filler, and surprisingly became ELP's first hit. It received decent airplay in the US. It is similar to much of Lake's other acoustic work, and features an excellent Moog solo by Emerson, taken in one take. The lyrics are some of the best Lake has written, telling the story of a warrior who lives an excellent life, and then dies. The story comes off as rather silly here, but is excecuted quite well, and makes a fitting end to the album.While ELP's 1970 debut is weaker than some of their other material, it is an incredibly brave, progressive and successful debut album, showcasing the collective talents of each member, who really were the cream of the crop. This album is highly recommended for historical significance to prog. It is also recommended to those who want the grit and talent of ELP without dealing with an abundance of synthesizers and pretension. 4 STARS."
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Friday, August 5, 2005",
      "rating": 4,
      "text": "4.5 StarsThe first and their best album. Here it sounds fresh and very progressive while the following albums, it sounds like more of the same (except the groundbreaking Tarkus). Keith Emerson is easily one of the best keyboardists ever to exist, Greg Lake is a great singer/bass player and can play some mean guitar, and Carl Drummer is one of the best Drummers to exist. The problem with the band is that they are not good songwriters at all.BARBARIAN (9/10) kicks off the album with a very good start .. it is a very hard rocker dominated by brilliant hammond organ playing all over the song, it is followed by TAKE A PEBBLE (8.5/10) which starts with one of the most gorgeous vocal performances ever, and is followed by a good ELP jam. KNIFE EDGE (8.5/10) is an ELP classic, and it contains a songwriting style that reminds me of Black Dog (Zeppelin) .. all musicians shine here. The next song is \"THREE FATES\" (8/10) which is a good showcase of Emerson's talents, then CArl Palmer shows his talents in TANK (8.5/10) which is an ELP jam with old synths and a drum solo. The album ends with easily the best song of the album LUCKY MAN (9/10) which is a perfect pop song with one of the most exciting moog solos to ever appear on a record. It is also the first moog solo to ever appear on a record, making this song legendary.I highly recommend this album for anyone, yet it is no masterpiece.My Grade : A/B"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Saturday, August 27, 2005",
      "rating": 4,
      "text": "A debut album from one of legendary progressive rock heroes. Greg Lake who was previously a bass player and singer for another legendary bandKing Crimsonfinally accepted Keith Emerson (exThe Nice) to form a new band. These two gentlemen met in San Francisco backstage at a show featuring both The Nice and King Crimson. During that meeting they did a lot of talking and followed-up their ideas when they came back to England. [1]. The early formation of ELP happened at the same time when King Crimson's recording of second album \"In The Wake of Poseidon\" at the Wessex Studios.When ELP finally got into gear, Lake did not return to Wessex Studios which left one track - the ballad \"Cadence and Cascade\" - without a vocal. For this Fripp contacted Gordon Haskell, hisl old schoolfriend who had no particular liking of Crimson's music but for a session fee of �50 was happy to come to Wessex and sing.[2]. Indeed, King Crimson's leader and guitarist Robert Fripp never considered Greg Lake as bass player. He's wrong as we know that Lake plays excellent bass guitar with ELP.Carl Palmer became a member ofThe Crazy World of Arthur Brownat the peak of their popularity. Returning from an 18-month American tour, Carl and Crazy World organist Vincent Crane split to formAtomic Rooster. Musically akin to The Nice, Atomic Rooster was Palmer's first real success as a band founder, and it took some persuading from Greg to convince 20-year-old Carl to leave the band and cement the ELP lineup in 1970. And . JRENG! Finally, what would later be a famous band was formed! And their debut album Emerson Lake and Palmer took the music industry by the storm.This album features six tracks including a song adapted from Bela Bartok's \"Allegro Barbaro\" (The Barbarian) and another song adapted from Janacek's \"Sinfonletta\" (Knife- Edge). The album starts off with a distorted music which brings Keith Emerson's dazzling organ / synthesizer combined with dynamic drum by Carl and bass by Greg. It continues to Greg's nice ballad \"Take A Pebble\" which features great piano work by Keith and melodic vocal line by Greg - reminiscent his style with King Crimson's \"Epitaph\". What comes after is a kind like improvisation music blending Keith rapid-fire piano work, Greg inventive bass playing and Carl drumming (mostly with high hats and toms). The long interlude part explores the piano solo nicely. \"Knife-Edge\" - which later became an ELP staple - continues with accentuated voice line, dynamic bass line combined with organ and drum.\"The Three Fates\" that contains three parts starts with a long sustain and multi layer organ solo with some classical music influence (Royal Festival Hall Organ). It continues with piano solo, broken down into two parts. This track is explorative in nature, written by Keith Emerson. \"Tank\" is another legendary track ELP has ever produced; containing Carl Palmer's excellent drum solo. The album concludes with a simple ballad written by Greg Lake \"Lucky Man\".It's a promising debut album that proved to be the hallmark of ELP's subsequent follow- ups\" \"Tarkus\", \"Pictures At An Exhibition\", \"Trilogy\", \"Brain Salad Surgery\". It's a must for any prog music lover.Keep on proggin' ..!Peace on earth and mercy mild - GWReferences: [1]. \"The Return of The Manticore\" ELP box set sleeve [2]. \"In The Court of King Crimson\", Sid Smith, Helter Skelter Publishing, 2003."
    },
    {
      "reviewer": "Progbear",
      "date": "Posted Sunday, September 4, 2005",
      "rating": 5,
      "text": "A monstrous achievement, so far above anything Emerson did with the Nice it can't come as anything but a revelation. The dated psychedelic predilections and silly joke songs of the Nice were long gone. Moog synthesizer was in and, for 1970, this must have sounded very fresh and modern. This was not the first rock album to use a Moog, but it was probably the first one to really integrate it as a rock & roll instrument, as opposed to a mere sound effect or gimmick. The fire it brings to \"Knife-Edge\" and \"Tank\" is undeniable, and the textures on \"Lucky Man\" are, of course, the stuff of legend.But the Moog is not over-used. Emerson is still all about the Hammond, and applies what he learned in the Nice to stunning effect on \"The Barbarian\" and the aforementioned \"Knife-Edge\". He gets the opportunity to lavish some absolutely heavenly piano work on Lake's feature-length ballad \"Take A Pebble\".Most of the album sounds as though it could have been recorded live; the exception being \"The Three Fates\", which opens with a pipe organ solo and closes with Emerson playing three pianos at once, thanks to the magic of multi-track recording. There's even some Hohner Clavinet on \"Tank\". In all, this is practically an aural reference book for prog-rock keyboard players.Easily the peak of Emerson's career as a keyboardist and ELP's as a group simultaneously. For once in their life, the mating of rock and the classics seemed like a vital thing, rather than the campy kitsch it became on ensuing attempts. I think song selection (pieces by Bart�k and Janacek) has a lot to do with that. Choosing pieces that work well as rock songs as opposed to, \"Recognize this piece? Ha ha, aren't we clever!\"The most underrated ELP album for me, and also the best. Plays to all of the band's strengths and none of its weaknesses (I'll be kind this time and turn a blind eye to the drum solo in \"Tank\"). They'd never be so consistently inspired again."
    },
    {
      "reviewer": "Raff",
      "date": "Posted Friday, October 28, 2005",
      "rating": 5,
      "text": "I love ELP, nevertheless I think this is their only really perfect album. As much as I love the others (at least those up to \"Welcome Back My Friends...\"), to be honest I have to admit there's always something missing, unlike, for instance, in albums such as \"Wish You Were Here\" or \"In the Court of the Crimson King\". However, this is not the case of ELP's eponymous debut: a bold, bombastic, in-your-face statement of intent, a prog masterpiece the band have been able to better in all their chequered career.When the record originally came out, its two sides were divided between 'group' efforts on the first and tracks showcasing the individual prowess of the three band members on the second. ELP took up the same idea in their 1977 \"Works vol.1\" double album, only much less successfully. Everything begins in style with one of my all-time favourite instrumental tracks, the magnificent \"The Barbarian\", a reworking of Bela Bartok's \"Allegro Barbaro\", an extremely heavy triumphal march driven by Palmer's drumming and Emerson's Hammond, complete with booming gong to signal the end of the quieter section and the reprise of the main theme. After that, things couldn't get more different with Lake's haunting, wistful ballad \"Take a Pebble\", undoubtedly one of his best vocal performances, with lovely piano and acoustic guitar in the middle section. \"Knife Edge\" is a rockier song that draws again upon a piece of classical music (this time it's Janacek's \"Sinfonietta\"), featuring beautiful Hammond work by Emerson and menacing, almost snarling vocals by Lake.The second side sees Emerson's three-part tour de force, \"The Three Fates\", where he plays a real organ in the majestic \"Clotho\", before laying into his piano for \"Lachesis\" and \"Atropos\". Palmer's showcase, the intricate and heavily percussive \"Tank\", follows, and Lake's Top Ten ballad \"Lucky Man\" (which, as everybody now knows, he wrote at 12) brings the album to a close. Though I've never been particularly fond of this song, I cannot deny its attractiveness, enhanced by Emerson's Moog solo a the end. However, as Lake's ballads go, I very much prefer \"From the Beginning\" and especially the much- maligned \"Still...You Turn Me On\". I agree that ELP may not be to everyone's taste, but I also think no self-respecting progger's record collection could be considered complete without at least this one album. As to myself, this is definitely one of my Top Ten favourites in any kind of genre."
    },
    {
      "reviewer": "Guillermo",
      "date": "Posted Thursday, June 8, 2006",
      "rating": 4,
      "text": "I first listened to this album in 1981. An older cousin lent me this album then, and also other albums like ELP`s \"Brain Salad Surgery\" and others.Maybe the band was still trying to create their own identity in sound in this album, but there are very good songs like \"The Barbarian\", \"Take a Peeble\" (with a very good piano), \"Knife Edge\" (with a great \"Baroque music\" organ arrangement), \"Three Fates\" (with the use of a church organ) and \"Lucky Man\" (maybe the most known song of this album). The music in this album is maybe less interesting than \"Tarkus\", \"Trilogy\" and \"Brain Salad Surgery\", but it was a very good start for this band, IMO."
    },
    {
      "reviewer": "Australian",
      "date": "Posted Wednesday, September 20, 2006",
      "rating": 4,
      "text": "The band Emerson, Lake and Palmer are arguably the first ever prog super group, comprising of members from already established British progressive groups. Keith Emerson was from The Nice, Greg Lake of King Crimson and Carl Palmer of Atomic Rooster, these three musicians joined together to create Emerson, Lake and Palmer, or simply ELP. The guys decided to name the band after each member's last names as they were all well-known musicians and this would grant the band immediate recognition. Luckily, something good came out of this supergroup in their debut album\" Emerson, Lake and Palme\"r which was the first in a string of successful albums. \" Lucky Man\" in particular was very successful and ELP gained a foothold so to speak on the musical public.The album opener \"The Barbarian\" is quite a heavy song as far as this band goes, entirely instrumental and almost completely dominated by Keith Emerson's moogs and other Synthesizers. Parts of said song are very swift and display great virtuosity from all members, but especially from Carl Palmer whose percussion is a driving force in this number. Following \"The Barbarian\" is \"Take A Pebble\" which originated as a poem and then as a blues tune written initially by Greg Lake. The song was taken and literally stretched out to around 12 minutes, in which Emerson and Greg Lake play solo on the piano and guitar respectively. When the \"pebbles drop\" a fast pace instrumental section beings which then leads into an ending much like the beginning of the piece.The calm brought on by \"Take a Pebble\" is completely thrown out the window with the next track, \"Knife-Edge. \"\"Knife Edge\" is quite a loud song with heavy keyboard, percussion and bass guitar lines. The lyricism of \"Knife-Edge\" is very catchy and the bass guitar echoing in the back round complements the vocals very well. The addition of instrumental interludes between vocal sections gives the song a, kind of repetitious feel. The band was taken to court over a keyboard section \"borrowed\" from a 20th centaury composer's song. Luckily the dispute was solved out of court and royalties were payed to the composer's family. Next is \"The Three Fates\", a song completely dominated by Keith Emerson.until the last two or so minutes when the whole band comes out with all guns firing.Next is another instrumental called \"Tan\"k which begins immediately with swift percussion from Palmer and thrumming bass guitar, which is soon joined by Emerson playing the main tune over the top. Carl Palmer's percussion solo in the middle of the song leads to another violent fusion of synthesizers, bass and percussion which in tern ends the song. Finally we come to \"Lucky Man\", which is probably ELP's most famous song. It's basically about a rich, lucky man who goes to war and dies. Acoustic guitar makes up the general feel of the song, with an electric guitar solo in the middle. The good-stuff comes towards the end of the song when Emerson plays probably the most memorable moog-solo in all prog. Great stuff.1.The Barbarian (4/5) 2.Take a Pebble (4/5) 3.Knife-Edge (4/5) 4.The Three Fates (3.5/5) 5.Tank (3/5) 6.Lucky Man (5/5) Total = 23.5 divided by 6 = 3.916 = 4 stars Excellent addition to any prog music collectionELP may not everyone's cup of tea, and many people dislike ELP with a bloody passion, but this album is one which everyone can enjoy along with 'Brain Salad Surgery.' This is real classic progressive rock, it doesn't come more genuine than this my friends. I'd recommend this album to everyone who enjoys classic 70's symphonic prog and fans of Yes, Genesis and to a lesser extent King Crimson should enjoy this album among the band's others."
    },
    {
      "reviewer": "Atkingani",
      "date": "Posted Saturday, September 30, 2006",
      "rating": 4,
      "text": "Even arriving a little later than King Crimson, Genesis, Yes, Jethro Tull and others to the progressive scene, EL&P is doubtlessly one of the\"Giants\". Well, their members were all in a way or another involved with prog-rock and the likes for some time then when the trio appeared. They are also called the first prog super-group exactly due to the previous musical contacts and experiences of Keith EMERSON, Greg LAKE and Carl PALMER. Uh, too many epithets for a bunch of three men and what about the music?EL&P were a very popular band in early 70s (not only for prog, but for the entire rock genre) who saw their prestige diminish since then except for some resurgent appearances, material re-issues and compilation releases. Unlike other 1st class bands which settled their record material on their own compositions, EL&P rotated around old erudite authors giving their opus new clothes and approaches. Yes, they produced their own stuff too, but the entire atmosphere sounded clearly imbedded in theclassics. In a span of few years, the scheme aged just when prog-rock was suffering its adulthood pains and the general audience was aiming to less contemplative and qualified genres, led by label managers and media promoters, not counting the excesses and pretentiousness of prog spearheads (EL&P amidst them) that initially amused/amazed the public only to leave a boring feeling as long as time goes by.Band self-titled first studio album is a fair effort, although unbalanced, with orchestral-like extravaganzas dwelling together with simple chord arrangements and with classical based songs joined by virtuoso keyboard exhibitions opposing soft and cool ballads. General production is half-way mainly if compared with band's output in years to come. The ever-present sensation is that for their first party together, members brought their own home-made liquors.\"The barbarian\", the opening track, is a powerful beginning, reminding King Crimson's openings in their two first albums, being the great difference the absence of a singing segment, which could be even more noticed since the singer is the same either for Crimson and EL&P, the notorious Greg Lake. The song is credited for the triad but in fact is based on a Bartok piece namedAllegro Barbaroand it sounds like an introducing card of band's philosophy.\"Take a pebble\" has all the progressive spices we all pleasantly admire and consequently grabs the honor of being the best album's track. Lake's voice is superb, Emerson's piano solo and accompaniment is glorious and Palmer does rightly his work here. After the smooth balladesque intro we hear a very bucolic and sometimes psychedelic guitar passage mixed with folk backings that gives room to the mentioned piano part broken only by drums and bass tunes, the effect is magnificent, a great prime mover of the prog-rock style. Song closure returns to the ballad part with a slightly different touch which is very convenient.\"Knife edge\", a song based on a Janacek composition, starts nervous and almost frenzy bearing the typical troika keyboards-drums-bass playing that should be a kind of band's signature. The following track, \"The three fates\" has a disturbing organ sounding a bit non-sense. Piano part is much more appreciable even resembling the previous track. The song leaps in quality when the band acts like a real combo. \"Tank\" has a rehearsal atmosphere which may have sounded fair when played live, however the final result is poor bordering asleep state.Final track, \"Lucky man\" is probably the most commercial feature in band's career. While the song is hearable and agreeable, it breaches totally album's nature and its inclusion was initially rejected - what an irony! The now famous and recognized moog ending was improvised and player Keith Emerson wasn't satisfied, although he probably changed his mind when the coins erupted in his wallet.As a first effort by EL&P, we should say that the this album is above average with prospects for higher flights (and that was the perspective back in 1970). Splendid \"Take a pebble\" track responds for the rating increases fromgoodtoessential. Total: 4."
    },
    {
      "reviewer": "Chus",
      "date": "Posted Saturday, November 18, 2006",
      "rating": 4,
      "text": "3.5 stars.This is, by far, their most even album far as I've heard.People seem to be afraid to spin this baby, at the threat of getting killed by Emerson's dissonant marathon... But there's not really that much to fear about; yes, there's still dissonance, but it's digestable. A fault that many people find in this band is the lack of guitar. Lake fortunately fixes the problem, even if he doesn't do any \"Steve Howe\" or \"Steve Hillage\" (whichever suits better), he gets the job done effectively in both electric and acoustic. The guitar is still not omnipresent though.\"The Barbarian\" starts the album with a faithful reworking of Bartok's \"Allegro Barbaro\", even if it differs in format, substantially is the same feel.\"Take A Pebble\" is a Lake's composition, and it has Emerson trying to jazz things up, as the verse-chorus-solo fades, we're brought to a southern folksy passage with claps, and then Emerson sets the mark again for a jazz improvisation. After all that, we get back to the main theme. Although it might seem a bit stretched at first, it grows on you. I liked it on first listen.I really didn't care for \"Knife Edge\"; I find it cheesy in arrangements, and even if I haven't heard Janacek's piece, I don't think he'll be too happy to hear this. The song's melody is strong nonetheless.\"The Three Fates\" is for me the best opus on this album. It's mostly a showcase for Emerson alone, although the rest of the band enters at some point. The suite sets off with haunting organ chords that fits more in \"Atropos\" than in \"Clotho\" (past and present, respectively), but it doesn't matter. Lachesis is a grand piano segment very much in the vein of a true classical pianist, and yet it really evokes at some point a \"warp to the future\" (ironically enough). \"Atropos\" welcomes the entire trio to the piece and Palmer's beat is amazing here.\"Tank\" might be seen as a continuation of \"The Three Fates\" in which Lake employs vibrato in the bass notes at the beginning.\"Lucky Man\" is the pop song of the album. Terribly spoiled by the Moog solo in the middle, which by now sounds awfully dated.All in all, I still think that this album is an excellent addition to every progressive far, even if brought down by 0.5 stars."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Monday, December 25, 2006",
      "rating": 3,
      "text": "Maybe the most \"normal\" of the ELP \"elite\" records.Take that comment as you wish. Some will praise this record for maybe being the most sane, others will complain because it wasn't pompous enough. For me this has a very significant connection to King Crimson's first work primarily because of Lake's presence during the time period (released in back to back years).This album was surprisingly heavy, to me anyways. It's also got plenty of moments of virtuosity, which although might not be thought as such by some of today's elite, but certainly was for its time. The biggest problem I have with the record is a lack of balance and lack of identity. I hear ELP catering to many different audiences, as if to attract more listeners, but no definitive sound throughout. While such decisions may have helped them reach a broader audience, I am of the opinion that they are wasted and dull tracks which only serve to hurt the impact the record might otherwise have.For example, the rhyming lyrics in The Knife is pain to listen to, it's just awful poetry; maybe Ian Anderson could have helped them with some snazzy lines. I would say Three Fates is the best listen here, along with Barbarian. ELP certainly was one of the most experimental of early prog bands, and an extremely innovative band. This is a nice little start, and would be the best place to begin for those more accustomed to the other \"big\" symphonic prog acts."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Saturday, February 24, 2007",
      "rating": 5,
      "text": "I was in my very early 20s when this album came out in 1970. But I was in no way, shape or form able at that time to fully appreciate the brilliance of the revolutionary music of Emerson, Lake and Palmer. (I dare say I wasn't alone among my peers in my immaturity, though.) I'm not telling you that I didn't become an instant fan or that I didn't enjoy it. On the contrary. It's just that I probably lifted the needle over the very best parts a hundred times in order to get to the \"heavier\" stuff that the headbanger in me craved. It's only in the many decades since then that I have come to understand just how amazing and timeless this album is. First things first, however. I have to point out the fact that the painting on the cover by Nic Dartnell is one of the all-time classics. But you already knew that.\"The Barbarian\" is a perfect four and a half minute introduction to ELP. They throw everything at you including a fuzz bass and a very intense, snarling organ from Keith Emerson. His piano interlude midway through is exhilarating and soon you know you are in the presence of a truly gifted keyboard virtuoso. \"Take a Pebble\" is one of those songs I would jump over in my youth but I was only cheating myself by doing that. Greg Lake's distinctive voice starts things off singing a nice melody with simple lyrics about how each individual act can have a rippling effect on one's entire life. Emerson's piano takes over and literally takes your breath away. Then comes a folksy acoustic guitar segment from Lake that is gentle and spacious, ending with handclaps and whistles as if they were sitting around a campfire. Next you get another dose of wonderful piano alongside Carl Palmer's jazzy drums before Lake finishes the song with another poignant vocal. \"Knife Edge\" more than satisfies the hard rock monster in us all with its hard, piercing organ and gutsy vocal over some very strong drums. And the cool meltdown ending is just what the doctor ordered. There's no excuse for my years of skipping over the apex of the album, \"The Three Fates.\" What was I thinking? Just testosterone-fueled impatience, I guess. The enormous sound of the Royal Festival Hall Organ is magnificent and the piece, \"Clotho,\" would be right at home in a gladiator movie soundtrack. And I mean that in a good way, too. It is epic in scope. Emerson next treats you to \"Lachesis,\" a truly outstanding solo piano composition and performance that blew away 99.9% of the keyboard players in rock at that time. It is nothing short of awesome. After a brief return to the cathedral organ the drums enter and Palmer and Emerson go into the stirring 7/8 time \"Atropos\" that would impress even the great Gershwin. It's fantastic. \"Tank\" is probably the least remarkable track here but that's only because of the obligatory (at that time) drum solo contained within. Even then the clavinet at the beginning and the Moog noodlings at the end are intriguing. All this being said about the album, if it wasn't for Lake's ironic anti-war anthem \"Lucky Man\" it's debatable as to whether the group would have attained the huge success that was to come. This song got them noticed. It's a very catchy ditty to begin with and Greg's unique voice is a definite plus but it was Emerson's Moog rising like a phoenix toward the latter part of the tune that made everybody reach over and crank up the volume on their radio. It wasn't the first time the public had heard this new instrument but it was the first time it was the STAR OF THE SHOW and even the most conservative listener couldn't get enough of it.The high fidelity of the sound is surprising until you notice that the engineer was none other than Eddie Offord (who would go on to produce most of Yes' finest albums). In particular, the piano sounds so crisp and clear it's like it's in the room with you. So, if you haven't procured a copy of this cornerstone of progressive rock by now, do yourself a favor and add it to your collection. It is unquestionably one of the greatest debut albums ever and the music is still as fresh and relevant today as it was when it first appeared on the record shelves. Just don't be like me and skip over the best parts."
    },
    {
      "reviewer": "Garion81",
      "date": "Posted Saturday, April 21, 2007",
      "rating": 5,
      "text": "For the record I love ELP. I can still remember going to see them play live in 1972 at the Long Beach arena in Southern California knowing nothing of their music except Lucky Man. I came out of there stunned. Being a piano player I was completely blown away that Keith Emerson had replaced the guitar with his keyboards as the main focus of the music. So of course I went out the next day (or maybe it was the next time I had money. Fuzzy memory there. Well it was the 70's) and purchased all three ELP studio releases.I listed to them over and over. I still pull out this occasionally anfd I still listen to the whole albuim when I do. To me that is a mark of a classic. What strikes me first is the willingness of the group having such a great singer is producing so many instrumental songs. The Barbarian, Tank, Three Fates and the middle section of Take a Pebble make up for way more than half the album. Starting with t he Barbarian the band is stating to you this is no acoustic guitar singer album. They smash you in the face with an almost metal like violence. Then they turn 180 degrees to the acoustic Take A pebble with it's brilliant vocal and romantic piano lines, then turn back to the thunder with Knife Edge. The Three Fates show off Keith's side as a classical composer moving through three movements with varying intensity and instrumentation. Tank finds us in awe of Carl Palmer's drumming prowess until they leave us with Lucky Man kind of swaying pub song you might sing while drinking with your friends.Great album on progs earliest examples by three excellent musicians. It was one of my earliest introduction to what would become a long line of great keyboard players. 5 stars."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Friday, April 27, 2007",
      "rating": 4,
      "text": "ELP. Three letters which evokes all the extravaganza and exhuberence you can think of. They have been categorized as pompous, pretentious, bombastic. What is for sure is that those three guys are very gifted. Each of them playing his intrument (s) very well. To decide to not include a guitar player in their line-up in those days was rather bold.The opener \"The Barbarian\" is a true ELP song. Every aspect of their personality is represented here. It is a kaleidoscope of what ELP will produce durin the decades to come. One of my all time fave. Powerful, violent and bombastic. This is how I love ELP. This trio is extremely powerful, delivering incredible sounds thanks to each one's virtuosity.\"Take A Pebble\" is a showcase for Lake and Emerson. I quite like Lake's very smooth tone of voice; quiet, discreet, almost tranquil. His bass play in the first part of the song is really impressive. The song will evolve into a classic piece during which he will play a very subtle acoustic guitar piece. It is a very slow part, almost silent. Emerson will take up around the middle of the song, as if each has to have the lead on his own.This will probably affect the cohesion of the band sometimes (cf. Works). Each member playing his part to shine. I do not know if it was a compromise between them or just a fact that arose between them. The last section of the song, is quite jazzy and sounds more as an improvisation. Some nice drumming work as well during this part. IMO, this number lacks in cohesion : no real leading strand.\"Knife Edge\" is a difficult number, its dark mood reminds me of KC. It is a powerful track, like the opener. We are far from the subtility of \"Take A Pebble\". This track clearly announces \"Tarkus\". It also has all the typical ingredients of a classic ELP track. The trio is sensational : to combine such pieceful (almost religious) music with the heaviest one without transition is a remarkable tour de force. Keith is hitting his keys like a savage. Really good.The pompous side of the band is clearly illustrated in the intro of \"The Three Fates\" : sounds like the entry of the gladiators in the arena. Could have been the sountrack of a peplum of the sixties (Wakeman will also sound like that from time to time). These three movements are purely there to push Keith on the front line. This track is a bit annoying. It is again a real band track during the last third of it. Great percussion work again from Carl.\"Tank\" is, during the intro sounds more like a combination from the band. It confirms their maestria as a band but inevitably since he was somewhat discreet so far, this number will be the opportunity for Carl to be on the foreground. Great drumming (with a short solo) from one of the greatest rock drummer (all times, all genres).ELP were short of one song to make a decent lenghty album. So, they were still missing one number. Lake will come with a very old number he wrote while he was twelve (if I remember correctly). It will lead to this very nice little piece of music. The lightest on this album, and even if Lake is of course the frontman here, the band is wonderful in its complementarity. I like that song very much (even after such a long time).This is a very good debut album for the band. Of course these musicians have already played with big names before so it is not really their debut. What frustrates me on this album, but this is an ELP trademark, is the habit from the E, the L and the P to play each one's part as being more important as the performance of the whole. At least it sounds like this to my ears. Having said this, this album gets all the ELP quintessence. There are no weak numbers, it displays already what the band will produce later on and is, IMO, one of the best they will produce.Four stars."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Wednesday, June 20, 2007",
      "rating": 4,
      "text": "A great album from a band would arguably go on to define the genre, and is probably one of their best. I consider ELP to be the drunken frat-boys of progressive rock, since many of their later albums feature ecclectic (and overrated) songs which are neither very progressive or exciting; however, \"ELP\" is short and sweet, showcasing the band's legitimate talent with a classy set of songs that are a perfect example of the early '70's progressive sound.The heavy opening of the instrumental \"Barbarian\" starts things off great, while the soft textures and smoothness of Lake's vocals in \"Take a Pebble\" really demonstrate the band's range. \"ELP\" is heavy on instrumentals, but since each member of the trio is outstanding at what they do that isn't necessarily a bad thing. Highly recommended to the very few people reading this who don't already have it!Songwriting: 4 Instrumental Performances: 4 Lyrics/Vocals: 4 Style/Emotion/Replay: 4"
    },
    {
      "reviewer": "1800iareyay",
      "date": "Posted Sunday, July 8, 2007",
      "rating": 5,
      "text": "ELP's debut is, for many, their best and it stands as one fo the finest debuts in prog. Prog rock's first supergroup wasted no time placing themselves at the top of the burgeoning heap, and they would go on to become more popular that Genesis and Yes in the early years. The members brought with them mastery of their respective instruments and would make some defining records. Keith Emerson is the only man who could ever outplay Rick Wakeman. Lake brings his wonderful voice as his incredible bass skill, as well as high competence with a guitar. The stand out, however, is Carl Palmer, who plays the most technical drumming that had ever been heard at that point.\"The Barbarian\" opens the album with heavy bass and organ from Lake and Emerson before mellowing out for a bit with piano, then coming back fiercer than ever. It's one of the more enjoyable ELP instrumentals, and it sets teh stage for the high musicianship of the album, especially Carl. \"Take a Pebble\" features Keith messing with the strings of a piano before playing liek a normal person (if you can call his phenomenal skill \"normal\"). Lake's voice is incredible, as is his bass. Emerson has some great improv in this song. \"Knife Edge\" is the best song of the album, and it obliterates the tranquility of the last song with crushing heaviness clearly influenced by Lake's stint with Mr. Fripp. This song is really the best glance into what ELP would sound like on the next few albums. Songs like this show how well these guys could gel, and it's a shame that so many of their arrangements serve only one member at a time.For example, \"The Three Fates\" lets Keith show off and \"Tank\" is Carl's drum solo. They are both very good, especially Tank, but it kills the togetherness by having essentailly two solos back to back. \"Lucky Man\" is the pop tune for the album. It's the only ELP pop tune I enjoy; later ballads would lack energy or even decent lyrics.Overall, this is ELP at their rawest. They act like aband, not three separate stars. The next three albums would show ELP conquering the progressive world, until ego and greed got the best of them and they released failure after dismal failure. This remains the only ELP album without filler, and prog fans must have it.Grade: A-"
    },
    {
      "reviewer": "fuxi",
      "date": "Posted Thursday, August 2, 2007",
      "rating": 2,
      "text": "This debut album reveals a very human side of ELP, but it also shows where they were apt to go wrong. The human side is prevalent in the 12-minute-plus 'Take a Pebble'. This tune has simple lyrics and an attractive melody, but it's notable for its extended piano improvisation. Emerson may not be in the same league as Bill Evans, Keith Jarrett or similar virtuosi, but he is fun to listen to, and the interplay with his fellow musicians runs smoothly. I can't think of any other prog pianists who could have pulled off this sort of thing back in the early seventies - certainly not Rick Wakeman, Tony Banks or John Evan. (Perhaps the pianist from Renaissance? I must admit I don't really know that band...)\"ELP going wrong\" emerges in 'Lucky Man', which would have been a lovely ballad if only it had been sung by someone with true emotion in his voice (love that Moog solo though), and in 'Knife Edge', which is ruined by Lake's clever-clever lyrics. But 'Knife Edge' also demonstrates that Emerson was prog's unmatched Hammond organ hero! I didn't discover ELP until 1975, but back in 1970 this album must have raised great hopes.Rating: two stars and a half."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Friday, August 10, 2007",
      "rating": 3,
      "text": "Any normal new band can afford the luxury of making a good even when not great album but ELP not, they were the first Prog Supergroup, with members who came from great bands as The Nice, Arthur Brown and nothing less than King Crimson, so people should expect not only a solid but a mature album and they partially achieve the goal, even when it's evident we're not before one of their masterpieces.The album is very good, saying the contrary would be a lie and unfair, but it's far from being even close to the status of masterpiece. Some tracks are almost perfect but others too simple for them, most are well elaborate but as a whole it's a bit uneven, so without more subjective comments, lets check the songs.\"The Barbarian\" is an adaptation of \"Allegro Barbaro\" by the Romanian composer Bela Bartok, quite an ambitious task, but IMHO they fail, at the beginning you don't know if they remain in the Psychedelic era or trying to make some Classical oriented Hard Rock, then they step closer to Jazz and Neo Classical. If I had to say something positive, the drumming by Carl Palmer is quite impressive but nothing else, yes Keith is very skilled but it seems like not able to find a defined style, loud and frantic, but lost in the middle of nowhere.\"Take a Pebble is a solid improvement, Keith starts scratching the chords of the piano and immediately joins the wonderful voice of Carl Palmer sounding better than ever, absolutely impressive and strong, the piano background is incredibly beautiful, then the instrumental section gets even better, Keith proves how good he is in the piano and Carl makes a perfect subtle jazzy drumming, simply love this track.\"Knife Edge\" is another adaptation, in this case from Sinfonietta by Janacek, the result is amazing this time, Greg's incredible voice helps a lot and they can really Rock while making radical changes, then the instrumental section is Prog at it's best and the organ solo gives me goosebumps, another excellent track that never bores.\"The Three Fates\" simply leaves me cold, seems like Keith lost his path between Rachmaninoff and Debussy and could never find it, it's a pity that the only epic and the best chance they have to demonstrate what they are able is practically wasted, not bad but they were able of much more.\"Tank\" starts solid with Keith making his synth sound as a clavichord, the rhythm section works perfectly with Lake at it's best, but the two minute solo by Carl Palmer is way too much, it may be great in a concert to give the rest of the band time to take a breath and get an ovation, but in a studio album is a waste of time, yes we know Palmer is top notch, but this is not the way to prove it, playing perfectly with the rest of the band is better.After the boring solo, the closing section is also brilliant, Lake is again perfect with the bass and Keith knows what to do when he puts his hands on a Moog, now Palmer does a great job, if there was a way to eliminate the drum solo would be a perfect song, sadly that's not possible so we get a good one and not more.The album ends with the na�ve \"Lucky Man\", yes I know people will say that Greg wrote this song when he was 11 or 12 years old, what is pretty impressive, but he was 23 and Keith three years older when released, so by this moment it was not a so impressive achievement.But being honest, the singing is perfect and every album requires a single and a chance for the audience in the concerts to sing along, so \"Lucky Man\" fulfills it's mission and it's pleasant, at the end the Moog performance by Emerson makes the track much better than the usual acoustic versions sung by the author lately.Now it's time to rate the album, not a masterpiece so 5 stars is out of the table, but now comes the problem, I'm not sure if it's an excellent addition for any Prog Collection and obviously is not essential from my point of view, but it's more than just good.This is one of the cases in which I wish there was half stars to rate it with 3.5, but being impossible, will have to go with 3 very solid and a bit unfair stars."
    },
    {
      "reviewer": "jammun",
      "date": "Posted Sunday, September 2, 2007",
      "rating": 4,
      "text": "There was a time when keyboard players got no respect. The music press was all Hendrix and Clapton and Page and Beck. And you know who that hot chick in the front row went back to the motel room with; it wasn't the keyboard player. Well, Keith Emerson set out to change all of that.The opening shot was the first Emerson Lake and Palmer album (sorry, the Nice stuff, while admirable, doesn't count).The intention is clear right from the beginning: we're a power trio and we don't need no stinkin' guitar player! The Barbarian (never mind that it was an uncredited ripoff of Bartok) is absolutely brutal hard rock. Lake and Palmer -- no strangers to strange bands -- are more than up to challenge. Take a Pebble shows a softer, more contemplative and even experimental side -- I don't think anyone had played a piano zither-style before. Then comes Knife-Edge, which is more flat-out, take-no-prisoners hard rock. Emerson and the band are shoving it down your throat.With these three songs Emerson forever changed what would be expected of a rock keyboard player. It was no longer enough to be some competent mellotron player (e.g., Moody Blues), or organ power chord purveyor (e.g., Jon Lord of Deep Purple). No, you had best bring some chops to the table if you wanted to be counted among the best.What was side two of the LP is a bit of a disappointment. The Three Fates hints at where ELP would eventually end up, and Tank is the obligatory drum bit. But Lucky Man is a great vehicle for Lake, and at the end Emerson lays a little moogie-woogie on the king of rock and roll.The last half of this one runs out of gas, so I'll only give it a 4. However, do not underestimate the importance of this album: proof that a band with no lead guitarist could play devastating hard rock."
    },
    {
      "reviewer": "apps79",
      "date": "Posted Wednesday, October 24, 2007",
      "rating": 4,
      "text": "The birth of EMERSON,LAKE AND PALMER (simply E.L.P.) came true,when Keith Emerson of ''The Nice'' met Greg Lake of ''King Crimson'' at a concert,where the two bands shared the same stage.The two men had complementary opinions on musical direction and recruiting Calm Palmer of ''Atomic Rooster'' behind the drum kit,they formed E.L.P. amd moved on to record their eponymous debut in 1970.A high-class work,''Emerson,Lake and Palmer'' is a great combination of KING CRIMSON's smooth yet amazingly-arranged prog rock with THE NICE's classical approach.The sensitive vocals of Greg Lake are excellent,while Emerson fills the instrumental space with awesome suite-like organ themes,sometimes mellow sometimes bombastic.The powerful drumming of Palmer is fantastic,while I recognize some slight jazz influences in their music.''Emerson,Lake and Palmer'' is a beautiful start of a magical journey for E.L.P. in the progressive rock planet!"
    },
    {
      "reviewer": "clarke2001",
      "date": "Posted Wednesday, October 31, 2007",
      "rating": 5,
      "text": "An irrelevant debut.No, it's not the album that is irrelevant. The fact that it's a debut doesn't mean much. It could also be someone's last album, the only album or randomly generated sounds by some aliens, appearing on the Earth in 1970 by a coincidence. It's so unique. Where did these guys came from? Well, we know the story: THE NICE; ARTHUR BROWN; KING CRIMSON, but...where did the ideas originated? Obviously, Keith had a main role here. As a performer and as a composer. Now I know, notallthe material is originally Emerson's, but back then I wasn't familiar with Bart�k or Jan�ček. They were not credited, and I heard they had some problems because of that...and as a sidenote, Greg was absolutely unaware of that musical \"borrowings\". I won't comment legal and moral issues - however ELP popularised a contemporary classical music to a wider audience (remember, this was recorded in 1970, when sympho rock was POPular). The album consists of six songs; six different ideas. Hmm, that sounds stupid. Of course they have to be different ideas if they are different songs...but what I'm trying to say is....they were new, fresh band. The direction that band should follow was not clear yet - so they were lost in different paths, different concepts...different ideas. In a word, they lacked focus. From that point of view,this is so typical debut. Of course, what makes a difference is the music. There is no bad song here, they're just all too different. Okay, now we are crossing that tiny line from concept (or lack thereof) to the substance...and here we are, grinded, mutilated by piano keys, stabbed by a church organ, while arpeggios are bleeding and drums are enfilading us.It's that powerful, and more. In the most furious moments (personally, my favourite moment from the album) we have a piano trio, with perverse chord progressions, evil rattlesnake percussion and 7/4 time measure that is vivisection of all things related to madness. On the weakest side, we have poppy folk balladry - which is not bad at all, with its clever usage of text (I dare say ironical). ELP were always touching the subject of battles, wars, madness...and that story started here. In \"Tank\" (sic!) we have detailed picture of a tank and his driver: scared little man, reluctant to go, drives a tank and slowly enters the battlefield as his madness is growing. Great clavinet and bass melodies here are making so plastic, tactile, humid picture of his brain. Drum solois nota show-off for Mr. Palmer; it's a middle of the battlefield, showing as machine guns, cannons and enfilades. The final of the song utilises heavy layers of synths: madness is here. The tank proceeds, but not intact. Blood-red are the eyes of the driver. The tank is advancing and crushing everything in front of him without mercy. Those high-pitched synth solo, don't they sound like weepings and screams? The story has no conclusion, since it's faded. The destiny is to be imagined. The closing song is explicitly criticising the aforementioned topic, plus with the music, the solo at the very end...isn't that the sound of bullet hitting the body? All these pictures will be developed further on, on the albums to come (please see my reviews), but the big idea started here. The debut is inconsistent, innocent, at the moments na�ve. The song themselves are filled with monstrosity. Young, raging brains struggling to explode in all possible directions. How could I dislike it?"
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Sunday, January 13, 2008",
      "rating": 5,
      "text": "Review 1, 1970, Emerson, Lake and PalmerThis self-titled debut is, in my opinion, the progressive supergroup's best. Of the six tracks, only one (Emerson's 'The Three Fates') suffers from any doubtful taste, and even that has a beautiful section. This is an even more astounding accomplishment given the sheer versatility of the music produced: a great folk ballad with a moog solo that never ceases to amuse me, the essential acoustic masterpiece, the heavier Hammond-based Barbarian and Knife Edge, the drumming-dominated Tank, and the various noodlings that comprise The Three Fates. Even though ELP have produced several excellent prog albums, this is the one I'd call essential.Barbarian introduces the trio perfectly, with a growling electric guitar, a superb heavy Hammond organ, and tasteful drumming. The music's constantly shifting, yet retains all its rawness. And suddenly, there's an acoustic section with quirky, yet delightful, piano and drumming. And somehow Emerson escalates that back to the main tune's heaviness flawlessly. And it just gets better and better towards the end. Proof that a progressive masterpiece does not need to be long.Next we have my all-time ELP favourite, Take A Pebble. It's just three musicians on acoustic instruments working together flawlessly, with gorgeous, flowing classical-inspired piano supported by Lake's delicate bass and acoustic guitar parts, tasteful percussion, inspired use of watery sound-effects, strong vocals (most reminiscent of Epitaph) with beautiful surreal lyrics. The band shifts moods between optimism, anticipation, grandeur and surprisingly heavy, dark moods seamlessly. Emotion oozes from the piano and the vocals. There are no weak moments in all the twelve and a half minutes of beautiful music.Third in the album we have another heavier piece, Knife Edge. This took me a little longer to acquire than the previous two songs, but the excellent bass lines, mantra-like, almost-spoken vocals, slightly darker drumming with brief drum solos, and superb build-up and entertaining keyboard riffs and parts ultimately make for a great song. I particularly like the weird churchlike instrumental section in the middle. The lyrics are solid, and work very well with the music. It ends with a slowing-down effect and sort of clicks to a stop. As progressive as Barbarian, and though it doesn't quite reach the heights of the opener, it's still a masterpiece.The Three Fates is a little more mixed. The organ-opener Clotho hasn't really made an impression on me, but it's well worth listening to through to move onto the beautiful piano solo, Lachesis. Delicate, beautiful, tasteful, mobile, and fairly symptomatic of Emerson's piano on the album as a whole. Atropo is another entirely different kettle of fish, with a combination of the instrumentation used earlier in The Three Fates and a little percussion, if I'm not mistaken. The build-up to a final explosion sound effect is quite good, and has a bizarre dramatic atmosphere that goes down quite well. Overall, this track's not quite as good as the rest of the album, but still interesting, at times masterful, and well worth listening to.Tank is another oddity. Bass and drumming paves the way for another flippant keyboard (Moog, I think) part, sustained by the bass and brief bursts of solo drumming leading up to a longer (though not excessive), extremely good drum solo with a real sense of direction that many solos lack. It builds up extremely well and leads into the return of the bass and the moog. Yet another great, charming prog piece.Lucky Man rounds off the album soundly. It's in a much less progressive vein than the rest of the album, but that doesn't really matter to me. The basic melody and the bass part is good, Palmer's drumming complements it nicely, you get to hear more of Lake's voice. And finally, there's a hilarious moog part. Emerson was apparently not taking the solo entirely seriously when he played it, but it's still brilliant. Although it's really more folk than prog, I still love this song.In conclusion, I'm giving this album one of the easiest five star ratings that I'm ever likely to give. I love it. This is ELP at their finest, with electronic and acoustic instrumentation both used to their full effect. Accessible, yet a grower. As much loved as In The Court Of The Crimson King or Selling England By The Pound. Well worth buying, and also a good introduction to the band.Rating: Masterpiece. Five Stars.Favourite Track: Take A Pebble."
    },
    {
      "reviewer": "Tom Ozric",
      "date": "Posted Saturday, May 3, 2008",
      "rating": 5,
      "text": "I really am in turmoil to award anything less than 5 stars for this Supergroup's debut album.... From the 1st time I was turned on to ELP - (then it was Crimso, Nice, Asia, Yes, Atomic Rooster, Genesis, Floyd etc ..........) I knew this was the complexity and sound I desired for my sort of music. With this album, I loved the brutal fuzz-Bass (on the opener 'The Barbarian'), Hammond Organ/Piano play, also an early display of a Moog synthesizer, fully endorsed by its creator, Dr. Robert Moog....., and for Carl Palmer's beyond 'rock-music' approach to his drum-kit (he did display his amazing dexterity on Atomic Rooster's debut album, particularly on the track 'Decline and Fall'....), so, this record stands as an amazing amalgam of different styles of music, all rolled into one highly attractive and accessible offering on a musically hungry demanding public. Of course, this album came out well before I was born, but, I feel that these sorts of changes were quite revolutionary within music's development.....(please correct me if I'm wrong....). There's been recent evaluations on various ELP albums at this time, and I would just like to support their albums with my honest feelings toward their music. Sure, a 5 star Canterbury album means so much to me, in terms of quality.....but, ELP are totally amazing as well........I can understand why a certain amount of listeners don't dig these guys........"
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Thursday, May 29, 2008",
      "rating": 3,
      "text": "I have been looking forward to making this review as it has been a very long time since I listened to this album the last time and it�s nice to come back with fresh eyes to see if it�s really as good as I rememeber it. This is ELP�s debut album. ELP consists of Keith Emerson ( The Nice) on keyboards, Greg Lake ( King Crimson) on vocals, bass, electric & acoustic guitar and Carl Palmer ( Atomic Rooster) on drums. A kind of supergroup. Both Keith Emerson and Carl Palmer are without a doubt virtuosos on their respective instruments while I have always had a hard time really appreciating Greg Lake�s efforts. He�s a good musician no doubt, but I never felt he was as brilliant as the others. Quite franky I never liked his voice much. It�s hard to explain but it never touched me but it didn�t annoy me either. It�s just there.The music is rock inspired heavily by classical music. There are only keyboards, bass, drums and vocals in the music but Keith Emerson dominates the soundscape with his keyboards, so you don�t miss any other instrument. This is truly a power trio. The music is mostly instrumental but there are vocal parts which is of course great for the diversity. There are some really good songs on this debut album and I would mention The Barbarian, Take a Pebble, Knife-Edge and Tank as the highlights of the album while I find The Three Fates to be too much noodling and Lucky Man too commercial.What I enjoy most about this album is the musicianship. Let me just state that it is outstanding and there are several breathtaking moments throughout the album.The sound quality is excellent. One of the best productions from that time.There are many positive things to say about this album and I have mentioned a few, but somehow ELP never really excited me much. Their musicianship has always been the most exciting thing about them while I always found most of their songs to be emotionless compared to other great bands from that time like Genesis, Gentle Giant and Yes. It�s about the same feeling I have always had with King Crimson even though I like them a bit more than ELP. I know this sounds very negative but this is a good album and I do like it more than it sounds like when you read the above lines. I would have rated the album 4 stars but after some second thoughts I have decided that I will rate it 3 big stars."
    },
    {
      "reviewer": "progaardvark",
      "date": "Posted Thursday, June 12, 2008",
      "rating": 4,
      "text": "Emerson Lake & Palmer's eponymous debut hit the world in 1970 and started what would become a fruitful, yet at times trying relationship among these three talented musicians. Labeled as a supergroup at the time, and although unfortunate that they never got the chance to explore the incorporation of Jimi Hendrix into the group due to his unfortunate death, that supergroup label stuck with them ever since, even during their dismal return in the 1990s. It was well deserved nonetheless.Although the talent was there, much of the material off their debut was mostly solo-related. The only song where all three received credits was on the opening track The Barbarian. Lake was responsible for both ballads, Take a Pebble and Lucky Man. The latter track was originally recorded to fill leftover space on the record at the request of the record company. It was actually penned by Lake as a teenager, not well received by either Emerson or Palmer, and featured a one-take, improvised Moog solo at the end by Emerson. It became one of the band's biggest hits and a concert favorite.Carl Palmer is showcased on Tank where he shows off his virtuoso drumming style. The remaining tracks are Emerson's contributions. Incorporation of classical influences is easily noticeable with references to Bart�k, Jan�ček, and Bach. In fact, many of these inspired pieces were note-for-note extractions placed inside a rock music setting, something Emerson is most noteworthy for. Original or not, it made for some interesting listening showcasing some beautifully played symphonic prog rock with many complex time signatures.My biggest issue with ELP is that each of their albums seems to have a couple of what seem to be unnecessary tracks just thrown in like they were there to fill up the space, maybe even precursors to what we all know as bonus tracks these days. For me, they tend to be the ballads and acoustic numbers written by Lake. When you have someone pounding away on the keyboards like a madman, although sloppy at times, and follow it up with a sleepy lullaby, the unevenness is glaring. Sometimes that can be put to good effect, but not here nor in any other ELP album that features this flaw. Furthermore, just from hearing these differences in style between Lake and Emerson on their very first album clearly shows the personality conflicts that would erupt between them for many years to come.An excellent debut with a perfect marriage of classical and complex rock, but with some flaws like the Lake filler and a question of being slightly unoriginal. Clearly very pretentious, but we all like that about ELP, don't we? Definitely a worthwhile purchase and easily worth four stars."
    },
    {
      "reviewer": "LinusW",
      "date": "Posted Wednesday, June 18, 2008",
      "rating": 4,
      "text": "It's both a surprise and an impressive statement that this first album by the symphonic supergroup is their best. The complicated relations of the three members and their individual talents actually work alongside each other at one-hundred percent here, creating a focus and determination one would have wanted for all the successive albums, but sadly is found only here.There has always been a deep schism in ELP's music, between top-class symphonic numbers and the more accessible songs, appealing to a wider audience. Heading off in your own direction, with the choice of combining these two styles, is by many considered the biggest flaw of the group. I'm often, but definitely not always, agreeing with it since it makes many of the albums feel like bags of wild ideas, without relation to each other and far from being in touch with the audience. It's an egocentric, introvert yet flamboyant style of music you often love OR hate. Stuck in a middle-ground between these camps, I find ELP's career to be an interesting mix of highs and lows. The self-titled debut is a definite high. It's definitely focused on sheer, brutal musicianship, leaving vocals and lyrics a little behind. If you find this hard to bear, be warned.With a menacing distorted guitar, The Barbarian opens the album in classic ELP style. Aggressive, loud and forceful, with technical and jagged keys from mr. Emerson and drum power from Palmer, you know you're in for a proper tour-de-force. Interestingly, the song develops into a nervous, paranoid theme with a compulsion that reminds me of Banco Del Mutuo Soccorso's Darwin!, only to return to more violent ground and the abrupt ending.Showcasing ELP's most prominent feature - the polarity - Take A Pebble is next. It's stunningly beautiful, sometimes reminiscent of the mellower King Crimson tunes, but with a lot more emphasis on piano. Soft-singing, Greg Lake delivers the first vocal line of this great tune. It's not sad, but reflective in nature. Mystical and enthralling, it's carried away on Emerson's delicate piano. The odd, cheerful middle-part with guitar feels very Yes-like for a while, but it's deceptive. In a matter of seconds, the piano is back, very classical-sounding this time. A real pleasure for tired ears.Lucky Man closes this phenomenal album, being the last jigsaw in the ELP puzzle. Simple in structure, light-hearted in ideas and concept and perhaps frustratingly accessible to some, it's a quality rock song nevertheless. Acoustic guitar as a textural backdrop, with a relaxed electric solo, standard drumming and Emerson surprisingly out of the picture. He delivers a Moog solo in the end, but it's actually not that mind-boggling. A fair, but not brilliant ending.Aggression is what prevails though, and most of the remaining songs wander off in that direction. The hard-rocking Knife Edge, a bit like something by Atomic Rooster, the chaotic and brilliant Three Fates, which I didn't like at all from the beginning, but which has evolved into an amazing display of Emerson's, but also Carl Palmer's disciplined frenzies as instrumentalists.It is absolutely an odd collection of songs. But they all work together, sharing one important thing: impressive quality. And sometimes that's all you need. There are some jazzy parts thrown around, there is a lot of arty pretension, stunning displays of skill, drama and fire. Borderline masterpiece.4 stars.//LinusW"
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Saturday, July 19, 2008",
      "rating": 5,
      "text": "Of their first four classic albums, this self titled debut is far and away my favourite. It's almost like it was tailor-made for me. Perfect fit. It's difficult to estimate how influencial this album became, but make no mistake it became a template for many bands who followed. I could heap praise upon each one of these three guys for their individual talents and no one would argue, but I think Palmer is the one who surprised me the most on this debut with his drum skills. I mean he's only 19 years old here but playing like a passionate, seasoned veteran.\"The Barbarian\" is raw and dirty to open. Check out Lake's filthy fuzz bass ! Meanwhile Emerson is ripping it up on his Hammond organ. Palmer meanwhile is simply incredible on the kit. Things change 1 1/2 minutes in as piano and drums take over. A gong sound signals a return of that fuzz bass and those nasty organ runs. Palmer is so good just firing off round after round. A knock out punch and they're just getting started. \"Take A Pebble\" is pastoral track with Lake's pleasant vocals as Emerson tinkles on the piano. The tempo picks up after 2 1/2 minutes with piano leading the way. A calm before 4 minutes with Lake on acoustic guitar. The tempo picks back up 5 1/2 minutes in with clapping. Back to a calm and acoustic guitar. Piano takes over 6 1/2 minutes in. Drums start to get more prominant after 9 minutes and bass joins in too. Vocals are back before 11 1/2 minutes to the end of the song.\"Knife-Edge\" features sinister sounding organ, and vocals that are darker. An uptempo organ/drum melody follows. These themes are repeated. Check out the organ and drums 3 1/2 minutes in. It becomes powerful 4 minutes in with vocals and killer organ runs. \"The Three fates\" opens with pipe organ. It's so powerful ! Piano 2 minutes in. Yes Emerson can play ! The organ is back 4 1/2 minutes in. Piano and drums follow. Great sound before 6 minutes. An explosion ends it. Appropriate. \"Tank\" opens with drums and a clavinet solo from Emerson. This all sounds pretty incredible. A collage of intricate sounds fills the air. Check Palmer out 2 minutes in until after 4 minutes when the other two finally join in. Love the synths 5 minutes in to the end of the song. \"Lucky Man\" was written by Lake when he was around 12 years old when he was learning to play guitar. He dreamed of what it would be like to be rich. To be a lucky man. I first heard this song when I was in my teens in the mid seventies and have never grown tired of it. It's a mellow song that tells a story. Acoustic guitar, vocals and drums to open. Awesome sound before 2 minutes. Palmer is so intricate, very Bruford-like here. Of course it ends with that famous moog synthesizer solo. Emerson didn't own one at this point, but there was one in the studio belonging to MANFRED MANN's Mike Vickers. He borrowed it and the rest is history."
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Wednesday, July 23, 2008",
      "rating": 4,
      "text": "Rave upEmerson Lake & Palmer's self-titled debut is one of the classic albums, not only of the band but of the whole genre of Symphonic progressive Rock. Several of the album's tracks went on to become staples of the band's live sets and have appeared on several live albums and compilation.The album opens with the menacing The Barbarian (which, when I played it aloud today, frightened my cat so much it hid under the bed!). This is an adaptation of a piece by composer B�la Bart�k. This sort of adaptation of classical music was something that was to become a trademark of the band, and music composed by Leo? Jan�ček and Johann Sebastian Bach is used on the track Knife-Edge.The Three Fates is an original three part composition by Keith Emerson in a classical vein while Take A Pebble and Lucky Man are written by Greg Lake in a more folky in nature and Tank shows Carl Palmer's jazzy influence. This mixture of Classical, Folk, and Jazz within a Rock context is the life blood of the band and essential to their greatness.The band had yet to mature fully, but they were already very good here. A very good start of a brilliant band. Highly recommended!"
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Tuesday, September 16, 2008",
      "rating": 2,
      "text": "The trio of Keith Emerson, Greg Lake, and Carl Palmer, who created a few of the greatest progressive rock masterpieces imaginable, begin their adventure together weakly and rather disjointedly. It is hard for me to imagine the celebration of this album next to the reactions of horror that typically accompany Works Volume 1, particularly since what they seem to be here are three outstanding musicians who are completely apprehensive about working together. This album is a hodgepodge of classical and jazz piano music, singer-songwriter ballads, crunchy organ, and daring instrumentals.\"The Barbarian\" With a distorted introduction and some grating organ, along with wild snare-slapping and dynamic bass playing, the first one-and-a-half minutes of this piece is an excellent idea of what the band will sound like on forthcoming releases. What follows that, however, is a sudden piano interlude. It takes getting used to in the overall context of the piece, but it demonstrates Emerson's ability well. After this, there is more in the vein of what came before. It is one of the band's best instrumental tracks, and certainly the best instrumental on this album.\"Take a Pebble\" The opening to this one features alternating harmonious and discordant chords that makes one think of an autoharp played with only the benefit of a strumming hand. Overall, this is less like progressive rock and more like directionless meandering. The folk section that comes in later is apropos of nothing. Six-and-a-half minutes in, there is beautiful piano playing, some of Emerson's best, but again, it just seems capricious in context. Later, the band enters to make what sounded like classical piano jazzy. Lake's vocals bookend this unnecessarily long track, but just as the keyboard work up until this point has finely exhibited Emerson's ability, his singing displays what he will sound like during his finer moments with the group.\"Knife Edge\" The second of three vocal tracks, this song takes what was great about the first track and what was great about the second track, namely Emerson's organ and Lake's vocals, respectively, and blends them to produce a highly enjoyable listen. The song repeats themes without becoming repetitive, paving the way for further organ work. After the middle section (an ELP highlight in and of itself), Lake returns with more energized vocals. It's unfortunate the song fizzles out in the manner it does.\"The Three Fates (Clotho/Lachesis/Atropos)\" This is the point in the album where ELP begin to seem less like a ensemble, and more like a threesome of solo artists sharing studio time. Emerson has already shown how amazing he is at what he does, so why the need for an extended three-part instrumental exclusively featuring church organ, piano, and then more piano with some unwarranted drumming? While it's certainly understandable that ELP (and many artists in the early seventies) were not consciously trying to write progressive rock (the way many modern symphonic acts seem to be doing), Emerson's solo act is no more progressive rock than any classical or jazz pianist playing alone is.\"Tank\" Finally Palmer gets a real opportunity to show his stuff, with a drum solo both to open the song and two minutes in. The dual clavinets and piano are all over the place for the most part during the time before this, which is sad really, because the bass line is truly one of Lake's best. It is not until Palmer's solo is finished that Emerson finally breaks out the Moog, using it both as a solo instrument and to beef up the rhythm section.\"Lucky Man\" Almost an afterthought, it was this song that was largely responsible for taking ELP to the airwaves. Its chords are played on a twelve-string guitar and Lake sensitively sings the words. The improvised synthesizer solo at the end sounds out of place and can be annoying in parts. Overall, it's a good song, but nothing at all compared to what would come."
    },
    {
      "reviewer": "crimson87",
      "date": "Posted Saturday, December 20, 2008",
      "rating": 5,
      "text": "We all know the story of these three guys so I won't take time explaining it. In my opinion BSS is the ultimate ELP masterpiece ( and prog rock masterpiece as well) , but this album is a high point in their career.When I think of ELP I tend to focus on the huge epics like KE9 , Tarkus or , The endless enigma but when I started paying attention to The Barbarian I realized what a great tune it was. Just 4 and a half minutes long but including every single aspect of ELP's career . OK no vocals this time , but you get: Classical influenced keyboards , versatile drumming and a fuzz bass that sounds like a roaring beast! I picture the faces of the ones who first heard this piece in 1970 , it must have been overwelming. There can't be a better way of introducing themselves in a record.The second piece settles a huge contrast to the previous one , it's a very relaxing one with an acustic interlude by Greg Lake , also I must add that his vocals in this song are among the best he ever did. This type of songs is what made me become an ELP addict , sometimes this song reminds me of Keith Jarrett and makes me wonder why Emerson did not release a solo album in the vein of the Koln Concert , I would have bought it for sure.Kinfe edge is a hard rock piece , much similar to the heaviest moments of the Nice and Atomic Rooster. It may sound weird on a prog rock site but the way this tune develops reminds me of Nirvana , Lake sings quiet the verse and then the song reaches a peak in intensity. If anyone has a doubt about ELP rocking or not just heard this tune.The second side of this album is their more exprimental one , in which hints of ELP's future records will be found. The three fates is a haunting instrumental featuring a church organ first , then a percussion movement and lastly several layers of keyboards by Emerson. i picture this song to be hugely influential to japanese symph groups like Ars Nova or Gerard , again if you have any doubt as regarding this fact just check The Goddess of Darkness by Ars Nova , there is Three Fates all over it.ELP was always about instrumental abilities. Tank features a Carl Palmer drum solo which is accompanied by Emerson's Moog. I really like the outro to this song because of Palmer's simple yet powerful drumming. As a negative aspect I have to say the production is not the best. Last tune of the album is hit single Lucky Man , which is a ballad that features very moving vocals by Lake , with the exeption of Emo's famous Moog solo at the end of it ; this song has no progressive elements around and it feels quite out of place in the album. However what would an ELP show without Lucky Man?Outstanding debut , 4.5 stars"
    },
    {
      "reviewer": "The Truth",
      "date": "Posted Wednesday, April 22, 2009",
      "rating": 4,
      "text": "Like this album needs another review, but heck with it! Emerson, Lake, and Palmer had already outdone themselves on their self-titled debut! The keyboard playing in each track is phenomenal! No wonder Keith Emerson is called the Jimi Hendrix of the Hammond organ, he's amazing! This really shows on the tracks The Barbarian and The Three Fates. On The Three Fates the organ is immediately noticeable and it only gets better after that as they go into the piano trio which is amazing! Lucky Man the hit single is an excellent track although it definitely could've done without the synth solo in the end which just doesn't seem to fit it. All the other tracks are very good and there is nothing just thrown in here which seemed to be the case of their later albums. It's a masterpiece ELP!EDIT:Gosh this album grows stale after awhile even with it's impressive passages. Guess it's not a masterpiece, but just an excellent piece."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Thursday, August 20, 2009",
      "rating": 4,
      "text": "This self-titled debut of ELP's possibly represents the band at their most focused and most restrained...so is it any good?My answer would be just listen to the first thing you hear, that fuzzed-out bass thing at the beginning of ''The Barbarian''. That instrumental track is an all-out assault on the ears with the pounding drums, heavy bass and piercing organ. If that's not enough, they managed to reprise the assault on ''Knife Edge'' (add in some vocals) and ''Tank'' (with an astounding clavinet part). This heavy bass-keys sound is what I enjoy most from ELP, the band and the album.However, it isn't an ELP without even a slight degree of pretentiousness. ''The Three Fates'' is just that to the max, a chance for Keith to show how impressive he is on church organ and piano all the while not much impressing me either. Carl Palmer is also guilty by squeezing in a drum solo in the middle of ''Tank'', although that solo doesn't get on my nerves. My problem is that this is the first album to feature the ''obligatory Greg Lake sappy ballad'', one that will be copied several times throughout ELP's career to get radio play. Here, the ballad is ''Lucky Man'', and it contains some of the worst lyrics in the ELP canon. The catchy chorus saves the song though.All three kind of get out of hand on ''Take a Pebble''. While the acoustic guitar is put to great use in the form of a country-hoedown-esque solo (I rarely have complements for ANYTHING country) and Keith lays down some great piano solos (including the very beginning of which he plucks the strings inside the piano), ultimately, it's length gives me fits as many solos go on for longer than I desire.All fussing aside, check this out if you think excursions like ''Tarkus'' and ''Karn Evil 9'' are too much for you. Probably my personal favourite of the ELP albums I've heard so far."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Monday, September 28, 2009",
      "rating": 5,
      "text": "Emerson Lake & Palmer burst onto the music scene back in 1971 with this incredible album. Keith Emerson had used classical pieces as the basis for his rock songs while inThe Nice, but never with a band with this amount of talent. Carl Palmer's drumming and Greg Lake's bass, guitar and singing voice far surpassed their counterparts in Emerson's old band.Right from the start ofThe Barbarian, with a roar from Lake's guitar, and Emerson's might Hammond organ, the listener knew he was in for a new experience.Bartokhad never sounded so cool. Every song here, even the soft ballads, are classics of prog.Take A Pebblemay be ELP's most beautiful song, with Emerson's piano deftly describing the ripples created in the ocean from a tossed pebble.Knife Edgegives us a very heavy piece, based onLeos Janacek'sSinfonietta. This song would become a live favorite for the band, with Emerson throwing knives into his tortured Hammond.The Three Fatesis first an organ-heavy piece, that then turns to piano amazingness.Tankis a fusion piece, one of the few Palmer had a hand in writing. AndLucky Man, well, everyone knows that song. It still, to this day, gets plenty of radio airplay.While this does not have ELP's best songs, it is certainly their most consistent album."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Tuesday, September 29, 2009",
      "rating": 4,
      "text": "ELP roars into the prog world in a blaze of glory with this 1970 debut. Bands worldwide must have been envious of the debut that stamped authority on prog and a unique blend of symphony and rock. Every track screams to be noticed and are all bonafide classics in their own right.The Barbarian is a fabulous complex instrumental featuring chaotic drumming and a frenetic Hammond from Emerson. What a way to introduce the band! Take A Pebble is close to my favourite prog song with beautiful lilting vocals and an amazing melody line that is unforgettable. The lyrics are simply mesmirising. I love the piano interlude and acoustic instrumental. An absolutely brilliant piece of virtuoso music from end to end. You will find it on all good ELP compilations.Knife-Edge is a trademark ELP track and features Hammond stabs and wall to wall bass and drums. A very frenetic time signature and potent vocals. The 4 chord staccato stabs are powerful and aggressive.The Three Fates is the lengthy majestic Emerson showpiece that grows on you on each listen. It is perhaps the only track not found on compilations as a general rule.Tank showcases Palmers enimatble style, a drum time signature that made all other drumers sit up and take notice.Lucky Man became ultra popular and blitzed the charts showing the softer balladic style of the band and Lake's quiet approach to music. And there you have it. A master class performance. Not the best they will do but as far as a debut goes, it would be hard to find better."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Friday, October 16, 2009",
      "rating": 5,
      "text": "Great debut album from the first prog Supergroup. Playing just in power trio format, they 're maiking impression of full orchestra added, Album songs are very different in melodies,styles and arrangements, so you wouldn't be boring during listening. Main album sound is Emerson keyboards,for sure, but pleasantly total sound is acoustic enough ( I hate all this over- produced sympho-rock bands filling all the space not with music, but with pseudo-classic keyboard's sound).The Barbarian is a gem, classic ELP song for years. Longest composition \" Take The Pebble\" contains Greg vocal ( I have nothing against it, but some people don't like his voice). Long construction contains classic piano sound mixed with jazzy drums and bass line, and I like it!Knife Edge and The Three Fates ... demonstrate nice neo-classic piano technicue both. Again, in combination with jazzy drumming and some synth effects it give really nice result.Tank is synth-based instrumental with characteristic sound of early seventies and long drums solos.All album is still not as bombastic as later ELP works ( for good). Palmer's drumming is more jazzy there,and it really gives some air to total sound. \"Lucky Man\" is traditional ballad ( many critics hate it because of simplicity and lyrics, but I prefer this naive song against complex songs about dragons and elves so popular between pseudo sympho-proggers).I am sure, that it is very strong debut and one of the best ELP album. Absolutely recommended to everyone interested in sympho-prog roots and one of the best bands for years."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Monday, December 21, 2009",
      "rating": 4,
      "text": "ELP is probably one of the most debated of all classic prog bands, praised to heaven by some, slated by others. I find myself in both camps really, often even simultaneously, one moment marvelling at their unique sound and musicianship, the next shaking my head in desperation at the pointless and emotionless drivel they churned out. Also their debut doesn't escape this ambiguity and contains both pearls of prog and annoying filler.The first track is essential, in so far that I would include it on a 'mixed tape' sampler of prog music - supposing someone would actually ask for that.The Barbarianis rock music full of classical influences, it's big, overstated, pompous, grandiose, swirling, epic, virtuosic, it's prog! And it only needs 4.30 minutes to make its point.Take A Pebbleshows another side of ELP, more lyrical, melodious and romantic. It's the Lake side of ELP, more classic rock ballad oriented, tasteful and more subtle then Emerson's extravagance. It's the other aspect of ELP's sound that makes them an interesting listen.Take A Pebbleis a beautiful piece of music; even if the middle part is a bit long-winded, (especially the piano section).Knife Edgeis another classic ELP track where all 3 forces in the band come together very successfully, the heavy organs from Emerson, the pumping bass and commanding vocals from Lake and Palmer's superb drumming.Side B of the original album has a whole lot less to offer, at least to me, when I want to hear church organ I'll put on Bach and when it comes to piano, there's a library full of more meaningful pieces from classic composers and jazz pianists.The Three Fatesis not bad by any means but it's a bridge too far for me. The last two minutes with the entire band make more sense.Tankis the desperation moment. There are worse examples but still this is where purposeless virtuosity for its own sake takes over, the drum solo is downright tedious. However, the last 2 minutes save this one again and demonstrate what this band could achieve when they set their minds to it. A great staccato rhythm sets the pace for one of the first moog solos on a rock album, and it's a great one, both playful, smart and dramatic.Lucky Manis ELP's campfire moment, unexpectedly ending with anther big moog party.Making consistent albums wasn't ELP's specialty and the debut suffers from their lack of consistency. Overall, I count a good 20 minutes of really great music here. The remainder is a bit average but nothing that's really poor.EDIT: I though I likedTarkusmore but upon reviewing that one, I realised this debut is my preferred ELP release after all."
    },
    {
      "reviewer": "J-Man",
      "date": "Posted Saturday, January 16, 2010",
      "rating": 2,
      "text": "Masterpiece?When people talk about the classic progressive rock groups, ELP is always mentioned. While I won't dispute their significance in the progressive rock world, they have never excited me as much as other classic prog bands such as Yes, Jethro Tull, King Crimson, and Genesis.This was the third ELP album I had purchased afterTrilogyand thenBrain Salad Surgery. I find both of those albums moderately enjoyable (probably 3 star albums), but I did find them overrated. When I bought their debut album I was really expecting something great, but I was very disappointed. Whereas the two above mentioned albums have many redeemable qualities behind the excessive noodling, this album never really did much for me. I don't think I'll ever understand what is so great about ELP, and why I'm unable to discover it. This album certainly didn't do me any favors from that aspect, and makes me question their music even more.For those of you who have never heard ELP, this is progressive rock (though I wouldn't nessacerily label it \"symphonic\" prog) with many classical influences. There are some hard rock leanings mostly because of the heavy dependence on Hammond organ. The music has a lot of weak transitions, and is focused mostly on Keith Emerson's virtuosic keyboard abilities. The skill and talent is present on all of these songs, but the memorable melodies and consistency is only present for brief visits.THE MUSIC:\"The Barbarian\"- The first starts with a distorted guitar riff, that soon turns into heavy and dark organ chords. I remember the first time I heard this I was immediately in love. Keith Emerson's talent on the organ shines right here, and Carl Palmer does an excellent job as well. Almost out of nowhere, it turns into a classically-influenced piano section. I think the song would have faired much better without it, to be honest. The transition into this section is weak, and the section itself is nothing too memorable, and seems directionless. Luckily the original section soon returns, and Keith Emerson amazes me again. The organ soloing is truly excellent. Overall, this is a mixed bag, though. It definitely has its moments, but it is lacking in consistency.\"Take A Pebble\"- The first song opens up with a beautiful piano melody. The opening is really good and when Greg Lake's vocals enter it's pure magnificence. Soon a classical-sounding piano section enters. It sounds really good, even if it doesn't really fit. Soon a folky guitar section enters. This entire section (and trust me it's pretty long) doesn't fit at all, and seems almost pointless to me. It gets absolutely nowhere, even if the guitar playing is solid. When the classical piano enters again, too much of it seems like noodling for my tastes, but the musicianship is excellent. It builds well into the ending. Again, this is a very uneven song, and only about half of it is really worthwhile. This is much longer than it needs to be.\"Knife-Edge\"- After the fairly boring and overly long previous track, this immediately brought my attention back. After the bombastic organ opening, it goes into a bluesy-section with just bass, drums, and Greg Lake's vocals. Much of the song builds off of these two sections, and it does it excellently. This has some great soloing from Keith Emerson. This is my favorite song from the album, and I wish more of the album would be like this.\"The Three Fates\"- We all know the saying that good things never last. Well this is a perfect representation of that. After the magnificent previous track, this just strikes me as boring, pretentious, and unnecessary. The opening church organ solo is decent enough, but it does nothing for me. It goes into a piano section that is just pure noodling. Nothing more, nothing less. The church organ shortly returns and just plays the same chords over and over again. A weak transition brings us into a complex piano section with drumming. This whole song is completely pointless in my opinion, and it just seems like Keith Emerson showing off. Needless to say, it doesn't impress me.\"Tank\"- This is Carl Palmer's solo spot, and he shows his chops clearly. This is a weak composition, though. The musicianship is spot-on as always, but the songwriting does nothing for me. That's usually my main problem with ELP. Their talent is undeniable, but the music is often questionable. This is another fairly useless track.\"Lucky Man\"- This is often the most scolded track on the album, but I must say that it is one of my favorites from the album. Unlike most of the other songs, this actually has memorable melodies and it is consistent from beginning to end. I love the synth solo near the end especially. This is a great closing track, though I'm sure many will be quick to deny it.Conclusion:Emerson, Lake & Palmeris a pretty overrated album in my opinion. The musicianship is excellent, but the music often is directionless and leaves me cold. ELP's music just never interests me as much as Yes, Jethro Tull, or Genesis, and this album is no exception. I enjoy some of their later albums, but their debut is flawed in various ways. I don't consider myself an ELP fan much at all, but this is one of my least favorites from this era. If you're interested in ELP, I recommend going to their next couple albums, as I find them moderately enjoyable. This album is lacking terms in consistency and memorable moments. I know many will disagree, but I can't give this more than a 2 star rating. I don't think I'll ever understand what's so great about this album.2 stars."
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Monday, January 25, 2010",
      "rating": 4,
      "text": "The first and the bestEmerson, Lake and Palmer got together from their three previous bands - Emerson's The Nice, Lake's King Crimson and Palmer's Atomic Rooster. They released their debut album - homonymous Emerson Lake and Palmer, to a dreat commercial success in 1970. In my opinion, this one will eventually remain their best album. The musicianship is perfect. These musicians are magicians, but regretfully their composer's skills are not of the same high quality as their musicianship. Despite that, all songs are memorable and interesting. The album is highly influenced by classical music, most notably in Take a Pebble and The Three Fates. Piano solos by brilliant Keith Emerson are exceptional moments all around the album. The voice of Greg Lake is of high quality, especially in vocal-oriented song - Knife-Edge and famous ballad Lucky Man. The opening track - The Barbarian contains darker themes as well as the third part of The Three Fates. Tank is captivating mixture between different ideas, including eastern influence and contains drum solo by Carl Palmer. It's quite experimental album, highly recommended for classical fans and quite recommended for prog fans with dynamic taste. 4 stars!"
    },
    {
      "reviewer": "Peter",
      "date": "Posted Thursday, April 15, 2010",
      "rating": 4,
      "text": "By 1970, when Emerson, Lake and Palmer released their eponymous debut, the infant progressive rock movement was really beginning to grow, and flex its muscles. King Crimson had established an influential prog blueprint the year before with IN THE COURT OF THE CRIMSON KING, and future top-tier progressive acts Yes and Genesis were each toddling to their wee prog feet with sophomore efforts TIME AND A WORD and TRESPASS, respectively.EMERSON, LAKE AND PALMER saw prog's most potent trio emerge fully-fleshed upon the developing scene. It's an impressive first effort, with all of the classic ELP elements in place. The band whose names would become synonymous with the genre -- for a few bright years in a positive fashion, but, during prog's 76 to 77 fall from grace, more often in a scornful manner -- had a firm musical identity, and knew their business right off the mark. Singer Greg Lake had already honed his grand, inspiring vocal style during his two-album stint with Crimson, keyboardist extraordinaire Keith Emerson had been wowing audiences with his prowess for some time with The Nice, and Carl Palmer now confirmed his burgeoning reputation as a drummer's drummer, having been the tour drummer for The Crazy World of Arthur Brown, and a founding member (and studio drummer) for Atomic Rooster. The three ELP men were no smooth-cheeked neophytes, but seasoned musicians and recording artists.That deep pool of experience is apparent on EMERSON, LAKE AND PALMER's opening track, the instrumental \"The Barbarian,\" which is four and a half minutes of rampaging, head-hewing, pure prog power and majesty. Emerson in particular shines here, with some church-style organ and some lightning-fast work on the piano. The second piece, the magnificent twelve-and-a-half minute, multi-part \"Take a Pebble\" finds Lake delivering some typically stirring vocals, while Emerson and Palmer get to stretch out and show off their flashy, jazzy chops in perfect complement to one another. Next up is \"Knife Edge,\" another heavy number which encapsulates all of the quintessential ELP elements within its five minutes. Palmer's stellar performance on the skins and cymbals, and Emerson's mastery of the Hammond are again the highlights. \"The Three Fates\" is an instrumental, which takes the listener to some grandiose cathedral of prog, via Emerson's imposing pipe organ opening. Piano and drums also get a real workout here, and the high-ceilinged sound evokes the mythological motif of the title, before a literally explosive close. This, boys and girls, is the sound rock makes when it's progressing! \"Tank\" is another instrumental, and this initially nimble number at first belies its name. Formidable finesse is seen in Palmer's \"obligatory for the early 70s\" drum solo, before the slower main theme asserts itself for the closing half. Now one can readily envision the armoured killing machine of the title, lumbering along in smug, impenetrable might. Finally, the album ends with 70s FM favourite \"Lucky Man.\" (Only the cloying \"C'est la Vie,\" from the overblown WORKS, would ever garner ELP as much air time.) \"Lucky Man\" is a nice enough song, though its lyrics are somewhat school-boyish and didactic in their heavy-handed message that wealth does not bring true happiness, or even (gasp!) forestall death. Still, Lake's acoustic guitar is pretty, and dig that spacey synthesizer at the close -- far out! (Hey, it was a new sound way back then, and it impressed my shell-pink ears to no end -- even if it sounds a mite dated and corny as I listen today. Alas, fleeting innocence, I hardly knew ye! How dare I be so jaded?)Thus, EMERSON LAKE AND PALMER was a strong debut, which played no small role in solidifying the progressive rock template. Jazzy affectations, classical pretensions, \"deep\" lyrics, pompous musical bombast and complexity, along with sheer \"look what I can do\" ace musicianship, had constructed a gilded home. A growing, worshipful audience, eager for more such heady fare, soon came calling. These days, as prog's favourite whipping boys, ELP have fallen far from the Olympian peak of slavering adulation they once occupied. Still, here one can find out how they attained such rarified heights in the first place. EMERSON LAKE AND PALMER is must for all fans, and for any comprehensive collection of early progressive rock."
    },
    {
      "reviewer": "tarkus1980",
      "date": "Posted Tuesday, May 18, 2010",
      "rating": 5,
      "text": "Boy, did THIS album ever grow on me. When I first got it, I basically liked it, but probably would have given it only a high ***. Then it grew on me some more, and comfortably settled into a **** range. Then when I thought it would go no further, I eventually found something that basically shocked me - not only had this album managed to sneak its way into my top 100 overall (for a while, anyway), it had managed to be an important reason in my upgraded opinion of ELP as a great band. Brain Salad Surgery may be the focus of ELP's fame (for better or for worse), but THIS is the album that makes them deserving of that fame.Indeed, the first half of this album is just about PERFECT, one of the best sides of any prog album I own. \"The Barbarian\" is an astounding opener, an update of an old Bartok piece that takes on a life of its own here. If you're a cynic who says that Emerson's playing is merely self-indulgent tripe that cannot be easily enjoyed by a casual listener, you really need to give this track a listen or three. It took me a while to get into the rest of the album (to varying degrees, anyway), but this track sucked me in right away. The opening distorted bassline/guitarline is much moodier and \"tougher\" than one would stereotypically expect out of ELP, and once Emerson jumps in with his keyboards and begins driving forward theme after theme with his whole array of piano and organ tricks, any expectation of archetypical British \"wussiness\" on the album should fly right out the window. All three are at their very best throughout this track, managing to both demonstrate their huge talent AND make sure that the listener actually cares about what they can do with that talent, with the final result an unabashed prog classic.The next track is no slouch either, and quite possibly even better. \"Take a Pebble\" is based around an absolutely gorgeous ballad courtesy of Greg, and what truly makes the song magnificent is the soaring and powerful vocal effort that Lake graces it with. Now, I appreciate Jon Anderson's vocal approach as much as anybody, but I will admit that prog tunes benefit when the vocalist is able to (almost) convince the listener that the bombastic and meaningless ravings are actually relevant and, well, emotionally move the listener. And Lake does just that; not that the lyrics are all bad (\"the sadness on your shoulders like a wornout overcoat, in pockets greased and tattered hang the rags of your hopes,\" there's a good line), but they really need that extra oomph in order to make them work. In any case, there's also a really nice middle instrumental section. Parts are in typically bombastic classical motifs, but they really sound interesting (once again, Emerson is at his beautiful best, this time on piano), especially after we get to be enchanted with, of all things, a nice Mississippi-style acoustic ditty (which once again provides a perfect example of ELP's ability to deflate itself at needed times, at least in the early days of the band). As you might imagine, when they performed it in concert, they would stick tons of music between the bookends of the piece, often sticking several of their other tunes in the middle, but this 'miniature' seven or eight minute middle section is wonderful in and of itself.Next up is \"Knife Edge,\" which I once disliked for whatever reason, but I was a F-O-O-L. An adapation of a classical piece (the name and author of which escapes me at the moment), this track is a nearly perfect summary of all of ELP's talents, with almost none of the flaws (except possibly \"self-indulgence,\" but that's just something you have to accept with ELP, and besides, nothing about this track is particularly self-indulgent). The basslines RULE, Lake's vocal delivery is aggressive and forceful in a manner that he didn't use nearly enough in the rest of the band's career (yup, I actually prefer aggressive Lake to bombastic Lake, even though the latter is just great), Emerson's playing is a perfect mix of jarring organ dissonance and blazing organ solos (ALL of which are interesting), and of course Palmer is Palmer. I tell you, when Lake blasts out his, \"CAN YOU STILL KEEP YOUR BALANCE?!!\" vocal near the end, it's absolute meaningless (but not imageless, make the distinction people) bombastic prog bliss for me, and when taken all together, it's little wonder that this is the track (along with \"The Barbarian,\" heh) that I use to try to introduce people to ELP (and with a decent level of success, considering that it's ELP, heh).Unfortunately, the majority of the second half of the album doesn't come close to matching the sheer brilliance of the first, and for many people this is what causes the rating of this to come crashing down like a ton of bricks. The first two tracks of this side, you see, comprise a lengthy (about 15 minutes) instrumental suite, consisting of a multi-part classically- influenced keyboard piece (\"The Three Fates\") and a drum solo (\"Tank\"). Upon first (and possibly second, and third) listen, these will come across as a completely self-indulgent mess, and it's possible you may want to dismiss them outright (I know I basically did). On the other hand, though, by making the three sections of \"The Three Fates\" distinctive from each other in both sound and mood, not to mention actually somewhat memorable (even for somebody who doesn't spend all day listening to this sort of thing), Emerson found a way to make me enjoy the piece much more than theory says I should, and as such I'm not at all offended by its inclusion on this album. As for \"Tank,\" well, it's a drum solo, and I don't much like drum solos, so it does somewhat offend me. That said, I'm amused that the band employs one significant variation on virtually every other drum solo ever recorded, namely that the main riff of the piece is played by keyboards and not by guitar, and as far as the actual solo goes, I think that Palmer is better suited for \"show-off\" soloing than most others I've heard (just because of his incredible technical ability), so I don't hate it as much as I do other solos.Fortunately for all, the album ends not on an ambivalent note (regarding my attitude towards it), but rather on an extremely strong one, courtesy of the radio hit \"Lucky Man.\" The song does a wonderful job of reminding the listener that the foundation of the band's greatness lay not with all their instrumental pyrotechnics, but with their ability to create solid \"normal\" songs, with their playing abilities serving as an augmentation and not as a replacement for true inspiration and creativity. The ultimately tragic lyrics work well with the sea chanty-style melody, and while some might gripe that the ending synth solo (filled with all sorts of cool pitch-bending) is tacked on and completely inappropriate (not me, though), there can be no question that it leaves a major impression (for better or worse, depending) on the listener come album's end, and I'm all for leaving strong impressions. Besides, it functions well on a symbolic level as well, a sort of trumpet's call proclaiming the band's entrance into the pantheon of significant artists (at least for a couple of years).In short, this is a solid 10, and without a doubt my very very favorite ELP album. It's the one that entertains me the most, and furthermore it's the one that interests me the most - after all, even if it doesn't define an entire genre likeIn the Court of the Crimson Kingdoes, it does represent an intriguing projection of modern-classical values onto conventional rock ideas, and that's definitely worth something in my book."
    },
    {
      "reviewer": "thehallway",
      "date": "Posted Saturday, August 14, 2010",
      "rating": 4,
      "text": "Most fans/listeners/people would agree that ELP's debut is probably one of their better releases, perhaps on a par with 'Trilogy', but not up there with 'Brain Salad Surgery'. And so I was surprised to see that on this site, it is the highest ranked album by the trio with a good forty places above their alleged magnum opus.It almost definately has something to do with the cloud of pretentiousness that has been thrust upon the band, because this is the only release where such a quality isn't present. And while some people have obviously underated the music on later albums due to the members' egos, that's not something I believe is fair. Sure, egocentricism is a social turn-off, but in order to even have any degree of success in the music industry you must showcase yourself. People might as well make music in private if others are going to criticise their attitude.Anyway, 'Emerson, Lake and Palmer' is a fine album regardless of such arguments, but is it deserving of its place in the middle section of our top 100? I'm not so sure. It's fequently good, but also frequently individualistic. There are plenty of moments (by which I mean, too many on side 2) where only one or two of the band members are playing. And albums such as 'Ummagumma' and 'Fragile' prove that this only works if the music has a point to it, which on both albums, it doesn't. And I'm afraid to say that it doesn't here either. 'The Three Fates' is purely a pianist's virtuoso display; fine, but the bulk of 'Take a Pebble' already proved that Emerson was a fantastic musician, not to mention being a vehicle for Lake's acoustic skills. And with 'Lucky Man' being self-confessed filler, the only neccesary song on side 2 is 'Tank', an actual song with a brief drum solo that makes it's point and leaves again. Carl Palmer knows the difference between a studio and a stage.I have no complaints about the group tracks; later albums would show significant development but these arrangements are good evidence that ELP was a band worth forming. In fact, despite my harsh remarks, all six tracks here are decent. It's just that 'Take a Pebble' and 'Knife Edge' sum up this band's sound enough between them to make the latter songs not needed. If 'Works' was too diverse, then this is too samey.In conclusion, this debut is a classy and dynamic album, but it had something important to say:\"Emerson, Lake and Palmer are a great band, but they've already run out of ideas\"Thankfully the impending 'Tarkus' would disprove such a claim..."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Tuesday, October 12, 2010",
      "rating": 4,
      "text": "I've been very patient when it comes to reviewing ELP albums. The reason for that is the fact that the first four albums strike a nostalgic chord with me that will probably effect my judgment. But after thinking about it I've decided to give it a go. I just what you all to know that you should take my ELP-reviews with a grain of salt since they're written by a fan.ELP albums have never, in my opinion, really been group efforts. That was until I discovered Emerson, Lake & Palmer's debut album. Here, I can actually hear Greg Lake's contributions on every track while still getting my regular dosage of Keith Emerson and Carl Palmer. It's clear that the band has a bunch of clever ideas, but those ideas wouldn't all be implemented with the same greatness as on their later releases. In other words, this album gives us a great group effort but lacks the maturity.Only the album openerThe Barbarianis great enough to be comparable with the band's later work.Take A Pebbledefinitely comes close to greatness but falls due to the very loose middle section of the track. My recommendation is to start withTarkus,Pictures At An ExhibitionandTrilogyand later work your way to this release and maybe evenBrain Salad Surgery. Although, if you ask me, you can probably skip everything that came afterTrilogyall together since it's all just an ego trip between the band members.The band's debut album is a good example of what these three individuals might have achieved if only they continued to collaborate as a band. Instead they only fell further apart from each other with each consecutive release. This, in no way, implies that they still couldn't write great music, even though it was never again the band effort that can be observed here.***** star songs: The Barbarian (4:33)**** star songs: Take A Pebble (12:34) Knife-Edge (5:08 The Three Fates (7:45) Tank (6:52) Lucky Man (4:36)"
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Monday, November 29, 2010",
      "rating": 5,
      "text": "This was, for me, a revolutionary album, very much in the vein of KING CRIMSON's Court of the Crimson King. That keyboards could be that expressive, and that dominant was totally revelatory to me. I had never before heard \"rock\" classical music--though with a jazzy flavor to it. Though I had not yet heard Aaron Copeland or Bach's compositions for church organ, I felt as though I were being introduced to the masters of old--Keith EMERSON provided a kind of bridge to classical music (which I would dive into whole-heartedly in the 1980s). 1. \"The Barbarian\" (4:33) is such an introductory bridge for me. (9/10)2. \"Take a Pebble\" (12:34) has some of the most gorgeous vocal and bass melodies in all music. To think that Greg LAKE could even conceive of singing his beautiful lines over such odd musical background is still astounding to me. (10/10)3. \"Knife Edge\" (5:08) is powerful for both keyboards and Greg LAKE's vocal. (Not much of a fan of the drumming here.) (8/10)The three-part keyboard extravaganza, 4. \"The Three Fates\" (7:45) starts off so majestic and pompously with the awesome church organ, then goes into the amazing piano part--which, incidentally, feels as if it has three distinct personalities--before moving into the trio section. Awesome ride! (Pre-dating RENAISSANCE's comparable \"Trip to the Fair\" by a few years.) (10/10)5. \"Tank\" (6:52). The world of electronic keyboards was so new to me, and this album had a lot to do with introducing me to the possibilities of said instruments. BTW, this song puts on display Carl PALMER's best drumming on the album. (Finally!) (9/10)6 \"Lucky Man\" (4:36) is to this day probably my favorite all-time prog radio \"hit\" (rivalled only by FOCUS' \"Hocus Pocus\"). As much hate as it gets around here I find myself mystified: It is such a cool, gorgeous song with one of the greatest instrumental exits EVER! Prog's \"Man of La Mancha\"! (10/10)I did not like this album--or ELP--so much when I first heard it but each and every successive listen to this album has helped to win me over and caused the band (and album) to grow in my esteem. I now feel that this eponymous debut album is one of the most important, foundational albums of all of progressive rock music. Amazing, start to finish!"
    },
    {
      "reviewer": "colorofmoney91",
      "date": "Posted Monday, April 11, 2011",
      "rating": 2,
      "text": "This ELP self-titled debut album is probably the only one of their albums that I can slightly enjoy all the way though, and this is only because they haven't starting playing in the pretentious style that took over on their later releases. The playing here is fluid and the songwriting is barely existent, although it stands that I really don't like ELP's music and this review is only for review's sake.\"The Barbarian\" is heavy rock inspired prog jam that is quite energetic and fun to listen to. \"Take a Pebble\" is the first track that I had ever heard of ELP and it serves as a terrific introduction to the band. It's a calm track that starts with Emerson strumming the strings inside of his piano, creating a very nice atmosphere that is instantly memorable and gripping. The vocals are also strong here. The song goes through various passages that seem to be loosely strung together, but manages to come off as playful rather than overly serious. \"Knife-edge\" is another rock inspired song with a very solid bass line and strong keyboards. This track comes across as a bit too goofy for me, and I personally never enjoyed it. Most of \"The Three Fates\" is a jazzy and modern classical inspired piano solo, but the other instruments later come in at the end and manage to make quite a bit of noise. This only stands out as being the only incessantly noisy track. \"Tank\" is a noisy and random track that most people seem to enjoy, but I also find this track to be forgettable and incessantly noisy. After all the noise, \"Lucky Man\" is a classic acoustic ballad that is very accessible. It still isn't a song that I enjoy, but it is beautiful and a great break from all the madness that came before it.I recommend this to people who already know they like ELP, which I am not. In fact, I know that I don't like ELP. However, this is one of their best albums, and I recommend this as an introduction to the band."
    },
    {
      "reviewer": "friso",
      "date": "Posted Friday, May 20, 2011",
      "rating": 4,
      "text": "Emerson Lake & Palmer - st (1970)To be honest with you, listening to this album was a relief for me. I'm not that good at liking common 'masterpieces' and this ELP debut was actually quite extraordinary, especially when you place it on a time-line of progressive rock.Keith Emerson (the Nice), Greg Lake (King Crimson) and Carl Palmer (Arthur Brown, Atomic Rooster) formed this first super-group of progressive rock. With their music they changed the way progressive rock was perceived. From now on progressive rock didn't need to be music with strange atmospheres and innovative ideas, but the extreme technicality would ad both ego and some playfulness to the mix. ELP didn't embark on the spacey atmospheric passages, but they would play fast, thick, right in your face instrumental passages without to much delays and reverb.The recording quality & sound of this album is stunning for 1970. All instruments sound warm, clear and have a good place in the musical land-scape. Later on dozens of Italian symphonic progressive rock groups would try to get this sound again, and frankly, none ever did except for Banco (debatable topic though). Most of the time ELP has a bass, drums and two keyboards or a piano. The arrangements are exciting and bombastic, with many organ and moog sounds (with amazing bass) that would make you forget a band ever needed a guitar player. Though this album has many moments of great intelligent en technical compositions, the other big element of his album is showing of musicianship. Luckily there's also some good song-writing and I must say I even like the ending ballad 'Lucky Man'. I still think Greg Lake is one of the best vocalists of prog, though I don't like many ELP recordings.Conclusion. This is the best ELP album for me, and it's good to know it still sounds fresh after more then forty years. Though this album features all weaknesses of the band, it is dominated by the quality of the compositions and the song-writing. After this only side one of Tarkus would be of this quality IMHO. Four stars for this one, but I can recommend it to every-one on this site."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Friday, June 24, 2011",
      "rating": 4,
      "text": "Although I can't say I got on too well with their later directions, I do like ELP's debut. Not uncritically - although the performances are undeniably good, they don't reach the stratosphere, but then again they don't reach the depths of later work either. I would say, in fact, that if you want *consistency*, this is the best ELP album of them all - later albums would be much more up-and-down in terms of quality.The album starts with some rocked-out classics in the form of The Barbarian, with a down and dirty performance that proves that this supergroup can get heavy if it wants to (though it's no Atomic Rooster). Other highlights include Take a Pebble, in which the group proves that it can bring jazz into its formula as well as classical music, and the closing Lucky Man which binds a Moog solo to a folk-rock number with surprising success.I guess part of the reason I can't quite extend my rating to five stars is that the album feels directionless. Musically, the group are very diverse, but the consequence of that is that the tracks don't seem to flow together very well and it's hard to say what the band's identity or sound at this point really is - or even if it does have an identity at all beyond being a vehicle for the three named talents to strut their stuff. They would succeed in forging a unique sound for themselves in the title track of Tarkus... but that album, and subsequent ones, would continue to have the problem that the three musical personalities in the group just never quite gelled, resulting in all of their work having a similar lack of focus to this one. That said, even if I find their later work patchy, still *this* album turns me on. (See what I did there?) Four stars."
    },
    {
      "reviewer": "Prog Sothoth",
      "date": "Posted Wednesday, November 16, 2011",
      "rating": 4,
      "text": "Reviewing albums from 1970 on a progressive rock site without mentioning Emerson Lake & Palmers debut would be beyond foolish, so here it is. Concerning 1970, I actually would consider this the most important prog album of the year. Plenty of the major forces in prog were developing their sound and even releasing some fantastic albums, but most of those bands' seminal releases would not occur until the following few years. However, ELP did not waste their time churning out one of their highest regarded works from the get-go, packaged in an album cover that comes across like The Moody Blues in an uncharacteristically morbid and bleak mood.\"The Barbarian\" starts off with a mean distorted bass before the keyboards kick in and it is soon realized that this is pure keyboard driven prog rock without things like loud guitars getting in the way. Still, this does have some power and 'oomph' to it, and the song does not feel incomplete despite lacking ripping guitar solos and vocals.\"Take A Pebble\" is an interesting track with its gorgeous verses and long break in the middle with a bit of a hoedown tossed in. Odd, but strangely atmospheric. \"Knife-Edge\" has a bit of that Atomic Rooster sound to it and actually feels like all of the performers' previous bands contributed equal levels of influence to the overall sound of the song.\"The Three Fates\" is Emerson's \"LOOK AT ME\" song, and for what it's worth, I pretty much dig the 2nd part featuring the solo piano quite a bit. \"Tank\" is Palmer's stab at glory, and it starts off cool, but drum solos over a minute long on studio albums eventually bore me. There were a lot of these drum solos being pumped out on albums back then. \"Lucky Man\" gets slagged a bit, but Lake's contribution to this album remains one of their best known tracks, and is actually the best track on side two. Catchy chorus, friendly guitar solo, folksy vibe that was in vogue at the time. Yet there's still that wild moog attack at the tune's end that brings back the prog and keeps things interesting.ELP have never released a brilliant album in my opinion, but as an important one, this certainly deserves lots of regards. It sort of set the bar up a bit earlier than most in for the prog scene, and remains highly influential."
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Wednesday, March 14, 2012",
      "rating": 5,
      "text": "I must confess that I was never a big fan of ELP. Too much keyboards noodling and too little guitar, I guess. However, I cannot deny their importance for rock in general and the prog world in particular. They were truly grounbreakers that merged classical, rock and jazz into a very new kind of sound that defined the 70�s. There were groups that worked those styles before (among them Keith Emerson�s own band prior to ELP, The Nice), but not in such scale of talent and style. Emerson was right when he finished The Nice and looked for the right line up to fit his ideas. So while he and drummer Carl Palmer were technical and trained,. bassist, guitarrist and vocalist Greg Lake (from King Crimson) balanced the sound with nice acoustic songs and warm vocals. This chemistry remains unsurpassed.I heard their debut album many years ago and I bought it again a few weeks ago. And I was astonished by how good it was. I mean, I didn�t exactly turned into a hardcore fan of them, but it is clear to anyone that their first work was a milestone in rock music when it was released in 1970. They impressed many with their instrumental virtuosity, but they also came with great songs to match, even for radio play. Several of ELP�s more celebrated stuff was introduced here: Take a Pebble, Knife Edge, Tank, Lucky Man. Besides we have other fine epics like the opener The Barbarian and the surprisingly varied suite The Three Fates (I loved the caribbean rhythms included on one of the parts, with a great percussion work done by Palmer). The CD is incredibly well balanced and nothing is really overdone here (like it surely would in years to come). Such an achievement for such young band.It had a good production for the time and the new remasterd edition made it quite perfect.Like King Crimson�s debut, ELP defined the coming of age of an era with its first release, a great promise that was totally fulfilled (all the future excesses included). This CD is not only a great record. It is, along Yes Close to The Edge, Genesis Foxtrot and the aforementioned Crinson�s first, the quintessential work of a new time in music, no less. A classic, essential masterpiece fo progressive rock. Five stars with honours."
    },
    {
      "reviewer": "octopus-4",
      "date": "Posted Friday, May 4, 2012",
      "rating": 5,
      "text": "The debut album of three non-debutants as this is one of the first supergroups in the prog history. Keith Emerson comes from the Nice and the first track of this album \"The Barbarian\" clearly demonstrates it \"from the beginning\". Carl Palmer is the powerful drummer from Atomic Rooster and Gre Lake is the man behind the Crimson's masterpiece 21st Century Schizoid Man.Can you expect a masterpiece from this band?Yes, of course.Reviewing an album of this kind is very hard because finding something that hasn't already been said by somebody else is very uneasy and unlikely to happen.However after the very \"nice\" opener, Greg Lake gifts us of his fantastic voice on \"Take A Pebble\". I'm one of those who think that Lake is one of the greatest singers ever. I think that his voice is the essence of how a prog vocalist should sound and this long song is for me the best of the album and one of the absolutely best songs released by ELP. It contains all the things which have made this band great: a great piano solo, the non-invasive but effective drums and a lot of ideas. Emerson harping directly on the strings of an open grandpiano while Lake plays a 12 strings guitar in an oriental performance that grows into a country-blues piece. An epic track which pays back for the whole album.\"Knife Edge\"'s bass line is something that's fixed in my mind since from the 70s. Sometimes these few notes pop up to my mind unexpectedly. Emerson's keyboards has here that sound that will forever be the band's trademark, so what could I ask more to a five minutes song?Let's switch to Side B (I have the vinyl, of course). The church organ which opens the mini suite \"The Three Fates (Atropos, Clotho and Lachesis)\" is pompous and dark as a church organ only can be and I think this is the track which gave to some Italian directors the idea of hiring Emerson for horror movie's soundtracks. After the initial organ part, the rest of the track is mainly based on piano as Emerson only can play it. I don't want to enter in the polemics about who's the best player between Emerson and Wakeman. I like both and they are just similar but different. This is another track that I love.\"Tank\" became famous in my country because it was used as end title track of a weekly TV magazine. It started from the last minutes of the drum solo until the end, but it was the version taken from Works. Here it's still one of the most famous ELP songs and on the album is followed by the radio-friendly one: Lucky Man.I loved that song but as all the radio-friendly things, I've got a bit tired of it during the years. What I still love of this song is the final keyboard riff that's not so much radio-friendly.The only \"bad\" thing of this album is the presence of very low volume parts, specially on take A Pebble (but even the following albums will have silences and low volume moments). This is a problem when you pretend to listen to the album while driving. It requires headphones and finding the right way to listen to this album was not easy neither cheap in the early 70s.However this is a masterpiece and I still listen to this ELP album (and not to this one only) even after 40 years."
    },
    {
      "reviewer": "GruvanDahlman",
      "date": "Posted Friday, March 7, 2014",
      "rating": 4,
      "text": "For me ELP was always one of the most inconsistent and uneven of the great prog bands of the 70's. Their albums seemed marred and at times unfocused, blending greatness with fillers. Often these fillers appear to have been great fun recording in the studio. A great laugh for all involved but less fun for people like me, having to bear through it or skipping songs, thus breaking the spell.Their first album, however, is interesting in many ways. First off it is sort of crude and raw, bringing forth a musical concoction based on distorted organ, heavy bass and thumping drums. One can easily see how the early phases of prog developed through the adaptation of heavy and hard rock of the late 60's, paving the way for ever more sophistication further into the decade.Secondly I find the first album to be the most consistent. The presence of classical influences are there but first and foremost it is an album of heavy, menacing and powerful prog performed on organ, bass and drums. Magnificent! Especially since I am a great fan of the hammond organ.The first track, The barbarian, hits you right in the face with it's distorted bass and rolls you over, feeling like you've been hit by a train. The second track is a marvellous, multi-part piece called Take a pebble. It seems to have been a live favorite and I can understand why. Very atmospheric and provides a great example of early prog's ability and willingness to expand on musical structure. Knife-edge is similar to The barbarian. It is a hard rock piece. Very heavy and certainly one of my favorites. The three fates is the track where ELP's fascination for classical music comes to the fore. It is a complex, daring piece which opens up with a majestic organ. The track Tank showcases Carl Palmer's amazing drum skills. The album closes with the ballad Lucky man. A nice song, deliverd with emotion and beauty.All in all ELP's first album is a starting point for what is to come later on. It is quite raw but not without sophistication and wealth of music. On this album the focus and concistency is never broken. The magic is there throughout, making it, simply, their best album, although not consisting of their all time best tracks, like Tarkus for instance. A great place to start and certainly a great way to end the day."
    },
    {
      "reviewer": "TCat",
      "date": "Posted Sunday, January 11, 2015",
      "rating": 5,
      "text": "This is the debut album from this supergroup of stellar musicians. This was to become the outlet for Keith Emerson, Greg Lake and Carl Palmer to showcase their musicianship. But, at it's peak, it was more than anything a spotlight for Emerson's spectacular keyboard playing and composing. As you listen to this album, which has been reviewed plenty of times here already, you will notice that everyone gets to shine, but the balance of the spotlight is tilted quite heavily to Emerson, which is fine. His talent has inspired countless musicians and has influenced many people to explore other avenues of music that they normally would not have explored.This album is amazing, especially for a debut album. There is quite a mix of classically inspired rock. The mix of sounds you get here should not be too surprising because of the talent. You start off with \"The Barbarian\" with the full band doing their take on a Bartok composition from 1911; \"Allegro Barbaro\". After this somewhat bombastic instrumental where each band member shows off their talent, an epic track named \"Take a Pebble\" follows. This track has vocals from the amazing voice of Greg Lake. The sections where there is singing is performed by full band, but the very long instrumental break is surprisingly acoustic piano through most of it with a short break for an acoustic guitar solo and a return to the piano with drums joining in eventually. This is a very nice surprise because the sound is amazing and anyone who knows keyboards will be blown away by Emerson's playing. \"Knife Edge\" is another harder edged song again with full band and vocals and is very progressive. It is based on the first movement of Leo? Jan�ček's Sinfonietta. with a organ solo during the instrumental break that follows Bach's Allamande from the French Suite in D minor.Following this you get two long instrumentals. The first being a suite called \"The Three Fates\" which is definitely another chance for Emerson to show off, of which I have no complaint. This is one of my favorite ELP tracks and probably one of the least known. You get a very cool organ solo on the first movement, and nice piano solo on the 2nd movement, and then the piano gets joined by drums and bass for the third. This is a very progressive number that always gets my heart pounding. This also demonstrates that Emerson is not only an amazing player, but an outstanding composer also. Next is \"Tank\" which is a full band instrumental which spotlights Carl Palmer this time. This is another excellent instrumental with a completely different feel from the last track and a very excellent drum solo in the middle which is not stretched out to a never-ending length. Palmer shares the spotlight with Emerson not only with the instruments but with the composition also. Great stuff. The album ends with the popular Lake folk rock ballad \"Lucky Man\" which features his vocals and guitar and ends with Emerson on synth that was overdubbed on the end so that everyone would know (on the radio) that this is not a Lake solo. Good song, but not very indicative of the rest of their sound and I'm sure a lot of people were surprised when they heard the song on the radio, bought the album and heard something they were not expecting. But it worked for the band and made them hugely popular and that popularity continued for several years.Anyway, this is an excellent album that introduced a lot of people to the challenging music of progressive rock. In that way, it is essential in that it helped bring a lot of rock lovers around to becoming interested in classical music and a more sophisticated style of popular music. The importance of this album in rock music can not be denied. ELP would go on to produce some other great albums and some trashy ones too, but their influence in progressive and popular music is still felt today. Essential album. 5 stars."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Monday, September 7, 2015",
      "rating": 5,
      "text": "Review N� 15This is my second review of an Emerson, Lake & Palmer's album. The first was their debut live album 'Welcome Back My Friends To The Show That Never Ends'. I chose review their eponymous debut studio album 'Emerson, Lake & Palmer', released in 1970, as my first studio review of them, because is my favourite studio work from the group.The three band members came from three very well established bands, before they joined together. All of them were very talented musicians and very experienced too. Greg Lake came from a band that needs no introduction. He came from King Crimson and was one of their founder members. King Crimson are simply and undoubtedly, one of the best and most innovative progressive bands ever. He took part on their two first studio albums, 'In The Court Of The Crimson King' and 'In The Wake Of Poseidon'. Carl Palmer came from Atomic Rooster and he was also one of their founder members. Atomic Rooster is a British heavy progressive band. He has only participated on their debut eponymous studio album 'Atomic Rooster'. Finally, Keith Emerson came from The Nice and he was one of their founder members too. The Nice was a British symphonic progressive band who has combined classical, jazz, blues and rock music. Their music became the seeds of what will be the sound of Emerson, Lake & Palmer. He took part on all their four studio albums 'The Thoughts Of Emerlist Davjack', 'Ars Longa Vita Brevis', 'The Nice' and 'Elegy'.Curiously, Emerson, Lake & Palmer could have been called HELP or Hendrix, Emerson, Lake & Palmer, if Jimi Hendrix had adhered to the project. It seems that Hendrix was tired of his own band and wanted to try something different and new. So supposedly, he expressed an interest in playing with them. However, because of scheduling conflicts, such idea couldn't be immediately held, and unfortunately, Hendrix died shortly after. However, the history was never confirmed. It even was contradicted by Lake, saying that it was just a rumour created by the press.The front cover of the album depicts a fluttering white bird with a human ear in the bottom left corner. It was painted by Nic Dartnell and it seems that originally was for the Spirit, an American proto-prog band. It also seems that the figure man on the left of the cover is the Spirit drummer, Ed Cassidy. However, the artist denied, in an interview.'Emerson, Lake & Palmer' has six tracks. The first track 'Barbarian', despite being attributed to the trio, is a musical arrangement of a Bela Bartok's piano piece, named 'Allegro Barbaro'. Although, the original piece be only for piano, the band rearranged the song for organ, bass and drums. This is a great aggressive track with a hard rock influence. The second track 'Take A Pebble' is a beautiful ballad by Lake, and is the lengthiest track on the album. This is a magnificent song with the powerful vocals of Lake. His singing is simply terrific, with the final line of the verses building on the legacy of King Crimson's 'Epitaph', which sounds even better. The third track 'Knife-Edge' is based on the first movement of Leos Janacek's 'Sinfonietta'. This is another great piece of music with a great showcase by all the three band members, with particular emphasis to the great bass lines. The fourth track 'The Three Fates' is an Emerson's concept piece of music, about the meaning of life, god and evil. The suite is divided into three parts. 'Clotho', an organ solo recorded at the Royal Festival Hall, 'Lachesis', a piano solo and 'Atropos', a piano trio. This is technically an excellent piece of music that showcases the rare musical talents of Emerson. The fifth track 'Tank' contains a Carl Palmer's small and beautiful solo studio drumming. Basically, the piece showcases Palmer's unique drumming style and features one of the few drum solos on a studio album. It also marks the first appearance of the Emerson's famous Moog synthesizer. The sixth track 'Lucky Man' is a ballad written by Lake for acoustic guitar, when he was a schoolboy. However, at the beginning, the song wasn't well received by Emerson and Palmer. It's a song with acoustic guitar, beautiful singing and a great synthesizer solo towards the end. It's, for me, one of the best songs ever written by Lake, and it became as one of the band's most commercial and accessible tracks.Conclusion: 'Emerson, Lake & Palmer' is an excellent album, very fluent and very beautiful, with moody keyboards, memorable guitar lines, immaculate drumming, and above all, a great vocal work by Lake. It also still features very strong compositions and a magnificent and inspired musicianship. Emerson takes the band's music a little too strongly in his own hands on many occasions on the album. His virtuoso skills have become the defining factor on the band's music. However, fantastic musicians such as Lake and Palmer deserve certainly also a more prominent spot. Sincerely, and in my humble opinion, this album is with 'Brain Salad Surgery' the two best studio works from the group, only supplanted by their triple live album 'Welcome back My Friends To The Show That Never Ends'.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "ALotOfBottle",
      "date": "Posted Wednesday, February 17, 2016",
      "rating": 4,
      "text": "Emerson Lake & Palmer was formed by a keyboardist Keith Emerson, who departed from The Nice, Greg Lake, a bass player of King Crimson and Carl Palmer, who previously had played with Atomic Rooster and The Crazy World Of Arthur Brown. Needless to say, ELP have become synonymous with the term \"prog rock\" being one of the best known bands in the genre. What really is a proof of the \"chemistry\" between the musicians of the supergroup is that they released their debut slightly over half a year after meeting. This was intended as a collaborative recording session work, but ELP couldn't part their ways with just that. So, that's how the band was formed.Emerson Lake & Palmer have a distinctive style of their own that blends jazz approach to classical music. This is best visible on their variations on themes by Bela Bartok (\"Barbarian\") or Leos Janacek and J. S. Bach (both on \"Knife Edge\"). Their music is characterized by unbelievable amounts of vigour, energy as well as musical intelligence. The great late Keith Emerson is the wizard of keyboards and a phenomenal composer. Greg Lake's unmistakable tear-bringing vocals has become one of audience's favorites. In addition, Lake is a proficient bassist capable of moody grooves. Carl Palmer is an excellent drummer with great playing dynamics. Enough said, the musicianship of this debut album is outstanding.Emerson Lake & Palmerconsists of six tracks. The band seems to have organized the time perfectly. This work goes from English renaissance folk ballads like \"Lucky Man\", through Emerson's triple-movement suite \"Three Fates\" or jazzy improvisation over classical quotes on \"Knife Edge\" to almost proto-metal opening on \"Barbarian\". The variety is great, because it does not show the common inconsistence that many debuts have with too much of a variety. At times, the music loses itself and becomes a bit repetative and sterile, which is a shame.All in all, this is a classic prog album, so it's obviously a much needed addition to every collection of the genre's fan. This work majestically represents the early years of symphonic rock subgenre as well as progressive rock in general and despite being slightly flawed here and there, it is highly recommended, Many amazing and unforgettable moments!Four stars!"
    },
    {
      "reviewer": "Kempokid",
      "date": "Posted Sunday, March 17, 2019",
      "rating": 3,
      "text": "After an onslaught of Dream Theater reviews that honestly left me burnt out on everything to do with the band for the time being, I decided to just stop with them for the time being and move onto a band that I have extremely mixed opinions on, Emerson, Lake and Palmer. Overall, I find the band to have a very particular sound to them unlike much other prog at the time, with much more on the nose classical influence to the point of reimagining various classical pieces, an extreme focus on keyboards and drums, and an all around more energetic, chaotic, jam focused sound to them. Out of all the classic prog bands, this is easily one of the most pompous and excessive of them all, only issue being that it only works some of the time, an issue present through every one of their albums. Their debut is definitely their most restrained work by an extremely wide margin, but even here, there is still a lot of time dedicated to simply showing off the incredible talent of the band members, rather than on making enjoyable music. Both Keith Emerson and Carl Palmer are extremely skilled at their respective instruments, and Greg Lake is one of my favourite vocalists, but the music itself is quite a mixed bag, with a lot of it sounding like more work could have been done in order to polish things significantly.Despite the band largely providing its riffs and melody through the keyboards, The Barbarian kicks off the album with a sludgy guitar tone, before increasing in speed, starting off slowly before the beat evolves into a gallop. I love the way everything cuts out in order for the frenetic drumming and tense piano playing to come in, providing the mental image of being chased, at least to me. I love the intensity of this song, and it's without a doubt one of my favourite songs on the album, and is at the very least, what I'd consider to be the most perfect. Take A Pebble is a very different affair however, starting off very strongly, highly reminiscient of the earlier King Crimson ballads such as the first couple of minutes of Moonchild, with similarly amazing vocals and an overall powerful beauty to it. The issue here is that a lot of the middle instrumental section feels very unecessary, being quite dull with what I consider to be fairly unappealing country - blues section that feels as if it comes out of nowhere and lasts far too long. In a way, I guess I can compare it to Moonchild, both starting out excellently before devolving into pure boredom, with any magic the song contained being drained away. Knife Edge proves to fare far better, being a pleasant, bluesy song with much more restraint placed upon it, with nothing getting too out of hand, and some really great concepts explored, especially the baroque section, which is simply to die for. The song feels a bit stilted in placed, but is definitely enjoyable.The Three Fates feels like the polar opposite of Knife Edge, with it sounding like the band just decided to abandon all restraint and see how much punishment their instruments could take before they broke. What is created from this is a wonderfully chaotic instrumental that switches between mildly dull to downright awesome, the latter being much more prominent in the third movement of the song, and at the very least, it's simply more proof that Keith Emerson is incredible on his respecitve instruments (if it was somehow not already extremely obvious from everything else here), but once again, the song could have used a bit of trimming. Tank is definitely an interesting song, having some of the greatest instrumental interplay that the band has ever composed in my opinion, with an amazing driving energy behind it. The issue here is that once again, the excessive, pompous side of the band ends up getting the better of it in the form of a 2 minute drum solo which becomes almost painfully dull by the end. I honestly want a version of this song with a shortened version of the drum solo, as this would otherwise be one of my absolute favourite songs by the band if not for how much the energy is ruined. Lucky Man is definitely a beautiful track and one that I can quite easily see how it became the most popular, well known song by the band, as it's peacful, melodic, and absolutely beautiful. There is nowhere near the same amount of chaos and intensity as previous songs, but does close off in a way that sums up the whole album very well, with a poorly conceived moog solo that disrupts the beauty, although the song is still incredible despite this.Overall, while 5 of the 6 songs on this album are good overall (Take A Pebble, not so much), almost all of them are flawed in the same general way, with the exception of The Barbarian. Each of them could have used further editing and polishing to make for some really great listening, as the songs all have incredible potential in one way or another. As it stands though, while I do really enjoy listening to this album, I often end up becoming mildly irritated at the many flaws it has, which is definitely enough for me to knock this down to 3 stars. I'd highly recommend this album to those who enjoy heavily classical influenced music and also can get behind a lot of excess. This is definitely their most restrained album of their peak material, which is honestly a good thing in certain respects when looking at some of their later efforts where they allowed their pretentiousness to go unchecked.Best songs: The Barbarian, Knife Edge, Lucky ManWeakest songs: Take A PebbleVerdict: Highly technical, complex muwsic that has a habit of becoming too overtly complex for its own good. Songs can both have moments of genius, and moments of ill conceived noodling, but for the most part, it's an entertaining album overall, albeit very flawed in certain respects."
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Friday, July 26, 2019",
      "rating": 3,
      "text": "After finishing the Nice experience, Keith Emerson joins the great drummer Carl Palmer, the excellent singer and bassist Greg Lake, and founds Emerson, Lake & Palmer, a group that since the name highlights the three singularities of the artists who are part of it, and who there will be some three soloists playing together. Their first Lp, definitely one of the most important in the history of symphonic progressive rock, is qualitatively controversial, let's see why.1) \"The Barbarian\". First instrumental song inspired by Bartok's Allegro Barbaric, it starts as a heavy metal piece, then Emerson gives vent to his virtuosity, and Palmer tends to overdoing, then comes a piece played by the piano more adhering to Bartok's original, then the heavy metal sound returns for the ending, that is too pompous. Beautiful reimagining, never monotonous, just a little repetitive and bombastic in some passages. Rating 7.5/8.2) \"Take A Pebble\". Acoustic ballad written by Lake, with country inflections, where Lake sings up to 2'30''; then comes a long instrumental piece of very nice pastoral atmosphere, dictated by Lake's guitar; then at about 6'30' is Emerson's piano to lead, joined by Palmer's drums towards 8'30'. At that point the song becomes prolish and jazzy. Lake's voice returns at 11'20'' and restores balance. It's the best piece on the album, the one and only masterpiece. Rating 8.5.3) \"Knife-Edge\". Hard-rock song, with a good aggressive beginning, quotes Janacek with the organ in the instrumental part. Repetetive in the ending. Good but not excellent. Rating 7+.End of Side A.Side B begins with a mini-suite in three movements: \"The Three Fates\", written by Emerson. A solemn beginning with the organ, then the piano arrives and the song improves; finally Palmer arrives, the song becomes jazzy and pedantic, too percussive and obsessively repetitive. It's a piece with some good ideas, especially in the middle, but overall it is not quite successful, the listening isn't very pleasent. Rating 6.5.\"Tank\" is another instrumental track led by Emerson and Palmer, more unpredictable than the previous one but also more spoiled by the style exercises played by Palmer and Emerson: decidedly the weakest piece (euphemism) of the album, which with the last two tracks has dropped dramatically in quality after the promising start (the first two songs). Ratin 5+.With \"Lucky Man\" fortunately Lake brings the music back to more relaxed atmospheres. Simple and linear piece, less beautiful than the second, progressive only in the arrangement. Emerson buns in the ending. Rating 7+.Qualitatively, this Lp is a long way from the masterpiece: this album can keep up with the best of 1970 only for the first two pieces, then otherwise it's mediocre. Rating 7+ (average 7,08); Three poor stars. If there weren't the first two pieces, it would take two stars."
    },
    {
      "reviewer": "Mirakaze",
      "date": "Posted Monday, June 21, 2021",
      "rating": 5,
      "text": "One of the most defining exponents of progressive rock was Emerson, Lake & Palmer, a British supergroup from the 1970s known for its elaborate stage antics and its distinctive sound. In combining melodies and structures from classical music with rock & roll energy and instrumentation, they successfully brought together the European and North-American traditions of Western music and created a completely unique kind of music.Keith Emerson, the band's driving force who was nicknamed the Hendrix of the Hammond organ, originally rose to fame as keyboard player of The Nice, which can be seen as a \"proto-ELP\" of sorts. It was an innovative rock band characterized by the prevalence of Emerson's keyboards and his bizarre antics on stage. Live performances of The Nice contained lengthy, virtuosic organ solos in which Emerson would stab knives into his instrument to hold down notes, or jump over his organ to play Bach's Toccata & Fugue in D Minor? while standing behind his instrument.While The Nice's sound already contained a prototype of the rock/jazz/classical fusion that would become ELP's trademark, Emerson envisioned a far more ambitious project and left the band in 1970 before forming a new group with singer/guitarist Greg Lake and drummer Carl Palmer. Greg Lake had been an unknown until he provided lead vocals and bass guitar for King Crimson's widely acclaimed 1969 debut album In The Court Of The Crimson King. His unique voice contributed to the celestial atmosphere of that album and would become a staple in ELP's sound. Carl Palmer on the other hand had previously made a name for himself as drummer in Arthur Brown's band, and later in the hard rock band Atomic Rooster. Aside from his skills at beating the hell out of his drum kit, he would also become known for his extensive arsenal of additional percussion, including a set of timpanis, tubular bells, two giant gongs and a bell that he could play with his mouth. The trio quickly acquired a record contract and kick-started their career by firing three cannons on stage at the Isle Of Wight Festival in August, 1970. Two months later, they released their first, eponymous, album, with which they wanted to smack their audience in the face and show them all that they were capable of at once. The album starts off right away with an example of the kind of rock/classical fusion the band would become known for: \"The Barbarian\". It's a cover of B�la Bart�k's \"Allegro Barbaro\" which is a piano solo piece, but you know you're in for something of an entirely different nature when you first hear the ominous fuzzy bass notes that open the album. Bart�k's original piece has been transformed into a roaring apocalyptic tune, dominated by Emerson's furious organ barrage that more than compensates for the absence of guitars, before giving way to the relatively quiet piano-driven midsection, which follows the original more closely. But the tension keeps building up until the introduction is reprised again, and afterwards the song ends with a \"call-and-answer\" duel between the screaming organ and Palmer's impeccable drum blasts.Too rough for you? Don't worry, cause the boys try to create a number of different moods on this album, and the next song couldn't be more different from its predecessor. \"Take A Pebble\" starts off as a beautiful piano ballad on which Greg Lake gets to shine with his heavenly vocals. However, the song is extended to no less than twelve minutes with some acoustic guitar plucking by Lake and a prolonged piano improvisation from Emerson. This might be one of the best showcases of Emerson's amazing keyboard talent: for several minutes, he plays the same eight-note ostinato with his left hand while playing masterful licks with his right hand, seamlessly varying between classically influenced chops and typically jazzy note sequences.\"Knife-Edge\" is much more straight-forward, as it actually has a verse-chorus-verse-chorus-bridge-chorus structure (more or less). The instrumentation is also much closer to conventional rock music, despite the fact that Emerson's organ is once again the dominant instrument. The main melody is borrowed from Jan�ček's Sinfonietta, but it's presented in such a way that it becomes its own thing entirely. It rocks!Now, while the first three tracks perfectly capture the trio's strength as a group, the next three tracks are rather meant to display the individual talents of each musician. If you're an Emerson fan, you're in luck because he's the only band member who's present on the first two parts of \"The Three Fates\". This starts off as a purely classical composition, beginning with an introduction on organ before moving to another beautiful piano passage, less ethereal than the one on \"Take A Pebble\", but more complex and engaging. While the piece shows influence from composers such as Chopin and Ravel, Emerson refrains from directly quoting other compositions, plus he again incorporates chromatic jazz scales to avoid it sounding too derivative. Then, in the final part, Lake and Palmer finally join in to bring the piece to a chaotic ending.\"Tank\" puts Palmer in the spotlight, but it's sadly not as interesting as what came before. The focus of the song is his drum solo, which he uses in part to show off his aforementioned percussion set, but for the most part it's just an erratic collection of kicks and snares without much rhyme or reason. The song was mainly meant for live performances where the effect could indeed be impressive, and its inclusion on this album would be rather pointless if it weren't for the catchy, jazzy clavinet and synth solos that bookend it and turn it into a memorable composition in its own right.Finally, \"Lucky Man\" is an acoustic folksy song written by Lake when he was twelve years old. It's probably the most normal song on the album. Emerson doesn't show up at all until the last minute when he throws in a solo with the undiluted square wave oscillator of his newly acquired Moog Synthesizer. It doesn't fit with the rest of the song at all but it gives a pretty hilarious effect. \"Lucky Man\" was the band's first single and its most well-known song to this day, which is unfortunate because it does not represent the band's style very well. I even happened to hear it on the radio the day after Keith Emerson's death in 2016, and the station was nice enough to cut out the synth solo in its entirety, thus completely removing his contribution to the song. Maybe it was meant to be symbolic?...In all, the album as a whole feels a little unfocused, but the individual songs are just so strong. All of these weird rhythms and song structures will probably take some time to get used to, and I realize that many may shake their head at the prospect of listening to a twelve-minute song (look out, by the way: \"Take A Pebble\" is far from the longest track ELP ever recorded?), but if you allow it to sink in you can't help but be enthralled by it in the end. At the very least you have to acknowledge the talent and the ambition of the musicians and songwriters at work."
    },
    {
      "reviewer": "A Crimson Mellotron",
      "date": "Posted Thursday, July 22, 2021",
      "rating": 4,
      "text": "'Emerson, Lake & Palmer' was certainly the start of something beautiful. The newly-formed prog supergroup, combining the forces of Greg Lake from King Crimson, Keith Emerson from The Nice and Carl Palmer from Atomic Rooster, was set to champion the up-and-coming genre with their adventurous sounds and the classical crossover direction that was strongly influenced by their keyboard maestro. This first album by the trio was released in November of 1970 on the Island label, and was produced by their own Greg Lake.At this point, this is a seriously important album both for the band, and for the whole movement, massively influential and groundbreaking, the insane playing of Keith Emerson was what truly sets ELP apart from many of their peers. Writing rock arrangements for classical pieces, amongst some hard rock-influenced numbers, and occasional acoustic moments, the band already displayed an original and recognizable sound with their very first release.Some absolutely fantastic compositions on this self-titled debut, amongst them we have to mention the opening track 'The Barbarian', based on Bela Bartok's 'Allegro barbaro' - a beautiful and energetic rendition by the band, with everyone playing masterfully, the haunting 'Knife-Edge', that is the band's first tread on some hard rock ground, with the prevailing manic Hammond organ, and the enormous and menacing instrumental 'The Three Fates' - this is absolutely Emerson going crazy and displaying his full potential on the keys. 'Take a Pebble' is another very good composition, maybe a bit aloof in the middle section, eventually slightly prolonged, but nonetheless memorable and touching. 'Lucky Man' has to be one of the all-time most recognizable songs of ELP, a highlight of Greg Lake's charming writing. 'Tank', however, has some pretty ridiculous sounds that have hardly aged well; it must be noted though, that it is a mood that is often copied by other bands, some in the 80s and some 21st century collectives.All in all, this record is extremely influential, very menacing, and pretty impressive. It is hardly, however, a perfect album. It has its wacky moments, which you sometimes get with prog rock, but it also has some of the most excellent material that this musical genre has ever offered. The artwork is iconic, the band are playing their hearts out, and all this contributes to making Emerson, Lake & Palmer's self-titled debut a must-listen!"
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Wednesday, July 5, 2023",
      "rating": 4,
      "text": "Taking modern classical music as their main source of inspiration and adding elements and nuances of their own, Emerson, Lake & Palmer debut with a solid album, with the trio's surnames as title, backed by their previous successful experiences (Greg Lake's participation as singer and bassist in the fundamental \"In the Court of the Crimson King\" by King Crimson in 1969 is very notorious).Virtuosos almost on the verge of a nervous breakdown, it is, however, the brilliant multi-keyboardist Keith Emerson the main protagonist of most of the pieces, both in the adaptations of classical music (the instrumental and over- saturated \"The Barbarian\" and the demanding \"Knife-Edge\"), as well as in those of their own label (the extensive and restful \"Take a Pebble\", surely on the podium of the best of the album), or the also instrumental and jazzy \"The Three Fates\" and \"Tank\", in both cases with the impeccable percussion of the remarkable Carl Palmer.The mole of the album was exposed when Lake, with his grave and serene tone of voice, describes an unfortunate story in the imperishable and beautiful ballad \"Lucky Man\". Created by the singer and bassist in his early teens and included at the last minute on the album, it unexpectedly became for EL&P one of their most representative songs, and the moog at the end of the song, an Emerson improvisation that remained as is after only one take, in one of the most celebrated passages of their discography.Emerson, Lake &Palmer developed their own particular style until becoming one of the great icons of the genre without any transitional albums, placing themselves at the top of the progressive Olympus with their 1970 album of the same name, something that they would confirm with their later works.Excellent4/4.5 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album45e3.html",
  "last_parsed": "2025-05-17T12:11:58.598122"
}