{
  "album_title": "COLOSSEUM LIVE",
  "artist_name": "Colosseum",
  "artist_page_link_local": "artista0ab.html?id=784",
  "year": 1971,
  "rating_value": 4.2,
  "rating_count": null,
  "review_count": null,
  "genre": "Jazz Rock/Fusion",
  "album_type": "live",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/784/cover_10221329122007.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Rope Ladder to the Moon",
      "duration": "9:43",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Walking in the Park",
      "duration": "8:21",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Skelington",
      "duration": "14:52",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Tanglewood '63",
      "duration": "10:12",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Stormy Monday",
      "duration": "7:29",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Lost Angeles",
      "duration": "15:43",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "I Can't Live Without You",
      "duration": "7:28",
      "is_sub_track": false
    }
  ],
  "lineup": [
    {
      "musician": "Chris Farlowe",
      "instruments": "vocals"
    },
    {
      "musician": "Dave Greenslade",
      "instruments": "organ, vibraphone"
    },
    {
      "musician": "Mark Clarke",
      "instruments": "bass, vocals"
    },
    {
      "musician": "Dave \"Clem\" Clempson",
      "instruments": "guitar, vocals"
    },
    {
      "musician": "Dick Heckstall-Smith",
      "instruments": "soprano & tenor saxophones"
    },
    {
      "musician": "Jon Hiseman",
      "instruments": "drums, producer"
    }
  ],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Monday, February 2, 2004",
      "rating": 3,
      "text": "3,5 stars really!!!After a relatively disappointing third record (artistically only because it was still a strong seller), Colosseum hit the road, something it does best, really. Gerry Bron, their manager, was providing them still with as many gigs as humanly feasible by then, and the group was touring heavily Continental Europe and the States, but with no more recording contract, he created his own record label called Bronze Records (which Uriah Heep would soon join, too). One of the first things this new label did was issue a budget double live record of Colosseum. I believe still to this day, Colosseum is the only band to ever have had the first album of a record label TWICE.Hastily produced and packaged (with one of the blandest cover for a prog act in those years), this double live record contained just six extended tracks (the shortest being almost 8 minutes) but the overall length was anything but extraordinary since the Cd reissue boasts an 8 min bonus track. As I did with the previous album, I will review the Cd re-issue so the track sequence will not be the same as on the vinyl. Starting off in another rather interesting track from Jack Bruce and Pete Brown (after the cover of Theme From An Imaginary Western on the previous record) and a surprising rendition it is. Farlowe's impressive vocals bring much depth to Bruce's composition without altering its nature and the group is in fine form behind him, especially compared to the version that Clempson had sung on the North America-only The Grass Is Greener. Comes in a lenghty version of opening Colosseum track, the Graham Bond cover of Walking In The Park, quite beefed-up compared to their earlier studio version. I wish I had heard a live recording of the first line-up to compare with Farlowe is like a fish in water on tracks such as these. The 15 min Skellington (I would suppose a play on words with skeleton and Duke Ellington) is clearly not one of my favourite, as the standard blues-rock quickly goes nowhere and becomes an excuse for soloing past the first few verses Clempson clearly taking himself for Jimmy Page here. Farlowe is clearly on top of his game with this kind of track giving him plenty of room to move and yell like a madmanThe bonus track is rather surprisingly a Litherland-penned bluesish RnB song where Greenslade is finally heard, but the track is not a standout either, but certainly fits well in the fold of the rest of the album. Tanglewood 63 is one of those weird covers they chose to include in their shows, but I fail to see the exact reason why. I suppose this was pushed by Farlowe with DH-S, but it does no harm either. However, the use of the encore as Stormy Monday might just be the drop that overflows the bucket for the proghead, slowly losing patience on the Cd version (I remember a different track sequence on the vinyl) and it brings nothing new to the Allman Brothers Band version either.But the proghead's patience is finally rewarded as the major track of the second line-up of Colosseum is at hand. This song has been in my mind for almost thirty years, now as I first discovered it on a trip to California in the late 70's and this legendary city (LA) being actually a real nightmare and a hell-pit and us just wanting to get the hell away but not finding the exit easily (went-up north to Frisco and Seattle while the tape was playing endlessly this track in the car on the escape), so this song is extra special to me, and I must say that aside Valentyne Suite, this ranks as their best one. But the two tracks share a few similarities, mostly being written and dominated by Greenslade (even if Farlowe is simply awesome with his growling desperate vocals. Shivers down your spine guaranteed, and Clempson's epic guitar solo is also a textbook case of the paragon of taste. Compared to the early studio version (released on the odd album The Grass Is Greener) this track has a new life of its own here.After a few more months of touring and the fun and inspiration waning, Clem Clempson will leave the group with Hiseman's approval, but in a surprise move Hiseman will fold the band not even trying to find a replacement for him, citing today Colosseum a spent force. Most of the other musicians willingly recognize today that the end of the road was inevitable at that point. But for three years Colosseum had live a full life and all of the musos that played in the band are ready to declare that this was THE band they will remember. Knowing their respective career, I can agree with that, although Chris Farlowe will enjoy a superb stint with Atomic Rooster next. But this is another story."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Thursday, April 1, 2004",
      "rating": 4,
      "text": "Excellent live, the first one for this important \"Proto-progressive blues\" band from the UK, for which I remark the same considerations as for the studio album \"Valentine Suite\", already reviewed.Recommended!!"
    },
    {
      "reviewer": "Carl floyd fan",
      "date": "Posted Monday, April 19, 2004",
      "rating": 5,
      "text": "This cd is amazing! With all the energy these guys display, you can tell they really enjoy playing for the audience and with their fellow bandmates! The musicians are very talented, its easy to see and I can not believe Colosseum is so obscure and unknown! If you get a chance, pick this cd up, but I doubt you'll find this gem, so d/l it! You won't regret it!"
    },
    {
      "reviewer": "Trotsky",
      "date": "Posted Saturday, April 2, 2005",
      "rating": 3,
      "text": "I came to this album as a fan of the original Colosseum line-up (particularly its second album Valentyne Suite) yet never having heard a moment of the Farlowe/Clempson/Clarke incarnation's studio work. What I got was a mixed bag that left me exhilarated at times and deflated at others.For me, only 3 of the 7 tracks here (Rope Ladder To The Moon, Tanglewood 63 and Lost Angeles) meet my expectations of what Colosseum can acheive. The opening track sees some quality work on vibes from Dave Greenslade before he moves onto organ and totally dominates the song with some fantastic lead work. Clempson and Dick Heckstall-Smith weigh in towards the end and Farlowe's deep soulful voice suits this one.Tanglewood 63 is a jazz tour-de-force in which Heckstall-Smith's dazzling saxophone talents come to the work, although Greenslade nearly steals the show again with a classy solo. Despite the twee 60s pop vocal embellishments, this piece is generally potent jazz-rock of a different ilk from either Canterbury prog or post Bitches Brew fusion.The closer Lost Angeles is an exciting Greenslade driven piece in which maestro's organ once again comes to the fore. Reminiscent at times of ol' Dave's magnum opus Valentyne Suite, Lost Angeles sees Colosseum hit some dizzying heights of progressive interplay. I'm not sure if Farlowe's vocals are appropriate for the initial part of this excellent composition, but the rest of the band turn in some awesome playing. This multi-part epic effortlessly swings from heavy blues rock to breathy jazz excursions, from potent classically-influenced playing to a glorious moody vibraphone dominated vocal section in which Farlowe redeems himself. And my Lord, what a scorching outro they leave us with ... even if fans of Led Zeppelin's Babe I'm Gonna Leave You and/or Chicago's 25 or 6 to 4 will definitely feel it to be a rather familiar one though!On the downside, two other tunes ... the pulsating Walking In The Park and the blues standard Stormy Monday Blues ... are acceptable jazz-inflected blues jams, but when they are lumped together with the overlong blues-by-numbers tunes Skelington and I Can't Live Without You, one is left with the impression that the quality of the musicians on show cannot overcome the pedestrian nature of the material. I still struggle to believe that a band containing three musicians I admire as much as Greenslade, Heckstall-Smith and drummer Jon Hiseman could churn out such unadventurous music for so long, although I suppose I should have been prepared for this given the presence of Plenty Hard Luck, Debut and Backwater Blues on the first album and Butty's Blues on the second.Ultimately the disc's highlights make this an interesting document that ought to be heard by more people than just Colosseum fans, although this is not where I would recommend a novice start (yes ... that would be Valentyne Suite cropping up again!). ... 58% on the MPV scale"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Saturday, October 1, 2005",
      "rating": 5,
      "text": "A True Masterpiece Classic Prog Live Album!Well, please discount my rating on this album as much as you like and I don't mind about it at all. But let me tell you why I put this album as five star master piece album:1) Please put this live album in therightperspective.By the time it was released in 1971, Genesis was releasing \"Nursery Cryme\" after their successful release of \"Trespass\" the year before (1970). \"Close To The Edge\" by Yes was not born and the band was releasing \"The Yes Album\" with their new guitarist Steve Howe. King Crimson breakthrough the music industry with their ground breaking \"In The Court of The Crimson King\" (1969) followed with \"In the Wake of Poseidon\" (1970) and \"Lizard\" (1971). TrumpeterBill Chasejust released his band (CHASE) debut album which took the music industry by surprise through the dynamic trumpet dominated the brass rock music of Chase - the band that ended up tragically through plane crash. RIP Bill Chase and his friends. Your music will never die .. Other great bands like Chicago Transit Authority and Blood Sweat and Tears were emerging rapidly in the music industry. Camel had not recorded an album - even the industry had not recognized Camel at that time.Here we go .. Colosseum appeared in their own style following their success of their previous release \"Valentyne Suite\" through a live concert album featuring top notch musicians: Chris Farlowe (vocals), Dave Greenslade (organ, keyboards, vibraphone) of Greenslade band, Mark Clarke (bass, vocals), Dave \"Clem\" Clempson (guitar, vocals) of a classic rock band Humble Pie, Dick Heckstall-Smith (saxophone, sax Soprano, sax Tenor) and Jon Hiseman (drums, producer). The music is completely different with what's already in the market at that time. Yes, it's heavily influenced with blues and classic rock but the individual track featured here resembles the unique music of Colosseum. Those of you who like Chicago Transit Authority with their top notch musicians like Terry Kath, James Pankom, Robert Lamm; or Chase, would see some similarity. But the music is totally different.I just need to quote a statement by RoyalJelly @ 3:46:39 AM EST, 9/28/2005 in this site when he reviewed YES \"Fragile\": \"People on this site often tend to judge albums as if the entire progressive catalogue has always existed, but in understanding any kind of music, it's important to put yourself in the time frame of the music at the time it happened.\" I fully agree with him. If you put this perspective, you may agree with my five star rating on Colosseum Live album.2.) Typical live album would feature their previous recorded music.But it's not the case with this one as out of seven tracks featured here, only one track that represent their previous record: \"Walking In the Park\". Recorded at Manchester University and the Big Apple, Brighton, England in March, 1971. Originally released on Bronze that same year, it now includes the previously unissued 'I Can't Live Without You' as a bonus track, for a total of seven cuts. This album reminds me of \"Camel on The Road 1972\" because the band recorded the tracks they never recorded before. The only different was that Colosseum Live was issued at the same year when the thhe concert was performed.3.) The record itself is truly a gem - at least for me personally, especially considering the above two points I mention.The musicians performed the concert at their best. Even though it's not the case if you ask them directly. Jon Hiseman admitted that the concert was not really their best because there were many mistakes they made during the show - and the crowd did not notice it. Even when the band played Encore ..Stormy Monday, they did it on stage without any preparation - no rehearsal at all.Musically, the record represents a great composition of classic rock music combined with blues and jazz influence. The vocal is truly powerful. The use of organ (Hammond) and keyboards are really prevalent with soaring sounds. The solo is sometime accompanied with drum solo. The guitar work by dave Clempson is really stunning. Jon Hiseman is one of the best prog drummers, I would say. He delivers such a dynamic and inventive drum work. Sax is also a great one to observe throughout the stream of great music delivered here.SummaryIt's a highly recommended album that each individual prog lover should own. For my case, I knew this album very late after being informed by my progmate Nengah Rikon (pity me, he's much younger than me but he know more about the band than myself! - how dare I say myself as PROG REVIEWER?); also some suggestions from collaborators of this site: Erik and S Lang. Thanks mates! I just got the CD during the 11th ProgNite conducted by the Indonesian Progressive Society recently this month. I have spun this CD more than seven times and I still listening to it while am writing this view. Sorry for long review. This album deserves it ..Keep on proggin' ..!Oh by the way . forget about audio quality! It's irrelevant comparing sonic quality of this CD with today's digital recording technology.Progressively yours, GW."
    },
    {
      "reviewer": "Rivertree",
      "date": "Posted Tuesday, August 1, 2006",
      "rating": 4,
      "text": "Rope Ladder to Los Angeles ...Legendary and excellent live album from 1971. COLOSSEUM converts Blues songs into Jazz Rock in a singularly way. Somebody might remark that 'Valentyne Suite' is missing. Not important for me. The musicians are in good condition and enjoy their performance. The songs are differing to the studio version because they are more powerful and the band is jamming a lot. I saw them live during their reunion tour 1994 and it was also fabulous.The first song 'Rope ladder to the moon' is fantastic. The deep bluesy voice of Chris Farlowe is to remark. Mark Clarke reminds me at Jack Bruce. Dave Greenslade has a very unique and jazzy way to play the keys. 'Walking in the park' is a blues classic written by Graham Bond who played with Jon Hiseman for a while. The track contains an exciting vocal duel between Farlowe and ?? - I'm nor sure but it must be Mark Clarke. On 'Skelington' - not available on studio releases - Dave Clempson offers an outstanding solo and meets Jimi Hendrix in Woodstock - and Farlowe yodels - wow!Earthquake and smog are driving me out of town - oh, get me away from Los Angeles- it seems they don't have made good experiences with this american town. They compensate it musically with a special psychedelic touch. And so 'Lost Angeles' for me is absolutely the highlight - excellent vibraphone, Jon Hiseman in best form.'Colosseum Live' is an album which should have a place in every prog music collection. Only one thing is better - toseethem live ..."
    },
    {
      "reviewer": "octopus-4",
      "date": "Posted Wednesday, August 25, 2010",
      "rating": 5,
      "text": "When speaking of Progressive music, in general I prefer studio albums to lives because the studio work allows the artists to put as many details as they want in their music.This album is the exception. It's first of all a rock album. The quality of the sound is \"Fit for purpose\" in the sense that you know clearly that it's live music and this is the kind of sound that a rock live must have.Then if a heavy-blues subgenre existed this is how this could be called.\"Rope Ladder to The Moon\" is a great opener. It conquered me at the first spin. \"Walking in the Park\", alone, is enough to make it a five-stars album, but all the tracks are excellent: Skelington is another masterpiece of blues-rock. Just a note: if I'm not wrong, \"I Can't Live Without You\" wasn't on the vinyl version of the album and was added later to the CD edition. The original double album had two tracks on sides 1 and 3 and 1 track on side 2 and 4. This is the reason why this song is not of the same level of the other 6.Another remarkable thing is the sax work on Tanglewood 63, the most progressive track of the album. Finally, \"Lost Angeles\" has all the things that one can ask to an epic, even if \"only 15 minutes long.The internal sleeve of the vinyl edition was full of photos from the live session, and i remember at least one with Dick Heckstall Smith playing two saxes at the same time (he does it some times in this album) and is something that other than him I've seen done only by James Senese, but the whole lineup is skilled and talented.This album is son of its times. Something unrepeatable today, so other than an excellent album it's a document of how good blues-rock was sounding after the blues revival period. A great live full of great songs."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Friday, April 15, 2011",
      "rating": 4,
      "text": "This is a complete blast ! I must admit i'm a little partial to heavy Blues since back in the early eighties when I listened to early AEROSMITH, LED ZEPPELIN, FREE, CREAM etc. And this album brought those feeling all back to me.There's not too many bands on this site that are heavily influenced by the Blues but certainly early COLOSSEUM was one of those.The vocals of Chris Farlowe are over the top really, talk about passion.The guitar of Dave Clempson is what you might expect as he cops solo after solo. I love when these guys jam. And hey Dave Greenslade himself rips it up mostly on the organ but he does add piano and vibes.The drumming of Jon Hiseman is ever-present while bassist Mark Clark adds a lot to this rhythm section. What's unique about this style is the addition of the sax from Dick Heckstall-Smith. I was a big fan of \"Valentyne Suite\" and \"The Grass Is Greener\" and all this album did was make me an even bigger fan.\"Hope Ladder To The Moon\" sounds amazing to start as it builds with vocal expressions and more. It kicks in around a minute with vocals. Sax around 3 minutes when the vocals stop. It's the organ's turn after 4 minutes then the guitar starts to rip it up before 8 minutes then the vocals return. Kicking ass ! \"Walking In The Park\" opens with drums and guitar as organ, sax and vocal shouts follow.Vocals after 1 1/2 minutes and the organ leads when they stop. Sax after 3 minutes followed by guitar.Vocals are back before 5 minutes and he's singing with passion.Vocal scats follow then a big finish. \"Skelington\" opens with a an extended yell then the band kicks in with vocals in tow.The sax sounds good here. Some bluesy guitar 2 1/2 minutes in.This is great ! The guitar echoes 7 1/2 minutes in as he continues to solo. Sax after 8 minutes when the guitar solo stops.Vocals are back 9 1/2 minutes in. Some insane vocal expressions from 12 1/2 minutes to 14 minutes.\"Tanglewood\" has an interesting intro with sax and an almost Country vibe. Organ and vocal melodies join in. So good. Sax only 6 minutes in then it kicks back in at 8 minutes.Nice. \"Encore-Stormy Monday Blues\" is straight up Blues with vocals. Organ and sax lead after 4 minutes then guitar 5 minutes in. \"Lost Angeles\" is the 15 minute version. Haha. Organ to start as a beat joins in. Incredible sound here. It's building 2 minutes in then the vocals arrive after 3 minutes. Sax follows. It settles before 7 minutes with vocals.The guitar starts to solo before 9 minutes right through to almost the 15 minute mark. Hell yeah ! \"I Can't Live Without You\" opens with sax as drums then guitar join in.The bass throbs as the guitar solos over top. Vocals 1 1/2 minutes in then it settles with organ before 3 minutes.Vocals are back before 5 minutes. Sax and guitar lead late.4.5 stars for this live recording from 1971. I consider this a very special album."
    },
    {
      "reviewer": "ALotOfBottle",
      "date": "Posted Sunday, April 24, 2016",
      "rating": 4,
      "text": "Colosseum created a strange brew of their own, mixing jazz, blues, soul with progressive rock sensibilities in a very European way. After four studio releases, which enjoyed a relative success, the group released a live-cut double album named simplyColosseum Live. It was recorded Manchester University and the Big Apple in Brighton during the band'sDaughter Of Timetour.Colosseum Liveportrays an experienced group with incredible amounts of energy and vigour as well as on-stage know-how. Various jokes and modifications of lyrics are just a part of the act. This must have been a great show to be at! Dave Greenslade is at his best here with his unmistakeable jazz organ virtuosity. Dave \"Clem\" Clempson's screaming guitar rings out beautifully on his heavy blues rock solos, but also fits in well when a rhythm guitar role is needed. Chris Farlowe, only recently having joined the band, is the engine of the group with screaming jazzy vocals and many anecdotes in between songs. Dick Hechstall-Smith, the prominent figure of the English jazz scene adds incredible saxophone parts, sometimes playing two instruments at once, a bit like David Jackson of Van Der Graaf Generator. Jon Hiseman's drumming goes from light bebop parts to almost \"proto-metal\" gallops. Mark Clarke plays some great grooves as well as providing backing vocals, which are in great harmony with those of Farlowe and Clempson. All in all, Colosseum was made up of outstanding professional musicians.AlthoughColosseum Liveis a double album, it consists of just six tracks (plus one bonus track). These are always above seven minutes and are characterised by lengthy jams. Despite being largely driven by improvisation, the music has a feeling of being organised. \"Tanglewood '63\" is a great example of that. Starting with a charming saxophone intro, it turns into a jazzy jam, than introducing vocals and going through many different forms. \"Stormy Monday\", which is a classic blues number goes far beyond being a blues cliche with tempo changes. \"Lost Angeles\" is the track you are waiting for the whole album. Sort of based on their \"Valentyne Suite\", this song has many different sections, all very interesting and rewarding.To conclude,Colosseum Liveis a legendary live album. It could well be described as \"Colosseum in a nutshell\" with all of the band's most significant characteristics. Obviously, it belongs into every Colosseum fan's collection, but will make a great addition to every prog nut's assortment. A very accessible record and will be a great place to start for new Colosseum listeners. Four stars!"
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Tuesday, May 13, 2025",
      "rating": 4,
      "text": "Colosseum's boisterous prog-jazz-blues blend really shines in a live context, and whilst I wouldn't say this is enormously better than their top-grade studio albums (Valentyne Suite and Daughter of Time), it's a decent summation of the best aspects of their sound. It's particularly good that Chris Farlowe got this opportunity to further showcase his vocal contributions, because he'd only joined on Daughter of Time and it would have been a shame if that had been the only outing for him as frontman of the first incarnation of the group. Lost Angeles is a particular highlight, with Farlowe wringing genuine emotion out of the track as the band play like the world is ending (which for them, in a way, it kind of was)."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    },
    {
      "text": "Colosseum's boisterous prog-jazz-blues blend really shines in a live context, and whilst I wouldn't say this is enormously better than their top-grade studio albums (Valentyne Suite and Daughter of Time), it's a decent summation of the best aspects of their sound. It's particularly good that Chris Farlowe got this opportunity to further showcase his vocal contributions, because he'd only joined on Daughter of Time and it would have been a shame if that had been the only outing for him as frontman of the first incarnation of the group. Lost Angeles is a particular highlight, with Farlowe wringing genuine emotion out of the track as the band play like the world is ending (which for them, in a way, it kind of was). Warthur | 4 /5 | 2025-5-13",
      "reviewer": "Warthur",
      "date": "2025-5-13",
      "rating": 4
    }
  ],
  "source_file": "album8541.html",
  "last_parsed": "2025-05-18T11:15:48.179636"
}