{
  "album_title": "IN A GLASS HOUSE",
  "artist_name": "Gentle Giant",
  "artist_page_link_local": "artist5cee.html?id=118",
  "year": 1973,
  "rating_value": 4.35,
  "rating_count": null,
  "review_count": null,
  "genre": "Eclectic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/118/cover_22331617102008.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "The Runaway",
      "duration": "7:15",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "An Inmate's Lullaby",
      "duration": "4:40",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Way of Life",
      "duration": "7:52",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Experience",
      "duration": "7:50",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "A Reunion",
      "duration": "2:11",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "In a Glass House (8:26) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "The Runaway / Experience (live at Philipshalle in Dusseldorf 9/23/76)",
      "duration": "10:01",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "In a Glass House (live at Munsterlandhalle in Munster 4/5/74)",
      "duration": "9:49",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "The Runaway / Experience (live at Philipshalle in Dusseldorf 9/23/76)",
      "duration": "9:43",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "* concludes with a small musical collage identified (only on LPs) as \"Index\" including samples from each of the album's other songs",
      "duration": null,
      "is_sub_track": false
    }
  ],
  "lineup": [
    {
      "musician": "Gary Green",
      "instruments": "12-string (1,5,6), steel (6) & electric guitars, mandolin & tambourine (6), recorder (3)"
    },
    {
      "musician": "Kerry Minnear",
      "instruments": "piano, electric piano, Moog (1,3,6), Hammond (1,3,4,6), clavinet (1,4,6), thomas organ (3,4), clavichord (4), celesta (2), glockenspiel (1,2,4), marimba (1,2), vibes & timpani (2), cello (5), descant recorder (1,3), lead (1,3-6) & backing vocals"
    },
    {
      "musician": "Derek Shulman",
      "instruments": "alto & soprano saxophones (6), descant recorder (1), lead (1-4,6) & backing vocals"
    },
    {
      "musician": "Ray Shulman",
      "instruments": "bass, acoustic & electric violins, tambourine (4), acoustic guitar & backing vocals (1,6)"
    },
    {
      "musician": "John Weathers",
      "instruments": "drums, bass drum (5), cowbell (6)"
    }
  ],
  "reviews": [
    {
      "reviewer": "corbet",
      "date": "Posted Monday, January 19, 2004",
      "rating": 4,
      "text": "This album marks the most dramatic transition point in Gentle Giant's career. Elder brother Phil Shulman splits from the fold, taking his voice and saxophone with him, and from this point on the band's sound is remarkably different from that of all their previous releases. What is this difference? Well, for one thing, you'll hardly hear any more sax-driven numbers, and also gone is the playful, kitchen-sink attitude we hear on an album like \"Octopus\". Instead we find an extremely serious and ambitious group of musicians seemingly bent on pushing their music's complexity and intensity to its absolute limits, and as the first release in this new mode of operation, In A Glass House is often regarded as the band's ultimate masterpiece, their crowning achievement -- and one of the all-time greatest prog-rock records ever conceived. Without a doubt, this is Gentle Giant's most consistently intense (and \"serious\") album -- I remember being almost creeped out by it the first time I heard it, and a little unsure of what had just happened to me. With repeated listens, however, their genius begins to reveal itself; and soon I found myself revelling in every twist and turn, awestruck by their peerless intelligence and imagination, wishing they had recorded hundreds of albums. Within are most of the band's longest running tracks (around the 8 minute mark) with \"Experience\" being a particular favorite of mine, featuring subliminal keyboard work and haunting vocals throughout as well as a mind-bending instrumental pileup at the end that I could go on listening to forever. While it's nearly impossible to say which Gentle Giant album is the definitive best (too many flawless albums), this one will always get primary consideration."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Monday, January 26, 2004",
      "rating": 5,
      "text": "I'm really speechless. Sometimes, I feel ambarassed by my lack of mind-opening. Once again, after 3 (the magic number) good listen at the album, I do not regret to have purchased this BRILLANT record. Gentle Giant is a very respectable, yet 'easy listening' prog band. But this time, it's getting crazier.In a Glass House deserves a place in your shelf as Moving Pictures (Rush) or Close to the Edge (Yes) . Am I crazy you say? THIS IS the classic album of GG with Acquiring the Taste. And Gentle Giant is a band that brought A LOT of innovation and expertise in progressive rock. But the record is not 'Holy Grail' impossible to find now for a mere 30$, you get bonus live tracks. There's a song (An Intimates Lullaby) about a crazy guy in an asylum who soliloquys in his room, almost a nursery rhyme. The voice feels like it's recorded from a phone.Way of life, Experience and A Reunion offers lots a 'medieval' approaches that made GG such a joy to experience. This is the kind of record that makes me realize more and more that I was born in the wrong era. God, going to college with GG being an underground extravanganza and even going tho their concerts would have been a real treat. Anyway, if you can find the record, jump on it, it's an order. This is like the summer in Quebec, catch it while you can, because if you blink it's gone for another year of waiting."
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Tuesday, February 24, 2004",
      "rating": 5,
      "text": "If GG had done a tour without brother Phil, buying a Moog to fill-in his parts, it was another thing to do an album without him, but again, this proved to be a non-issue with Derek playing sax and singing as had Phil. In fact this proved to be their better album (IMHO but also for many other) although this album never got a US release - something rather odd since Octopus had encouraging sales there.This is one of the many kind of strange decisions that probably stopped GG to become a household name among rock fans. Actually, they had different labels handling the album on each side of the pond, and by now, their contract with Vertigo had run out and they had signed to Iommi's WWA label, prompting their US Columbia label to pass up on this one. By the time this album did get a US release in 78, this album had become their best-seller over there as an import. Are you sure you are following this?Anyway, GG purist will scream scandal at this album and its so-called blatant attempt at commercialism, but if the album is more accessible (a bit easier on minds like the debut or Three Fiends) this is hardly a sell-out, being their longest record and four tracks above 7 minutes and three of those around the 8 min mark.From the breaking of glass becoming the rhythm of the opener to the all-percussive astounding Inmate Lullaby , to the very classic GG Way Of Life , this album is strictly in line with all other albums , the main difference is the gradual decrease of acoustic instruments (a consequence of Phil's departure) , here being kept in a role of anti-climatic response to the more energetic moments of the songs. The second side is not be shamed either with the aptly-titled Experience with its constant twists and changes to the driving title track with its never-ending tempo changes with superb harmonies but the tedious but short Reunion does bring the only damper on an otherwise almost flawless album. Why Mr; Stump and Mr; Joynson do not appreciate this album to the fullest is beyond me.Nevertheless, this album will set the template for the following albums with lesser acoustic instruments and more mechanical tempo changes (both flaws increasing with time) , but also increasing commercial success to the bring of stardom. Certainly my favourite album , this album now fetches small fortunes for a mint copy with its transparent gimmicky window-shadow trick."
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Friday, March 19, 2004",
      "rating": 4,
      "text": "The same year that GENTLE GIANT released \"Octopus\" they released in the UK only \"In A Glass House\" which unfortunately never saw the light of day in the US or Canada. In sharp contrast to \"Octopus\", this album takes on a much more accessible sound with a sharper focus on the melodic horizon. Of course all of the patented GENTLE GIANT'isms are present throughout culminating into perhaps my personal favourite GIANT song of all time \"In A Glass House\". \"In A Glass House\" is a real prog lovers album with some highly complex interludes and well thought out tempo shifts and melodic runs. I guess if SPOCK'S BEARD borrowed from any of GENTLE GIANT albums this would be it. An essential album most definitely with some totally musically all-inspiring moments."
    },
    {
      "reviewer": "Prognut",
      "date": "Posted Saturday, April 3, 2004",
      "rating": 5,
      "text": "Can you define Masterpiece? I personally think that in the prog world there are several definitions, depending who you are or what is your experience and background on progressive music as a whole; however, to me is either an album so creative and inovative that can not be compared with anything done before and is at the same time unique, or is an album that has reach the creative peak of one particular band... simple!!!, isn't, but really other than this? How can you define masterpiece... I am actually open to any suggestions.This is GG huge MASTERPIECE, and fulfill both of my suggested definitions... before this album, they struggled to get there, and after it they wish to come back. So much effort, dedication, perfection... few bands have reached this level, the sad thing you see, is that is short duration, showed over and over with every other band. And, come on, they knew that.. living in a \"Glass House\". I have found in GG, like no other band, that they may have individual Masterpieces compositions, thru out their life span... but, as an album, this hold together better than anything else done by them. This album can not be apreciated based on, this guitar sound like this, then the violin, and also the Keys and by the way the drummer, well... It will be nonsense for me getting on these type of details... for the newcomer however, try maybe \"Free Hand\" or \"The Power and the Glory\" first; since they maybe a little more accesible. But, if you still want to take the chance with \"In a Glass House\" let it spin several times, until you chew, chew, digest and then grow on you.... give it time and will happen, trust me... 6 Stars, ups! I mean 5."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Monday, May 31, 2004",
      "rating": 4,
      "text": "By forgetting such an heavy lack- like that one of Phil Shulman- and regarding also of a melodic jazz approach, this album remains as one of their best and most original ones!!So without any doubt you can add another \"half star\" at least and-moreover-you can start appreciating a more accessible band...the breaking of a glass, becoming a rhytmical pattern in the intro of \"The Runaway\", is a G.G.'s trademark: the explosion of a funny glass, introduces a remarkable song, where Derek Shulman is treating us to his own style of singing!!That is a great loudness and softness in his approach, even though by alternating cleverly these music features by means also of the melodic breaks through, which make this album so creative and simple in the same time !!Afterwards, through several time changes, a \"recorder\" emerges from the odd guitar tune...here it is another G.G.'s trademark!!Instead \"An Inmates Lullaby\" is a bit weak in my opinion, apart from a lullaby sound, which is weird but it's not enough to let us consider this song recommended (the vocalism is not so remarkable)...never mind, cause the following one- \"Way of life\" - is an exceptional offtune track, which is enriched by means of such a great jam by Ray Shulman on the bass line, an organ \"background\" and the soft vocalism by Kenny Minnear as well, who has got his own difficult task to let us forget the lack of a genius like Phil Shulman. The track \"Experience\" is a complex song, where the approach by Derek Shulman is as usual essential for whom is already completely into their strange old stuff, despite of a certain mellowness at the beginning, which leads us to the effort by Kenny Minnear at the vocals: well I prefer him as a keyboardist rather than as a vocalist, but never mind once again, in fact at last a string quartet introduces the pretty \"Reunion\", preceding the unforgettable title track with its remarkable acoustic guitars, harpsichords, Lead violins,heavy basses and electric guitars,all at one time, which make this album essential and almost perfect for their personal style (a fast tempo with complex parts, which is one of the typical music features by G.G.!!).Let's listen to the remastered version of this important work (above all to their new change of direction in their music) !!"
    },
    {
      "reviewer": "Bj-1",
      "date": "Posted Saturday, October 16, 2004",
      "rating": 5,
      "text": "I recall back in 2003 when my music teacher introduced me to this band for the first time, and this was my first taste of them. The wonderful guitar riff after the quirky glass breaking intro to \"The Runaway\" instantly stroke me as some of the best music I've heard so far, and to this date it still is my personal favorite GG song. This one was a change from their 'Octopus' opus in 1972 and introduced the band to a darker, more rock solid sound while not missing the adventurous stylistics from before. The strictly tuned percussion composed \"An Inmates Lullaby\" is a prime example on this, echoing the 'Acquiring the Taste' days very much and standing as one of the most original songs ever written. The rest of the album follows the same formula as the opening track with dynamic elements of both medevial and heavy progressive rock (save the beautiful folk tingled interlude \"A Reunion\"), each with a different personality and mood certainly paving the way for albums such as 'Free Hand' later on.Gentle Giant kept experimenting with each release and this is definitely one of their very best offerings. This one, Octopus and Power & the Glory are my favorites by GG, but this is probably the best one to start with (besides the excellent Free Hand). Great stuff!"
    },
    {
      "reviewer": "NJprogfan",
      "date": "Posted Thursday, May 5, 2005",
      "rating": 4,
      "text": "Most prog fans/GG fans consider this their magnum opus. Funny how an album that was impossible to find back in the day would be considered such. Not to rub all the fans the wrong way, I consider it to be a tad cold in spots. It opens with the sound of breaking glass seguing into the beginning of 'The Runaway'. I don't know how everyone else feels, but the recording, (I have the 1st re-mastered CD) seems to have been done in a cave. There's a hollowness to the sound. Good, bad? A 70's thing? I don't know, but that coldness factors in. Up next is 'An Inmates Lullaby', drums, xylophone? and voice. One odd little song...not their best if you ask me. 'Way Of Life' comes next and again I have problems with the recording. Is it me or does Derek's voice sound disconnected from the rest of the band? And there's that hollowness again rearing it's ugly head. Man, a most frustrating album! \"Experience' and ' A Reunion' are fine songs, but the last track, 'In A Glass House' is the gem of all gems. It is THEE Gentle Giant song to beat all Gentle Giant songs. It has everything you love about the band, the medieval, the R&B, and the rock all rolled up into one fantastic song. Unbelieveable! The one thing I love about them is how the time signatures are so normal sounding yet inaccessible. On a side note, I enjoy the many live recordings of the songs off of this album moreso then the album itself. How does everyone else feel? So, in a nutshell, the album is a disjointed, rough-edged, frustrating, crazy quilt, listen-many-times-to-understand classic. But be warned, for those who want to get into the band, do not and I repeat, do not pick this as your first venture into the world of GG. Try \"Octopus\" or \"Freehand\". 4.5 frustrating stars!"
    },
    {
      "reviewer": "FishyMonkey",
      "date": "Posted Sunday, June 19, 2005",
      "rating": 4,
      "text": "Technically I should be giving this album five stars -- I can't really pinpoint anything as \"bad\". However, I don't feel like this is a five star album, more of a 4.5 album. This album, made by the highly experimental and crazy Gentle Giant, is one of my favorites that I've heard of theirs. It's got good songwriting, great...and I mean GREAT melodies, and uses some isntruments and sounds you odn't hear too often. So, I probably should be head-over-heels in love with this album.But I'm not, not enough to give it five stars. Sure, everything seems right, but it's prog. Huh, you say? I mean just that...it's simply prog, nothing more and nothing less. It doesn't do anything daring, doesn't try anything too new, no real soul in it, no passion of any sort, no experimental stuff, no crazy singing...gawd, nothing. It's just prog. There's nothing wrong with just prog -- especially when it's done this well. A wide array of sounds of instruments and tight composing, it's good stuff that keeps me coming back to this album. BUT, there's nothing that screams, \"This band put everything they had in them into this album\", or \"This is something different\". It doesn't quite sound generic, in fact it doesn't sound generic at all. Once again, it's just prog. Good prog at that, but there is abslutely nothing that distinguishes it from the huge amounts of other symphonic prog bands out there.The title track is a wonderful song with pretty nice violin and all around nice voice work and once again great melodies. It sorta gets a little boring, but it's good, I do like this track a lot. I feel the same way about Experience, which gets a little rougher in the middle in its' sound, but is still great. Way of Life starts with an awesome bass part and someone shouting GO! The vocals seem kinda dissonant when they coem in, but it works. This song also reverts into the same mode as Experience and the title track -- greatsong ,some amazing moments, but nothing you look at and realize that this band is something special. They're very good, but nothign different. An Inmates Lullaby and A Reunion are pretty worthless, but oh well. The Runaway is the same as the other three great tracks on this album, very good but nothing new.See, I really like Gentle Giant and plan on buying much of their discography, but they will never be one of my favorites, just as this album will never be one of my favorites. It's good prog, but that's ALL it is: good prog. Nothing else. This isn't bad, but it certainly doesn't make me ecstatic and doesn't make me flip out and give it five stars.Disclaimer: I really do like this album, honest -- but it's just that missing extra element that keeps me from giving it five stars or proclaiming Gentle Giant as great."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Saturday, July 2, 2005",
      "rating": 5,
      "text": "Finally, the long awaited 35th Anniversary Edition has recently been released with a new deluxe and elegant package and bonus live track. The package is covered with an external cardboard with Gentle Giant's mascot : an old man face with bold head. When I received the CD from amazon couple of weeks ago, I was impressed with the package. The original artwork is still maintained inside the package, cover of the sleeve notes. The cover is made of plastic with a printed original artwork but it now looks like a negative film with picture in it (the artwork). It's really nice. All lyrics of the tracks are printed nicely inside the sleeve. The disc itself is printed in black. Judging from the package itself I can see that with the CD price of USD 13.99 it's worth owning this package.Let's talk about the record. From the sonic quality I can only say that this is excellent and better than the original CD version. All detail sounds, like the opening broken glass sounds that have characterized the music of Gentle Giant, can be heard excellently. The combination of Derek's powerful voice and other instrument sounds can be heard very clear, transparent. Yes there is hiss especially during quiet passages but what can I do? It was originally recorded in the seventies - it's probably the master has it already.The music? Well, no one would argue about the brilliance of this critically acclaimed album. Through this album the band had pushed their music much more on avant-garde style while maintaining the key ingredients of Gentle Giant's musical characteristics: excellent harmony of vocal / choirs and complex arrangements all songs featured in this album. \"The Runaway\" (7:15) which opens with broken glass sounds offers rich varieties of styles and textures combined with a complex rhythm section with intertwining guitar and keyboard works. It has become the band's legendary track. The less popular \"An Inmate's Lullaby\" (4:40) is the kind of avant-garde style played by the band combining vibraphone and vocal. \"Way of Life\" (7:52) is a song with hard driving rhythm, fast tempo and frequent tempo changes with guitar work during transition pieces.\"Experience\" (7:50) is another excellent track with inventive keyboard combined with a complex arrangement of acoustic guitar played in speed. It's quite complex track but it's enjoyable - especially with this digitally remastered package where all details can be heard excellently. The structure of this track is also complex where it comprises many forms of music. I like especially when the music reaches in the middle of track where Derek sings in nigh register notes \"Master inner voices, making any choices\" followed with guitar solo and keyboard as rhythm. \"A Reunion \" (2:11) has a great combination of acoustic guitar, violin and low register notes yet powerful vocal of Derek. \"In a Glass House\" (8:26) is another great composition featuring excellent harmony between all instruments used especially acoustic guitar, violin, clavinet and electric guitar. The choirs performed by Derek, Ray, Gary and Kerry are also top notch! But the strong point of this concluding track is its net composition and precise delivery by the band members. The bonus track is actually a combination of \"The Runaway\" and \"Experience\". It's performed excellently with a live ambient from the crowd in Dusseldorm who seemed very enthusiastic with the show. Sonic quality of the live bonus is excellent.This remastered edition is highly recommended. Keep on proggin' .!!!Progressively yours, GW\"Now I am a man, I realise. My unworldly sins pained many lives. Yet I heard, heard with ears that wouldn't listen. And still I watched and I saw with blinkered eyes.\" - WAY OF LIFE."
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Wednesday, July 13, 2005",
      "rating": 4,
      "text": "Overall, this album is a very solid effort from Gentle Giant. The intensity and the feeling angst that this album gives off is mainly because of the recurring theme of breaking free from capture (which would somewhat come back in Free Hand) is an overwhelming factor that could make or break the album for someone. In my opinion, this is the heaviest album they had created up to that point, long gone were the silly styles of Octopus, and now they were delving into more serious themes, while still keeping some of that silly quality. Keyboard wizard Kerry Minear holds the album together with his catchy, and ever so intricate keyboard lines that utilize so many different instruments, one would think that there was more than one keyboardist in the band. Gary Green also working heavily along side Minear, creating rich tones and sounds that go side by side with the keyboard madness. Ray Shulman keeps a subdued role in this album, not reaching his creative peak yet. But still, at that time, he was a superb bassist that played lines that were outside the proverbial box. John Weathers also gives some great performances on this album, but in my opinion had already past his peak in Octopus. And finally, Derek Shulman showing everyone who's boss with commanding vocal work and superb recorder work. In a word, musically and lyrically this album is among their best work.Stand out tracks on this album are the opener, The Runaway, which begins with the sound of glass breaking, then becomes one of the most creative Gentle Giant riffs ever conceived. It is filled with lyrical hooks and has some great bass and guitar work. A Reunion is the softest track on the album, and is along the same lines as Knots from Octopus and later On Reflection, in the multi-layered vocal aspect. And the finale, In a Glass House features a superb solo from Green, and some intricate work from Minear, and one of Ray Shulman's best bass lines.Overall, this album is very solid musically and lyrically. My only problem with it is that the songs tend to drag a bit, there should have been more musical ideas added, rather than the repeating of riffs. One of Gentle Giant's best, there is something on this album for everybody. 4/5."
    },
    {
      "reviewer": "Andrea Cortese",
      "date": "Posted Friday, July 29, 2005",
      "rating": 5,
      "text": "Impressive! I don't know if this one is the best of Gentle Giant's catalogue. It's a pleasure for ears and minds, better than Octopus which is also a five rating must! Perhaps almost all the albums of GG merit 4.5 star rating (or more)!!"
    },
    {
      "reviewer": "Marc Baum",
      "date": "Posted Friday, September 16, 2005",
      "rating": 5,
      "text": "\"In A Glass House\" is arguably GG's best and most ambitious record and the outstanding gem from their in prog circles highly astonished early period. It's their highest masterpiece of all. Period: From the intro of \"The Runaway\" 'til the outro of the title track with the glass- breaking effects in both, the album is deep, perfectly structured and with so many changes and complex parts (which always are understandable and memorable), that this album never tunes boring. It's without doubt a definitive landmark record in classic prog, from the year 1973, where progressive rock reached it's highest creative point. \"In A Glass House\" is GG's \"Close To The Edge\", \"Dark Side Of The Moon\", \"Selling England By The Pound\" or \"Thick As A Brick\" if you will, but you can't compare it with one of these records, it stands on it's own as a prog masterpiece, like all of those mentioned from above.Since some recent reviews, I specially reviewed the single tracks from one record and gave them points from 0-10. This time I make it short and give them only points, because here is so much to discover, which isn't discribable with some words. You must hear it yourself!Extremely high recommended to all prog and Gentle Giant fans (those own it already though)!Track ratings:\"The Runaway\": 10/10 points \"An Inmates Lullaby\": 9/10 points \"Way Of Life\": 10/10 points \"Experience\": 10/10 points \"A Reunion\": 8.5/10 points \"In A Glass House\": 10/10 pointsRecord rating: 10 + 9 + 10 + 10 + 8.5 + 10 = 57.5 / 6 tracks = 9.58 = 9.5 points Gentle Giant - \"In A Glass House\": 9.5/10 points = 96 % on MPV scale = 5/5 starsEssential: a masterpiece of progressive music."
    },
    {
      "reviewer": "richardh",
      "date": "Posted Thursday, September 29, 2005",
      "rating": 3,
      "text": "First thing to say is that I've only had this album for about six months so its probably too early for me to be posting a review about it but I can't be bothered to wait any longer!My first observation is that even on the remaster it all sounds a bit 'tinny' to my ears.Is this really taken from a first generation master tape? I doubt it especially as there is some obvious hiss on some tracks.My second observtion is that none of the songs are as strong as those on other albums.Too much of this is complex for the sake of compelexity and the song gets lost along the way.Thirdly the drums seem very weak and ordinary by great prog standards.The main plus point seem to be that Kerry Minnear is on red hot form.Great keyboard player and multi instrumenatlist for sure.The live bonus track seems to sucessfully summarise the album and make all that goes before redundant.Ok its just an opinion but Power and The Glory is GG's great masterpece for me not this slightly over self conscious 'trying to be too complex for the sake of it' album."
    },
    {
      "reviewer": "Man With Hat",
      "date": "Posted Sunday, November 6, 2005",
      "rating": 4,
      "text": "I would describe this album as an enigma. Many people hail it has Giant's masterpiece. While it is a very strong album, i don't think it desevers that title. It is remarkable that they were able to continue so powerfully after Phil left the band. All the musicians are in top form, the songs are all well written, and the album is very coherent. Why then do i say that it should not be called a masterpiece? For some reason this one doesnt jump out and slap you in the face like The Power and The Glory, Octopus, and Free Hand (the Giant's masterpieces in my mind) did. I have listen to this album many times and everytime i enjoy it alot and love what I hear, but it just donest go.With that said, this is a grand album! All the songs are great, and the musicians are phenominal. The album starts off running (excuse the pun) with The Runaway, one of Giant's best songs. Awesome guitar riff, great drumming, and fantastic singing. Flawless! Then comes An Inmates Lullaby. This is an interesting song told from the point of someone is obviously in need of help. Clever lyrics, and great percussion parts are featured here. A very good song. Next up is the ever exciting Way Of Life. A great song with alot of energy (especially in the begining) and wonderful music. The only thing about this song that may deter people is the ending. For one, i like it. It's progressive for one. All in all this is a standout track. Experience is a song that, to me, is just like this album: I like it, but i don't like it as much as everyone says i should. It is a good song with solid music and lyrics. Next is the soft spoken A Reunion, the only song less than four minutes. Again, a solid song with great strings and a wonderful vocal performance by Kerry. I think for this song to reach its full potential it should have been expanded more than it was. But that takes nothing away from it. Another good song. Finally comes the tour de force of In A Glass House. This is in my top five of Giant's songs. What power and sophistication is there in this song, full of life and engery that bubbles to the top and encapsulates the listener. Powerful and fantastic drumming, bass, and guitar playing combined with great lyrics make this song one not to miss. Another flawless song!This is a very good release that should not be missed by anyone. Standout tracks are: The Runaway, In A Glass House, and Way Of Life. But even better, there are no bad songs on this album. Even though i can't call it a masterpiece this is an album that everyone needs to try. You won't be disappointed. Very highly Recommended."
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Saturday, November 4, 2006",
      "rating": 5,
      "text": "One of my all-time Gentle Giant favorite releases, and just as their sophomore gem \"Acquiring the Taste\", \"In a Glass House\" is also an acquired taste, since the band chooses to create repertoire in which they can dig particular dpeths into their own complex, uncopromisng musical vision. There is also some sort of dark emotional vibe that perfectly fits both the black color's predominance and mysterious double-image cover design. The infamous broken glass effects that set the pace for the main motif and the most recurrent tempo are, in some ways, a metaphor of what the band had been going through between the completion of their \"Octopus\" album and the conception of this one. One of the Shulman brothers left the band, Phillip, the one who was more straightfordwardly interested in eerie harmonizations and sonic textures. Something had been broken on the road, yet the band remained undefatigueable, and that's where the solid style of drummer John Weathers feels more at home among the band's overall instrumentation. In fact, Gentle Giant starts to increase their rocking potential (to be soon enhanced in their follower \"The Power & the Glory\") while remaining loyal to the heritages of Medieval, Rennaisance, 20th century chamber, Celtic and jazzy things that they so amazingly combined into their signature sound. The opener 'The Runaway' bears a very appealing hook despite the complex melodic lines and weird adornments on recorders and vibes. Definitely, the inputs of Ray's bass, Minnear's keyboards (and else) and Green's guitars are being provided a major dynamics by Weathers' drumming. Next comes the segued second track 'An Inmate's Lullaby', a surreal slow piece in which the Spartan vocal leads and harmonies seem to float above the vibes, glockenspiel and tympani. This song is a perfect example of GG's clever use of apparently few tricks in order to transform them into an intrincate piece. 'Way of Life' is the most patently exciting song in the album, with again a catchy motif on guitar and organ that takes in as soon as the word 'Go!' is shouted. The use of counterpoints and countermelodies gives way to the dreamy, exquisite interlude, based on a harmonium motif and enriched by violin and recorder. The interlude is reprised for the song's last section in a majestic manner. The long minimal harmonium layers that prolong the ending were conceived as the intro theme to another track that eventually wasn't completed. That makes 'Experience' the next track, and what a lovely track it is! Dominated by Minnear on the vocal department, it bears a floating Renaissance ambience that is only interrupted by a rock-blues section in which Derek Shulman delivers on of his most explosive performances. The encore is simply delightful. After 'A reunion', a very soft ballad based on violin flourishes with Minnear in exclusive charge of vocal duties, comes the closing title track. This one begins with a section in which Celtic flavours (with the violin assuming the lead role) and playful rock alternate each other. The second section focuses on the rock thing but with a slower tempo: the appearance of dual acoustic guitars in the bridges gives some room for brief country- inspired stuff. The live rendition that appears as part of the CD reissue bonuses reveals an increased use of sonic power for thsi one, but the studio version remains captivating in its own constraint manner. The album ends with a minimum capitulation of the album's repertoire, and so it happens that we have yet another GG masterpiece in the annals of vintage prog rock."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Wednesday, November 29, 2006",
      "rating": 4,
      "text": "The most challenging classic GG release.This is a remarkable change from the jubilant Octopus. With the departure of Phil, the band took a more serious direction, creating a concept album which continues to highlight the band's creativity and talent, but also approaches a level of depth, a dramatic element to their sound which they had not explored yet.One of the biggest changes here, besides the departure of the sax, are the lyrics, which are easily some of the most poetic lines GG wrote, especially on tracks like Experience. This is a record about growing up, and about change. Often times a band's deepest works comes when turmoil and tension are at its peak, and here GG had to take a good look at themselves and the direction they wanted to take their band.My biggest complaint would be that this record sounds particularly dated (as in not timeless), especially the opener The Runaway. I still believe their best work was Octopus, in which the songs seem to flow like a river, and they were crafting 4 and 5 minute \"epics\" that reached more emotions that many songs of longer length reach. This is perhaps the deepest and most difficult of the GG records to get into, but it's a very fun ride."
    },
    {
      "reviewer": "Atavachron",
      "date": "Posted Friday, July 6, 2007",
      "rating": 5,
      "text": "There may have been more talented individual figures in progressive rock, more fireworks, personal virtuosity and mass appeal, but there was no more inspired or skilled a unit than these comparatively unsung heroes. An outfit so well-versed in myriad musics and so able to pull the very best from each member, that there are moments on this 1973 release that dwarf contemporaries and make Yes and Tull look like schoolchildren. Consequently, there is not a slow or insignificant moment on 'In a Glass House' and it remains the enormous masterwork it was then.'The Runaway' is prime, definitive Gentle Giant with the brilliant counterpoint and meticulous structure they were the best at. 'An Inmates Lullaby', though bizarre, mirrors Roger Water's preoccupation with insanity that same year and tinkers along with music box chimes and some children's piano silliness. Back to the real show is 'Way of Life' which moves with smooth velocity, beautifully remastered here with all players sounding marvelous. Gary Green's weird guitar notations, John Weathers' painfully tight drums and Kerry Minnear's angles of synth and organ. Woven in and out of a cooking rock foundation are Elizabethan breaks that establish a solid thematic and rich, acoustic/electric tonal palette . This band is a glory to behold and we're left wondering why other prog acts so consistently took the spotlight of history. No matter really, Gentle Giant made great records for us to enjoy forever. 'Experience' is intriguing with its medieval psych, Derek Schulman's minstrel-on-acid vocals, deep church organ drones, Ray Schulman's childlike bass phrase and a crunchy middle section. 'A Reunion' features Ray's violin and brother co-founder Derek's sax, becoming a splendid rock-fusion number that Steve Morse had to have heard as a young composer. The title cut follows and rocks things to a close.If it is possible for one band to have been the quintessential prog rockers with no more than a quick glance from the world, it was Gentle Giant. It doesn't get any better."
    },
    {
      "reviewer": "thellama73",
      "date": "Posted Thursday, August 9, 2007",
      "rating": 4,
      "text": "In A Glass House is Gentle Giant at their best. On their earlier albums, even on the celebrated Octopus, I felt like there was still an awkwardness present in their music, perhaps due to their extremely complex arrangements. However, on this outing their sound is stripped down to the bare essentials, and I think it's better for it.I don't mean to imply that this album is simpler or more accessible than their others, to the contrary, this is very challenging music and it took me a great number of listens to feel like I really understood it. There is a nice mix of styles present over the course of the record. An Inmate's Lullaby is a sparse, percussion driven song about a man in mental institution. The creepy/sad lyrics are really great and really make the song. Experience is a rock and roll jam, which lends some more traditional aggression to this otherwise very avant-garde record. A reunion is a medieval sounding snippet, which is very peaceful and gives the listener a chance to rest for a second.The title track is definitely the highlight, with some of GG's best melodies and ends with a recap collage of all the other songs (Queen would use this exact same trick five years later with More of That Jazz.)If you're a fan of the more avant-garde side of prog. you will undoubtedly enjoy In a Glass House. To this day, no other band has managed to sound anything like Gentle Giant, which in itself is unique. 4 stars."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Wednesday, August 29, 2007",
      "rating": 4,
      "text": "Well I do like this better than \"Octopus\" but it doesn't measure up to the enjoyment I get out of \"Three Friends\" and \"Acquiring The Taste\". It just seems like something is missing from their early days, maybe it's just that the music has become more challenging and complex. Having said all that I really like \"The Runaway\" , \"Experience\" and \"In A Glass House\" a lot. It's all good though.\"The Runaway\" opens with the sound of someone breaking something and this continues until it is in a rhythm.The sound builds as vocals from Shulman arrive a minute in.There is some recorder, guitar and vibes to follow, actually there is a vibes solo 5 minutes in. \"The Inmate's Lullaby\" doesn't have a lot of melody as percussion and vocals lead the way.There are some vibes and the lyrics are quite interesting in this intricate and complex song. \"Way Of Life\" is an uptempo tune that has a mellow section 2 1/2 minutes in of organ, violin and Minnear's gentle vocals.Then were back to the races.The drumming is quite prominant on this track and the song ends with prolonged organ sounds.\"Experience\" features fast paced vocals from Minnear with lots of keys.Some good bass 2 minutes in and a chorus that follows. Some angular guitar melodies late. Nice. \"A Reunion\" is ok,but it does seem very English to me, maybe it's Minnear's vocal style on this one. Acoustic guitar, bass and violin lead the way. \"In A Glass House\" is my favourite track on this album. It's an uptempo tune with violin and acoustic guitar. The tempo changes often and Shulman does the vocals. Nice to hear some sax as well. With Phil Shulman leaving before this recording there is far less sax melodies then we're used to with this band.This is classic GENTLE GIANT so what's not to like ?"
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Monday, December 31, 2007",
      "rating": 3,
      "text": "If this is Gentle Giant's most serious album, then the band is probably just not serious enough for my tastes. There is plenty of good music on this album, but there is more than enough goofiness that really doesn't do much for me either, such as the sound effects to open and close the album and all of An Inmate's Lullaby. I realize that's all part of the Giant's uniqueness and creativity; however, this seems to be one of the kinds of prog that I have trouble really getting into.The lone exception is the title track. With a killer opening 12-string (at least I think) riff, coupled with a captivating violin countermelody, this track wastes no time in getting started. Then the vocals come in with classic Giant irregularity, and the guys keep hitting you with great melody after great melody, until about halfway through we get an unexpectedly heavy guitar riff that takes the song to conclusion nicely. It's really an amazingly frenetic eight minutes of prog.The Runaway, Way of Life, Experience. These songs all have plenty of good moments, but lack the energy and consistency of the title track. The Runaway is a rocker--at least by Gentle Giant standards--and is centered around the guitar lines, but also features tons of interesting synth and xylophone fills. Way of Life and Experience I have mixed feelings about--they feature so many contrasts (between light and heavy particularly), that I usually enjoy sections of each when I put them on, but rarely enjoy the entire song throughout. Despite that, they certainly bear the Giant's unique touch, including playful interplay and slightly off-key vocals.Gentle Giant are one of those bands that are good enough to intrigue me, but in my opinion not worth the money it costs to obtain their music. Except for the title track, this album is somewhat inconsistent, but solid enough for a moderately enthusiastic recommendation."
    },
    {
      "reviewer": "The Pessimist",
      "date": "Posted Wednesday, April 9, 2008",
      "rating": 5,
      "text": "I do love this album, however it is not their best, by a long shot. I prefer Free Hand and Octopus, they have no weaknesses, however this has one, and it takes up the place of an entire song: that weakness is An Inmate's Lullaby. It is GG's strangest song, but by far the worst of their classic era, it almost tops So Sincere on the crap-o-meter. Anyway, now with the negatives out of the way, we can get down to the good stuff!The album starts astoundingly with ear-splitting simulated glass-breaking sounds, and then into the fantastic song Runaway. This is one of my very favourite GG songs, for many reasons: the two things I love the most though arise from Minnear's brilliance on the keyboards and the marimba. First of all, the run down on the lower organ in the main theme, such simplicity and so short, but unbelievably effective, secondly, the very jazz-based marimba solo in the middle. An excellent start.I've already said my piece on An Inmate's Lullaby.Way of Life is the most rock n roll on the album, with a fast-paced and dare I say it, cheesy riff and progressing into some really nice changes: of these include some virtuose guitar playing from Gary Green, tight drumming from Weathers and an amazing middle section that is in the symphonic vein, with some very pleasant melody and powerful organ from Minnear. Overall I could prog-rocker, generic GG complexity and some real bite.Experience is once again a true classic, it has two of the greatest prog riffs of all time, this really proves GG as riff writers as well as straightforward composers. Gary Green really shines on this track with a classic guitar solo to penultimate the track. I really love the simplistic bass work overlapping the main riff, 3 minutes in. The Baroque sections also have a glowing charm to them, although they can get a little boring at times. Still a commendable track, and another one of my favourites: the riffs are to die for!A Reunion is a bit like a chamber music filler that gives you a little break between two big songs. Once again, Kerry Minnear's orchestrational skills show through here, and give you even more reason to love the guy.In A Glass House is by far THE BEST GENTLE GIANT SONG EVER COMPOSED. There is no weak point to this song; it is just the perfect prog rocker. Shame on anyone who tries to slate it! The song is divided into two halves, the first part complex in arrangement and harmony, with clever use of violins and a 12-string, the second part consisting another great riff, and very addictive, beware! The first half is very complex, no theme is repeated more than twice, and even when it is it's tweaked slightly. This is the opposite of boring, all of the musicians are at their prime (apart from Weathers, who reaches his prime on Knots IMO) here, and it is bliss to listen to. The second half is the best bit though. Words cannot describe the genial ability of these guys: the riff is in 29/8 and you can still groove to it! Enough said, I really don't want to spoil it for you.Overall, a very strong album with one massive hole in the middle, but that is overshrouded by the other songs. I will have to give this a 5star rating, as it would be an insult to give it any less. Buy Free Hand or Octopus before this though, easily accessible and they are generally better IMHO."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Monday, May 5, 2008",
      "rating": 5,
      "text": "In a Glass House is the fifth album from Gentle Giant. This was their break through in the United States where the album sold pretty well. It�s hard to hear why this should be the break through though as it is just as complex and challenging as the previous albums. Maybe even a bit more. For me personally this is another masterpiece album from Gentle Giant.The music is still unmistakably Gentle Giant with the many different influences ranging from hard rock, classical chamber music, jazz, medievil troubadour music, avant garde and this time around funk. I am tempted to say that as usual Gentle Giant pull this of with ease. All sorts of different themes are thrown around and changed and used again. This is a typical feature in Gentle Giant�s music and the one I enjoy the most. I think Gentle Giant�s way of making music is close to classical music compositions with the layers of different musical themes. In a Glass House consist of six songs. Four pretty long ones The Runaway, Way of Life, Experience and In a Glass House and two shorter songs An Inmate's Lullaby and A Reunion.A Reunion is the only song here which isn�t higly complex. instead it�s a pleasant song in the midst of complex song structures and playing. The other five songs are well structured and highly complex tracks which were up until then the best material written by Gentle Giant IMO. An Inmate�s Lullaby stand out a bit as it is very avant garde, but still beautiful and Way of Life has a funky beat while the remaining three songs are just plain beautiful and challenging. I can�t begin to describe how much I enjoy this album, but you get the picture right ?The musicianship is astonishing as usual, and as on other Gentle Giant albums both violin and sax is also used here in addition to the more normal rock instrumentation. The xylophone is used more extensively here though than on any previous albums.The production turned me of the first time I listened to it, because it�s much thinner and not very bass heavy than on their previous album Octopus, but it�s like I�ve grown used to this sound and it gives In a Glass House it�s identity in the Gentle Giant discography.This is another 5 star album from Gentle Giant, and so far they have not disappointed me. As a newbie to Gentle Giant I have taken their albums from an end and started with the first one and including this album I have only given 5 star ratings as I feel Gentle Giant might be the best prog rock band ever. Every album sounds unmistabably like Gentle Giant while they still develop their style from album to album. Once more I can only regret that I haven�t discovered Gentle Giant earlier. This is highly recommendable to people who like their prog rock to be challenging yet melodic and memorable. MASTERPIECE."
    },
    {
      "reviewer": "LiquidEternity",
      "date": "Posted Wednesday, October 8, 2008",
      "rating": 4,
      "text": "Though often considered Gentle Giant's best release, I find In a Glass House to be a flawed and less lovable album than Free Hand and Octopus.Now don't get me wrong. Gentle Giant has one of the strongest discographies of any prog band I've ever run across (at least until 1977 or so). Saying that this album is more flawed and less lovable than the two aforementioned is like saying that George Harrison is a slightly less famous Beatles member. In the end, it doesn't matter, because if you enjoy about any Gentle Giant album, you need to come to this one, too. The highly experimental nature of the previous albums is starting to segue to a much tighter and more band-oriented feel on this album. In truth, a hard rock sound is starting to creep into this album, giving it both wild complexity and irresistible energy. For the most part. Most hopeless prog nerds (like myself) would look at this album first of their discography, most likely, due to the longer tracks. However, sometimes their longer compositions lose the power and effectiveness that their less meandering songs before and after this album have.The album opens with The Runaway, a pretty good track by Gentle Giant standards, though nothing particularly inspiring or different. The xylophones on this track are pretty well written, though. And speaking of xylophones, An Inmate's Lullaby plays with some absolutely gorgeous melodies on that instrument. This track is one of the two gentle (again, no pun intended) songs on the album, featuring quiet voices and rather not aggressive harmonies. A very nice track, though it is in the end quite eclipsed by the stronger songs on In a Glass House. The side wraps up with Way of Life, a song apparently many don't appreciate so much. However, I find the band's energy and intriguing composition more than make up for the few weak vocal moments. Some spacey keyboard sequences conclude the song and the side of the LP.The second half is much stronger, I believe. It kicks off with Experience, a less intense and much more weird song. Tightly unraveled composition (I know no other way to describe it) holds together threads that do not seem to want to fit right. It's one of Gentle Giant's trademarks, and this is one of the prime examples of this style. Wonderful piano and electric guitar in the middle and towards the end bring back the sense of drama and energy. A Reunion picks up the pieces after that song ends, providing soft orchestral backing to a quiet vocal melody, something like Think of Me with Kindness but not quite as impressive. In a Glass House, arguably the greatest song on the album, kicks off with some highly complicated guitar/bass/keys/drums interplay in the way that only this band can do. All throughout the song, complex parts are interwoven and bring out one nice track that probably is one of the most eclectic songs written by Gentle Giant in this era. And it has cowbell.In the end, this album is wonderful. Anyone, a fan of Gentle Giant or someone completely unaware of the band, can enjoy this. I'd recommend Free Hand or Octopus first, but this is undeniably one of the better albums ever to grace the 70s."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Tuesday, December 2, 2008",
      "rating": 4,
      "text": "In a Glass House contains longer pieces than one would expect from Gentle Giant, which proves to be, for the most part, a bad thing. Gentle Giant does an outstanding job keeping things progressive, tight, and under seven minutes. On this album, there's a lot of stuff that drags on and thus drags the album down a bit, like repetition and incongruity. The beginning and the end of this album are undoubtedly the highlights. Because of much of the middle, though, I disagree that this is their best album, but I emphasize that this is definitely worth possessing.\"The Runaway\" Every time I begin this album, my wife wants to know what the hell just broke! Soon enough, the sound of glass breaking develops into a rhythm, and eventually the song proper explodes into our eager ears. Normally, Gentle Giant's music takes time to appreciate and enjoy, but right off the bat, we're treated to some of the best the band has to offer. The main riff depends greatly on a not fully distorted electric guitar and thundering bass. There is an unusually moderate amount of keyboard present for a Gentle Giant song. Kerry Minnear does an excellent job singing in the middle section, going from his usual high notes to extremely low ones. The arrangement and instrumentation are impeccable. The lyrics suggest a convict who has tired of living in his glass house, namely, a prison cell. In \"The Runaway,\" Gentle Giant made a song that is at once full of musical complexities and yet strangely accessible; this would be a great place to start for someone new to this fantastic group.\"An Inmate's Lullaby\" Perhaps one of Gentle Giant's most bizzare songs, this one is about a man in a mental institution. In a way, he is forced to inhabit a glass house, subject to people's observations and comments. The percussive music is interspersed with quaint but really creepy xylophone.\"Way of Life\" A wacky rocker, Derek Shulman seems to be flat on several notes, but that might just be because the melody is such an awkward one. The musical interlude is likewise peculiar. After a third verse, there is quiet organ section during which Minnear sings softly. Despite all the preceding adjectives, \"Way of Life\" isn't a bad song, but isn't nearly as tight or as good as \"The Runaway.\" It doesn't go anywhere fresh, and therefore lingers for too long. To add to the flaws of the song, the last ninety seconds consist of nothing but an organist playing the same irritating riff ad nauseum.\"Experience\" The music has a renaissance feel, and changes galore. The first couple of minutes consist of Minnear singing reflectively. Later, in between a bass riff that will be the backbone for the next section, Minnear intones over a lone chapel organ. Gary Green gets a lengthy guitar solo after Shulman's rocking vocal part. The coming-of-age lyrics are some of the best Gentle Giant has written, as they describe a timeless theme regarding life.\"A Reunion\" Short and sweet, the violin and cello receive an opportunity to shine, over a backdrop of acoustic guitar and well-played bass. When I hear this song, I think of it as the unlikely epilogue to a previous album entitled Three Friends.\"In a Glass House\" Loaded with twelve-string guitar work and a healthy dose of ingenuity, the title track is genius, rife with time signature and tempo changes. Shulman and Minnear take turns on lead vocals. Near the end we get some resonator guitar played with a slide, unusual for Gentle Giant, who has used probably every instrument short of the kitchen sink (which they will no longer need since they broke all their glassware at the beginning of the album). The lyrics depict an interesting twist in the concept of the album: We usually think of people in a glass house as being on display at all times; what if the glass that made up the house was really mirrors? Then the person inside would be forced to reflect on himself. The very end is a short collage of all the tracks, ending with the echo of one more glass shattering."
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Thursday, January 15, 2009",
      "rating": 4,
      "text": "While I gave Octopus a low rating, I definitely feel that In A Glass House is very much better. The feel of the music is darker on this album compared to the often too cheerful Octopus, which is apparent already by the look of the cover art. They also managed to produce lyrics that are worth taking seriously here for the first time in their career. In A Glass House is supposedly a concept album, but the concept is loose and invite you to think (instead of giggle, as was often the case on Octopus!) In A Glass House shows a more reflective, more mature Gentle Giant.Compared to Octopus the tracks here are much longer (the title track is almost twice the length of the average track on Octopus) and allow more breaks and instrumental sections. The synthesisers sound as synthesisers should for the first time on a Gentle Giant album. Notice particularly the Moog breaks on Way Of Life.The title track I think is a masterpiece and The Runaway is also quite excellent, even if I find the sound of breaking glass at the start annoying. I also don't like very much the repetition of short snippets of all the previous tracks at the very end of the album. But despite a couple of irritating moments, this album is really good overall.While the music on Octopus often was extremely complex, I felt that it lacked real depth. The complexity was often of a na�ve and simple kind, if that makes any sense. It was a type of complexity that jumped right out at you, and not a type of complexity that it takes several listens to reveal. I don't get that feeling while listening to In A Glass House except maybe on The Inmates Lullaby, which is slightly silly. But can get away with it here, because it tackles a serious subject after all. This is certainly not easy music to get into. I did not like it straight away when I first heard this album, it took several listens before I started to really like it, which is sometimes a mark of a good Prog album.In a way you could see In A Glass House as the result of Gentle Giant taking all the good aspects of all their previous albums and putting them into one, leaving out much of (but not all) the bad aspects.Recommended!"
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Tuesday, March 24, 2009",
      "rating": 5,
      "text": "Here I go with In a Glass House and I want truly say this one is just next masterpiece after Three Friends. It sits exactly after the biggest disappointment of the band for me - Octopus. I consider In a Glass House as the second best album by Gentle Giant after magnificent Three Friends.The album is concept and all the songs have the same folk prog sound. In a Glass House is the most prog folk album by GG. It proves GG to do so different kind of albums. That's why I called them an ocean. Here begins a series of albums with same conception by GG. This continues with next three albums (The Power and the Glory, Free Hand and Interview) and marks the best period in band's career. This period can be characterized with dynamic conception of the band and very varied and saturated sound, revealing the enormous musicianship potential ofthe band members. Everything here, in In a Glass House, is made with routine. The sound is constant and perfectly purposed, in difference with the last album - Octopus.All the songs are as a whole, a big entity. There aren't ideological discrepancies between the songs, which is one of the most important moments for a concept album. As I said most of the songs are prog folk, except the last one - the homonymous In a Glass House, I consider it more like symphonic prog. So all of my thoughts suggest to me, this will be without doubt 5 stars album."
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Friday, April 3, 2009",
      "rating": 3,
      "text": "Making Me Work for ItGentle Giant is not known for easy to digest music. And yet, once your brain becomes accustomed to their style, their sound can be quite enjoyable. There is a warmth, love, and humor in much of their music that draws even the novice musician in. (My 6 and 8 year old kids like GG). The album In a Glass House, however, ups the ante by being less whimsical, perhaps their most complex (which is saying something, this is GG after all), and just more work to get into. Unfortunately, there are also some recording issues that make it even harder (mainly the vocals being mixed too low and the EQ being a little too sharp (too much in the highs, not enough fullness in the lower registers))It is not surprising that on first listen in the car home from the record store, I was pretty disappointed. That was months ago, and many listens later, I must admit that there is some very essential GG here. It's worth the work. But it's not like Free Hand or Octopus that pull you in from the first listen and then continue to reward with hearing after hearing. This one is the ultimate \"grower,\" and deserves a track- by-track.The Runaway - Starts with the sounds of broken glass evolving into the rhythmic backbone of the song, not unlike Money by Floyd. Lots of clucky clean electric playing - both single note lines and strumming. Derek Shulman's vocals follow rather than lead here, and there are lots of different instrumental parts including recorders, big keys, dreamy harmony vocals, and complex time signatures. Toward the middle of the song, a new lead voice comes in (Kerry Minnear) and the whole song starts to pull me in a little more. There's just more thematic anchor to the second half that then allows the freedom to explore. (8/10)An Inmate's Lullaby - This song consists of two voices, a music-box key sound, and percussion. One of the voices is mildly distorted, the percussion employs single syncopated tympani hits, and the timing is quite complex. Simply put, this one is strange, experimental even for this band. I'm not sure it works, frankly. (5/10)Way of Life - A relatively simple riff over almost disco drums, and then Shulman singing in quite dissonant tonality that doesn't fit his voice well. This one is almost irritating at times, though certainly ambitious. However, there are many instrumental breaks and some of them are brilliant. There is a great dark minor march riff, some symphonic keys, and then back to the dissonant dance theme. That this juxtaposition works at all is remarkable, but this may be the lowlight of the album. (5/10)Experience - Here's where things pick up a bit. Still complex and angular, Minnear's vocals again just work better than Shulman's under the demands of the chaos. The guitars are distorted, filling out their tone, and the disparate parts just hold together better. When Shulman comes in, his vocals are effected, fuller and more up front. The song just sounds better. All the things they've been trying to do all album finally click. 9/10A Reunion - A remarkably short, quiet and simple piece, with Minnear again taking the lead. This is a much needed chance to come up for air before the final race to the finish. Pleasant ballad but not as good as the corresponding piece on Octopus (Think of Me with Kindness) 6/10In a Glass House - Like Experience, this song contains more of a thematic core that holds the piece together. These melodies just aren't that interesting though. Shulman takes lead vocals, and it works a little better than earlier in the album. This time, interestingly, Minnear's vocals are buried when they come in midway. This song does have a nice little slide guitar bit that comes out of nowhere. 6/10Experience (Live) - This is a bonus track on the 35th edition, and it may have saved the disc for me. Obviously, the recording process was completely different than the album. The bass is better, the vocals sit on top of the music much better, and of course there is the live energy. Like many live GG performances, this is actually a composite, and includes at least part of Runaway as well. This live track gave me another perspective on the music and a motivation to come back for further listens. Good choice for an add-on. 9/10This album suffers from two things - the exit of older brother Phil Shulman and overambition. In combination, these lead to a loss of the warmth and humor that serves as a foil for the complexity of the music. Luckily, the band continues to hone their sound and by Free Hand have created a masterpiece that combines the best of both worlds.This is one of the hardest reviews I've done on this site. Over time, I've considered giving this album anywhere from 2 to 4 stars. Three seems appropriate. This is still essential for the GG fans, but is for me in the bottom tier of their classic 8."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Sunday, May 10, 2009",
      "rating": 5,
      "text": "Two weeks ago I saw the semi-reunion gig of Gentle Giant in Gothenburg, Sweden. Before the concert I revisited Gentle Giant's discography (7 album in total, from the debut all the way toFree Hand). After listening to 6 of the albums I was finally there ... only one more album to go... I'm talking aboutIn A Glass House, an album that I never really understood. It has always been considered the highlight of the band's catalog but never really made my jaw drop.I finally stopped hesitating and placed the 35th Anniversary-CD into my music player. The feeling that I experienced 40 minutes later was beyond words! This time around I really appreciated songs likeThe Runaway, which I now consider to be one of my top 5 Gentle Giant-favorite compositions.Way Of Lifeis an awesome rocker but what makes it truly amazing is the middle section where Kerry Minnear takes over the lead vocals and turns this track epic! I even managed to enjoyExperiencea lot more, although I still consider the second half of the track much stronger than the slow intro.An Inmate's Lullabyremains for me the weakest track. As for the title track, it has always been a favorite of mine where the band gives their all time greatest performance.Considering that I've listened non stop to this album since my so called rediscovery ofIn A Glass House. I guess that it's safe to say that this release has surpassed the greatness ofFree Handand has become my favorite Gentle Giant release! But what about the reunion concert, you might ask?Well today is your lucky day, since I am starting my Gentle Giant retrospective! As I go through every one of the seven first Gentle Giant albums and uncover my thoughts on the songs and their live versions, that I experienced just recently. The only track played at the concert from this album was (of course) the magnificent title track! This was, for me, the second biggest highlight from the set since it sounded almost as good as the studio version (minus the acoustic guitar arrangement during the intro of the track). Want to know the biggest highlight? Just keep reading those reviews of mine!***** star songs: The Runaway (7:15) Way Of Life (7:52) In A Glass House (8:26)**** star songs: An Inmate's Lullaby (4:40) Experience (7:50) A Reunion (2:11)Total rating: 4,62"
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Friday, May 22, 2009",
      "rating": 5,
      "text": "Anyone who discovers Gentle Giant through IN A GLASS HOUSE and believes they are a certified prog fan will call this an instant classic. This is very easy to get into and understand because I feel there is an accessibility factor on this album; there exist tons of passages that make me think of soul music (''Experience'') and good old-fashioned hard rock (e.g. the last half of the title track). Remember though, we still have a group playing some of the most eclectic type prog here as there are some parts that are difficult to digest, so to speak.The playing on the album is stunning; almost makes me think that these kinds of compositions come naturally to Gentle Giant. Stylistic, dynamic and technical changes can occur of what seems to be abrupt, but the way Gentle Giant does it, they make every transition sound so natural and instinctive that it just adds to the enjoyment of the music rather than sounding awkward.I believe plenty of tracks have uptempo rock-like structures filled with complex vocal passages which is what most prog fans will enjoy hearing, and by that, I mean ''The Runaway'', ''Experience'' and ''In a Glass House'', the three tracks most likely to please the eager prog nut. I'd put ''Way of Life'' among those if those church organ bits weren't as annoying as they are. ''A Reunion'' is a very quiet, sombre track while ''An Inmate's Lullaby'' uses very peculiar percussive rhythms, giving a kind of ''avant'' feel to the track.There are so many great theme changes, time signature patterns, moods, atmospheres, obscure sounding lyrics and nontrivial instrumentations that anyone with a remote interest in prog rock ought to pick this up. And just for a bonus, the live cut of ''The Runaway/Experience'' is fantastic. A great entry point of the ''boys in the band''."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Friday, December 18, 2009",
      "rating": 4,
      "text": "I absolutely love Gentle Giant. And I know this album is a favorite for many here, but something about this one never quite clicked with me.I know this is the first Gentle Giant album without Philip Shulman, and it does suffer some for lack of his voice and sax. I also think that this is Derek Shulman's worst vocal performance on any GG studio album. His voice is uncharicteristically unintelligible throughout the album, taking quite a bit away from the music.The compositions, while good, are nowhere near the level of eitherOctopuswhich came just before this album, orThe Power And The Glorywhich immediatly followed this one. But the band has set such a high standard for themselves, that still leaves this a highly entertaining recording.3.5 stars, rounded up."
    },
    {
      "reviewer": "friso",
      "date": "Posted Wednesday, January 13, 2010",
      "rating": 3,
      "text": "'In A Glass House' is an album that wat later criticized by members of the band for its troubled production. Though the overall broadness of the sound is fine, the tone of the instruments and the arrangements are quite troubling I must admit. Moreover, a lot of vocals sound off pitch on this album, a problem no other Gentle Giant album has. Right from the opening of 'The Runaway' the vocals of Derek Schulman sound awful. The guitar sounds like a surf guitar, totally out of place. Some tracks like 'An Inmates Lullaby' are still classic Gentle Giant, but I eventually had to conclude I could not 'get into' this album. I do like all the other classic albums of the band."
    },
    {
      "reviewer": "Peter",
      "date": "Posted Thursday, June 10, 2010",
      "rating": 5,
      "text": "IN A GLASS HOUSE is Gentle Giant's fifth album, and the fully-realized product of a band at the height of their creative and musical powers. It's an essential part of their core catalog of weird and wonderful releases from their 1972 to '76 heyday.Giant's eccentric sound (which is, of course, unlike that of any of their prog contemporaries) had firmly solidified by their fourth release, OCTOPUS. The band knew what kind of music they wanted to make, and they enjoyed the unbridled artistic freedom to do so. They certainly weren't afraid to experiment, and to combine their many musical influences, from rock, to jazz to classical and renaissance, into a new -- and frankly bizarre -- hybrid. In short, at their best Gentle Giant were true originals who fearlessly blazed their own trail,. First and foremost, they sought to please themselves with their wonderfully strange music. If some open-minded listeners actually happened to \"get it\" and bought their albums and attended their concerts, then so much the better, but commercial success was never the band's primary goal. To this day, Gentle Giant's vocalist and front man Derek Shulman expresses surprise that their oddball music managed to find a fairly large, appreciative fan base. A major part of their relative success had to be the times; things were different in the rock world of the early to mid 70s, and experimentation, for artists and listeners alike, was often the order of the day. It's hard to imagine a risk-taking modern-day equivalent of Gentle Giant finding major-label backing and total creative freedom, let alone a sizable and dedicated fan base.IN A GLASS HOUSE, then, is the masterful issue of that happy marriage of utter freedom and creativity with outstanding musicianship. Because I grew up on the \"left\" side of the Atlantic, I never had this album \"back in the day,\" and was unaware of it, despite my being a committed Giant follower. (IN A GLASS HOUSE was originally unreleased in North America.) It was quite a revelation for me to experience this seamless, fantastic album just a few years ago, when I bought the re-mastered 35th Anniversary Edition. (This fine edition boasts excellent sound and instrumental definition, plus a wonderful '76 live recording of \"Experience.\" That they could routinely do this convoluted stuff note-for-note, night after night on stage further demonstrates just how consummately talented the Giant men were as musicians.) Track for track, this is undoubtedly one of the very best Gentle Giant works, and particularly strong songs such as \"The Runaway,\" \"Way of Life,\" \"Experience\" and the title track easily rate with the anything from their best albums.Overall, IN A GLASS HOUSE just might be my favourite Gentle Giant album. It easily warrants five stars as a \"masterpiece of progressive rock.\" Not to be missed!"
    },
    {
      "reviewer": "tarkus1980",
      "date": "Posted Sunday, August 8, 2010",
      "rating": 3,
      "text": "While many fans listOctopusas the band's best, there's also a good contingent of Gentle Giant fans that rate this as number one. In a way, I can see where they're coming from - the concept and lyrics are good, the ideas are complex and twisted without becoming irritating, the arrangements are as creative and untrivial as ever, etc. Yet while after many listens I can see all these positives, this album has nowhere near the same amount of impact on me thatOctopusalways has, and I don't think that additional listens will change that.The main problems stem from the fact that the band decided to abandon the \"slam tons of ideas into a short time period\" approach for a \"let's make the songs based on these ideas long\" approach. Yup, the number of tracks has been cut to six, and four of them last over seven minutes; this is hardly a bad thing in and of itself, but in terms of keeping my interest throughout, the songs don't measure up to the lengthier excursions of, say, Yes. There are simply far too many moments on this album where the arrangements, while just as impressive technically as before, lull my head into a stupor and force me to fight the urge to nod off. It also hurts that the vocal parts aren't that good even by Gentle Giant standards - except for the lovely (and perfectly appropriate) delivery that Derek gives in \"Inmate's Lullaby,\" it seems like the band (Derek especially) just included the sung parts for the sake of including them, without bothering to put any conviction behind them (which is a shame since, as mentioned earlier, the lyrics are just fine).Still, every track on here has decent enough 'raw materials.' They may not be put to the best use, often interrupted with quieter parts that add little to my listening enjoyment, but I would be lying if I said that, when looking at the track listing, any of the songs make me gag and lament my precious lost seconds of life. I'm not big on \"Way of Life,\" which has a cool dancable (ha) foundation but little else (that is, little else that I like - there's a lot going on in the track, it's just that not much of it makes me care), but I gotta admit it's funny to hear such a thing on a prog album (especially when I know that the band saw it as complex prog and not as proto-disco). Aside from the pretty (but underdeveloped) \"A Reunion,\" though, everything has at least a few solid chunks of quality. \"The Runaway\" starts the album on an extremely high note, with a rhythmic groove formed out of samples of glass breaking (not making this up), then turns into what could be an excellent intense piece (with great tight work from everybody) with a fine vocal melody, but is instead dragged down by the total lack of effort from the vocals and extreme excess in the mid-song jam. Cut this to five minutes from seven, and I'd be a happy man - as is, I'm just a mildly content man.The tracks bookending the second side are also quite good, though each has passages that I definitely think should have been left on the cutting-room floor. \"Experience\" starts off much like something fromOctopus(both in style and quality), then eventually enters a fine groove (with a great guitar and bass line), but also meanders into generic (and in this case boring) medievalism too many times for my liking. Still, what a great groove, even if Derek's voice adds little. As for the title track, it more or less bypassed me the first eight times I listened to the album, but I think that was just a function of me being tired. A lot of it seems somewhat like Gentle-Giant-By-Numbers to me (though that's not necessarily a bad thing), but it gets great in the second half, where we suddenly get this killer hard rock groove that has bits of steel guitar here and there that closes out the album.For all of the ambiguous praise that I can give most of the album, though, there is actually one track that I can't whine about. \"An Inmate's Lullaby\" is a perfect look inside the mind of somebody locked away in a mental institution, with odd processed Derek vocals, the best use of vibes you'll ever hear, and just such a bizarrely pleasant atmosphere that I can't help but love it. I actually almost get the feeling that Peter Gabriel, when putting togetherBirdyten years later, took a listen or two to this track (if he didn't, and I'm guessing he didn't, the resemblance is freaky) - substitute the vibes for marimbas, lay on a grumbling static synth pattern and muffle the singing, and you wouldn't be that far from that mid-80's soundtrack.So basically, it's a good album (and just short of a **** rating from me). Unfortunately, it's a noticable slip from the band's previous accomplishments - the complexity of melodies and arrangements is just as high as ever, but the ability to make the casual listener care about it is on the decline (though not gone by any means). If you're a hardcore prog fan, you might adore it, though."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Wednesday, September 22, 2010",
      "rating": 3,
      "text": "After my disappointment withOctopusI was slightly hesitant to continue drilling my way through the Gentle Giant discography. But the abundance of critical acclaim for second 4-album batch motivated me to do so anyway. Album number 5 on the list is an ok Giant album but it's still not as mesmerizing asAcquiring the TasteandThree Friends.The album rocks harder thenOctopusand with the opening killer track it takes a strong start. I like the samples of the glass shattering that sets the rhythm for the main riff. The weird baroque vocals are still an acquired taste and sometimes sound a bit gimmicky, just like the endless renaissance indulgences. I can't say I'm overwhelmed with powerful emotions when listening to them.The songs go through the typical Gentle Giant motions, with lots of strange twists, angular riffs and mathematical precision. It's a very studied type of music and there's no room for sonic experimentation, noise, improvisation or other frivolous things. The resulting effect is a bit sterile and lifeless, but it's technically perfect and probable very satisfying/frustrating for the musicians amongst us.It's excellent music but it misses something, it lacks the spontaneity and looseness that speaks to the imagination and tickles the senses. Surely a recommended title fans."
    },
    {
      "reviewer": "stefro",
      "date": "Posted Thursday, October 14, 2010",
      "rating": 4,
      "text": "A solid Giant album with a f*cking awesome(please excuse my French, but no other word seems quite strong enough) denouement in the form of the final, album-titled track, which showcases the group at their edgiest and best. Featuring a rip-snorting guitar riff from Gary Green, 'In A Glass House' must surely rank as one of the best individual pieces Gentle Giant ever concocted, coming as it does on their first genuine classic album. Of course, after 'In A Glass House' the Giant would concoct another two fantastic albums in the shape of the heavy- edged 'The Power & The Glory' and the intensely-eclectic 'Free Hand', but it is here that the group really flex their progressive muscles. With the departure of elder brother Phil Schulman, gone is the kitchen-sink humour and twee, medieval tinges that gave early albums such as 'Three Friends' and 'Octopus' their artistic bells, instead replaced with ballsy rock sections that juxtapose brilliantly with the more sedate, classically-informed moments. As an album 'In A Glass House' ranks highly, though incredibly, despite the undoubted quality on offer, the Giant would go on to better this hugely-entertaining album twice over in the following three years. Seen by many as the beginning of their golden period, this is a scintillating piece of progressive music that, technically-speaking at least, puts honoured groups such as Genesis, Pink Floyd and Yes to shame. Great stuff. STEFAN TURNER, LONDON, 2010"
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Saturday, November 6, 2010",
      "rating": 3,
      "text": "If I consider the score and the amount of reviews on PA for this fifth GG album, it is the best of the band. There are lots of five stars ratings and dithyrambic reviews (masterpiece, outstanding gem, powerful vocals, etc.).Since I only moderately like their music, I was quite curious to discover this work (I only got three of their albums during their classic period and did not get into GG more than that since 2004).What I can say is that there are indeed some good songs featured on this \"Glass House\" but none is getting me by the guts. It is true to say that this effort is more accessible; some songs even feature some pop moments (which is far from being the band's mould so far).I have to say that this is even embarrassing at times. Anyway, most aspects of the classic GG are still present even if the usual complexity is maybe a bit set aside. Jazzy atmosphere, folkish ambience, medieval passages and all the likes can be discovered throughout the album. So, even if one of the brothers is missing, the global mood of \"In A Glass House\" is not so unconventional.It is a good album for sure, with longer songs than usual. But no highlights as far as I am concerned. Three stars."
    },
    {
      "reviewer": "colorofmoney91",
      "date": "Posted Friday, April 8, 2011",
      "rating": 5,
      "text": "In a Glass House is an absolute Gentle Giant masterpiece. The songwriting here is more sophisticated that is has been in the past, and the musicianship still reigns supreme, and the compositions are still incredibly complex if not more so. This music is highly eclectic and jam packed full of instruments from all eras of time, consisting of the obvious guitars and percussion but also violins, flutes and various medieval instruments. One thing that I've always loved about Gentle Giant is the absence of organ sounds, usually opting for much more interesting keyboard variations. Most of the music is full of energy, but is always wildly creative and never boring in th least.Very highly recommended masterly crafted eclectic prog."
    },
    {
      "reviewer": "baz91",
      "date": "Posted Wednesday, April 13, 2011",
      "rating": 5,
      "text": "While this album sadly loses the warmth and playfulness of their earlier recordings, there can be no doubt that 'In a Glass House' was Gentle Giant's finest moment. 1973, the year that gave you classics like Caravan's 'For Girls Who Grow Plump In The Night', ELP's 'Brain Salad Surgery', Genesis's 'Selling England By The Pound', Pink Floyd's 'Dark Side of the Moon' and Yes's 'Tales From Topographic Oceans' now brings you this masterpiece album. I own the Alucard CD, which was remastered as late as 2009! The remastering is the best I have ever heard, and the songs actually sound like they were recorded yesterday. Everything is crystal clear, and there is not even any tape hiss!Beginning with the raw sound of breaking glass,The Runawayis surely very easy on the ears for fans of Yes, Genesis and the like. The playing throughout is extroadinary, and is very close in sound to the 'natural' prog sound, whatever that is. The beat is constantly kept up, although time signatures are obviously changed. The song flows perfectly from riff to riff. This is a flawless start to an amazing album.Gentle Giant had done 'creepy' before with songs likeEdge of TwilightandSchooldays. However,An Inmate's Lullabynever fails to give me goosebumps. Utilising extremely eerie vocal effects, this song is the musical definition of claustrophobic. Though the instruments sound quiet, they feel extremely close, and often there are two people singing at the same time, making it harder to work out what's going on. The lyrics are horrifying too, and sound as if they are read by a simple person:'Eating flowers growing in the garden where there are tasty tulips and I don't care if I wet my trousers'. The sentences all run together. Scarier too are lyrics like'Hurt myself this morning, doctor gave me warning', andI heard someone saying I think he'll be staying'. This one could give you nightmares, which is why it is utter genious.The antidote to this scariness is a bit of fun. The next trackWay Of Lifestarts with someone shouting 'GO!' The 4/4 starting riff makes this track sound much lighter than the last track. Of course the song doesn't stay in 4/4 for long. This song is actually the closest I think Gentle Giant came to sounding cool! At about the 2:30 mark, the song changes to a very different sound, which will define the beautiful outro, but not before another repeat of the introduction to the song. After the outro though is something completely different. In fact the final 1:40 is just Kerry Minnear playing something ghastly on the keys, and I don't like it at all, but I don't let it ruin the otherwise fantastic song.Experienceis a track that slowly builds up to something superb. While not as instantly gripping as it's other 7 minute counterparts, this track is nonetheless enjoyable all the way through, and there's a great guitar solo towards the end of the track. If you need more reason to listen to this song, there is a section in 6 2/3 over 4, and the outro is in 9/4.Beginning with a heartbeat - coincidentally the beginning to the Floyd album released in the same year -A Reunionis Gentle Giants chance to take a breather. This is an acoustic track, with only acoustic guitar, bass guitar and violins being used. There's nothing particularly interesting about this track, but it creates a very welcome change in atmosphere in the record.The title trackIn a Glass Houseis my favourite on the record, simply because of the great themes used. This track uses many different genres as inspiration, and you'll hear tempo, instrumentation, time signature and mood change several times within this track. This track actually feels more like two songs joined together, at about 4:15. Both parts are very cool, but musically they don't coincide at all. Afterwards there is an outro to the album using clips from all 6 songs, and the sound of smashing glass once again.'In a Glass House' seems extremely different to the groups earlier albums, more serious and somehow far more proggy. This fine album showcases some of Gentle Giant's best compositions, but more fantastic songs were on their way. To me though, this is their magnum opus."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Sunday, June 12, 2011",
      "rating": 4,
      "text": "First released in the UK on Phillips Records subsidiary Vertigo on September 21, 1973.1. \"The Runaway\" (7:15) talk about some mathematically constructed music! Even the marimba solo has a 'pre-planned' feeling to it. Still, this song has a very (misleadingly) easy going feeling to it--and the vocals make for one of the most melodic and accessible songs in the GG catalog. (9/10)2. \"An Inmate's Lullaby\" (4:40) presents itself as almost a Mother Goose nursery rhyme like children's song. But it's not. It is a very jazzy percussion-oriented song. I think both Miles Davis and Harold Budd would be quite proud to have composed this song. (9/10)3. \"Way of Life\" (7:52) is a bluesy vamp with a pre-disco beat/sound (reminiscent of The Four Seasons' \"O! What a Night!\" and Madness' \"Our House\"). Rather brilliant organ and lead guitar work offer the listener an alternative to the rather poor vocals and rhythm structure. (/15)4. \"Experience\" (7:50) is a Renaissance troubadour song using modern instruments that, frankly, doesn't work. The a cappella vocal (gorgeous!) alternating with silly bass line section (later repeated with organ alternating with same silly bass line) is an excellent example of what's wrong with this song: excellent & beautiful playing along side poor and almost laughable. (/15)5. \"A Reunion\" (2:11) is a pretty little folksie Renaissance song. This one works. (4/5)6. \"In a Glass House\" (8:26) illustrates how GG can hit on all cylanders: amazing keyboards, JTull-like guitar sections, folksy vocals and acoustic guitar picking, all woven together quite masterfully--like a church dialogue. (18/20)Total Time 38:14Gentle Giant has been one of my favorite re-discoveries of 2011. Brilliant composition and performance with often quirky and unsustained or more intellectual or mathematical melodies. One of the most highly acclaimed GG discs has moments of sheer brilliance, but, IMHO, not enough to be able to claim true masterpiece status.This album opens and closes with four stellar songs (two at each end), yet somehow this fails to offset the let down of the middle two. \"Runaway\" and \"In a Glass House\" are two of my favorite GG songs, but the album cannot quite earn me the full 5 star \"masterpiece\" designation. Four maybe 4.5 stars: an excellent addition to any prog lover's music collection."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Wednesday, August 24, 2011",
      "rating": 5,
      "text": "The departure of Phil Shulman did mean that Gentle Giant lost his saxophone playing, but rather than simply replacing him the band took the opportunity to hone and tighten up their sound. This narrows the diversity of the tracks on In a Glass House a little compared with previous albums, but on the plus side this helps the band to focus on the album's concept, which centres around ideas of imprisonment, confinement and surveillance in society.And really, even though there isn't any more sax playing from Phil we're still dealing with classic-era Gentle Giant, so the album covers far more musical territory than many of its contemporaries and shows more than enough variety and complexity to keep prog fans happy. One of the best things about Gentle Giant is their talent for creating compositions which are on the one hand extremely complex but yet at the same time are insanely catchy, and this skill is out in full force on this album. Ranging from the delicate and gentle to the wild and rocking, In a Glass House is yet another Gentle Giant classic."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Sunday, November 4, 2012",
      "rating": 5,
      "text": "Gentle Giant's \"In A Glass House\" is one of their most popular albums, and in fact receives high ratings from many reviewers. The lineup are infamous as one of the all time greats in prog history. Gary Green is awesome on 6 & 12 string guitars, mandolin, percussion, alto recorder, Kerry Minnear is brilliant on keyboards, tuned percussion, recorder, vocals, Derek Shulman is a marvel on vocals, alto sax, soprano sax, recorder, Ray Shulman is particularly great on this, playing bass guitar, violin, acoustic guitar, percussion, and John Weathers is magnificent on drums. This is one time when everything went right and, when the chemistry was evident, nothing could stop these influential pioneers of prog; these progenitors of eclectic rock.It begins with glass smashing, as if stones were being thrown into windows in a rhythmic meter, on the warm melodic 'The Runaway', and this classic song is literally shattering the boundaries from the outset. Gentle Giant love to break walls of musical boundaries down as is evident on all of their earlier albums. The fractured guitar rhythms, percussion and keyboards are thrown about like stones exploding into shatters as they hit their target. This album certainly has it's fair share of quirky pieces such as 'An Inmate's Lullaby', a paean to a mental institution, with a ton of crazy glockenspiel, a seizure of guitar chords, and insane time sigs throughout. The polyphonic or metronomic time sigs are prevalent with some of the oddest switches in musical tempos you will hear. The music bounces all over the place and injects that whimsical sense of fun; the band never took themselves as seriously as their critics.The quirky edge is heard on the jaunty manic phrases on 'Way of Life', that begins with the shout of \"Go!\" Then the band in fact do go for it with no holds barred relish. This track has that medieval flavour that the Giant loved to explore, sounding like some fairy tale at times with instruments more suited to the 18th century Elizabethan era. Then the organ and heavy guitar joins to remind us this is 20th century prog. The lyrics are as fragmented and crazy as the music; \"You'll find an answer, You've got to believe in your own way of life, So you'll have to find an answer, You'll have to find a way, try to find, try to find, You'll try to question her, Does she believe in the choice of your life, So you have to try to ask her, when you are away, left behind, out of mind, away.\"'Experience' opens side two with glorious fanfare, along with that weird high vocal register and some wonderful basslines. The music is a circus sideshow of keyboard whimsy and frantic guitar spasms. The sigs are twisted into shapes and turned inside out and the band keep up, tighter beyond compare. The glockenspiel is followed by courtly a capella harmonies, the trademark of Gentle Giant. The lead break is fat and muscular and I like how the more forced vocals break through the technical layers of music. This is definitely one of the best Gentle Giant songs showcasing all that they stood for in one sitting.'A Reunion' is a short little piece infusing very calm melancholy strings and vocals; \"Meeting in this way who could have known, How our destinies and ways apart have grown, Looking still the same after all these years changing only in my memories not clear, and believing all futures we would share.\" This makes a nice departure from the complex time sigs and is quite a serene piece with Ray Shulman's violins becoming so essential to the sound.'In a Glass House' ends the album on a mini epic, opening with intricate phrases on bass, drums, violin, mandolin, chimes and whatever else they could get their hands on. The medieval troubadour flair is obvious and the vocals have a nice rhythm spouting imagery of some fanciful musings; \"Living in a glass house shielding all that's meant for me, Can you clear the shade and can you tell me what you see, Shadow fills the light until the glass house becomes the night, dark is gleaming or am I dreaming.\" The instrumental break is incredible with tons of brass, woodwind and a dynamic bass punctuation. It is complex and impossible to emulate but incredibly infectious. When it breaks into the heavy guitar riff I am completely entranced by this amazing composition. This is quite possibly the greatest gentle Giant song, they saved the best for last. It features the weird little courtly moments of Elizabethan charm sandwiched in between the heavy guitar augmentations, that seems to be playing in a 29/8 time sig if that were possible, though Gentle Giant make it possible. It ends with another pot shot of glass breaking and thus a legendary album was thrown through the glass house of the musical industry to the masses.Gentle Giant tip their hat at the establishment, the stuffy musical industry, and show it is possible to play brilliant music and still have fun. \"In A Glass House\" is quintessential Giant without a doubt, all killer and no filler where everything just worked. The band are obviously virtuosos and deserve their high powered reputation. This is definitely one of the best albums from their catalogue, along with \"Power and the Glory\", \"Free Hand\", \"Acquiring the Taste\" and \"Three Friends\". Masterpiece is the only way to describe it as everything on \"In A Glass House\" is incredible legendary prog, without a shadow of a doubt."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Friday, January 30, 2015",
      "rating": 5,
      "text": "IN A GLASS HOUSE was made under pressure because of the fact Phil Shulman left the group leaving the group as a quintet and also by the fact that Columbia Records dropped them at the same time due to their uncommercial sound. Luckily that meant that the band retained control of their master tapes and after not being released in North America for decades was finally remastered and available everywhere in 2004.Luckily all the members of GENTLE GIANT were multi-instrumentalists so that didn't mean any particular sound went unrepresented although Phil was a major contributor in the horn section and although Derek Shulman picks up sax duties on a couple tracks, this album contains noticeably less horns and rocks more than any album before. The electric guitar displays some seriously heavy riffing and is the prominent feature on IN A GLASS HOUSE with the other usual suspects making their appearance such as the whacked out glockenspiel parts, organ runs, violins wending their way through medieval, classical, rock and GG-style avant-garde.The fact that GG made yet another masterpiece that is as different from the previous albums as can be only testifies to their utter brilliance in continuing to reinvent themselves and standing tall in the face of any adversities. Their assiduousness is admirable with every detail laid out in texture, tone, tempo and tenacity. GENTLE GIANT really reaches new heights here. All that came before reaches a sublimeness despite everything leading up to this release also being brilliant albeit on a less complex level. The ability to keep a melody and mangle it with complex interludes, extremely demanding tempo shifts that change with no prior notice, instrumental parts that shouldn't work where they do and the mixing of mellow medieval segments alternating with hard rocking parts that can be folky and classical at the same time, is the reason GENTLE GIANT remains one of the most unique, talented and demanding bands of all time and despite all the complexities the melodies somehow register as pleasing to the ears all the while leaving you scratching your head wondering how they just pulled that off.The fact is GENTLE GIANT wanted to create the absolute most original music of their day. This is a feat that many a band had in their vision but absolutely no one pulled it off with more panache and class than GG who liberally borrowed every style of music known to humankind and deftly assembled all the parts into a musical vision that was so far ahead of its time that its taken the rest of the world four decades to catch up to. Although i absolutely love every GG that preceded IAGH, it is on this release i feel that they reached the pinnacle of their progressive genre fusion powers where every note and every single phrasing is sedulously matched in an impressive piece of perfection. Mega Classic!"
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Sunday, February 1, 2015",
      "rating": 4,
      "text": "'In a Glass House' - Gentle Giant (81/100)First of all, let me say that I am beyond glad that I decided to listen toGentle Giant's discography in chronological order. They're one of the greatest examples I can think of in progressive rock of a band that continuously attempted to reinvent and evolve their sound as time went on. With that in mind, it's easy to understand why my experience withIn a Glass Housewould be informed heavily by recently listening toGG's earlier work. With this album (their fifth, chronologically speaking)Gentle Giantmaintained the fearsome technical proficiency and general busyness that defined the predecessorOctopusand most of that which came before. However, with the departure of longtime main vocalist Phil Shulman, the band gave their style a more focused (and even more serious-sounding) tone. WhileGentle Giantbecome ever more deserving of being called out forKing Crimson-variety self-involved pretentiousness with every album they put out, the focused compositions and reined-in weirdness putIn a Glass Househead and shoulders aboveOctopus. It may not beGentle Giant's magnum opus, but it's relatively up there.It's really toGentle Giant's credit that I have to keep rethinking what I thought of previous albums every time I hear another of theirs. My dominant impression ofOctopuswas that it was too serious, and lacked the personality needed to justify the outlandish technical direction they were taking with their music. By comparison,In a Glass HousemakesOctopuslook as fun as delightful asAcquiring the Taste. Even so, while my initial impressions withIn a Glass Housewere just as muted as with its predecessor, repeated listens have made me love it almost as much as the first two albums.Yes, the wacky 'everything but the kitchen sink' mindset that Phil Shulman brought to the band is missed (and in a way, this feelslesslike aGentle Giantalbum as a result) but the weirdness is traded off for a much-desired sense of structural focus and moderation. Even in their greatest moments (most of which may be found onAcquiring the Taste)Gentle Giantstruggled with relaying sense to their often- messy compositions.In a Glass Housedoesn't get them out of that hole entirely, but listeners who struggled withGentle Giant's characteristically tactless flow should find this much better suited to their tastes.OnIn a Glass Housemoreso than everGentle Giantwarrant a comparison toKing Crimson. The heavy European Medieval influence notwithstanding,Gentle Giant's mid-era stance as a serious band taking serious music seriously closely echoes what Fripp andCrimsonwere doing around the same time- the jarring tranquility of \"An Inmate's Lullaby\" even sounds like something the gamelan aficionado Fripp himself may have concocted.In a Glass Housemay feel less personally characteristic and more along the lines of a garden variety prog rock record, butGentle Giantstill instil themselves in the album by means of the sheer technicality which, in keeping with their legend, is almost unbelievably tight and complex. Even the would-be 'soft' track \"An Inmate's Lullaby\" comes off as angular and technical, especially for a celesta and glockenspiel-directed piece. The winding Medieval spiral-staircase of \"Experience\" is instantly gratifying, shocking, yet takes several listens to even begin to understand. Part of the enjoyment of the album's more byzantine passages (especially when first hearing it) is that sense of being out of control. Even with progressive rock, that is a pretty rarely-found impression.The vocals and sporadic instrumental jumbles have both been toned down, and while at first glance I thought that might have been a bad thing for the album, it's actually resulted in some of the most memorable songwritingGentle Giantwould ever do. \"the Runaway\", \"Experience\" and \"In a Glass House\" are full of immortal riffs I would have never expected to hear from a band likeGentle Giant. \"Way of Life\" feels a bit rushed for its own good, and like many 'calm before the storm'-type acoustic ditties you see on the latter halves of prog records, \"A Reunion\" doesn't so much affect as pleasantly occupy the listener. \"The Runaway\" and \"Experience\" are two of the best slices of traditional progressive rock you're bound to find. It should also be mentioned that while Derek Shulman sounds a little out of his class doing leads (his vocals sound workmanly at best), the notable lack of wild harmonies helps to keep the focus on the instrumentation, where (at least for a band likeGentle Giant) it probably belongs.In a Glass Houseis a very stately album- far, far, far moreso than I ever would have thought to hear fromGentle Giantupon being introduced to the self-titled and the wackyAcquiring the Taste. Only a few years since the debut, andGlass Gianthad a much differenttasteto their sound. It's just as impressive, albeit not quite as viscerally fascinating as the early stuff.In a Glass Houseproves once again thatGentle Giantwere one of the most proficient acts of theirs or any day. I may hesitate to call it a masterpiece (I'm not convinced thatGGare good songwriters so much as inventive composers) but after the relative listener's disappointment I felt hearingOctopusand evenThree Friends,In a Glass Houseshows a band's renewed vision at the top of their form."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Sunday, September 17, 2017",
      "rating": 5,
      "text": "Review N� 135'In A Glass House' is the fifth studio album of Gentle Giant and was released in 1973. It became with 'Octopus' as one of Gentle Giant's most popular albums. 'In A Glass House' is another conceptual album. Its concept is very original and strange and is allegedly based around the idea that people who live in glass houses shouldn't throw stones. Curiously, the album begins and ends with the sound of breaking some glasses. It was the band's most directly and psychological effort ever. 'In A Glass House' is probably their most ambitious work, with four lengthy songs as 'The Runaway', 'Way Of Life', 'Experience' and 'In A Glass House'. With it, they delivered another masterful work.'In A Glass House' represents a very important landmark in Gentle Giant's musical career because it marks the definite departure of one of the three Shulman brothers and former member Phil Shulman. He left the group because he was burnt out and discouraged after some problems with the public, especially after the difficult live concerts done by the band when they supported a live tour of Black Sabbath, and so, he had realised that the lifestyle of a touring musician was damaging his family life. Instead of finding a replacement, the remaining band members decided to continue just as they were. So, 'In A Glass House' became the first Gentle Giant's album released by the group after the departure of Phil Shulman. John Weathers even sustained that they became a stronger band after Phil left Gentle Giant.The line up is Gary Green (6 and 12 string guitars, mandolin, percussion and alto recorder), Kerry Minnear (vocals, keyboards, tuned percussion and recorder), Derek Shulman (vocals, alto and soprano saxophones and recorder), Ray Shulman (vocals, bass, acoustic guitars, violin, trumpet and percussion) and John Weathers (drums and percussion).'In a Glass House' has six tracks. The first track 'The Runaway' written by Kerry Minnear, Derek Shulman and Ray Shulman is a song with an extraordinary and surprising beginning where the band seems to break some glasses. This is a very rich song with rich varieties of styles and textures, extremely melodic but is also at the same time complex and very creative. This is an extraordinary track, one of the best tracks ever released by them and a perfect way to open the album. The second track 'An Inmate's Lullaby' written by Kerry Minnear and Ray Shulman is a completely different song from its previous track. It's an avant-garde and strange song especially performed by drums, xylophone and vocals. This is probably the most experimental song on the album, it isn't particularly melodic and we need some time to be familiarized with it. The third track 'Way Of Life' written by Kerry Minnear, Derek Shulman and Ray Shulman is a song with driving rhythm, fast tempo and tempo changes all over the track. We may say that this is another progressive experimental song with some extremely beautiful and melodic moments and at the same time it has also some strange musical parts. It's a very solid and variable song with melody and improvisation at the same time. This is a truly Gentle Giant's track. The fourth track 'Experience' written by Kerry Minnear, Derek Shulman and Ray Shulman is another extraordinary song, very inventive and with a very complex musical structure. Basically, this is a perfect example of Gentle Giant's medieval complex sound, but the song comprises also many others and varied forms of music. The song is also rich of wonderful vocal harmonies. This is probably the most complex track on the album. The fifth track 'A Reunion' written by Kerry Minnear and Ray Shulman is the smallest, simplest and most calm song on the album. It's basically a soft acoustic ballad that reminds me a quartet in the classical music. It's a fine and emotional song with beautiful melody, but it seems be dislocated on this album and is probably the weakest track on it, despite its beauty. The sixth and last track is the title track. 'In A Glass House' was written by Kerry Minnear and Ray Shulman and is the lengthiest song on the album. It's another excellent composition with great harmony between all musical instruments. The chorus performed by the four singers is also of superior quality. It has also a hard rock section with a memorable guitar riff, in the second part of the song. This is a great track that closes magnificently this amazing piece of music.Conclusion: 'In A Glass House' is a very important album after their two great masterpieces 'Acquiring The Taste' and 'Octopus'. 'In A Glass House' is also a very important album because it was their first album without the participation of one of the Shulman brothers. Phil was one of the main composers of the band. It's interesting to note that the quality of the music performed by them hadn't lost nothing and probably even improved a bit. Probably, I agree with them when they said that Gentle Giant continued with Kerry Minnear and Ray Shulman writing great stuff and that probably they became a stronger band after the departure of Phil Shulman. So, 'In A Glass House' is without any doubt one of the greatest prog rock albums from the 70's. It's with 'Acquiring The Taste', 'Octopus', 'The Power And The Glory' and 'Free Hand' one of their best works, and all of them are some of the best prog rock albums ever made too.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Wednesday, December 12, 2018",
      "rating": 2,
      "text": "If I consider the score and the number of reviews here on PA, In A Glass House is the masterpiece of GG. It is the first in this ranking. Instead I think it is one of their worst albums, despite being one of the most progressive.Side A. 1) The Runaway 8; Brilliant the initial rhythmic rock of the first song, which then rattles off in a thousand variations and in some steps of their typical math rock, which towards in the end results a bit exasperated and repetitive. 2) An Inmates Lullaby 6.5/7; The second piece, as the title suggests, it's a lullaby; an original piece compared to the previous production, all choruses and percussions; it could remember (and make to regret) Edge of Twilight or Moon is Down. 3) Way of Life 7+; Third piece of a compulsive rock, very sustained, all keyboards, with reinassance variations, which in some places almost reaches an epic inspiration that however expires in math rock.Side B. 4) Experience 6.5; Second side (worse than the first) with the same structure: two long rock tracks interspersed with a classic bracket. It starta with a rock piece that begins undertone, continues with a medieval intermezzo and continues in a very forced way (with bad guitar solo), little inspired. 5) A reunion 6+; Follows a brief parenthesis with the strings: an anonymous piece, without a great melody, subdued; 6) In a Glass House 7+; Conclusion with the piece that gives the title to the album (the longest of the GG after Nothing at All), a folk rock characterized by the violin and the sustained rhythm, that changes continuously, and suddenly, in a completely forced way: the piece doesn't know what direction it wants to take.There is a lot of technique and a lot of sophistication, a lot of skill, but - with the exception of the first piece - there is not much inspiration in the pieces of this album, which in fact are the ones that remain the least in mind of all the classic production of the Gentle Giant. There is in fact no masterpiece, no classic, no melodically remarkable piece. In terms of arrangements, nothing new compared to Octopus, if not the absence of the winds, which makes the music more monotonous, also because compared to Octopus has lost in clarity and conciseness, as well as in melody, to become more convolute and repetitive . It is the progressive in full of its faults. In this album there is a band without inspiration that uses all his craft to create compositions according to the crism of progressive rock: but when you compose art without a real expressive urgency, thinking only of making a pedantic execution of the canons of a genre (musical or literary ), you get a formally flawless product, perhaps exalted by some lovers of the genre, but that is completely insipid emotionally and that seems unbearably didactic for those who do not like the genre.Medium quality of the songs: 7,00. Rating = 6.5 / 7. Two stars. Very Overrated."
    },
    {
      "reviewer": "rogerthat",
      "date": "Posted Tuesday, December 29, 2020",
      "rating": 4,
      "text": "A long, long time ago (OK, not that long ago in prog world but certainly feels like a long time to me), when yours truly was getting into prog, the track Experience off this album was one of the first prog tracks I heard. Needless to say, I was simply confounded by the track. I filed it for comprehension at a later date.As it happened, my full fledged dive into prog, where I began to devour back catalogues of the who's who of prog would come about a couple of years later.This time, I sampled Runaway before I ventured any further on Gentle Giant. I hadn't heard Experience again at all but I did remember the, er, experience rather well.Runaway clicked where Experience didn't. Perhaps, the slight Jethro Tull-ness of the track makes it a little more accessible than many other Gentle Giant tracks. Which isn't necessarily saying much.I have sort of said a version of this in my other Gentle Giant reviews but they are really like no other prog rock band. Broadly speaking, prog rock bands are either accessible and somewhat catchy (Genesis, Yes, Jethro Tull) or not very accessible and not very catchy (King Crimson, Van Der Graaf Generator, Magma). The former are easy into get into and the latter, it is understood, need growing into and may not be for everyone.Gentle Giant on the other hand is rather catchy and yet not accessible!Their tracks are short by prog standards (the longest one here clocking eight and a half minutes). They are also laden with molten hot funk grooves. They are unabashedly playful in a way that comes off as goofy. That is one of three primary sources of irritation for those who don't like the band. Number two, Derek Shulman's vocals and even many fans, including myself, make peace with his singing for what it is. Number three, the songs go through lots, and I mean lots, of changes within the five-six minute length. Long before there was Spastic Ink, there was Gentle Giant. The music changes so much it gets rather restless and that too may turn off a lot of people. Even if it doesn't, it may simply get difficult to get a handle on what's going on.With all that said, in the intervening two years since my first experience of Experience, I had gotten a better grip over prog. So...I made headway with Runaway and then gingerly tried Experience, finding to my surprise that I rather liked it now.In fact, Experience is probably my second favourite off the album. The first being the title track. It's vintage Gentle Giant - a violin part interlocking with a keyboard figure and then a different keyboard part comes in, paving the way for vocals. Which end with a stylish guitar groove. How they pass through all these changes smoothly is a mystery but they do it...that is, for those who do enjoy the music. At the half way mark, a much more rock-ing riff comes in, eventually leading to a country-like guitar part. And on and on it goes.Runaway is wonderful but once you HAVE become a Gentle Giant fan, it feels almost tame in comparison to Experience or the title track! Way of Life is likewise and overstays its welcome a tad. Reunion and Inmates Lullaby are too brief to really hit home, on the other hand.All in all, this one isn't quite up there with Acquiring The Taste, Octopus or Free Hand. It's still a very strong four, which is most everything they did from the debut right up to Free Hand."
    },
    {
      "reviewer": "TCat",
      "date": "Posted Monday, June 14, 2021",
      "rating": 4,
      "text": "\"In a Glass House\" is the fifth studio album from Gentle Giant and was released in 1973. By the time of its release, the band had garnered enough fans and people had started to acquire a taste for the band's quirky complexities, odd time signatures, and their bizarre way of incorporating folk and modern music in ways that were completely unique to the band. The public even excused the interesting harmonies that didn't follow the norm, in fact, it seemed that more and more, they were craving it. The band had been, at least to this point, fairly lucky with their consistent line- up, and they had only really made a major change in their sound after their first album. So things were sitting pretty good for them. However, before recording this album, they had lost one of their original members; Phil Shulman, who felt that the touring life was ruining his family life.This would be the first album with the band reduced to a quintet, and it was uncertain how the band would be received minus the vocals and horns that Phil provided. There was a shift in the band's sound to a more guitar- oriented sound, but overall, the basic feel of the band remained intact. But with the uncertainty with this line-up, it was decided to not released \"In a Glass House\" in the U.S. It's really quite a shame as the album has been somewhat ignored in retrospect, however, at the time, it ended up being the band's biggest seller to date. It has every reason to be recognized, because it is still full of GG's signature styles and sounds, and it easily fits in with the discography of the band at the time. Made up of 6 tracks, 4 of them great, meaty tracks at over 7 minutes each and 2 shorter tracks that help to even things out.The Runaway - This track has a nice lilt to it through the first few verses, but as the instrumental break comes in, it gets quite a bit more complex. There seems to be a bit more guitar here, albeit a bit jangly, but still quite enjoyable. The marimba in the middle of the song is a great touch too, plus the crazy complexity of the melody keeps it all interesting.An Inmate's Lullaby - An almost music box quality in the beginning, then two contrasting vocal lines, one of which is interestingly processed, to almost sound like it is coming from inside the box and another vocal line that is more upfront, but less important. There is some quirky interplay between the tonal and traditional percussion instruments, once again with the help of the marimba and the complexity is also there, making this one hard to sing, let alone whistle along to. But then, we are not here to whistle now, are we?Way of Life - Suddenly more upbeat and heavier. A guitar riff sounds like it is going to define the track, but remember this is Gentle Giant, and it soon veers off into the usual complexities furnished by the guitar and keys. The rhythm tries to keep things \"sensible\" but that would be impossible to carry that on for too long now wouldn't it. The center section calms down quite a bit and becomes more traditional-folk sounding, losing the percussion for a while, but it comes back in a stately way. Thematic returns help to keep the track grounded even with all the progressive horseplay going on here. The weird repeating organ at the end is a bit of an odd ending.Experience - This one lightens things up a bit, at least as far as the tone of the track, and is a bit more playful. As a result, it seems a bit weak in substance, but its still signature Gentle Giant. This finally become more intense after 3 minutes in when the vocals become louder and the guitar and hard piano chords take over. The guitar solo that comes later sounds more like it is improvised while the supporting instruments play repeating backup, but then it goes back into progressive structure later.A Reunion - A short folksy piece with soft singing, string ensemble and such. It's a nice intermediary track that helps to break up the complexity a bit.In a Glass House - Returning to an upbeat, start-stop style with a nice violin riff. A vocal section, then a tricky guitar lead which leads into a complex lilt. Don't expect anything to sit in one place for too long though, as this one flows along adding in jazz for a nice Canterbury feel which often gives way to rock sensibilities, passing back and forth often. It even finds time to throw in some twangy acoustic guitar just in case you think you've heard everything. Break some glass and get a quick review of the album with some quick snippets of all the songs.This album ends up being another great album from GG's best years. It is one worth looking for if you are trying to build up your classic-prog library, but it can be a bit more difficult to locate in North America, yet it really shouldn't be ignored. After this point in the band's history, the line-up would not change again, but remain until the split up in 1980, which came about because of the drive of some band members to get a hit record and the desire of other members to return to the band's classic prog sound. At least the band would still have some great albums up their sleeves for a few more years."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Thursday, October 10, 2024",
      "rating": 4,
      "text": "Without the resigning Phil, the eldest of the three Shulman brothers, Gentle Giant rethink their future and among the five remaining members they reassign tasks without looking for a replacement for the outgoing musician, and to a large extent this fact redefines their musical approach for \"In a Glass House\" (1972), the band's fifth album. A transitional stage that does not leave aside their experimental and colourful vein, but with less convoluted and more amiable sonorities, configuring a somewhat different approach with respect to their previous works.Crystals breaking harmonically announce the starting point of the A-side of the album and the track \"The Runaway\", an exercise of lilting baroque reminiscences sustained in good measure by the friendly counterpoints between the versatility of Kerry Minnear's keyboards and Gary Green's guitar riffs that lead to a warm marimba solo by Minnear, followed by the interesting combination of percussive elements with Derek Shulman's megaphonic vocal cooing in the haunting and dreamlike \"An Inmate's Lullaby\", and by the contradictory \"Way of Life\" that intertwines an unexpected funky rhythm with a very attractive middle section of medieval airs marked again by the active Minnear on keyboards.The eclecticism and sonic diversity of the reflective \"Experience\" kicks off the B-side and provides the space for one of Green's rare guitar solos (whose individual participation on the album is resigned in favour of the melodies as a whole), continues with the gentle beauty that Minnear's cello and Ray Shulman's violins lend to the brief \"A Reunion\", and culminates with \"A Glass House\", and culminates with another eclectic essay, 'In a Glass House', which features a very intense John Weathers on percussion (as on the whole album, by the way), and has the particularity of including in its final section a minimal sample of each previous song, a resource used by other bands later on, such as Queen in their song \"More of that Jazz\" from the album \"Jazz\".Commercial success was again not on Gentle Giant's side with their excellent 'In a Glass House', a constant in the band's career, sharing such 'honours' with other generational cult groups like VDGG, Camel or King Crimson.4/4.5 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album94e9.html",
  "last_parsed": "2025-05-18T12:35:36.364579"
}