{
  "album_title": "DARWIN!",
  "artist_name": "Banco Del Mutuo Soccorso",
  "artist_page_link_local": "artistf62c.html?id=36",
  "year": 1972,
  "rating_value": 4.39,
  "rating_count": null,
  "review_count": null,
  "genre": "Rock Progressivo Italiano",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/36/cover_15596652016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "L'Evoluzione",
      "duration": "13:59",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "La Conquista Della Posizione Eretta",
      "duration": "8:42",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Danza Dei Grandi Rettili",
      "duration": "3:42",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Cento Mani E Cento Occhi",
      "duration": "5:22",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "750,000 Anni Fa ... L'Amore?",
      "duration": "5:38",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Miserere Alla Storia",
      "duration": "5:58",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Ed Ora Io Domando Tempo Al Tempo Ed Egli Mi Risponde ... Non Ne Ho!",
      "duration": "3:29",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Marcelo",
      "date": "Posted Tuesday, December 30, 2003",
      "rating": 5,
      "text": "The perfect mixture between complex and beauty. The best of BANCO, a superb album. Incredible instrumental richness, lots of variations, very expressive voice, long epic tracks and beautiful short songs, all in the same bag. This stuff is the pearl of the great BANCO's trilogy (the first three albums they edited), and deserves a privileged place in a serious prog discoteque. One of the Italian monsters, highly recommended!"
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Monday, March 15, 2004",
      "rating": 4,
      "text": "A great epic journey by this well respected legendary Italian progressive rock. \"Darwin\" was BANCO's 2nd release and is certainly one of their most complete works of art. \"Darwin\" is a very expressive album and offers a wide range of tones and moods with a superb blend of classical and progressive chamber rock. \"Darwin\" is a heavy theatrical production which comes across as a great concept-like piece of art. Loads of great keyboard work here as you would expect and songs are exceptionally well pieced together. I love the inter-exchange of the rock ideals with the classical style BANCO mix here. Oboes, clarinet and harpicords get interwoven with synths, piano and electric guitar. The CD re-mastered version is exceptional and offers grand sound reproduction. This is a real treasure for those lovers of Italian prog rock and is also a great place to start for the young at heart."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Thursday, April 1, 2004",
      "rating": 4,
      "text": "A jewel, probably their best album, even though by regarding the difficult connection between a song and another, some critics have been criticizing such concept album for many years... but apart from this controversial opinion, to me the impact was enormous and the work of the keyboards fantastic as usual!!"
    },
    {
      "reviewer": "Fitzcarraldo",
      "date": "Posted Friday, May 14, 2004",
      "rating": 4,
      "text": "This concept album is my favourite of the first three BANCO albums, but it is also the oddest (mind you, all BANCO's music is a bit odd in my opinion). Pity I understand very little Italian, because I think the lyrics for such an ambitious theme (evolution) would be interesting.The long 'L'Evoluzione' (evolution) is obviously the vehicle to introduce the album's concept. It starts off as a fairly sedate song (I even hear a little PINK FLOYD in there somewhere) but then comes some synth which makes me think of erupting volcanoes, and the song heats up, not very melodically, with BANCO's characteristic repetitive note sequences, with a piccolo mib playing over the top in places. Keeping one's mind on the theme stops the track getting tedious.'La Conquista Della Posizione Eretta' (the conquest of the upright position) is really atmospheric, with synth used to produce animal-like sounds, and some dynamic 'echoey' synth that, given the theme and track title, make me think of apes swinging through the forest treetops at great speed (honestly!, although the band probably intended nothing of the kind). I really, really like this track.'Danza Dei Grandi Rettili' (dance of the large reptiles) is also the business. It has a very laid-back jazzy barroom feel, starting with some piano and bass, and then adding synth. Again, bearing in mind the theme, it's not hard to picture a T. Rex clomping around looking for prey. Great synth on this one.'Cento Mani E Cento Occhi' (a hundred hands and a hundred eyes) is the reason I bought the album in the first place. It is a frenetic track with a fair amount of unmelodic keyboard with what sounds like repetitive two-finger key bashing and 'wailing' by Francesco Di Giacomo (well, that's how it sounds to me!). When I first heard this track I thought, \"What on Earth is this?\" but had to listen to it again, and again and finally had to buy the album. This is probably the track to play if you want to clear a room! Knowing the title, the music makes me think of a giant millipede scuttling at high speed along the jungle floor, but I'm probably way off: wish I could understand the lyrics. Then, right at the end of the song, there is what sounds like a tribal ritual chant over some foot-tapping progressive rock. A bizarre track, but strangely compelling.'750,000 Anni Fa...L'Amore?' (750,000 Years Ago...Love?) is ballad-like, Francesco Di Giacomo singing with great feeling with the piano as the principal backing instrument, interrupted for a short while by some very electronic synth. It's pleasant enough.'Miserere Alla Storia' starts off with staccato, repeated note sequences on the organ, then changes to a classical-sounding theme with piccolo mib and acoustic guitar, then transmogrifies into a mad-sounding Francesco Di Giacomo half speaking, half singing, then back to the staccato repeated note sequences on the organ. It becomes more interesting towards the end when piano kicks in with synth and other instruments, but in places reminds me a bit of a slightly out of tune village band.'Ed Ora Io Domando Tempo Al Tempo Ed Egli Mi Risponde...Non Ne Ho!' (and now I ask the time to Time and he replies...I haven't got it!) is yet another bizarre track. It starts with a sound like a donkey braying, which sounds to me like the very slow dragging of a violin bow or perhaps the rocking of a very creaky rocking chair. Then the clavicembalo and piccolo mib add some background as Francisco Di Giacomo sings to backing music that sounds a bit like an umpapa umpapa village band.I hope the above whets your curiosity rather than putting you off getting this album. If you're used to melodic Progressive Rock then this is a very different beast, but should grow on you. The composition and use of instruments to convey the theme are clever, and there is so much variety and oddity in the tracks - and within tracks - that it keeps you listening intently and enjoying immensely. Get it, listen to it on headphones, imagine and enjoy. If you don't like it at first, stick with it, it's worth it.I'd like to give this 4.5 stars if such a thing were possible, but will go with 4."
    },
    {
      "reviewer": "Proghead",
      "date": "Posted Wednesday, May 4, 2005",
      "rating": 5,
      "text": "Definately an improvement over their debut, which was released earlier the same year as \"Darwin!\" \"Darwin!\" is supposed to be a concept album, presumably inspired by Charles Darwin himself. The debut album, to me, was like the first two YES albums or GENESISs' \"Trespass\", or in the world of Italian prog, Le ORME's \"Collage\", all albums showing potential which following albums fulfilled that promise, although I have to say BANCO's album was definately much more progressive than those two early 1969-70 YES albums. \"Darwin!\" to me fulfilled the promised that showed on their debut. No doubt the opening, \"L'Evoluzione\" shows BANCO at their finest. The synthesizers are more present, unlike the unremarkable Moog leads you might find on \"R.I.P.\", the synthesizers on \"Darwin!\" are far more interesting and present. This album showed the band really did their homework, and so little time between the debut and this album that the year still wasn't over (1972). \"La Conquista Della Posizione Eretta\" is another totally fantastic number, largely instrumental, dominated by the keyboards of the Nocenzi brothers (Gianni and Vittorio), with some truly amazing use of synths. The cut ends with Francesco di Giacomo's usual dramatic singing. The rest of the album consists of shorter pieces, but still unmistakably progressive. \"Danza Dei Grandi Rettili\" is a more jazzy piece, all-instrumental, dominated by Gianni Nocenzi's piano, although his brother Vittori gives us some nice use of synth. \"750.000 Anni Fa... L'Amore?\" is a nice piano-dominated ballad, definately my favorite ballad from BANCO, I like the use of synths in the middle. The closing piece, \"Ed Oro Io Domando Tempo al Tempo Ed Egli Mi Risponde... Non ne Ho!\" is a more waltz-like piece, with harpsichord and reed organ.If you want to get in to BANCO, make sure you start either with this one, or their following, \"Io Sono Nato Libero\", as both are totally essential Italian prog albums."
    },
    {
      "reviewer": "NJprogfan",
      "date": "Posted Tuesday, February 7, 2006",
      "rating": 5,
      "text": "Everything that is wonderful about Italian Symphonic Prog is encapsalated in the first track, \"L'Evoluzione\" on Banco's best album; almost 14 minutes of majestic keyboards, sonically charged guitars, Francesco's incredible voice and just enough Italian weirdness. Fantastic! And that's only the first song! One thing I love about Banco is that they're very original. Except for a Emerson-like keyboard flourish here or there, I can't compare them to anyone else, especially outside of Italy. So, to make this short and oh so sweet, if you want to check out this band start with this one. It's up there in the top 5 Italian Symph albums of all time. Take my word!"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Thursday, June 15, 2006",
      "rating": 4,
      "text": "It's really a classic prog album which I have the remastered edition (2001). Looking this album in the context when it was released, it's definitely an excellent classic album! There is a blend of bluesy style as indicated by how the guitar is played like David Gilmour of Pink Floyd. I'm not in a position to comment which band came first with this kind of bluesy style but it seems like Pink Floyd first. It's not the whole style and nuance of \"Darwin!\" is similar with Pink Floyd - it's only the guitar style at the opening of the first track \"L'Evoluzione\" (13:57). The total music concept, approach and style of Banco is completely different with Pink Floyd. Based on my observation this album is more a symphonic prog than a psychedelic one.The opening track \"L'Evoluzione\" (13:57) is truly a killer with great variety of styles from start to end. There are parts with memorable melodies and well balanced segments with complex arrangements - even it's combined with short drums solo. The vocal in Italian language is powerful and unique. I think Italian is one of the best prog languages - it sounds nice to my ears. All musicians play their parts wonderfully: classic organ, bass guitar, drums and guitars. I keep repeating this track one because I like it. The music sometimes reminds me to PFM.All other tracks are also excellent in terms of composition, varied tempo as well as time signatures. Am not gonna review on track by track by track basis but by going through some tracks, you will get a full picture of the music of \"Darwin!\". The second track \"La Conquista Della Posizione Eretta\" (8:41) brings the music even much more wonderful with pulsating organ / piano work which reminds me to Keith Emerson even though in different style. The first verse of the song is truly rewarding and I doubt that you do not think that this is a great composition. Any prog ear would say that this is a great composition. More of half duration of this track is a great instrumental, and the vocal part enters at the ending part. Instead of symphonic, the band also inserts jazz style like it's demonstrated on some segments of track 3 \"Danza Dei Grandi Rettili\" (3:39).Given the facts that many segments of this album have symphonic nature, it's actually a representation of the era where most prog music was revolving around this style. It's an excellent addition to any prog music collection with unique sound of Italian prog. Recommended.Keep on proggin' ..!"
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Saturday, November 4, 2006",
      "rating": 5,
      "text": "The reason why Banco del Mutuo Soccorso so much deserves their status as an epitome of the best Italian prog of all times is the fact that its first three efforts are highly remarkable masterpieces in which complexity and beauty are taken to their maximum levels. All three together follow a coherent line of artistic ambition and consistent recreation of sonic potential. \"Darwin!\" was my first BMS experience, and what a pleasant entrance it was. 'L'Evoluzione' brings the listener a complete landscape of the musical world generated by the Nocenzi borthers and ordained by the full ensamble. There is Di Giacomo's peculiar vocal style in which the grandiosity of opera and teh magic of Mediterranean folklore are mixed, there are the interplays sustained by both keyboardists while they apparently seem to go their own ways, there are the guitar flourihes, there is the complex labor delivered so solidly by the rhythm section, there are the additiona ornaments provided by other instruments such as vibraphone andclarinet. This is the first BMS to feature a Moong synthesizer, and you can tell that the Nocenzi brothers are loving it. Its employment adds color and energy to the other keyboards' inputs, as well as robust duplication of guitr phrases and clarinet lines. This is an incredibly jaw-dropping opener that leaves the listener wanting more (or some time to ret before going on with the album). 'La Conquista della Posizione Eretta' is heavily based on the multiple keyboards' stuff, but this is not a mere exucse fr technical pyrotechnics: in fact, you can sense a dramatic feel in the long instrumental jamming that takes place, a feel to which Di Giacomo's singing a proper defining conclusion while the piano delivers mysterious chod progressions. 'Danza dei Grandi Rettili' is a most beautiful serenade, relaxed and constraint, focused on the playful side of conventional jazz. 'Cento Mani e Cento Occhi' is a typical BMS number: it's complex yet not unscrutable, energetic yet not overblown, full of appealing musical ideas which ae cleverly intertwined through thoroughly crafted mood shifts and tempo changes. And what can I say about track 5 that many haven't said before me 750,000 times? It's one of the most beautiful ballads ever in the world history of rock, just like that. Therefore, it's one of the most beautiful ballads in prog history and Italian prog history: Di Giacomo makes his voice cry in sheer sadness, and so does Gianni Nocenzi regarding the ivories of his grand piano. Sadness leavs and grandeur returns for the almost instrumental 'Miserere all Storia'. Unlike 'La Conquista...' and not unlike 'Cento Mani...', this one is constructed in a very calculated manner by all instrumentalists, but there is a brief moment for drama during Di Giacomo's pompous soliloquy: ceremonious, perhaps parodic. The closer is a prerry circus-meets-Venezian folk song on a 3/4 tempo. The final sounds of old carrousel machinery closes down a terrific musical work, a masterpiece indeed."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Tuesday, December 19, 2006",
      "rating": 4,
      "text": "BANCO are of course one of the big three from Italy and for many this is their favourite album by them. The emphasis is on the keyboards, organ, piano and of course those amazing vocals.Yes this is complex and well played. And for this being a concept album, there are so many styles of music as you go from song to song.One of my favourite songs is \"L`Evoluzione\" with acoustic guitar and organ leading the way early before drums and piano have their way in the soundscape. But man ! Can this guy sing with those operatic vocals. Lots of mood and tempo changes in this one, and lots of organ. \"La Con Quista Della Posizione Eretta\" is laden with keyboard melodies and it's 6 1/2 minutes before the vocals come in. The songs ends with piano and the wind blowing.\"Danza Dei Grandi Rettili\" is jazzy sounding with light drums and nice piano melodies. \"Cento Mani e Cento Occhi\" is an uptempo tune with vocals that is dominated by keyboard melodies. \"750,000 anni fa...c`amore\" features fantastic vocals and more amazing piano melodies. \"Miserere Alla Storia\" is kind of strange with theatrical vocals and lots of organ. The final song has a title that is almost a paragraph long, much like the RED SPARROWS song titles. I really like the chorus in this song but the creaking noises throughout, I just don't seem to appreciate.I love Italian music and this is essential."
    },
    {
      "reviewer": "Guillermo",
      "date": "Posted Wednesday, December 20, 2006",
      "rating": 3,
      "text": "Until 2005, the only album that I have listend from this band was \"...di Terra\". For me, that album was very good, and it was easier to like maybe due to the lack of lyrics. This \"Darwin!\" album is not the same for me. It has some good music, but it is not very accessible. Some of the arrangements are good and complicated, but, sorry, I don`t like Francesco DiGiacomo`s voice. He has a good voice, but his voice is not very often found in other Prog bands, and it maybe sounds very good for the fans of this band. Maybe it is not his fault, really. Another \"obstacle\" for me to really like this album is that, being a concept album, I can`t understand the lyrics, because I don`t speak, write or read Italian. Maybe this is the main reason for me to consider it as a \"difficult album to listen\". But even with all these \"obstacles\", I give to it a three stars rating."
    },
    {
      "reviewer": "FruMp",
      "date": "Posted Monday, July 2, 2007",
      "rating": 4,
      "text": "This is a fantastic album and is solely responsible for introducing me to Italian symphonic prog. I decided to go out on a limb and challenge myself with something different long ago after hearing great things about this album. It starts off nice and slow with the epic l'evoluzione with some gentle yet ominous sounding synth and then it builds adding guitar and drums and other instruments before ascending to becoming a prog freakout. At this point I was immediately hooked and decided that BANCO DEL MUTUO SOCCORSO were a fantastic band and as the song went on I was amazed I had delayed for so long in listening to this and I was enthralled as the song traversed emotional and atmospheric landscapes through the dark to the grand to the contemplative to the uplifting and finally to the mellow yet fitting ending, a very underrated prog epic and the perfect song to start the album with although unfortunately not all the songs are as good.Next up is la conquista della posizione eretta which is another great song, which within the confines of symphonic prog is a remarkably heavy piece with driving rythmn similar to zeuhl in a lot of ways and a brooding atmosphere (and great use of tympani) before near the end tapering off and becoming more mellow and melodic. From here the album lose a lot of steam unfortunately and it's mostly downhill from here to the jazzy laid back la danza dei grandi rettili to the more typical Italian prog of cento mani cento occhi to the emotive lamenting piano driven 750.000 anni fa...l'amore. The next song Miserere alla storia is another highlight of the album with more of the dark tones featured earlier on in the albums with some fantastic memorable melodies, unfortunately once again the album loses steam into the final song which is fairly uneventful. The good part though is that even though there is a fairly big disparity between the decent songs and the great songs the less prominent tracks all have some great bit in them and are fairly memorableI like the instrumentation on this album a lot, the album is heavily reliant on synths, they the main meat and potatoes of the music and they are used very effectively from heavy distorted organ sounds to sawtooth sounds to vibraphone sounds to straight up piano with all kinds of different sounds in between, my favourite being during the middle quieter part of l'evoluzione. The guitar is fantastic, it's not dominant at all but it comes in at all the right times with a furious fuzz tone and there are several parts with some amazing harmonised guitar passages a lot of the time though it's well down in the mix and it's hard to know it's there - not that this is a particularly bad thing as this approach is perfectly suited to the music. The bass has a pretty good tone but I tended not to notice it much to be honest. The vocals are okay, I don't like the guy's voice very much but he suits the music and sings in tune and that's all I can ask for really it doesn't detract from the experience at all.Overall Darwin is a great album from a great band, recommended highly to any fans of symphonic prog (not just Italian either)."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Monday, August 13, 2007",
      "rating": 5,
      "text": "Usually we consider many Prog albums as masterpieces and give 5 stars as candies because they are excellent (others for fanboyism), but the word seems to be loosing value with the avalanche of \"masterpieces\" we can find in Prog Archives, most of them for albums that are good but really not remotely superb.The problem gets worst when you are before album that is absolutely perfect from start to end. as is the case of Darwin! by BANCO DEL MUTUO SOCCORSO, all the words we can write and more clearly the 5 stars seem poor for this quality.The combination between the Nocenzi twins in the keyboards and Francesco di Giacomo perfect operatic voice and sweetness can't be compared with almost no other album that I ever heard, so how much higher can we go?. 5 stars is the limit. But if you add that imaginative human metronome called Pier Luigi Calderoni in the drums, Marcello Todaro on guitars and Renato D'Angelo in the bass, you got the perfect band and album, the musicianship and classical training is more than evident, there's simply no way to ignore this from the first listen, it's a wonderful album.\"Darwin!\" starts with the soft synth intro of \"L'Evoluzione\" (The Evolution), a blend of mystery and expectation can be felt in the dense atmosphere that can almost be cut with a knife, then the incredibly sweet voice of Signore Di Giacomo with the company of an incredibly beautiful piano and then full band places us in mood for what is coming.The vocal section goes \"in crescendo\" until a piano and guitar fugue announces the explosion, the whole band Rocks and Di Giacomo rocks with them proving us how versatile he is, pure Prog Rock at it's most pristine expression, radical changes, perfect arrangements, it's hard to describe with plain words this excellent opener.\"La Conquista de la Posizione Ereta\" (The Conquest of the Erected Position) is a semi instrumental that describes the battle between the instincts of the proto hominid to keep using four legs and the need to acquire the erect position in order to complete the evolution. Normally the instrumentals are unable to transmit a concept clearly (For example Six Wives of Henry the VIII is musically outstanding but it could also be an album about six of the seven Snow White dwarfs, because the music is unable to transmit the ,message), but in this case not only the frantic music but also the sound effects resembling the growls of our ancestors complete describe the scene.After six minutes of music Di Giacomo adds a short vocal passage in which he clarifies even more the idea they expressed so well in notes. More than explanatory this section is important because we have the chance to listen his amazing voice.\"La Danza Dei Gran Retilli\" (The Dance of the Great Satanding un Man -Not possible a literal translation-) is a softer and jazzy track that calms the mood a bit because the hearts of the listener must be pumping at 150 beats per minute, there are moments in which the influence of ELP is evident but mostly is pure Jazz with the Nocenzi twins playing together, even here they hit the nail in the head because part of the perfection of an album is to include the right section in the right moment and they did it.\"Cento Mani E Cento Occhi\" (One Hundreed Hands and One Hundreed Eyes) begins ultra frenetic with the whole band and vocals hitting us with all they have, now I feel some Crimsonian influence but which is softened by the characteristic Italian melodic sense and again (Not strange at this moment) a beautiful piano passage, just to return to a very controlled cacophony and then to Baroque synth just to loose control again several times.this track describes the word Prog more than 1,000 words.In this track Marcello Todaro adds his rough voice which make a perfect contrast with the clarity of Francesco, simply perfect.\"750,000Anni Fa..L Amore?\" (750,000 Years Ago.The Love?) is the reason why I bought this album, the most incredibly beautiful piano performance with Francesco Di Giaccomo that leaves me breathless, if you want to find the definition of beauty in any dictionary, you should read the name of this song.But again there's not all, the mystery and darkness is provided by the synth and again the original vocal and piano melody comes back for my pleasure, this sole song pays the whole album, the rest of it is for free, and what a gift.Normally we are used to praise good vocalists who are very good, but this guy is on another level, I'm sure he's the best voice in the Prog Market and by far.\"Misere Alla Historia\" (Misery to the History) starts with a vibrant instrumental intro that reminds me of \"L Evoluzzione\" but it's only a short reminiscence, the sound changes radically to a softer and more mysterious passage where the clarinet takes the lead, again Todaro adds his voice to create a primitive scenario (Something that achieves) and leads to another Crimson influenced passage where the piano and synths rule adding a touch of ELP and Wakeman successively, The guitar and bass work deserve special mention because fit as a glove in the song, well, we're before a group of virtuosos that know the meaning of the phrase \"team work\".\"Ed Ora Domando Tempo Al Tempo Ed Egli Mi Responde....... Non Ne Ho!\" (Now I command Time to Time and He Responds Me.....I Don't Have Any\" ) starts with a Medieval vocal section by a vopcalist who I guess it's Todaro (He's the only one credited in vocals beside Francesco) but sounds very clear, this intro is followed by some kind of carnival music, very weird and traditionally Italian, a short but interesting closer for an outstanding album.Now, I started to look for 6 stars but we don't have that chance, so I will have to rate it with the undervalued 5 stars, sad because they deserve more.There's simply no reason or excuse for any Proghead not to have this album, no collection can be complete without a copy of Darwin!, so connect to Internet with your credit card number or go to your favorite store and get it, it's a crime not to own it."
    },
    {
      "reviewer": "clarke2001",
      "date": "Posted Tuesday, August 21, 2007",
      "rating": 5,
      "text": "\"Prova, prova a pensare un po' diverso.\"The very moment I heard the first verse: \"Try, try to think in a bit different way\" I knew I will face an amazing journey. So I did. Unbeatable energy, intelligent songwriting. Expressive voice. Incredible piano passages - you have to hear it to believe it. And so on and so on.There is no point of further fanboy expressions, and I feel a little bit disgusted writing too-well-known phrases praising the masterpiece, and again I feel I won't do justice to an album that is simply ______________(enter your favourite expression here), by trying to write a review with at least some decency and value.Oh, who cares. What is from the bottom of the heart must be expressed, and if someone find it useful, great.This is a concept album about the evolution, hence the title. Lyrics are great, and vocal singing these lyrics is still able to be tear-jerking for this sentimental fool. The plot includes the prehistoric \"humid and colourless skies\", volcanoes, lava, the big reptiles..and the apes that will start to FEEL and to THINK...to use their powers as a group of hunters (\"one hundred eyes and one hundred hands\") and to feel love and to \"dance under the moon\", and finally, to let the wheel spin...I will give you two or three more unnecessary informations: music is superb, varying from excellent jazz to organ-driven hard rock, symphonic, mellow passages, piano balladry, Italian folk and a mind-blowing spectrum of synthesizer sounds that sound like a clarion call.Needles to say, they all fit into each other, and the music altogether is perfectly blended with the story, making it extraordinary, emotional and very intelligent. The sounds of squeaky wheel, symbolizing the advent of humans and the flow of time, and the growls \"uurgh aark\" are always sending shivers down my spine.This piece of art is beyond the boundaries of form, genre or medium."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Wednesday, September 12, 2007",
      "rating": 4,
      "text": "When you listen to \"L' Evoluzione\" you know instantly that something special is going to take place. This extraordinary epic is a digest of what Italian prog is all about : passionate vocals, complex song structure, fantastic keyboards, tranquil moments, powerful passages. There is not a weak second during these forteen minutes. A very strong opener which captivates the listener. The last section of this long number is quieter for a moment. It is again the occasion for Franceso DiGiacomo to display some wonderful vocals (I really like his singing style). The absolute highlight of this album. Such song are difficult to be surpassed on an album.I feel a bit sad that the harmony has left for the instrumental and long introduction of \"La Conquista\". Sounds a bit loose and I can only \"enter\" when the vocal starts. A good track, not more. The short and jazzy \"Danza Dei Grandi Rettili\" is not my cup of tea either. But that's not due to Banco : it is just that I do not appreciate very much this genre of music.\"Cento Mani E Cento Occhi\" opens almost like an ELP song : wild keyboards and frenzy combined with harmonious instants. This is the combination. Extremely varied track, changing from theme constantly. Banco could have used more than these five minutes to develop it more and offering us a song of the caliber of \"L'Evoluzione\". Anyway, \"Cento...\" is another great song from \"Darwin\".The delicacy of \"750,00 Anni...\" is again such a pleasant moment of prog music ! The dual vocals / piano works so well... This is one of my preferred track of the album. On a softer side of Banco as well as more accessible and peaceful while \"Miserere...\" is again more vigourous, darker. Keyboards are flamboyant and heavy. The clarinet during the lasty minute adds a different touch and is welcome to close this good song.The closing number \"Ed Ora...\" sounds almost as a medieval song. Some sort of gig. An intruigant piece of music.This is a real good album and a influent one for several Italian bands (\"La Maschera\" for instance). Still, it is not easy to approach and needs quite a few spins to get into it. But once you have done this exercise, you'll be charmed.Four stars."
    },
    {
      "reviewer": "Andrea Cortese",
      "date": "Posted Saturday, March 15, 2008",
      "rating": 5,
      "text": "Banco del Mutuo Soccorso are certainly the most original band from the classic symphonic triad from Italy (PFM, Le Orme and Banco). They managed to create a very distinctive sound due to the great interplay between the two Nocenzi brothers on keyboards (classic pianos, hammond organs, moogs and clavinet). For this reason they are still very influential (Consorzio Acqua Potabile, for instance).Darwin is not the most favourite of mine from their famous output. I still prefer Io Sono Nato Libero for its more mature soundscapes tinged with acoustic guitars.Notwithstanding, I have to admit that Darwin is their most bombastic one (L'Evoluzione and La Conquista della Polizione Eretta), their most operatic and theatrical one (just listen to the superb Cento Mani e Cento Occhi), italic in its essence for its dramatic haunting melodies (750.000 Anni Fa... l'Amore), unespected jazzy variations (Danza dei Grandi Rettili), medieval flash-backs (Ed Ora Io Domando Tempo al Tempo ed Egli Mi Risponde: Non ne Ho!), wonderful classic arrengements (Miserere alla Storia) and, above all, very inspired vocals courtesy of a certain Francesco Di Giacomo (who probably does his best here).You probably won't like it at first. But, listen to me: give it a pair of spins more and it'll never leave your top ten! A concept album for the evolution of your prog taste."
    },
    {
      "reviewer": "apps79",
      "date": "Posted Friday, April 25, 2008",
      "rating": 4,
      "text": "Great symphonic work by BANCO...at least of the same historical value with their debut...The sound here is more symphonic and less jazzy or rock than their debut with the massive use of the piano and other instruments like clavinet,clarinet etc...Great theatrical perfomance by DiGiacomo as well,one of the best vocalists in the history of prog rock ever...The only problem is that the compositions are sometimes a little more complex than they should be (in my opinion) instead of being melodic...Best song of the album I think is ''750000 anni...'',it grows rare emotions in me...Overall a gem of prog rock,with dark atmosphere,complex arrangements and outstanding vocal performance...Between 4 and 4.5 stars!"
    },
    {
      "reviewer": "LinusW",
      "date": "Posted Sunday, May 11, 2008",
      "rating": 3,
      "text": "Darwin! proves to be somewhat of an enigma. It's not that it's one of the unsolvable sort, but more that I don't know if I'm willing to accept the answer. The debut was a diamond in the rough, a heartfelt and stunning way to introduce the band to new fans across the globe and for some Darwin! is just the next and natural step for the band to take. It's tighter, it's more focused and it's always interesting instrumentally. And still I'm slightly disappointed.Because the frenzied darkness and adventurism is very introverted, for lack of a better expression. It fails to engage me with few exceptions. Laboured is one word, too dense is another way of putting it. Cold is another favourite and one I've used before. Yet none of these complaints really fit what I feel while listening to Darwin!. So perhaps it's one of those rare albums you should love, but just don't, for reasons unknown. The music is 'in your face' for the most part, but I like many other efforts with that concept, but here it reflects some sort of uncertainty and tension, which I can only attribute to the albums concept. A speedy, spasmodic journey through the evolutionary rollercoaster, with few moments to sit back and reflect. Images pass by you in light-speed, leaving you as a passive involuntary witness, stressed out and powerless. Perhaps that's it. This album feels very compulsory.Discerning keys, no matter how they're applied (atmospherically or melodically) play a very big role, and so does dark sound effects, sometimes shrill, sometimes distorted guitars and throbbing and nervous bass guitar (most enjoyable bass guitar on the Banco records I've heard so far). The beauty and easily detected classical parts (mostly piano) of the debut is left behind for sheer aggression and drive. For those who consider RPI as nothing but mellow, traditional Italian arrangements with a rock touch, Darwin! should be a great way of discovering the other side of the genre. La Danza Dei Grandi Rettili with its leaned-back, slow tempo jazz tendencies and the long-named Le Orme-like Ed Ora Io Domando Tempo Al Tempo Ed Egli Mi Risponde ... Non Ne Ho! almost feels like abominations when looking at the album as a whole. Especially the latter have more of what you'd expect from an Italian album, but both stick to the album's concept with a touch of darkness and distress. Francesco DiGiacomo is slightly overshadowed by the music here, and isn't allowed to reach such artistic heights as on the marvellous Io Sons Nato Libero. Still shining at times.Cento Mani Cento Occhi is very representative of this album, and surprisingly, it has become sort of a favourite even due to that fact. Unstoppable as a freight train, this is a true face melter. Heavy, pounding keys and bass turning into a slightly more polished song, but still a very compulsive one with the entire band contributing with vocals. It then mellows out for some spacey passages and comes back with full power in an organ-laid finale. Rough, primitive and very, very enjoyable.Still, the material here really can't reach for the higher ratings. I wish it did, and honestly, they sometimes do, but as those moments are sparse and far between this album is way too dependant on mood for them to be solidified. Can't complain on anything on the instrumental or compositional side of the album, as it's all pretty flawless. As such it deserves its place as a top RPI album, but it can't change the fact that Darwin! and I just don't match in the end.Three solid stars.//LinusW"
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Friday, October 3, 2008",
      "rating": 3,
      "text": "3.5 stars really!!As I'd written in the band's debut album review, it (the debut) was imperfect and came with the ugliest artwork ever and seemed to aim at a concept. Released the same year as the debut and with the same line-up, Darwin is a stunning follow-up too. Well certainly two these flaws are mended, with a really cool gatefold album depicting the Darwin concept: indeed the pocket watch symbolising time is being mishandled by the group and the artiste and the front drawings could fit a whitehead at a quarter after eleven (the position of the arms), when our modern life evolution time frame entered in our planet's life. Whether the group chose this concept and its title as a provocation or left-wing militancy is not evident, but most likely yes in view of the contents of their next album and the heavily politicized concert organization of the country back then.It's difficult to imagine an Italian album starting on such a stronger number than Evoluzione, even if it begins in a very minor mode with gentle mood that does let the promise of not-so-quiet developments in a few minutes. Indeed the double KB attack chooses to step back a bit on what they'd done on their debut, the \"slack\" being picked by Todaro's Hackettian guitar. As the sung unravels on each side of your ears, the middle section has both the organ and piano (each still riding their own channel) battling it out, before the Nocenzi twins engages in a moog battle that makes Emerson run for cover. After a cool out, the organ picks up again but battles the clarinet, before big bang occurs through a series of drum explosions. The same kind of aural feast goes on in the following Conquista, where the perfection is approached, through the incredible mainly instrumental songwriting with fantastic interplay showing the full dramatics of survival and its costs and consequences. Indeed with these two tracks, BMS have the perfect album side,Following this near-perfection would prove arduous and almost impossible to match, so most obviously they didn't try: the flipside is made 5 shorter tracks. The first of which Danza, which unfortunately after so many years remains out of the musical scope of the album, no matter how I've tried to like it. Its clumsy jazz with near dissonance and fake humour is just a plain flaw. In some ways, the following Cento Mani e Occhi is also a bit intrusive with its barbarian ELP opening, but the Hackett-like guitar and the almost tribal chants help smooth out a lot of the rougher more primitive edges. One could think that the next 750 000 Anni is a cheap shot at a slow dance and radio hit, if it had not been for the middle moog section. It would be easy to imagine a single version editing the intrusive moog bit and linking the front and closing section and have a huge hit. It's implacable and irresistible. Just as you thought BMS had returned to the A-side's near perfection Miserere comes in with its weird and flawed madness after an arduous and uncertain start with this near-ridiculous monstrous and near laughable monologue. One thing is for sure: Banco did not have the necessary tools to go this mad, be it in the pure songwriting expertise, the recording skill and proper production techniques. The second part of the song is of course better, especially the duet between Todaro's guitar and Niocenzi's clarinet, but it cannot mend the irreparable damages done earlier on. The closing track has the particularity to be longer time-wastage to type than its duration actually lasts. A strange and obtuse piece of madness involving merry-go-round music and local folklore including donkey raping. No thank you, thanks for asking, though!!How can such a superb opening side so close to perfection be possibly followed by such flawed second side, starting by the awkward opener and finishing by the awful closer. Danza Tempo are two atrocious \"faute de gout\", an accusation aggravated by the presence of Miserere. These two (three?) tracks simply ruin the album both its musical continuity, but fail to convince me the concept story was valid, right from the start. Elsewhere you get a feeling the conceptual story they'd build was probably binding the group too tightly and forcing them to outstretch their talents, and this is certainly no more apparent than with Di Giaccomo, who finds way too little space to express his talent freely. So with a perfect half album, and just two good songs out of five on the flipside, it's hard to call Darwin an improvement on the debut album. Yet through its trials and errors, the group has persevered and progressed."
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Tuesday, October 7, 2008",
      "rating": 5,
      "text": "5.00!!! Genius work by Banco Del Mutuo Soccorso! One of the top album of this world's progressive rock music and top of all genre,too!So much feelings,so much dynamic,so much drama,so much extreme progression,so much great musicianship,so much variety,so much artistic conception,so much ideas,developed in an exact matters,so much mixture of conceptual ideas with independent way of reaching the aim of the album,so much tempo changes,even in 10 seconds;one instrument begins in a tempo,then change it and then return to the first tempo in seconds;at that time the other instrument change the tempo itself,so much everything I would say!!! One of the most extreme progressive albums of all time and one of the greatest ever on that planet. There're no weak seconds here. The album is unhealthy for emotional people with weak hearts like me.I had made a pause of a couple of months before listened to it again. And now I believe what does Darwin! mean. Suitable only for absolute dedicated connoisseurs of the music as whole!!!We have not to forget that the name of that game - musica - is an italian word!!!"
    },
    {
      "reviewer": "snobb",
      "date": "Posted Monday, September 14, 2009",
      "rating": 4,
      "text": "\"Darwin\" was historically my first RPI album at all. I found that kind of prog very late, so some things is unknown for me till now.So, I expected to hear something very different. What did I heard?First of all, very professional music, as often in RPI. Attractive mix of neo-classical music with some prog-rock sound. In \"L'Evoluzione\" you will find 16+ minutes of whatever you want ( inc. J.S. Bach organ sound) ( I listened to new, 1991 re-release, where songs timing are slightly different, for example the first song continues not 13+ but 16+ minutes).Vocal is opera -based , reminds sometimes Povarotti, sometimes some Demis Roussoss moments. All theatrical scenario is based on classic opera-drama construction. Plenty of sympho-rock ( with strong sympho-elements) and some opera-style voice - is it it. Melodies are very classical, with perfection in arrangements.How much I like it? Difficult to say. The idea of combination of real classical music with prog rock for sure isn't new or rare, but there you can hear the different technology.It like in rock and jazz combination: jazz with rock elements is fusion, and rock with jazz elements is jazz-rock. So, rock with elements of symphonic music is sympho-prog, but symphonical music with elements of rock is ... Banco.Will you like it or not hardly depends on you point of view to classical music and opera-based voice. But in all cases, it's a really beautifull and high quality music."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Thursday, January 7, 2010",
      "rating": 5,
      "text": "Even though I have been raiding music stores, libraries and the internet in search for Prog for almost 30 years, I had no idea there was a prog scene in Italy. Actually, I never thought beyond the usual clich� that Italian people did anything besides enjoying their beautiful country and eating the most delicious food in the world. I didn't know they played music as well. That delusion came to a halt when I became an active member of PA and discovered Area and Banco.RPI is a very rich, imaginative and melodic type of symphonic prog, and as can be deducted from the ratings, fans of the classic UK sympho hegemony that know the Italian scene devour it like sweet cake. But it hasn't been easy for me, not at all. When I started listening to that other acclaimed band PFM, my first reaction was very strong and decidedly negative: way too mellow, sweet and tame for someone adhering to the dark side of the force for the biggest part of the last 10 years. But I'm stubborn in these matters and continued to give them a spin. PFM gradually grew on me but it wasn't till I heard Banco'sDarwinthat this music really struck a chord with me. Maybe it is because they are more dramatic, slightly moody and more powerful then PFM.Anyway, after hearing Banco I finally understand why VDGG were so popular in Italy. Banco's music relates to VDGG in many ways, it's very theatrical, emotional, playful, virtuosic, dramatic, original and absolutely free, meaning almost anything can happen in the course of a song. Still it remains coherent and tasteful. Other main influences would be ELP, a bit of Yes, pre-modernistic classical music and something ... something Italian I guess: light, clear colours and an after taste of delicious red fruits. Wait. I'm confusing with the glass of wine I'm having now.Whatever I try do to describe the actual songs will not do them justice. There are so many things going on here that my English vocabulary feels largely insufficient to describe them. The opening trackL'Evoluzionestarts with a sinister minor chord melody, quickly evolving into a delightful madrigal, featuring DiGiacomo's superb emotive vocals. The middle section is cascade of different themes that go in all possible directions. Lots of keyboards are applied through this 14 minute adventure, something that is usually not my cup of tea in the early 70's era of mosquito-buzzing synth tones, but the Nocenzi brothers play with a flair and tastefulness that easily surpasses my misgivings with supposed keyboard masters like Wakeman and Emerson.The remaining half hour of the album is distributed over 6 tracks that are for the most part as compelling as the opener.La Conquistahas an even higher VDGG-wit meets ELP-wizardry, but it is ELP with a purpose, no soulless parade but rich melodious keys with a great balance between virtuosity and a feel to play just the right notes, something that Emerson only achieved on occasion.La Danza Dei Grandi Rettiligoes high on Bach, resulting in a bass guitar theme that brings Jethro Tull'sBourr�eto mind.Cento Manistarts with a 15 seconds fanfare that reveals the sonic limitations of those early keyboards, but the agitated section that follows is amazing. I never would have thought getting so lyrical about a 1972 album with 2 keyboard players. My usual opinion is that even one of them is already one too much. But it leads to plenty of fun here. As a song, this one feels less coherent though then the previous ones.750.000 Anniputs DiGiacomo in the spotlight again, his emotive wail and sense for melody is gorgeous. Even though his voice doesn't remind me of Peter Hammill, his affecting tone and tune are on a par with Hammill's qualities in that area. Beautiful piano work rounds it off.Miserere Alla StoriaandEd Oraexplore theatrical tendencies that provide for many interesting and charming moments, but these tracks haven't entirely convinced me yet.Weighing this album up against its main influences, I'd say this is leagues ahead of ELP, on a similar level as Yes but still a bit below VDGG for me. Given that VDGG are my most loved Prog band that's a high assessment. There's really no excuse not to spend your time and hard-earned cash on discovering this creative - and as I've come to understand very productive - scene. 4.5 stars, with the evolutionary potential to make that last half one into a devastating supernova.Edit, oh yes 5 stars obviously!"
    },
    {
      "reviewer": "JLocke",
      "date": "Posted Tuesday, March 23, 2010",
      "rating": 4,
      "text": "Complex. Quirky. Beautiful.Darwin!was my second Banco Del Mutuo Soccorso album, and in truth, my second Rock Progressivo Italiano record. I do not claim to be an expert in this realm of music, and I certainly don't consider myself even a little bit knowledgeable in the genre's roots, origins or influences. And since I haven't really heard many other bands of this type as of this writing (March 2010), I clearly wouldn't know what else I could compare this album to, but all I can say is that I immensely enjoy this band's music, and this album in particular a whole helluva lot. So despite my ignorance in the matter, I find myself compelled to review this because it truly is so good.Plenty of originality is present onDarwin!not just on the compositional front, but with the use of the instruments and the presentation itself. I found myself grinning widely whenever I would hear a musical flourish or effect that I didn't expect, and on this album that happened quite a lot. For it to be the year that it is, and for me to have listened to so many different bands from all sorts of various musical genres, getting completely shocked by my music are cherished moments. Perhaps that is why I like what I hear on this album so much; the surprises.Francesco DiGiacomo's vocals are quite striking and memorable. Since the first Banco album I listened to was the instrumentalGarofano Rosso, I had yet to hear the voice of the band when I listened to this one. There is beauty and complexity here, married very successfully with quirkiness and fun-loving performances that make this album soar. Apparently there was a remake of this in the nineties by the same band. I'll probably listen to that one one day too, but I can't imagine why they would even want to dive into past material, especially when it is so wonderful and well-executed as this album is. There was probably a specific reason for re- recording it, but I'm just unaware.At any rate, this album is just gorgeous, and one of the most interesting listens from this band, hands down. It's also one of the group's best. If you're still very much in the dark about Rock Progressivo Italiano like I am, I would say you could certainly do worse than picking this album up as one of your first ventures into the genre. Banco have certainly peaked my interest, and twice they delivered big for me when first discovering their music. This album is just as good if not better thanGarofano Rosso, and I recommend it highly for those curious about this side of Prog, but have yet to take the plunge. Great stuff.Very happy listening."
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Tuesday, April 6, 2010",
      "rating": 5,
      "text": "A second Banco masterpiece, an RPI monsterOne of the most important RPI bands of all time managed to follow their incredible self-titled debut with another masterpiece. And of their ridiculously strong opening trilogy of albums, \"Darwin\" in my book is their most challenging, and perhaps their strongest, most rewarding title. \"Darwin\" is a true \"masterpiece of progressive rock\" as far as I'm concerned, a concept album which given its birthdate of 1972 proved the Italian scene was every bit as dynamic and adventurous as what the English heavy hitters were offering in the period. Banco is perhaps their most challenging on \"Darwin\", pushing limits more than they did on the debut. Here things feel more complex, baroque, intense, perhaps losing a bit of the warmth and sentimental aspects I noted in the melodies of the debut. But the consistency and excitment for the listener are at least equal if not a bit ramped up here. \"Darwin\" offers beginning to end chills, with a slightly darker feel, and a heavy dose of what I would call the \"spirit of RPI.\"They waste no time, the 14-opener \"L'Evoluzione\" is a stunner in the RPI arsenal, perhaps one of the greatest tracks of the subgenre. Again I mention the creeping baroque feel here presented with dramatic, bold vocals, thunderous keyboard crashes, and a very unique electric lead guitar style. Marcello Todaro plays without obvious influence, completely original in the way he bathes the compositions in an expressive, nimble, \"flittering\" note picking style. Sometimes he reminds me of the punchy leads Howe gave us in the wilder sections of Topographic Oceans and Relayer. The band is fantastically energetic, brash, and tight---this band features superb playing with little sloppiness that I can detect.The tracks consistently deliver a high level of composition with grand keyboard experimentation and thick gutsy bass playing. There are wandering, playful meditations on piano that veer into the jazzy realms. Later in the album another standout track is \"750,000 Anni Fa....L'Amore.\" This track features a truly legendary vocal by Francesco Di Giacomo that is full of life, passion, and sad longing. He can literally break your heart singing about an unfulfilled love. The piano melodies behind him are just drop-dead gorgeous, the epitome of a beautiful Italian musical vibe, and likely the album's calmest, most directly emotional moment. I wouldn't call the album instantly accessible for every progger, it has depths to it that require several listens to fully appreciate---but the rewards are there for the willing.\"Darwin\" is as essential to an RPI collection as Relayer or Selling England are to your English prog collection. It rounds out my personal \"suggested sampler\" of the Italian \"big 3\" along with \"Felona e Sorona\" and \"Storia di un Minuto.\" There are so many lesser-known RPI titles that occupy the special shelf in my prog collection, and I generally prefer some of these lesser-known groups for some reason. But if you wish to start with the more widely known bands, you can't go wrong with Banco's masterpiece \"Darwin.\""
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Sunday, April 18, 2010",
      "rating": 5,
      "text": "Darwin! hits the mark with some of the most innovative and experimental RPIDarwin! Is a real curio from these giants of RPI, their third album following two incredible albums that helped to put Italian prog on the map. Darwin! Is a full blown concept album that centres on the Darwinist belief system or theories of life on the planet, how we came to be here, disregarding creationism, and wholly encompassing ideologies of evolution. Banco thankfully do not attack God as such but take on this evolutionary ideology as a theory of how the earth, the universe was created ? by sheer chance. Darwin refuted these ideas on his death bed, nevertheless it is an enticing idea, and I guess an irresistible one that many bands hold to for content. In the case of Banco they feature some interesting lyrical notions on the idea.Translated they state: Try, try to think a little different, nothing was made by the great Gods but Creation had been created by itself: cells, fibers, energy and heat. The earth is rolling into a cloud swelling, spreading in the heat its limbs the Mother is ready, she will bear she's already bowing her womb, she wants another son and she will have it, son of earth and electricity. Grey coats of lava and coral moist and without colors skies, here comes the world breathing musks and lichens, green earth-made sponges are the hothouse for the sprout that will come.\" So it is evident that judging from the lyrics there is no real attack on creationism, but it is a fanciful notion that Banco are adhering to.The music is as usual very accomplished ranging from ambient keyboard section and falsetto soft vocals to all out frenetic drumming and erratic keyboards and bass. There are some incredible tracks on this such as 'La Conquista Della Posizione Eretta' translated The Conquest of the Upright Position. It is an ambient synth soaked piece and very animalistic in texture and tone, in fact I thought I was hearing animal effects at times. The piece captures a feeling of being lost in a jungle surrounded by primates and only Banco can produce this type of music which is absolutely mesmerising.'Danza Dei Grandi Rettili' can be translated as Dance of the Large Reptiles and is heavily influenced by jazz overtones with some captivating bass and piano. Indeed it is a soundscape capturing the imagination of when dinosaurs ruled the earth.'Cento Mani E Cento Occhi' meaning A Hundred Hands and a Hundred Eyes is one of the masterpieces of the album. The dynamic interplay of keyboards and drums makes for some compelling listening. Francesco Di Giacomo adds his own interpretation of singing, which may be understood as more of a howling sound than actual words but it suits it perfectly. The tribal chanting and African drumming is enough to drag you out of this reality into the warped landscape of Darwin! Indescribable music certainly but it will convert you if you allow it.'750,000 Anni Fa...L'Amore?' is a very intriguing track centering on the theme of 750,000 Years Ago...Love?. It is a love song of sorts, being a lot more balladic than other tracks and in fact Francesco Di Giacomo tries his hand at some romantic crooning. It is so different than what we have already heard that it comes as a shock to suddenly hear this style, and therefore it is perfectly balancing the frenetic material; chaos has become order for a term at least and we needed it.'Miserere Alla Storia' is Misery to the History and returns to the highly progressive style with sharp blasts of chords on organ and this is complemented by piccolo and acoustic guitar. On this track the words are half spoken and half sung by Francesco Di Giacomo. Not my favourite track but still a worthy addition to the album and a very similar style to King Crimson.The final track is a short rocker called 'Ed Ora Io Domando Tempo Al Tempo Ed Egli Mi Risponde...Non Ne Ho!' or you can translate this as And now I Ask the Time to Time and he replies...I haven't got it! Self explanatory really. The track begins with a donkey noise, a violin being dragged across with a bow very slow and creaky, I guess like the creaking floorboards of an ancient house. It is unsettling but once again draws you in patiently. The piccolo chimes in beautifully and Francesco Di Giacomo croons along in a low key style. And thus ends this incredible album.This album is one of the master works of RPI without a doubt and deserves a place in history as one of Banco del Mutuo Soccorso's best albums. The artistry of the band, the virtuoso musicianship is second to none, though this is not my favourite Banco album. That honour has to go to their debut album. However this is highly recommended among the best of the RPI genre."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Tuesday, May 25, 2010",
      "rating": 4,
      "text": "Full of bombast and majesty, Darwin is a solid effort from Banco. This one for me is still building up to their peak, which would be their following album (lo Sono). However, many of the same elements are present, but with a rougher, grittier sound--which of course may be your preference.I definitely prefer the A side--the one with two extended tracks, L'Evoluzione and La Conquista--although the material is solid throughout. L'Evoluzione reminds me of my favorite track from lo Sono (Canto Nomade), based on the track length, the restrained intro section, and then up-tempo, straightforward rocking, and even a nice, Bach-ian chamber section. Banco excel at all of these styles, with enough unique pieces (Francesco's voice, for example) that they really hold my interest even in the moments where the actual songwriting is not terribly creative.La Conquista is also solid throughout, though perhaps less cohesive--more a sequence of interesting musical segments than a great song, per se. Regardless, this could be an exemplar for my definition of bombastic, with a particular emphasis on blaring and blasting keys.An original album with plenty of interesting music, but nothing that particularly blows me away. Four stars for a largely solid and creative piece."
    },
    {
      "reviewer": "andrea",
      "date": "Posted Tuesday, January 11, 2011",
      "rating": 5,
      "text": "If I had to give someone an advice about the best starting point to explore Italian progressive rock it would be 'Darwin!'! It is one of the best known concept albums of the Italian progressive scene of the early seventies. It wasn't conceived as a scientific treatise but as a poetical parable to explain our evolution as men, the upright man is a metaphor for dignity, for the overcoming of stupidity... The album was released in 1972, a few months after the excellent eponymous debut one with a line up featuring Vittorio Nocenzi (organ, harpsichord, synthesizer), Gianni Nocenzi (piano), Marcello Todaro (electric and acoustic guitar), Renato D'Angelo (bass, contrabass), Pier Luigi Calderoni (drums, cymbals) and Francesco Di Giacomo (vocals). On account of the recording techniques of that period the sound quality wasn't flawless and almost thirty years after, in 1991, the band felt the need to re-record both their first two albums with up to date technologies and slightly different arrangements. The result was impeccable but I have to say that I still prefer the freshness and emotional intensity of the original album.The opener 'L'evoluzione' (The evolution) is a long and complex track that sets the right atmosphere. It begins softly, the music is evocative and dreamy while soaring vocals seem to invite you to close your eyes and to try, try hard to think to the genesis of the universe in a different way... No great Gods but just cellules, fibres, heat and energy blended together to give birth to the Creation. Mother Earth is spinning inside a cloud, she wants a baby and she's going to have him, son of Earth and Electricity! 'Grey layers of lava and coral / Wet and colourless skies / Here the World is breathing...'. Then rhythm goes up while primordial life blossoms in an unexpected way... 'The sea vomits shapeless creatures pushed out in clots on putrid shores / The land hosts the muddy herds that pass crawling on their likes / And the time will change the flabby bodies into forms that are able to survive...'. The music flows away like lava from a volcano, there's room for drum solos and organ rides while 'free sounds stir acoustic spirals of virgin air...'. When rhythm calms down it's time for reflection and for a new awareness. Observing an ancient skull you realize that Adam can't exist and that just seven days are not enough to create. Adam is dead by now and with him the genesis as told in the Bible... The new awareness leads to a delicate classical inspired piano and organ passage and to the poetical image of a new light... 'High, a halcyon squeaks making arabesques over the gorses and the sea / Now the sun knows whom to warm...'.'La conquista della posizione eretta' (The conquest of the upright position) is another long track featuring many changes of rhythm and atmosphere. It begins with a wild ride on a frenzy rhythm... Try to imagine a wild ape-like man running among rocks and rushes following the smells of other beasts, the footsteps of his preys, roaring and screaming. Then suddenly music calms down. The apeman realizes that he can see nothing but his path and in him rises the wish to see more and far beyond the trees. He tries to stand up... 'I try and fall and then I try again / I can stand upright just for a while / The scream resounds all along the vault / It goes up to the volcanoes and then I stand watching / My eyes drink flights and jumps, my forests and my likes... Now I can look straight, far over there where the air touches the sea...'.'Danza dei grandi rettili' (Dance of the big reptiles) is a wonderful instrumental where classical influences are perfectly blended with jazzier passages. Bass lines underline the slow and heavy paces of dinosaurs walking on earth, surrounded by a wild nature. Well, after Steven Spielberg's film 'Jurassic Park' it shouldn't be so difficult to get a picture of what music is about!'Cento mani e cento occhi' (A hundred hands and a hundred eyes) is about the need to socialize and join forces to fight for a common goal. It starts in a frenzy way while lyrics depict some hunters running after their preys. A solitary ape-like man observes the hunters wondering whether he should to get closer or to run away. Suddenly rhythm calms down and after a new rise of tension the solitary ape-like man get in touch with the hunters. One of them gives him his pray and he's surprised... 'On your spear you offer me some meat that I didn't obtain with my strength / What kind of action is this!'. For him this behaviour doesn't fit a strong being but the hunter backed by his companions answers: 'Our strength is in a hundred hands / And a hundred eyes watch out for us / You are alone! / If you want you can go now, or stay here and join us...'. Here Francesco Di Giacomo's vocals contrast with Vittorio Nocenzi's then backed by a powerful choir. The contrast underlines the clash between the instinct of freedom and the need of socialization. 'From a herd to a moving tribe, from a village to a city / People breathing at the same rhythm / Men closed inside boxes of stone where you can't hear the wind...'. Well, even if the need of socialization prevails the instinct to run away looking for freedom will remain...'750.000 anni fa... l'amore?' (750,000 years ago... love?) is an amazing piano driven ballad about the discovery of feelings. Love is far more than instinct to breed, it can stir powerful emotions. Lyrics describe a shy ape-like man observing a beautiful woman with her tribe. Emotions and desires rise... 'I hold my breath / If you see me you will run away... If you really were mine / I would dress your breast in water drops / Then under your feet I would spread veils of wind and leaves / Bright body with large flanks / I'd take you in the green fields and I would dance / I would dance with you under the moon...'. But the ape-like man can't move and can't speak, he's aware of his ugly look and fears that the woman could refuse him running away...'Miserere alla storia' (Miserere to the History) is a complex track featuring a mysterious atmosphere and an Oriental flavour leading you to the roots of history, to Babel and to ancient Egypt... 'Glory to Babel, let the sphinx keep on laughing for millennia / Let's build in the sky up to Syrius / Let horses frothing on the Milky Way...'. Recitative vocals seem to draw a mocking and disquieting prophecy about the destiny of Man... 'How long will live your intellect, if behind you the human race is disappearing?'.Last track 'Ed ora io domando tempo al tempo ed egli mi risponde... non ne ho!' (And now I ask time to the Time and he answers me... I haven't got it!) is about time passing by. Men are like puppets hanging on the eternal and heavy wheel of time that keeps on spinning... You can hear the wheel creaking and squeaking, munching lives and smashing bones, breaking wills and desires, slow and inexorable like an old and gloomy Waltz... 'Oh, gigantic wheel why do you make me think / If later in your spinning you will restrain my mind... It goes, it keeps on going / The wheel never miss a beat and goes on and on...'.Well, a great album..."
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Tuesday, February 22, 2011",
      "rating": 5,
      "text": "I have only heard the first three albums by Banco Del Mutuo Soccorso, but I much prefer this one to the debut and the follow up. By mistake I have also heard the 1991 re-recording of this album; it sounds slick and updated, but they sucked all of the life out of these songs. If you plan on buying this album, make sure you get the original 1972 recording. The sound on the original is maybe a little rough around the edges and the band apparently were not happy with it, but it works to the music's benefit. Judging by the album and song titles, this is some kind of concept album about Charles Darwin and his theory of evolution. If you don't speak Italian then you will not understand the lyrics anyway.Two things make Banco stand out from other Italian bands of the time: the sometimes melodramatic vocals of Francesco di Giacomo, and the twin keyboard attack of brothers Vittorio and Gianni Nocenzi. The guitar, bass and drums are adequate but generally don't stand out. Great use is made of the Moog synthesizer on Darwin! What they do with it is superb, just as good if not better than what any UK or US musician was doing with a Moog at the time. Speaking of UK musicians, you don't hear any obvious influences from the UK prog bands here as you do from other Italian bands at that time.\"L'Evoluzione\" opens with sinister sounding organs and then what sounds like an electric harpsichord, along with some guitar. Bass and drums join in before the song becomes very classical sounding when Francesco enters. Some great symphonic rock follows. The bass playing is interesting around 3 minutes. After 4 minutes the song goes into a great upbeat, energenic part. Later some awesome Moog playing. That whole instrumental section in the middle is just terrific. A mini drum solo before it goes back to the upbeat part again. Later the band stops and then some lovely keys and vibes. At the end the song goes into Gentle Giant territory and Francesco comes back.\"La Conquista Della Posizione Eretta\" starts out sounding like a cross between ELP and VDGG. Some crazy and fast playing for awhile before it settles into a groove. The tempo picks up and some great keyboard playing. Music starts to mellow out after awhile with some bursts of energy. Tempo increases again and more great keyboard playing. Some tympani in this song. Later some great growling Moog as the band dies out and just harpsichord is present. Some atmospheric organ joins before the band comes back in a laid-back mode with vocals now. Some lovely piano playing as wind sounds finish the song.\"Danza Dei Grandi Rettili\" is a great jazzy instrumental with some symphonic keyboards in places. You can listen to \"Cento Mani E Cento Occhi\" here on PA. This song has a grand opening with Moogs and tympani before it gets crazy and manic sounding. Francesco's vocals go well with the music. Great drumming and piano playing in this song. Over halfway the music settles down before erupting again into a rockin' finale. Love the \"ooo-ahh\" grunting vocals at the end. \"750,000 Ani Fa...L'Amore?\" is a melodramatic ballad with great singing. Mostly vocals and piano until later when some Moog enters. Piano and vocals again before drums and bass join in to finish it.\"Miserere Alla Storia\" starts with awesome staccato organ playing getting faded in. Great jazzy drumming before the music switches to a more laid-back mellower section. Later some creepy, slightly altered vocals come in. Goes back to the opening section. Later on some great classical piano as the band does some start/stop playing. Some \"ahh\" vocals. Goes back to the mellower section at the end. \"Ed Ora Io Domando Tempo Al Tempo Ed Egli Mi Risponde...Non Ne Ho!\" ends the album on a strange but great note. You hear what sounds like an old wooden rocking chair creaking. Some harpsichord and vocals before other instruments join. Turns into a symphonic waltz.I'm no expert in RPI, but of the albums I've heard from this genre, Darwin! is one of the very best. This is just fantastic classic prog from the classic prog era. Imagine if you mixed together ELP, VDGG and Gentle Giant and a strong Italian element. You would end up with something similar to this, but there is still an originality at work here. I wouldn't call Banco one of my favourite Italian prog groups, because I didn't enjoy the other two albums I heard as much as this. But Darwin! would fit in my top 3 Italian prog albums easily. 5 stars."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Thursday, April 14, 2011",
      "rating": 5,
      "text": "There are many bands and artists on ProgArchives painted with prog sensibilities. Proggish pop, experimental, retro, whatever. I have room in my heart for all of them, whatever their percentage progness might be. But if you want a single record to represent the true, vital heart of prog rock, BANCO DEL MUTUO SOCCORSO's 'Darwin!' is the prime candidate.It was while listening to this record that I was finally able to dismiss my prejudice against RPI. This is not some copy of the English progressive scene of the early 70s. In fact this is a perfect amalgam of rock and its antecedents with the grand tradition of operatic Italian music to create a sound never rivalled in the English scene. Dramatic, challenging, uplifting, certainly not easy listening, humorous and insightful, 'Darwin!' has everything a prog rock record should have.If one can forgive the primitive-sounding synths, and the less-than-ideal vocal mix, the opener 'L'evoluzione' is as emphatic a statement as one could wish for. Apart from the rather buzzy synths the keyboards are superb, not just played but performed on, the musicians exploiting their full dynamic range. Francesco DiGiacomo's vocals are magnificent - a little too operatic for my taste, but this 5-star review is not about my taste but about the quality of the music. My recording finds the vocals sitting a little too far forward in the mix, making DiGiacomo sound emasculated compared to the fullness of their debut album - but this may be an artefact of digital conversion. My goodness he can sing! The vocals at the end of 'La Conquista Della Posizione Eretta' send chills up and down my spine: we are truly blessed that such a fine vocalist should have been a part of prog rock. And I do not have words to adequately encompass the vocals in '750,000 Anni Fa ... L'Amore.' Perhaps the premier vocal performance in all of progressive rock. Sorry for focusing on the singing but that's what I used to do, and I know just how good this man is. Rock music usually demands raw power rather than such a superb tone, but DiGiacomo makes the absolute purity of his voice into the essence of the band's sound.The praise for vocalist and keyboard players is not to belittle the guitarists and rhythm section, who are a highlight on their own, the drummer laying down some outstanding patterns upon which the others build. I'd have liked the bassist a little higher in the mix, but alas, that's often true in recordings from the 70s (Squire aside). Refreshingly there's not a single testosterone-filled guitar moment, distinguishing it from most of its less thoughtful contemporaries. I suppose one could concede the fact that Side Two is not quite as heavyweight as Side One - but what could be? A selection of ballads and rockers, interpreted in the band's unique style, each track a superior example of its kind.'Darwin!' defines the meaning of 'essential', a majestic recording that to me is the pinnacle of this genre."
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Wednesday, July 20, 2011",
      "rating": 4,
      "text": "'Darwin!' - Banco Del Mutuo Soccorso (8/10)Although some would say that the best output with this band was from their second work 'Io Sono Nato Libero', I would argue that Banco Del Mutuo Soccorso's would reach greater heights with their classic album, 'Darwin!' Banco are held to be one of the staple acts in the Italian progressive rock scene along with Premiata Forneria Marconi and Le Orme, and while my heart has generally tended to sway towards PFM, Banco's third record plants them in my mind as one of the greatest exports of rock music that Italy ever produced. A jazzy and often theatrical album, 'Darwin!' is a work of near-equal parts harmony and complexity, and stands as being one of the records from the Italian scene that has really stood the test of time.One of Banco Del Mutuo Soccorso's defining traits in my eyes was their leanings towards jazz music. Although this is still rock by most any interpretation, Banco would often fuse sounds of jazz in order to give their band a little different flair than the typically symphonic Italian acts. Although the trademarks of Italian prog are still here- including the dramatic sound and synth-heavy sound- jazz is once again a very important aspect of Banco's music, especially when they roll into their instrumental segments. 'L'Evoluzione' is a perfect way to open up this album, with the distinctive vibrato of vocalist Franceso DiGiacomo delivering some of the band's most memorable melodies. Mellotrons are in heavy use here, and the album starts on a very dynamic note, going from romantic mellowness to feelings of climactic peril all within the space of the first ten minutes. 'La Conquista Della Posizione Eretta' picks up where the first track left off and almost feels invisible due to the fact that 'L'Evoluzione' flows into it so damned well. Before I know it, the album is already halfway through the third track,Banco's greatest aspect is their jazzy roots in my opinion in any case, and while their symphonic prog elements are admirable, I sometimes feel that they try to get too aggressive and complex, robbing the music of some of its emotional power for me. The band's talent is remarkable however, and there is still plenty of nuance that helps me to see why it is so highly regarded by many progressive rock listeners. My one real gripe with 'Darwin!' is that I do not really hear a standout track here; a song that helps me first build a real connection with the album, as I am able to do with albums I consider masterpieces. The music on 'Darwin!' runs together fairly smoothly as an album; much more so than 'Io Sono Nato Libero', and with this added sense of flow for the album, Banco Del Mutuo Soccorso have created an excellent album here."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Tuesday, August 9, 2011",
      "rating": 5,
      "text": "Banco's second album of 1972 is every bit as eye-opening as the first. Taking on a concept album approach to add cohesion to the piece, the group continue showcasing their exceptional instrumental and compositional talents, as well as the operatic vocals of Francesco DiGiacomo. The duel keyboardist approach taken on this album adds texture to the compositions, and the band resist the temptation to stick to long songs for the sake of it, generally keeping their compositions to a length which can be supported by the musical ideas at play. Part of the essential Banco trilogy (which also comprises the debut and Io Sono Nato Libero), anyone looking to explore the RPI scene should schedule a visit to Darwin! as early as possible on their schedule."
    },
    {
      "reviewer": "stefro",
      "date": "Posted Tuesday, October 4, 2011",
      "rating": 5,
      "text": "Often hailed, alongside the likes of PFM's 'Per Un Amico', Maxophones self-titled debut and Le Orme's 'Felona E Sonora', as the cream of the Italian progressive rock crop, Banco's second album finds the triple-decked keyboard, mellotron and piano-purveyors ambitiously tackling the concept album with this ode to 'Origins Of The Species' creator Charles Darwin. Like much of the mid-seventies Italian output, there is an obvious debt - or should I say homage - to Van Der Graaf Generators classic works, such as 'Pawn Hearts'(which stayed in the Italian charts for a mighty 12 weeks), 'H To He Who Am The Only One' and 'Still Life', and the more symphonic works of ELP and Genesis. However, those expecting lush, melodic sounds will be in for a shock. Banco's sound hovers fluidly between the discordant and the thunderous, the complex instrumentation at times mind-bogglingly intricate in it's execution. Those who know the groups eponymously-titled debut from 1971, and the 'Darwin!' follow-up 'Io Sono Nato Libero' of a year later will know what to expect, only this time, the group seemed to have taken the handbrake off and gone full pelt into a thickly explorative, and, at times, almost crazily manic sound that almost defies description. At times the music is utterly beautiful, as on the various, and dazzling, interconnecting sections of opener 'L'evoluzione, then, on other tracks, such as genre-defying 'Danza Dei Grandi Rettili', the group take an unexpected turn into proto-psychedelic classical rock, eschewing the grand progressive sounds of their British colleagues in favour of an all out sonic attack on the very hub of rhythm and melody, twisting complicated bass-lines over sumptuous keyboards with reckless invention. One of the real strengths of Banco's music has always been the classically-trained opera voice of lead singer Frances Di Giacomo, and it is on 'Darwin!' that his uniquely grainy vocals seem most effective. The triple keyboard attack - with mellotron, standard keyboard and grand piano played in almost perfect, multi-layered harmony, also adds a darkly-ambitious dimension which seems a million miles from the frankly rather ordinary sounds of Yes, Greenslade and Soft Machine, brilliant British groups whose pioneering music seems utterly dwarfed by the spectacular classic prog on offer on this most original of albums. On 'Darwin!' most of all, but also on the other two 'classic' albums, Banco Del Mutuo Soccorso virtually reach the pinnacle of this wonderful genre, eclipsing their fellow countrymen with their complete disregard for playing it safe. This is incredibly versatile, free music, played by seriously talented musicians with the shackles of commercial reality well and truly off. It may take several listens to truly grasp, and at first 'Darwin!' may just almost unpleasant in it's relentless keyboard attacks and strange, discordant sonic pallete of sounds and styles. However, with each repeated listen, true fans of the very essence of progressive rock will surely discover the beauty that lies at the heart of Banco's imperoious blend of rock, classical and jazz, and the fact that their first three albums make the likes of King Crimson, Genesis and Van Def Graaf Generator seem so ordinary is a true testament to the brilliant potential of European, and most importantly, Italian progressive rock. Masterpiece is a very strong word, but for 'Darwin!' it's an apt description. Simply brilliant. STEFAN TURNER, LONDON, 2011"
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Thursday, March 1, 2012",
      "rating": 4,
      "text": "Excellent Dark RPINearly two years ago I went on a small binge of Italian prog as I explored the unfamiliar corners of ProgArchives. Among the albums I acquired at that time was Banco's DARWIN. It has been on my \"to review\" for a long time, and falls in that hardest category for me, the \"excellent but not quite masterpiece\" level. Like Le Orme and PFM, this band represents the canon of the subgenre. If someone were to say, \"So what is this Italian prog thing all about?\" DARWIN would be an excellent album to grab to start the conversation. At the same time, there are stronger albums in this category, my favorite being QVL's IL TIEMPO DELLA GIOIA.While there are some very pretty, romantic passages interspersed on this record, DARWIN is a little bit harsher and more intense than the average RPI. The albums opens with a slippery low key part that evokes a fox sneaking up on prey. Soon the music opens up into a colorful scene a la the sun breaking through the night. Always melodic and rhythmic, the band isn't afraid to throw in some harsh harmonic intervals and nasty distortion for effect. There are abrasive staccato accents and strident vocal passages that I wish I could understand. But the band does remain grounded in the Gryphon / Genesis mold so that the most striking aspect of this work is the contrast of light and dark. Thankfully, this is done much more subtly than most rock bands, and the number of textures in the music is quite broad.Overall, the closest American style I can liken this to is Genesis' Trespass, heavy on The Knife. Of course, the more dramatic, almost operatic Italian singing style gives the music its own flavor. Keys definitely dominate over the guitars as in most RPI. These two elements will make or break your preference for the genre, and I like the way they are handled on DARWIN as well as any album. The vocals have clear, simple melodic motifs that make them still powerful and memorable even in a different language. The keys are tasteful and well played, and rarely go into full ELP cheese mode. When guitars enter, they are definitely derivative of Steve Hackett's style with huge sustain. Bass is high in the mix, trebly, and the drums are busy. Like Genesis or Yes, you get the feeling of a strong band where each element is critical, each player not only skilled but giving you their full heart.Highlights include the opener, \"L'evolutione\" and \"Miserere alla storia\" which begins in an almost Zeuhl-ish throb but evolves in a more composed, chamber rock style. There are no lo- lights. This album does, for me, lack that special something that grabs my heart and beats it for me. But my mind's interest is held for listen after listen, my toes is tapping, and my child's sense of \"Coool\" is piqued.Bottom line - great album, highly recommended. 4/5 stars."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Monday, November 14, 2016",
      "rating": 4,
      "text": "The much-acclaimed and revered epitome of 1970s 'classic' RPI here finds criticism and disconnect.1. \"L'Evoluzione\" (13:59) This song offers a perfect opportunity for me to express a few of my dislikes in Banco music. Banco songs can sometimes be too busy. Like the comment in Amadeus about Mozart using just too many notes, the average, untrained human brain can only take in so much. Then there are the tendencies that Banco uses to compose support music for individual soli that is too rigid and monotonous--that goes on for far longer than one would like to hear. And then there are the flaws in the mixes of the instruments. Still, there is the fact of the amazing complexity and sophistication that is always a part of Banco compositions. Admirable and laudable, but they do not always translate into enjoyable listening experiences. Sometimes there can be just . . . too much going on at once. And I am often found having trouble finding, much less attaching to, lead or woven melodies. Where are they? And I will finally admit that after all these listens to Banco materials: I am just not that big of a fan of Francesco Di Giacomo's voice. He may be the equivalent of the Peter Hammill of Italy--you either love him or you hate him. (Like with Hammill), I fall into this latter category. (Well, I don't really hate him. I don't always enjoy his voice or vocal performances.) (8.5/10)2. \"La Conquista Della Posizione Eretta\" (8:42) until the final two minutes, this is an instrumental song of typical Banco complexity and breakneck speed but possessing some nice, interesting, engaging melodies on the top (mostly from the synthesizer). Still, this song feels a bit too much like a song that would run over the introductory or end credits of a 1970s spy film. One of the more tolerable, even enjoyable, Francesco Di Giacomo vocals. (9.5/10)3. \"Danza Dei Grandi Rettili\" (3:42) opens with a kind of sophisticated coffee-house jazz feel. For 45 seconds. Then the full-house orchestral hall sound bursts forth. For a bit. Reverting back to caf� dynamics, the jazzy sound returns for some piano and jazz guitar interplay. The louder 'chorus' section returns with some cool organ and synth interplay before a bridge back to the original sound and theme occurs. Piano, jazz bass, brushed drums, and jazz lead guitar play out to the end--and, it is assumed, the sparse applause of the smokey caf�. (9/10)4. \"Cento Mani E Cento Occhi\" (5:22) opens with a driving, dynamic burst of straightforward organ-based rock. Francesco's poorly recorded voice is oddly mixed. There then follows a kind of Keith Emerson section before the vocals return. In the second half of the song, a kind of all-male barrel-house vocal ensemble becomes the form of vocal delivery--in both the louder and even the softer sections. A well constructed and performed song that is somehow poorly recorded and troublesome to connect with. Better to sit back and enjoy as spectator. (8.5/10)5. \"750,000 Anni Fa ... L'Amore?\" (5:38) opens as a gentle, contemplative piano-based song over which a very strong, passionate, almost operatic vocal is sung by Francesco Di Giacomo. The man can definitely sing! There's even a section where Francesco's voice alone exudes the force that an entire full rock band might try to display--just his voice! Perhaps he was a failed or frustrated opera singer. The odd synth interlude in the middle is unfortunate. But, it is short-lived. We return to the piano and solo voce format where Francesco and Gianni Nocenzi perform their magic--until the rest of the rock band finally joins in for the final 35 seconds. (9/10)6. \"Miserere Alla Storia\" (5:58) opens with a fade in of an already in full-form and fast-pace jazz-rock weave, but, then, just as it reaches front and center, it stops! Instead we are left with some spacious organ, bass, synthesizer play beneath a distant soloing clarinet. At two minute mark a very aggressive, demonic (non-Francesco) vocal sets up the onset of a new instrumental section of driving film soundtrack music. Piano soloing over staccato rhythm section ensues at the end of the fourth minute before returning first to the soundtrack \"chase scene\" theme and then to a pensive soft section for bass and fading clarinet to take us out. Odd song. (8.5/10)7. \"Ed Ora Io Domando Tempo Al Tempo Ed Egli Mi Risponde ... Non Ne Ho!\" (3:29) opens with themes and sounds that could come from several ethnic musical traditions--and which sounds a lot like some of Woody Allen's clarinet- led Italian music as used in his films. The song is partly beautiful, partly grotesquely sad, partly funny--and definitely interesting. (9/10)A near-masterpiece of Rock Progressivo Italiano and a clear example of how brilliant ideas in the hands of virtuoso artists do not always result in glowing masterpieces of artistic product."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Monday, March 19, 2018",
      "rating": 5,
      "text": "Out of the multitude of Italian prog that emerged in the 70s, of which there are too many greats to mention, only a few reached the top tier status that placed them as the crown jewels of Italian progressive rock. Alongside critically acclaimed acts such as Premiata Forneria Marconi and Le Orme came another Italian great from the city of Rome and like an episode of punctuated equilibrium, a term that describes a sudden burst of evolution rather than a gradual ascent, BANCO DEL MUTUO SOCCORSO or BANCO for short unleashed their second album of 1972 and expanded their musical paradigm a millionfold on their sophomore release DARWIN! Named after the famous evolutionary theorist Charles Darwin, the band crafted a concept album based on his theories about the birth and evolution of all species on the planet. Like the self-titled debut the music is driven by the powerful classical trained keyboard counterpoints of brothers Vittorio and Gianni Nocenzi alongside the powerful rhythm section and the operatic powerhouse vocal style of Francesco Di Giacomo.Much of the Italian prog scene was influenced by the British bands such as Genesis, Van Der Graaf Generator and Emerson, Lake and Palmer who often found more enthusiastic fans abroad than in their homeland. While each respective Italian band shared similar elements from the abundance of imported influences, they each managed to find a different recipe in which to refine the ingredients. In the case of BANCO, the band continued their heavy driving double keyboard drama with an outstanding emphasis on overlapping classical attacks of bombastic ELP styled Hammond organ runs along with Moog synthesizers and the tender yet stylistically challenging piano riffs. While many bands were about showcasing their virtuosity, BANCO found a way to tamp down those primeval impulses and implemented their talents in the context of a theme which gives DARWIN! a very mature and sophisticated overall feel. In addition to these imported influences, BANCO utilized healthy doses of the beautiful Italian folk as well as pan-European classical music in general.Due to the fact that like many Italian bands of the day, BANCO crafts their tales exclusively in their native lingo which means the storyline is completely null and void to non-speakers but even with no lyrical context, the music delivers a spine-tingling prowess that delves into a dizzying array of stylistic shifts throughout the album's seven track run. \"L'Evoluzione (Evolution),\" the lengthiest track running just shy of the 14 minute mark begins much like the expected symphonic prog band of the era hinting at a pastoral Genesis inspired dreamscape with lush classical passages and Giacomo's romantic soothing vocals. But as such a title would indicate many changes, the passionate lulling placidity ratchets up the tempo as classical piano runs are joined by rock and bass guitar and heavy percussive drive. The truck erupts into an organ frenzy venturing into a frenetic ELP inspired assault that becomes the main motif of the track's duration.\"La Conquista Della Posizione Eretta (The Conquest Of The Upright Stance)\" switches gears showing immediately that DARWIN! is a multi-faceted beast. The ostinato bass line provides a buzzing drone effect while the keys and flute are allowed to leapfrog all over each other. The track develops a melody and rhythmic drive that sounds sort of like a James Bond movie theme getting crashed by the mafia. \"Danza Dei Grandi Rettili (Dance Of The Big Reptiles)\" shifts gears again and transports the listener into some clandestine speakeasy jazz club with a sultry swinging groove augmented by the unusual sound of the Hammond organ runs crashing the party. \"Cento Mani E Cento Occhi (One Hundred Hands And One Hundred Eyes)\" deceives as it sounds like a victory dance at a Medieval festival and then plays the old switcheroonie as it jumps into a bombastic hyperdrive that finds BANCO in full hard rock mode making it the heaviest rock track on the album without sacrificing the Chopin-esque classical piano chops with ELP organ bombast.\"750,000 Anni Fa ... L'Amore? (750,000 Years Ago?.Love?)\" takes a complete 180 and tackles a passionate Italian pop piano ballad with no trace of neither progressiveness nor rock. \"Miserere Alla Storia (Misery To History)\" struts its swanky groove as a heavy bass line augments a heavy organ and piano intro but the tracks dramatically shifts to a sophisticated mellower track that exceeds in dynamic counterpoints that culminate in a dramatic Italian rant that sounds like something out of Phantom Of The Opera but ultimately finds resolution as a hyperactive jazzy-funk groove with out-of-sync synthesizer runs haunting the background. This track has a lot of changing parts with classical piano runs breaking in and stealing the thunder. One of my personal faves.\"Ed Ora Lo Domando Tempo Al Tempo Ed Egli Mi Risponde ... Non Ne Ho! (And Now I Ask For Time For More Time And He Answers Me?I Don't Have Any!)\" is a bizarre little ender to a very ambitious album as it is a short piece that is inspired by merry-go-round music. While that seems completely out of place it becomes clear if you understand how the music corresponds to the track titles since it seems to insinuate the cosmic wheel of life going round and round but very much on the clock. In fact the album makes a lot more sense at least understanding the meaning of the titles as they give some sort of reference to the musicality taking place. While the album may seem totally off-kilter in all its arrangement prowess gone astray, logic occurs in the context of the evolutionary themes of life on the planet and as a biology major myself, a thematic content that i'm quite enthralled with on a personal level.While DARWIN! has stood the test of time and remained one of the pinnacles of the Italian prog scene, it is by no means an instantly attainable album for the uninitiated. While melodies and moments of symphonic beauty can pacify the soul, this collection of progressive rock workouts can just as easily sound jarring and disorienting as angular rhythms and bombastic outbursts pummel away at the nerves. The sophistication of which the whole thing is stitched together takes a few spins to come to grips with and i by no means found this to be the masterpiece it's made out to be upon first encounter. After all is said and done (and a fair number of attentive listening experiences later), one can only conclude that this is indeed one of Italy's finest moments in a progressive rock context and deservingly stands up to such greats of PFM, Le Orme or Area in its unapologetic and idiosyncratic delivery of disparate ideas sewn together in a bizarre new concoction. While BANCO would churn out a few more excellent albums, none of them are quite as startling as hearing DARWIN! for the very first time."
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Sunday, December 27, 2020",
      "rating": 5,
      "text": "If you find a clock in a forest, you understand that there is a designer behind it, you do not think that he formed himself. So said the theologian William Paley to justify the argument that Nature was created by a Creator, according to an Intelligent Design. Banco del Mutuo Soccorso in 1972 dismantled this theory, saying that THE CREATED HAS CREATED ITSELF since the first note of the album. And they anticipated the English Richard Dawkins, one of the most important living evolutionists, who in 1986 published The Blind Watchmaker, overturning the saying of William Paley: natural selection is the Blind Watchmaker.Second album by Banco del Mutuo Soccorso, a concept album based on Darwin's theory.1. L'Evoluzione (13:59). Beginning that combines epic and melody, reaching a notable pathos. You immediately notice that the arrangements are much more pumped than the debut album, and that the synth is now king. Around 7-8 minutes the music stops and you hear the clarinet, which together with the synth is the trademark of this record, and which will be the protagonist of the second side of the disc. The rock progression restarts, then there is a long instrumental digression and in the finale the initial melody returns but is immediately marred by the virtuosity of Nocenzi, who seems to want to show off his technique. It's a great song, but I have the impression that something of the immediacy of the debut album has been lost: the greater instrumental refinement actually prevents the melody from taking flight. Rating 8,5/92. La Conquista Della Posizione Eretta (8:42). The second song seems to be the continuation of the first, with Nocenzi producing virtuosity. It is an almost instrumental song: Di Giacomo's vocals arrive only in the finale, as had already happened in the last song of the first side of the debut album. The musical difference lies in the rhythms, much more sustained, in the arrangements, much more charged, and guided by the synth. In short, music is more complex and layered, and this can be good or bad. Then the music slows down, and finally Di Giacomo's voice arrives, always very beautiful. Final falling with the wind. Rating: 8.Side B: 3. Danza Dei Grandi Rettili (3:42) is an instrumental piece, pop-jazz music, it's a nice ballad for piano, bass and clarinet, with synths making a progression. Rating 7,5.4. Cento Mani E Cento Occhi (5:22). It is the weakest song of the album. too forced, too based on rhythm, without melody, without the possibility of Di Giacomo's voice emerging, here the negative influence of Gentle Giant seems evident. The talent of Banco in my opinion is wasted for a rock song of this type. In fact, the best part is the slow one. Here perhaps the defect is due to the will to narrate. The fact is that Banco continues to show a very high potential, and wanting to put too much meat on the fire with its sumptuous arrangements: when you have such excellent compositional skills, virtuosos like Nocenzi and Di Giacomo, a beautiful melody, piano and voice is enough to being at the top of music, you don't need to waste energy on a thousand sounds. Rating 7.5. 750,000 Anni Fa ... L'Amore? (5:38) is a masterpiece. And it is no coincidence that Banco give its best with a piano and voice ballad, these two elements are enough for the Banco to record a masterpiece, thanks to Di Giacomo's vocals, what is needed is just a beautiful melody, and here is the case . Masterpiece. And it is surprising that the instrumental interlude is so little melodic, and lowers the tension of the song, and is similar to certain pieces of Gentle Giant (Acquiring the Taste) and also the ending in crescendo, immediately truncated. This song is definitely a masterpiece but at the same time it is definitely imperfect: the instrumental interlude is of low quality and the ending could have been longer and more powerful. Banco makes the same mistakes as Pfm by chasing English music in its formalities instead of focusing on the melody. And despite these imperfections, the rating of the song is 9, if it had been arranged at best it would have been one of the absolute masterpieces of the whole melodic prog. Rating 9.6. Miserere Alla Storia (5:58) .It is a song that at first seems instrumental, the clarinet recalls Stravinsky's Spring Festival, but with sounds almost like Kletzmer music, then the theatrical vocals arrive, which make the piece grotesque, and finally an alienating music starts, very ad effect, the Banco now pursues new sensations and the music is more and more colorful and baroque, they have definitely created a particular, sumptuous sound, which starts from the melody and reaches the sumptuous and sometimes mad rock. Rating 8.7. Ed Ora Io Domando Tempo Al Tempo Ed Egli Mi Risponde ... Non Ne Ho! (3:29) Final with a melodic song but with a circus flavor, which tries to close the circle with the wheel of time that comes and goes. Very well done, but in the second side the Banco has given himself above all to ironic, mellifluous, grotesque, aggressive, and finally circus melodies: great performance but where it gave its best: in the piano and voice piece, where the melody was epic and dramatic. Anyway, rating 7,5/8.Ultimately, with the second album in the same year, 1972, Banco turns towards more English sounds and proves to conform to a much more refined and pyrotechnic prog rock, as Pfm did with Per un amico (which actually had a sound more American than English). But what happens when these two groups want to imitate the British or the Americans? Pfm with Per un amico, in my opinion, produces a very good record, for heaven's sake, but clearly inferior to Storia di un minuto, because it loses immediacy, melody, pure emotion, and doesn't gain enough virtuosity to make the music enjoyable as much as the debut.Does the Banco end up the same? In my opinion, the Banco produces a second masterpiece, which is a masterpiece for different reasons than the debut album: Darwin loses in melody, simplicity of arrangement, immediacy but gains in arrangement, virtuosity, extension of the musical contents, and sound: here the Banco creates its own characteristic sound, with rhythmic progressions, synths superimposed on the piano, clarinet, and an alienating and grotesque mood. On the first album the sound is very heterogeneous.Darwin is better or worse than the debut? I do not know, we are more or less on the same level, it is certain that Banco in my opinion demonstrates with Darwin that it has taken a step forward in outlining a new music that Pfm cannot claim to have done with Per un Amico because despite being a very refined disc, compositionally is less inspired than Storia di un Minuto.Banco demonstrates with this album that it has enormous potential, and if only Nocenzi had been more inspired in composing memorable melodies here he would have obtained one of the greatest masterpieces of the whole prog.Masterpiece. Rating 9+. Five stars."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Wednesday, September 27, 2023",
      "rating": 4,
      "text": "A few months after their solid debut album, \"Banco del Mutuo Socorsso\" confirms their great form by releasing \"Darwin!\", a conceptual work in the style of the hurricane-like progressive winds of the early 70's, based on the theory of evolution of the English scientist and naturalist Charles Darwin. The classical and baroque influences of Romans combined with their particular lyrical and operatic style of singing, are tinged with elements incorporated from great icons of the genre such as their referenced E,L&P, to create one of the capital works of the flourishing Italian progressive rock.The first part of \"Darwin! \" is a puzzle of intricate instrumental structures, with momentary and elusive reflective passages, both in the huge and descriptive \"La Evolucione\", and in the gloomy and haunting \"La Conquista Della Posizione Eretta\", with both tracks featuring the virtuosic Nocenzi brothers in a leading role, with the sea of effects that they masterfully extract from their countless hammonds, moogs and grand pianos, and seconded by the impeccable dramatic effects that Francesco Di Giacomo's portentous voice brings to each of his interventions.The second part, while maintaining the complex compositional dynamics of the first part, nevertheless unfolds with short and heterogeneous pieces, such as the jazzy and anodyne \"Danza Dei Grandi Rettili\", the lively and incisive \"Cento Mani E Cento Occhi\", or the beautiful and peaceful \"750,000 Anni Fa ... L'Amore? L'Amore?\", a remarkable communion of piano and voice cut in between by a synthesised interlude, undoubtedly one of the best on the album.The strange and disturbing \"Ed Ora Io Domando Tempo Al Tempo Ed Egli Mi Risponde ... Non Ne Ho!\" concludes the album amidst fairground music and pig grunts, giving the final touch to a seminal work that cemented Banco as one of the cornerstones of the Italian progressive movement.Very good.4 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "albumd889.html",
  "last_parsed": "2025-05-18T00:09:25.164506"
}