{
  "album_title": "MOONMADNESS",
  "artist_name": "Camel",
  "artist_page_link_local": "artist0c98.html?id=50",
  "year": 1976,
  "rating_value": 4.4,
  "rating_count": null,
  "review_count": null,
  "genre": "Symphonic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/50/cover_15882072019_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Aristillus",
      "duration": "1:59",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Song Within a Song",
      "duration": "7:18",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Chord Change",
      "duration": "6:48",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Spirit of the Water",
      "duration": "2:09",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Another Night",
      "duration": "7:00",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Air Born",
      "duration": "5:04",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Lunar Sea",
      "duration": "9:14",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Another Night (single version)",
      "duration": "3:22",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Spirit of the Water (demo) (2:13) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "Song Within a Song (live) (7:11) * #",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "Lunar Sea (live) (9:51) #",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 12,
      "title": "Preparation / Dunkirk (live) (9:32) * #",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 13,
      "title": "* Previously unreleased",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 14,
      "title": "# Recorded at Hammersmith Odeon, London - April 14, 1976",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 15,
      "title": "Bonus disc from 2009 remaster - The London Hammersmith Odeon Concert - April 14, 1976",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 1,
      "title": "Song Within a Song",
      "duration": "7:13",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Excerpts from the Snow Goose",
      "duration": "10:41",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Air Born",
      "duration": "4:58",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Chord Change",
      "duration": "6:49",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "The White Rider",
      "duration": "8:51",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Preparation / Dunkirk",
      "duration": "9:22",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Another Night",
      "duration": "6:27",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Lady Fantasy",
      "duration": "16:05",
      "is_sub_track": false
    }
  ],
  "lineup": [
    {
      "musician": "Andy Latimer",
      "instruments": "guitars, flute, recorders, vocals (2,5,6,10)"
    },
    {
      "musician": "Peter Bardens",
      "instruments": "keyboards, vocals (4)"
    },
    {
      "musician": "Doug Ferguson",
      "instruments": "bass, lead vocals (2,10)"
    },
    {
      "musician": "Andy Ward",
      "instruments": "drums, percussion, spoken voice (1)"
    }
  ],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Thursday, February 5, 2004",
      "rating": 3,
      "text": "The climates and athmospheres of this one also fail to captivate me. This is too gentle especially after having heard the first two. The art woirk for the cover is close to perfection (unlike the US version showing Camel is a cosmonaut suit on the surface of the moon) and will probably help most of you get lost in the meanders of their music escaping to wonderlands unsuspected by this poor lonesome cow-boy unable to drown in such shallow waters.All kidding aside, give it another halfstar."
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Sunday, February 22, 2004",
      "rating": 5,
      "text": "One small step for a camel.This album was where Camel really came of age. From the first notes of \"Aristillus\", a brief but striking instrumental, the attention of the listener is caught.The well worn criticism of Camel's vocal capabilities can undoubtedly be applied to \"Moonmadness\". After \"Snowgoose\" however, another instrumental album would perhaps have appeared indulgent, and would certainly have implied that the band accepted the criticism, giving up on the vocals altogether. Without wishing to labour the point, the vocals are indeed the weak point, but not to the extent that they spoil the album.In any case, Camel's instrumental prowess is still very much to the fore here. The excellent closing track \"Lunar Sea\" (Lunacy = Moon Madness, get it?) for example is entirely instrumental, with slightly more jazz leanings than on previous albums but still very much in the symphonic prog vein. There isn't a weak track on the album, but my personal favourites are \"Air Born\" with it's dramatic pauses and soaring finale, and \"Chord change\".A remastered version of the album is now available, with a number of bonus tracks, although none of these can be considered essential.Footnote, \"Moonmadness\" was originally was intended to be a concept album based around the personalities of the band members (musically if not lyrically). Andy Latimer was \"Airborn\", Andy Ward was \"Lunar Sea\" Peter Bardens was \"Chord Change\" and Doug Ferguson was \"Another Night\"."
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Monday, March 15, 2004",
      "rating": 5,
      "text": "CAMEL's \"MoonMadness\" stretches beyond words as is certainly one of my alltime fav's. Centered around the classic CAMELl line up (Bardens, Ward, Latimer and Ferguson) , they continue to refine their sound. \"Moonmadness\" contains lots of great progressive styled flowing flute and wicked guitar additions by Latimer. I also love the keyboard sounds which Bardens carefuuly layers throughout the album. This album contains some of my alltime most loved CAMEL pieces (\"Another Night\" and \"Chord Change\"). For those who do not a lot of CAMEL, this is a great place to start your collection and work backwards from. \"Moonmadness\" explores loads of instrumental passages and background noises are added for dramatic intensity. I always considered this a kind of concept-like recording really and love the atmospheres they create. Songs are allowed to expand and the only bummer is that the album is over far too soon. Excellent progressive rock."
    },
    {
      "reviewer": "greenback",
      "date": "Posted Thursday, April 8, 2004",
      "rating": 5,
      "text": "Moonmadness is among the best Camel's albums. The songs are very progressive, and the melodramatic keyboards are often highly placed in the foreground. I would say the omnipresent keyboards are the main attraction, despite the guitar takes very much room too. The drums are often very fast (Lunar sea) and never simple. Latimer's voice is, as always, impeccable: he uses some fuzzy effects here. The bass is very well played, never timid, although not very elaborated. The guitar sound of Camel is nothing extremely spectacular, but the refined melodies involved are very compensatory. With combinations of mellow flute, Fender Rhodes, moog, organ, the quasi-Canterburian music is a pleasant emotions bringer; it is varied and sometimes surprisingly floating, so that it makes a very well balanced album. If you like The Snow Goose album, then chances that you like this one are high. Let us mention that this record is more loaded, progressive and complex than The Snow Goose. It is less delicate too, but still more than Mirage! A must for any progressive music fan who likes quality music."
    },
    {
      "reviewer": "daveconn",
      "date": "Posted Saturday, April 17, 2004",
      "rating": 4,
      "text": "The opening \"Aristillus\" may herald a mad moon, but the shrouded shapes cast by \"Moonmadness\" are old friends we've seen in an earlier \"Mirage\". These songs are slices of the same sleepy exotica that snaked like a wild opiate through the black grooves of their first two albums, \"The Snow Goose\" being for all intents a downy anomaly. Vocals return, shared again by various band members (Andy Latimer bears the burden of them), each obscured by the familiar veil of the subconscious from whence their muse arises.As with \"Mirage\", the music on \"Moonmadness\" is intoxicating, absorbing, and comforting, using gentle sounds (keyboards, muted bass, flute) to weave a soft fabric scented with the spices of faraway worlds. Within their complete catalog, several of these tracks breathe the rarefied air of prog rock classics: \"Song Within A Song\", \"Chord Change\" (with shades of SANTANA and PINK FLOYD to be found), the soaring \"Air Born\". The remainder of the album is never less than engaging, from the moody \"Lunar Sea\" (again inviting TANGERINE DREAM as a reference point) to the celebratory \"Aristillus\". I've read that this is a concept album, but some things are better left to the imagination. As with the best of progressive rock, the songs are suggestive of many things, and may transport individual listeners to any number of fantastic landscapes that a map might limit.The Camel albums that followed were terrestrial excursions, grounded in quasi-conventional structures that made spaceflight difficult. There were isolated moments of magic in them, to be sure, but it's on \"Moonmadness\" that the eerie light of inspiration last pervaded an entire album (\"Nude\" notwithstanding). Note that an alternate version of the cover exists with a CAMEL in a spacesuit."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Thursday, May 20, 2004",
      "rating": 3,
      "text": "Not quite on par with chef d'oeuvre Mirage. The dynamic is different, but still equilibrated. While Mirage was hard-rocking, epic and fantasy flavored, Moonmadness is...well...showing affection for the moon?Without the shadow of a doubt, this record will please you at night. The feel is soft, the albums takes it time to build and maintain a 'cosmic' feel. Nice attempt. Magnificent moogs in Aristillus is a great entrance. Spirit of the water has a nice rainy day feeling that's comforting and warming anyhow. Air born's Camel at his best. Great guitar line and the way the song gets back to where it started really hits the spot.Too bad the album was the last good one with the fabulous foursome that was Camel in his early and too short years. What is Latimer without Ferguson or Bardens? Not quite the same. More atmospheric than the Snow Goose (which is something), I really get the feeling to be on the moon, walking slowly and looking at the earth.Because giants steps are what you take, walking on the moon,I hope my leg don't break, walking on the moon....aw man, what was that?"
    },
    {
      "reviewer": "lor68",
      "date": "Posted Tuesday, June 1, 2004",
      "rating": 4,
      "text": "Well actually this work deserves a 3 stars and an half score, by regarding of a certain diminution of tension in some circumstances...nevertheless this album alone is such a unique \"Manifesto from Light Canterbury\" within the whole production of Camel, more than Caravan's \"In the Land of Grey and Pink\" and less than Hatfield and the North \"Rotter's Club\".The most unforgettable track is that unique and remarkable mini-suite such as \"Lunar Sea\", an imprinting of Andy's style, an emotional crescendo of feelings, by starting with an ambient and spacy atmosphere created by the analogical sythezisers, passing through the excellent guitar excursion by Andy afterwards!! Nevertheless it should be a mistake if I couldn't remark also some other interesting features within the easier and melodic songs like \"Another Night\" or \"Chord Change\" for example!! This time the melodic aspects of this band are more positive and less melancholic or sad in comparison to the majority of the recent albums by Camel (Do you remember the mood of \"Rajaz\" or that one of \"Harbour of Tears\"?!), even though the atmosphere is not epic or always aggressive (except on Lunar Sea) and the keyboards are sometimes not so much loud!! Apart from the considerations above, their taste is remarkable and the style unique as well!!It can complete your Prog Collection, regarding of such genre from Light Canterbury..."
    },
    {
      "reviewer": "Chris S",
      "date": "Posted Thursday, June 10, 2004",
      "rating": 5,
      "text": "Thanks for the rating warning but I remain undeterred, Moonmadness undeniably is the best musical contribution by Camel. Following hard on the heels of The Snowgoose, Moonmadness dealt a serious blow to the critics saying..\" Oh well you cant surpass that masterpiece\", that beeing the Snow Goose.Every track on Moonmadness is well balanced slick jazz prog rock at it's best. Aristillus opens up demanding attention and tracks like Spirit of the Water, Song within a Song and Air Born and pure magic. You wonder where the creativity and passion has gone when you listen to relative youngsters serving up classical dynamite. Moonmadness is their best piece of work but there are so many of their albums that came close but never quite having that all round polish."
    },
    {
      "reviewer": "Blacksword",
      "date": "Posted Tuesday, November 30, 2004",
      "rating": 4,
      "text": "Camels best in my opinion. The album opens with 'Aristilus' which chugs along in a Mike Oldfield fashion before 'Song within a song' sets the mood for the album. Melodic and moody in places. Latimers performance is superb especially on 'Chord Change' and 'Lunar Sea' Two instrumentals which, for me, represent all that is good about Camel. They were always at their best when performing without vocals. Latimers vocals are not brilliant but they in no way ruin the songs on 'Moonmadness' 'Spirit of the water' is a beautiful bridge track, taking us into 'Another night' a single. The 7' version is also on the CD. The song has a memorable riff, which some may say would have benefitted from more 'beefy' production, but then, I guess it wouldn't be Camel.Camel knew how to rock, and were at their best on 'Moonmadness' but they always 'rocked' in a controlled way, with clean, crisply produced music which allowed the complexity and sensitivity of all the bands input to be clearly evident to the listerner.A relaxing, melodic and thoughtful prog rock album. Highly reccomended!"
    },
    {
      "reviewer": "belz",
      "date": "Posted Saturday, February 5, 2005",
      "rating": 5,
      "text": "5.0/5.0 This album has a twin: \"The SnowGoose\". This is the perfect complement and further exploration of musical melodic exploration. Everything I wrote about \"The SnowGoose\" could apply here since I believe those two albums should be listened one after the other.I had a tape with SnowGoose on one side and Moonmadness on the other, and I could drive my car for hours listening to that. This is extremely intense music, with lot of interesting repetitions (creating a climax) and musical explosions.You have to listen to this."
    },
    {
      "reviewer": "chessman",
      "date": "Posted Sunday, February 20, 2005",
      "rating": 4,
      "text": "This should really have three and a half stars, but I will err on the side of generosity and give it the full four. For my opinions on Camel and their music, read my review of Mirage, the same thing said there applies here. Nevertheless, this is a superior album to Mirage as the songwriting is better here. We open with \"Aristillus\", a very short instrumental, keyboard dominated, with Andy Ward's voice repeating 'Aristillus, Autolycus' over and over. (These are two craters on the moon, visible with the naked eye.) I actually think this track, though short, is one of their best ones, melodic and bright. Next up comes \"Song Within A Song\", another decent effort, with some nice relaxing guitar and flute. It probably would have been better left as an instrumental, but, unfortunately, the vocals kick in on this one, and make it sound depressing. Camel can never be accused greatness when it comes to the vocals on their songs! The third track is \"Chord Change\", another track that is pleasant, if undemanding. The fourth one, \"Spirit Of The Water\", is a short piece again, and, (maybe there is a link here!) one of the best ones on the album. Lovely keyboards here and a gentle melody. Then comes the weak point for me, track 5, \"Another Night\", where the band try to sound more upbeat and aggressive, but only succeed in sounding dated. I have heard worse though. \"Air Born\" is the penultimate track, an improvement on the preceding one, but not particularly insipiring. The guitar work is ok here, but again I prefer the keyboards. For me, Peter Bardens is the main inspiration in the band at this period in their development. Last 'official' album track is \"Lunar Sea\", which is an altogether better song and finishes the original album off well. Again nice keyboards and guitar. Incidentally, the bass work on this and 'Mirage' gets better the more you listen to it, probably not receiving the credit it deserves. Likewise, the drums, whilst not brilliant, are played to a decent standard. My copy is the remastered version, with five extra tracks on them. As I said about 'Mirage', these tend to go on so long you end up wishing for the end to come! The last three are live tracks, two from this album, \"Song Within A Song\" & \"Lunar Sea\" and, finally, one from 'The Snowgoose', \"Preparation/Dunkirk\" which I find dull and not very inspiring. However, it has to be said that the first two bonus songs are far better. The first is the single version of \"Another Night\" which is shorter (see what I mean about the short pieces being more satisfying for me?) but has lovely keyboard work around the middle of it. The second is the demo for \"Spirit Of The Water\", which is an instrumental, quite haunting and probably my favourite track on the whole cd! Lovely evocative piano here, showing again Bardens' skill on the keyboards. All in all, although the vocals somewhat spoil it, and despite the lack of true inventiveness here, this is a good album to have, and, if I have to recommend one Camel album to have in your collection, then it has to be this."
    },
    {
      "reviewer": "Trotsky",
      "date": "Posted Sunday, February 27, 2005",
      "rating": 4,
      "text": "After the instrumental concept album The Snow Goose proved to be something of a breakthrough album, Camel must have been tempted to repeat the trick with another similar work. Instead Latimer, Bardens, Ferguson and Ward turned back the clock to produce an engaging album that probably ranks second-best among Camel's works, even if it is rather a long way behind the majestic Mirage.After opening with the lively and brief instrumental Aristillus, our boys hit us with Song Within A Song, surely one of the most mournful, yet compelling tunes they ever committed to record. Latimer's flute-playing is exquisite and the combination of the vocals and flute is heart-breaking ... until a ballsy Latimer guitar solo cuts through that is. His segment then segues into a Bardens solo extravaganza with the rest of the band providing a typically Camel-esque backing track.I'm not the biggest fan of the lengthy instrumental Chord Change, which while challenging enough, doesn't really have the memorable melodies that make Camel's musical interludes so special. The spacey Spirit Of The Water, which features some distorted vocals from Bardens is another track I don't rate too highly.But the album then gets back into full swing with the highly charged Another Night. While hardly a typical Camel prog tune, there's something about its underlying sinister tone that really gets me. The excellent off-time solo section doesn't hurt either! It's followed by Air Born which has a gorgeous flute and piano theme and some more phased vocals (this time from Latimer).The concluding track Lunar Sea is a storming piece of music that starts off, as one would imagine, full of spacey synths courtesy of Bardens. It eventually erupts into a full throttle Latimer guitar solo, but when the rhythm section starts playing around with the time signature, Bardens comes back in ... the effect is both discomforting and enthralling, and puts the exclamation point on an entertaining album. ... 70% on the MPV scale"
    },
    {
      "reviewer": "Tony Fisher",
      "date": "Posted Monday, March 28, 2005",
      "rating": 5,
      "text": "With this, Camel did the impossible. They produced a follow up album to the Snow Goose which kept to very nearly the same standard and didn't follow the same pattern. It's full of dreamy keyboards, superb guitar and flute work and the whole is backed by one of the classiest rhythm sections in history. Even the vocals, often a Camel weak point, work brilliantly. All the tracks are out of the very top drawer; not a filler or duff track in sight. It's hard to single any one out, but perhaps Another Day and Lunar Sea are the ones I will remember till the day I die. This is one for the desert island and no mistake."
    },
    {
      "reviewer": "Eetu Pellonpaa",
      "date": "Posted Friday, April 1, 2005",
      "rating": 5,
      "text": "I was really impressed by this album, and browsing the other albums of this band has been a sad process, as anything that I have heard from them haven't reached the quality of this album in any way. \"Moonmadness\" has a very compact and clean sound, and the compositions are pleasant, following each other in a logical way. The overall felling is nice and positive but not banal, which I see as an achievement. It's difficult to pick any highlights from this, as the quality is very good from beginning to end, but maybe the long instrumental which closes the album sums up the emotions of the album most strongly. Highly recommended!"
    },
    {
      "reviewer": "Andrea Cortese",
      "date": "Posted Wednesday, August 10, 2005",
      "rating": 5,
      "text": "My first Camel album. Of the many I have bought it's certanly the best. Great musicians, great elaborate sound. Sadly the Camel's Muse seems to pass away after this jewel... Delicate and soft Latimer's flute on Song Within A Song and exciting sinth instrumentation in Aristillus. Unique Camel's style is also evident in the ethereal Air Born and in the instrumental Chord Change. The icing on the cake is the Bardens 2 mins long piano played Spirit Of The Water. The best of Camel is surely a masterpiece!"
    },
    {
      "reviewer": "Matti",
      "date": "Posted Thursday, August 18, 2005",
      "rating": 5,
      "text": "(my #76 review: representing the year 1976)Count me as one of those who don't consider The Snow Goose as Camel's best work. It's not necessarily the lack of vocals that bothers me, but it has after all quite few highlights and too many interlude-like tracks that extend themselves too much. In my opinion, Camel's finest era begins with Moonmadness. It starts with a short and sharp keyboard piece 'Aristillus' that I don't really enjoy, but the rest is strong vocal-oriented Camel, stylistically a cross between Mirage and Rain Dances and also some worschmack of the 80's tight pop/rock songs in 'Another Night'. The soft and airy ones 'Spirit of the Water' and 'Air Borne' are among my dearest songs - some may find them too mild. At one time in my life I used to have nightwalks with my Walkman and this music still associates with the view from a hill, stars up and city lights down... (Though 'Ice' more than any!) 'Lunar Sea', long instrumental, is of course a classic track. The whole album could be longer, have more flute, etc, but it's very enjoyable, pure fine music. (4,5* rounded up.)"
    },
    {
      "reviewer": "NetsNJFan",
      "date": "Posted Monday, September 12, 2005",
      "rating": 5,
      "text": "September 12, 2005After the beautiful, but somewhat dull instrumental album THE SNOW GOOSE (1975), Camel returned with one of their best albums, the striking MOONMADNESS (1976). The album is a loose concept album, based around the moon, and the diverging personalities of each band member. (eg. \"Lunar Sea\" = Keyboardist Peter Bardens). The concept is rather weak, due to the mainly instrumental compositions and the weak vocals. While personally I feel Andy Latimer's suit the music perfectly, adding a light, ethereal quality that strong vocals (a la John Wetton for example) would ruin. This music is drifiting and beautiful, and Latimer's voice is pleasant enough. The album has shimmering layers of very modern sounding keyboards as well as Latimer's ever present flute, and trademark smooth, liquid guitar, which lends the album its melting soundscapes. It is easy to loose ones' self in the shifting textures of the album, but it remains structured enough to remain quite engaging as well.The album kicks off with the short, punchy instrumental \"Aristillus\", a composition based around concise, electric synthesizers. This piece, in its two minutes, manages to have more punch than much of the SNOW GOOSE album. \"Song Within a Song\" is a very good (typical) Camel song, in which there is a nice meeting of electric guitars, synths, and delicate flute work. The song has a brief vocal section in the middle, before giving way to an excellent instrumental section at end in which Barden's Synths are especially impressive. Camel have often been accused of sounding too much like Pink Floyd. This criticism is understandable, especially on this spacey album, but imagine this as Pink Floyd with much more solid melodies and a much faster tempo. These compositions move pretty quickly for such spacey material. \"Chord Change\" is a rather unstructured instrumental, where one could say spacey-symphonic meets jazz- fusion. It is an excellent, paced track in which every instrument is excellent. \"Spirit of the Water\" is probably the prettiest piece on the album, a song built on piano and synthesizers, in which Latimer's distant vocals add an eerie feel. The piece is short and stays around just long enough to achieve its goal, but more development would have been welcome. \"Another Night\" is probably the most typical rock song on the album with its insistent riff, and some of Latimer's strongest vocals. The piece, like all Camel tracks, does leave considerable time for instrumental development. Despite the strong melody, this is one of the weaker tracks on the album. \"Air Born\" is a very pleasant track, with lots of flute and acoustic guitar and piano. It is good, but somewhat unremarkable. It does contain an impressive and stately climax towards the end though. \"Lunar Sea\" is probably the most popular piece off of MOONMADNESS, and is also Camel at its spaciest. While the album mainly showcases Latimer's gorgeous guitar work, this track really is Barden's spot to shine, in which he employs a various number of pretty synthesizers to truly create a magical atmosphere. The song is long, but deserves its length entirely. The synthesized landscapes are always shifting, and like most Camel work, are always melodic and beautiful.MOONMADNESS is a masterpiece of Progressive Rock. The Instrumentation and is complex yet accessible, due to an abundance of pretty melodies sewn into the fabric of the album. Recommended to any fans of spacier rock (a la Pink Floyd, Tangerine Dream) who want more of a base for their music, and a must for all symphonic fans. MOONMADNESS, along with 1974's MIRAGE represent the peak of Camel's powers, and this album is easily the more cohesive of the two. 5 STARS."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Tuesday, September 20, 2005",
      "rating": 5,
      "text": "When looking back at the highly innovative music produced by British bands who emerged in the 1970s, the name Camel is always prominent. Their legacy includes albums such as \"Mirage\", \"Snow Goose\" an \"Moonmadness\" - all of which do much to enhance the reputation of a band who, unlike many of other contemporaries, have survived nearly thirty years in the music business and still demand a loyal and devoted following throughout the world, both in concert and on record. The consistent factor through various line-up changes has been, and continues to be, guitarist and flautist Andrew Latimer. [CD liner notes - quoted without permission].Yes, I think Camel is similar to King Crimson in terms of evolution of their line up: what ever changes in line-up, the guitarist remains the same and it's the only member that always be there in any album the bands have made. The only difference between these two bands is that in terms of music style consistency. King Crimson underwent fundamental change in their music direction when they reformed and released \"Discipline\" album. While the music style of Camel remains intact since its inception until now.For me personally, this album is special as some songs has been around me by the time it was released. The music I can say is melodic with a great combination of keyboard and flute. The album opener \"Aristilus\" (1:59) explores Peter Bardens keyboard work and set the overall tone of the album, followed with a melancholic and melodic track \"Song Within a Song\" (6:48) which has become the band's classic and legendary track. The lyrical passage combined with flute is really melodic and reminds me to the seventies era. \"Chord Change\" (7:18) is also a killer with some jazzy touch exploring Latimer's guitar fills combined with Bardens' keyboard. The music somewhat has similarity with Babe Ruth's. The short track \"Spirit of the Water\" (2:09) serves like a bridge with an exploration of distant vocal style and keyboard / piano in classical music style.\"Another Night\" (7:00) is another killer with an intro that comprises repeated chords of guitar and keyboard followed with vocal line. The music is floating melodic with steady drumbeats. The song has a nice interlude with solid basslines and guitar / keyboard works. \"Air Born\" (5:04) is a legendary track that begins with flute / piano work in classical music style followed with great music using guitar solo as main melody. When vocal enters the music, it turns out to be a melodic track with great work on flutes and clavinet. Memorable track! The album concludes with \"Lunar Sea\" (9:14) which its opening reminds me to space rock music like Klaus Schulze's. But what follows is a great guitar solo with layers of keyboard work augmented with solid bass guitar work by Doug Ferguson. Andy Ward who later became Marillion's drummer (for a short period) fills the drum work inventively. Keyboard solo continues the melody and the song experiences some tempo and style changes. It turns into faster tempo with more inventive guitar solo and multi-layer keyboard work. WOW! It's a wonderful track!It's highly recommended album and is accessible to many ears - prog and even non- prog lovers. You should have it in your collection. Keep on proggin' ..!Peace on earth and mercy mild - GW"
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Thursday, January 5, 2006",
      "rating": 4,
      "text": "4.25A great and mostly instrumental prog rock work from Camel that balances their classic rock roots with their melodic and symphonic rock from Snow Goose. It is not a strong departure from their previous albums. Instead I consider it to be a natural progression and their most mature work yet. If there is a complaint is its controlled nature that does not leave much room for impressive solos (with the exception of the opening and closing tracks).It begins with a brief mini-moog showcase. The proper songs themselves are multi-faceted, melodic, varied, dynamic, and just plain good progressive rock. 'Song within a Song' has great melodies in the first half and an extended, if restrained, synthesizer solo in the second half. 'Chord Change' begins and end with uptempo rock, its highlight being the laid back jazzy playing in between. 'Another Night' benefits from a rocking guitar riff and a contrasting middle section. 'Air Born' carry similar elements from the previous tracks but with greater success. This dreamy track is easily a highlight of the album. The closing track 'Lunar Sea' is an instrumental showcase and one of the best drumming performances on a Camel album. There's also a highly memorable guitar theme and an extended synthesizer solo. What follows however is an unrestrained Andy Latimer playing a highly fierce and passionate guitar solos that continues over the course of several minutes, only to end with a very powerful and frantic hard rock riff.5 Star Songs: Lunar Sea4.5 Star Songs: Air Born4 Star Songs: Aristillus, Song Within a Song, Chord Change, Spirit of the Water3.5 Star Song: Another Night"
    },
    {
      "reviewer": "Seyo",
      "date": "Posted Wednesday, August 9, 2006",
      "rating": 5,
      "text": "After very popular and IMHO overrated \"Snowgoose\", CAMEL recorded their last LP in the original line-up, and for my taste the best one. Although they were never among my top fav artists, I admit that listening to \"Moonmadness\" gave me many pleasant moments. Musicianship and production is perfect, sound mellow and polished, solo parts jazzy and spacey... Excellent for an engaged \"active\" listening as well as a leisure background. definitely the peak of CAMEL career."
    },
    {
      "reviewer": "Australian",
      "date": "Posted Monday, August 21, 2006",
      "rating": 5,
      "text": "First off, before I do anything I just have to say that my good buddy ClemofNazareth recently posted a review of \"Out of the Blue\" by The Electric Light Orchestra. In the opening paragraph of his review he stated that the best music has a personal story to it. I think that music is all about personal experience and in every review I write I include something about how I got the album or a story behind it. I know that most people don't care about your personal experiences, but I for one will continue to explore, not just the music in albums, but the personal experiences behind it.When I purchased \"Moonmadness\", or rather went looking for it I already owned \"Came\"l, \"Mirage\", \"The Snow Goose\" and \"Breathless\", so it was only natural for me to seek this album. I spent many weeks searching through CD stores, until eventually I just got fed up a decided to ask the employees at one of the stores if they could find a copy for me. The guy told me that there were no copies in Australia, and there hadn't been for several years. So I ordered a copy from America, the day before I picked it up I had a look under \"C\" in the popular section and guess what I found? Correct four copies of Moonmadness for $18 (The same thing happened when I went looking for 'Takk.' by Sigur Ros). I had payed $27 to order it so I was pretty angry and the people there.When I collected the album the next day I remember saying to myself \"this had better be really, really good.\" Now I have to admit that it took the better part of a year to get into the album, but nowadays it receives frequent listens and it has a place on the \"good\" CD shelf in my room, right along side \"Takk...\" There certainly is something different about \"Moonmadess\", perhaps it's just a matured sound to their previous stuff. If you haven't already guesses the album is inspired if you like by the moon which is obvious from songs like \"Lunar Sea.\"After \"The Snow Goose\" the band was eager to get back into to music with vocals and the result was \"Moonmadness.\" \"The Snow Goosev had had much success in the UK reaching number 22 on the charts and it gave Camel a good name. It didn't have such a great success in America however reaching number 162. Andy Latimer sates in the CD booklet that \"We decided to steer clear of conceptual albums and start to put more emphasis on vocals.\" It seemed that they just couldn't escape having a concept to their music here, but the second half of the statement it true, there are vocals. Camel was under tremendous pressure from record companies to create something good and Peter Bardens and Andy Latimer set to work creating something of very high quality.I'm not sure whether you agree with me here but I think \"Moonmadness\" had the best production of all Camel albums thanks to Rhett Davies. The first song on the album \"Aristillus\" was inspired by two craters on the moon which can be seen without the aid of a telescope. The song is a lunar sounding array of synthesizers with Andy Ward repeatedly saying \"Aristillus Autolycus.\" The following Song \"Lunar Sea\" is in my opinion the best on the album and has a very progressive structure with many time changes. The last 3 or so minutes of the song is some of the best Camel music ever written.The next song, \"Chord changev is another very progressive song and the guitar and keyboards in the song is very mood catching. The last one and a half minutes is the best part of the song, it is a lively section which closes the song on a high. There is another short song piano piece with flute echoing here and there, with vocals sung by Peter Bardens. Next is\" Another Night\" and this time the music is slightly more aggressive, but it still has that Camel charm. Again the last couple of minutes are extraordinary. There is a synthesizer solo followed by a guitar solo which closes the song.\"Air Born\" starts off with a soft flute melody accompanied by piano. It then moves into a short, but beautiful passage which is then embellished by mellow vocals and a relaxed feel enters the music. The entire song has the same, eerie but beautiful atmosphere and an epic finish. Last off is \"Lunar Sea\", a song inspired by the Lunar Sea of Imbrium on the moon. This song is entirely instrumental and the interplay between Synthesizers and Guitar is great. There is an especially good synthesizer solo around the 2:49 minute mark which lasts for the better part of three minutes. A guitar solo follows and it lifts the mood of the song and makes everything more livelily. The song closes with a slow synthesizer, and a slow wind-like sound.\"Moonmadness\" is Camel's highest charting album reaching number 15 in the UK and made a considerable impression in America. The Remaster of \"Moonmadness\" come with several bonus tracks which include \"Another Night\" Single, \"Spirit of the Water\" Demo, A live version of \"Song Within a Song\", \"Lunar Sea\" and \"Preparation/Dunkirk.\" Like all Camel albums the cover is worthy of a mention and the CD booklet is very informative.1.Aristillus (4/5) 2.Song Within a Song (5/5) 3.Chord Change (5/5) 4.Spirit of the Water (4/5) 5.Another Night (5/5) 6.Air Born (5/5) 7.Lunar Sea (4/5) Total = 32 divided by 7 (number of songs) = 4.5714 = 5 stars Essential: a masterpiece of progressive musicI know many people regard \"Moonmandess\" to be the last in a series of good Camel albums, but in truth there are a few very good Camel albums which were yet to come. Take 'Rajaz' for example and come on people 'Rain Dances' isn't that bad, is it? I recommend \"Moonmadness\" to all Symphonic prog Fans, it is among the best progressive albums ever, if you don't believe me just take a look at the top 100 list on this web site. Though I'm pretty certain this is the last 5 star Camel album around."
    },
    {
      "reviewer": "Melomaniac",
      "date": "Posted Friday, September 15, 2006",
      "rating": 4,
      "text": "On the heels of my recent discovery of this amazing band, and my review for The Snow Goose, I feel ready to review this one.Well, what to say? Is it as good as The Snow Goose for me? Most definitely yes! Even the vocals, which, from the Camel albums I have heard are usually a low point are fine on this one. Musically, I find it to be a continuity of The Snow Goose, only more concise.'Aristilus' is a very interesting and intriguing keyboard introduction to Moonmadness. It has a space and a medieval flavor that works, as weird as it may sound. Short but great.'Song within a Song' could'nt have been more aptly titled. The first part is mellow and soothing, with nice vocals courtesy of Doug Ferguson. The second part, instrumental, is more upbeat and entertaining and features great keyboard work backed by a great Latimer shuffle rythm guitar and a great rythmic section, not overly doing things. Great track.Instrumental 'Chord Change' shows once again great musicianship and songwriting from the band. The keyboard and guitar interplay in this song reminds me a bit of Babe Ruth, only much better. Interesting tempo shifts and structure changes throughout the song. Amazing instrumental.'Spirit of the Water' is a mellow tune, featuring great piano and flute work. The vocals, passed through Leslie rotative speakers, are good. Once again a medieval feel fills the song, only in a more melancholic manner.'Another Night' is the rocker on this album, and probably my favorite for that reason, along with 'Lunar Sea'. The song stuck in my head upon first listen. Latimer's guitar work I find very compelling in this song.At the moment I'm writing this, I realize I have no memory of 'Air Born', and I don't know if it's a good thing or not. I know I enjoy all songs on this release, so I guess it must be a good thing.Album closer 'Lunar Sea', as stated earlier, is my other favorite track from Moonmadness. From the spacy keyboard intro to the appearance of the rythm section playing a weird time signature tight as hell, all serving as background to Latimer's (once again) great guitar work, everything is there for this song to be a classic.I was about to give this album five stars, but due to the fact that I really don't remember 'Air Born' I'll give it 4.5 stars, even though it deserves five."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Tuesday, September 26, 2006",
      "rating": 4,
      "text": "Is it wrong that I find the first track the best and most intriguing? I'm not sure if this is my favorite Camel album, as it kind of goes back and forth with Mirage. Camel is one of the most laid back bands I listen to, as the music more or less speaks for itself rather than the in your face approach.I'm not captivated by the melodies, but I love them, in other words, the melodies don't really stick with you(at least not for me anyway) but I find myself enjoying it every time I hear them. To me, the intro alone is enough to have this record, even if its only 2 minutes.The biggest detractors are the vocals and the length, along with the fact that you really have to focus. Camel doesnt work well in the background to truly enjoy them. Don't worry though my friend, the time spent is well worth it. An album that more than deserves a place higher up in the ratings."
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Saturday, November 4, 2006",
      "rating": 4,
      "text": "To me early Camel sounds a an aural 'warm bath', so pleasant and relaxing. The climates change fluently from dreamy with twanging guitar, flute and soaring keyboards to mid- tempo and bombastic featuring often very sensitive electric guitar soli by Andy Latimer and great excertions on Hammond organ and Minimoog synthesizer by the late Peter Bardens. The rhythm-section sounds very flowing, they are a very pleasant support for Latimer and Bardens. I have seen Camel many times between 1981 (Nude-tour) and 2004 (Farewell- tour), always a sold-out house and Camel never let the crowd down with an inspired Latimer and good musicians around him (from Peter Bardens and Micky Simmonds to Ton Scherpenzeel). On this album Camel deliver 7 tasteful and varied songs, my highlights are Song Within A Song (great shifting moods and excellent finale delivering sensational Minimoog flights), Air Born (wonderful keyboards (organ and strings, sensitive electric guitar and beautiful flute with twanging acoustic guitar) and of course Lunar Sea: an up- tempo rhythm with powerful electric guitar (from fiery to howling), spectacular Minimoog sounds and a dynamic rhythm-section, Camel rocks! I just checked the ratings, this is Camel most appreciated studio album but I prefer the more dynamic and adventurous Mirage as their best. Nonetheless, a solid 4 stars for this very good symphonic prog album!"
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Friday, November 10, 2006",
      "rating": 5,
      "text": "4.5 stars. \"Moonmadness\" was the highest charting CAMEL record in the U.K.It starts off with a short keyboard based instrumental called \"Aristillus\" that sounds like a marching song. When I hear the first notes of \"Song Within A Song\" I just melt. No words necessary. The beautiful flute with piano and vocals are pure magic until the song changes after 3 minutes to the end. \"Chord Changes\" features plenty of that from Mr.Latimer as well as some fantastic drumming and keyboard melodies. Great band interplay on this 7 minute instrumental.\"Spirit Of The Water\" features the most beautiful melody I think I have ever heard. Gulp. My complaint is it's way too short. I really like the vocals on \"Another Night\" along with the keyboards and drums. Nice guitar around 6 minutes. \"Air Born\" is a very melodic track opening with piano and flute. It's also the only track with mellotron. It makes me feel so good. \"Lunar Sea\" is a jazzy, atmospheric instrumental that features some great guitar and keyboard passages. Amazing tune !This is a mature, beautiful piece of music history. This is possibly my favourite CAMEL album as well with the debut and 'Mirage\" rounding out my top three."
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Tuesday, December 5, 2006",
      "rating": 4,
      "text": "After exploring into the realms of symphonic prog in their \"Snow Goose\" opus, Camel was prepared to push the envelope a bit further for the \"Moon Madness\" effort, The main ingredient was the combination of the energetic presence of \"Mirage\", the stylish textures of \"Snow Goose\" and the addition of cosmic ambiences due to the increased synthesizer input by Master Bardens as well as Latimer's more robust confidence on guitar (using multipel layers and overdubbed harmonies) and flute (venturing into more complex solos). Simultaneously, the rhythmic interests of drummer Andy Ward were enhanced in favor of jazz-oriented vibrations, so the band's overall sound could achieve an augmented dose of dynamics and stamina. The sequence of the first three tracks is explicit enough as to set a proper general portrait of the album's nuclear essence. 'Aristillus' is an easy-going cosmic intro in which Bardens indulges himself in various Moog adornments over a firm basis of guitar and bass. Next, 'Song within a Song' defines a set of spiritually driven melodies alternately laid on Moog synth and flute, while the organ and the guitar provide subtle harmonic structures. The second half is more epic, although it could and should have sounded more energetic - perhaps a flaw in sound production?. Anyway, this track is in many ways a typical Camel song, with its intense lyricism obvious in the wide open. 'Chord Change' is much jazzier, creating a sort of bridge between the earliest Camel (i.e., the Canterburyr-related sound they developed in their debut album) and the Camel that would come to record the \"Rain Dances\" album one year later. If Ward was a master drummer since day one, now he managed to take his skill to a level of definitive maturity. The rest of the album is a catalogue of beautiful music, indeed. The piano based-brief ballad 'Spirit of the Water' is a very melancholic reflection on the futility of life, courtesy of Bardens: the recorder lines serve as an effective pastoral trick. 'Another Night' bears a denser sound, this time providing a hybrid between the first and the second albums, yet bearing a delicate eerie mood that works perfectly well in this particular album. The last two tracks are some of the most amazing Camel compositions ever: 'Air Born' and 'Lunar Sea' are real progressive gems of all time. 'Air Born' surpasses 'Song within a Song' regarding the manifestation of spiritual candor with a proper touch of energy that does not fall short at complementig the track's overall mood. 'Lunar Sea' is a top-notch instrumental tour-de-force that encapsulates the album's greatest qualities all at once. This album is a both step forward and a continuation of Camel's progressive ideology, although it is true that it fails to match the power of \"Mirage\" and the lyrical magic of \"Snow Goose\". While not a genuine Camel masterpiece in itself, \"Moon Madness\" sirely deserves to be labelled as an excellent prog item that should occupy a special place in any good prog collection."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Monday, February 5, 2007",
      "rating": 4,
      "text": "\"Moonmadness\" was one of my entries into the Camel catalogue and it is quite frankly my preferred one from their first era. At times, this is Camel at his best and how I like it : fully emotional, passionate and incredibly melodic.The short intro \"Aristillus\" is inspired by the name of two craters on the moon : Aritillus and Autolyus. Near the landing site of the Apollo 15 mission and close to the Lunar Sea of Imbrium (the inspiration of the closing number).Then comes \"Song Within a Song\" : I quite like the concept. Simply put it is effectively a song ... within a song : so, we got actually two songs in one ! And good ones.\"Chord Change\" is a complex song : good rocking tempo, the whole band seems very united. Each instrument flowing perfectly with the other. The song is rocking in its initial phase and then turns into a wonderful and melodious slow guitar break. A highlight and one of my fave on this album.I have mentioned this anecdote already in another review : during an interview, Clapton was asked which guitar player he liked the most. His answer was : Carlos Santana because he is the most emotional one. I would add that, IMO, Gary Latimer is also this type of guitar player : an enormous emotion is delivered from his play and it is fabulous to hear this here.Since their \"Snow Goose\" was an all instrumental concept album, they were seriously pressured this time to produce some numbers with vocals. There would not be that many though on this album. The short \"Spirit in the Water\" is the first one here : it is a nice little piece of quiet music with good fluting. Next comes \"Another Night\" which is a rather monotonous song and the weakiest track on \"Moonmadness\".We go back to melody with the instrumental \"Air Born\" : great number in which the emotional side of Latimer can develops in its full richness. Bass and background keys are superb. Another highlight. The closing \"Lunar Sea\" is probably the most complex song here : spacey in its start, the middle section with lots of synth and good bass playing is more rocky and ends in a furious guitar solo. The song finishes like it started : spacey and quiteful.The bonus tracks are quite valuable for two reasons : 1. they last for over thirty minutes and 2. they are good additions to the original album.The first one is the single (and edited version) for \"Another Night\". The album track is cut by half and this format is actually better. Next is an instrumental version of \"Spirit of the Water\" and I also prefer this version very much piano oriented. The last three tracks were recorded at the Hammersmith Odeon in April 1976 and are a good document : \"Song Within...\" and \"Lunar\" from this album and the mini-suite \"Preparation- Dunkirk\" from the \"Snow Goose\".All in all a very good album. It will peak at the 15th spot in the UK chart. It will be their most selling album. Four stars for this remastered version."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Tuesday, February 27, 2007",
      "rating": 5,
      "text": "Why is 'Moonmadness' arguably the best soft-prog album ever made? Because it marries the rock sensibilities of 'Mirage' with the melodic beauty of 'The Snow Goose', the albums immediately preceding it. This stands for me as CAMEL'S best moment. Whenever DJ Random spins this disc for me, I am forced to put aside whatever I'm doing and listen.There isn't a less-than-superb moment on the album, and sections of each song succeed in creating truly memorable musical events. The central section of 'Song Within a Song', with a repetitive theme underlain by soft keys and chased by rising guitars, the slow middle part of 'Chord Change', with an otherworldly beauty shared between Latimer and Bardens, a ghostly echo of moonlight shimmering on the water (oh lord, was there ever more gorgeous music than this?), the simple but profound instrumental sections of 'Another Night', the slowed coda to 'Air Born' and Mr Latimer's scintillating guitar on 'Lunar Sea', are just some of the terrifyingly beautiful moments this album brings.With Nick Mason-like drum fills, Bardens' keyboard to the fore, and Latimer providing the Gilmouresque guitar, you could be forgiven for thinking you'd come upon a forgotten PINK FLOYD gem from the early 1970s. But compositionally this album goes well beyond what the FLOYD ever did, though without the overriding cynicism and bite that characterised the Waters years. In my opinion, the lack of meaningful vocals was the single biggest factor that held CAMEL back from being part of the top echelon of progressive rock in the mid 1970s. No profundity to puzzle over with your mates, no weird sound effects, no angst. Just mercilessly beautiful music that opens you until you lie helpless before it.Let yourself be captured."
    },
    {
      "reviewer": "thellama73",
      "date": "Posted Monday, March 5, 2007",
      "rating": 3,
      "text": "I love The Snow Goose, and I rate Mirage along with the best of the early Prog giants, but for some reason Moonmadness leaves me as cold as... well, the moon. With the lone exception of \"Another Night,\" none of the songs grab me at all. There are none of the hooks of \"Lady Fantasy\" or \"Rhayader.\" I guess what I'm getting at is that it feels uninspired and formulaic. I'm not really buying the whole \"concept\" of the album either. This is generic '70's symphonic Prog that tries too hard and buries inspiration under aspiration. Stick with their earlier records."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Monday, May 21, 2007",
      "rating": 4,
      "text": "Being a man of first impressions, normally when I listen a band for the first time I know if will have the chance to like their music (of course there are exceptions like Trespass which I hated for a long time and now is among my favorites), CAMEL is not one of them, and believe me....tried very hard to like them with the impulse of the great reviews and the huge fan base, but it was always a futile attempt, even bought almost all their collection but it was left there at a corner of the shelve gathering dust, no matter what I did, always used to find them bland and dull.But something happened, last week, had to make a long travel by car and by some impulse I added\"Moonmadness\"to the CD's cartridge of the car and at last I could get them, won't say they are my favorite band but found something that was escaping from my perception.The keyboards and dense atmosphere captivated me, maybe because somehow they remind me a bit of Steve Hackett's first album including the distorted vocals but much more relaxing (Not necessarily better).But lets leave the chit chat and go to the album:\"Moonmadness\"is opened with the pompous intro ofArsilus, well, to be honest the whole 1:57 minutes of the track work as an intro for the album. The keyboard work by Pete Bardens, that reminds me of \"Voyage of the Acolyte\" even when more martial, sadly too short and leaves the listener with the honey in the lips, outstanding song.Song Within a Songis more in the soft and relaxing mood of CAMEL, the flute in the early section of the song is simply breathtaking, I don't like distorted vocals very much but in this case they are extremely appropriate for the song, which continues flowing as the atmospheric sound covers the listener. Around the third minute there's a radical change and the song turns stronger with a magnificent interplay of all the band and again Bardens is the star, they manage to keep making the music flow gently but with a touch of aggressiveness that makes the difference, incredible, two songs from a band I used to dislike and two songs that I find amazing. A special mention for Andy Ward and his brilliant work at the drums.Chord Changeis really a change, presents us the Fusion oriented sound of the band, clearly inspired by \"MAHAVISHNU ORCHESTRA\" but less dense and complex, my congratulations to Latimer, Ward and Ferguson who make an outstanding job, around the middle there's a change of mood, Latimer starts to remind me of Jan Akkerman and the soft Hammond in the background complete the FOCUS impression, three songs, three hits. also a lovely track.Spirit of the Wateris at this point the weaker track (IMHO of course) the artificial vocals, weak keyboards and flute don't match completely, seems as if they had an idea that were never able to develop, unconvincing and predictable but not bad.Another Nightis more my kind of music, strong and aggressive but without leaving the wonderful atmospheres which are CAMEL'S trademark, the changes are not radical or dramatic but never stopped to surprise me, when I believed they started to get predictable the magnificent instrumental section of the middle caught me by surprise, this is what Prog is about, to never know what's coming next, and CAMEL managed to do it perfectly inAnother Nightgreat song except for the ending, because I'm not very fond in fading tracks...Holy God, how could I ignored this band for decades?If somebody doubts CAMEL has a great FOCUS influence, the flute opening and guitar playing \"a la Akkerman\" inAir Bornshould convince them, despite the \"more than casual\" similarities in soound, wouldn't dare to call them derivative because the vocals and the backing organ make the difference. The instrumental section is marked by a Baroque Synthesizer and Latimer's flute which are delightful, the spectacular ending completes the success.Lunar Seastarts as another jazzy tune with brilliant bass lines by Doug Ferguson complemented perfectly by the accurate drumming of Andy Ward, you can't do anything but love the break point where the keyboards take the lead, when this guys stop to be predictable they are able of magic, magnificent interplay of all the band, a very strong closer with a great guitar and keyboards work at the end.........Who said they were too predictable?..Seems I was, but gladly admit I was wrong.Finding new great bands is satisfactory but it's much better when you discover you had great music under your nose and learn to appreciate it, and that's what has happened with CAMEL, I always had 5 or 6 ignored albums that now I have the chance to appreciate.Four solid stars for a very solid album, maybe after a couple more weeks of constant CAMEL feedback I will rise it to five stars but I'm still a newbie in a very old band."
    },
    {
      "reviewer": "Hercules",
      "date": "Posted Wednesday, July 25, 2007",
      "rating": 5,
      "text": "I missed early Camel due to being in Canada from 75 to 78, so when I got back, a friend lent me this album, the first of theirs I'd heard. And for 45 minutes, I sat back in complete amazement at the sheer beauty and virtuosity on display. It's spacy, melodic and perfectly progressive. If you like the more metal side of prog, perhaps it may not appeal, since it's fairly gentle but utterly relaxing. Even the vocals work, which isn't always true with Camel, and the musicianship is superb. Latimer is one of the truly great axe players and played a mean flute too, whilst Bardens (rest in peace) was a wonderful keyboards player. Ward and Ferguson melded like glue and the bass line to Lunar Sea is a masterpiece of effective minimalism. Every track is beautifully constructed, but Song Within a Song, Lunar Sea and Another Night are just my favourites. I will only award 10 albums 5 stars - this is definitely one of them and is my favourite Camel release and may indeed be my favourite album of all time. Utterly essential to any record collection."
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Wednesday, August 22, 2007",
      "rating": 5,
      "text": "Moonmadness is Camel�s best CD. Although I like very much the three that came before it - some people disagree with me, electing maybe Mirage or The Snowgoose- I still think that their fourth release is also their crowning achievement.They never sounded so perfect and inspiring as on Moonmadness. I was very sorry that bassist Doug Ferguson left the band after this CD and, with that, altering the chemistry within the group forever. Ok, they�d release some fine albums in the 90�s onwards, but not as good as the �magnificent four�.From the the short introduction of Aristillus to the last notes of Lunar Sea, the CD reeks of talent, guts and sophistication. As simple as the songs sound at first they grow on subsequent hearings to show all the glory of a band on all its power and glory. Song Within A Song is a classic prog song, Chord Changes shows the jazzy side of the band, Spirit Of The Water and Air Born their delicacy, and so on. But the best example to me is still the last track, Lunar Sea. This instrumental shows how powerful this band was, a great showcase of their technique, skills and songwriting capabilities.All in a ll my fave Camel album and the one I listen the most. A wonderful piece of prog music that inspired so many others. A must have and highly recommended CD."
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Sunday, December 9, 2007",
      "rating": 4,
      "text": "Camel reaches the peak of their career. For many this album is the best Camel, maybe, but the direction they took after Mirage is kinda strange to me. Mirage was more hard edge with a lots of guitar, while Snow Goose and Moonmadness are more keys orientated more symphonic but with no omission from the guitar parts. This is the last album created by the classical line-up of the band. After this album the band departs from classical symphonic prog and moves to jazzy/pop rock. A trully great album and pieces like Air born and Chord change are among the best Camel ever did, so why i give to Moonmadness 4 stars. After all this is a recommended album because of his melodic aproach."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Thursday, December 27, 2007",
      "rating": 3,
      "text": "It has taken a few years, but I think I finally appreciate the cold and empty soundscape that Camel has created with Moonmadness. To be honest, there is only one song that continually interests me (Lunar Sea), but every time I go back to this album, I wonder why I don't give it more respect. Also, I have thoroughly enjoyed reading many of the great reviews of this album that point out creative touches that I hadn't noticed, such as the songs loosely being based off of the band members' personalities, as well as numerous astronomical references and tongue-in-cheek jokes (song titles, plays on words, etc).Moonmadness seems to start quite slowly, which may be why I often have trouble getting into it. The march-like instrumental opener, Aristillus, sounds a bit dated, and the proceeding Song Within a Song begins quite slowly (and boring), with some very poorly enunciated vocals (typical of Camel). But then there is a gorgeous crescendo, the tempo picks up, and the rest of the album (save the short Spirit of the Water) is very high quality.On this album, you can't help but appreciate Camel's talent, in songwriting and playing. They are very tight together, and their transitions between tempos are about as effective as you will find, as is their use of dynamics. The problem is the vocals--they certainly are wise not to give up on them completely, but they range from average at best to terrible. This is actually a criticism I have of many Canterbury bands--if they just would have found better vocalists, the music would have that extra needed dimension. That being said, when Camel set to playing they are terrific, from the mellow shimmering organ and guitar section of Chord Change to the ominous, heavy chords of Another Night, to the spacey, distorted guitar of Air Born. Of course, the highlight is Lunar Sea, which features the perfect balance of mellow and fast sections, dreamy synths and impeccable guitar. This is certainly the best Camel piece I have heard, and it really fits with the moon-related theme of the album.Dark Side will always be my favorite lunar album, for obvious reasons, but Moonmadness probably comes in second (though I'm not sure what other competition there might be!). Camel provide series of full, enjoyable, and expertly crafted songs with Moonmadness, and as long as you can appreciate the mellow and melodious side of prog, you should have this album."
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Wednesday, February 20, 2008",
      "rating": 4,
      "text": "Camel's finest hour?Personally, Camel's first album is my favorite of their classic period which I consider the first four releases with bassist Doug Ferguson. The debut album has so much enthusiasm and fun jamming. But I have to admit that \"Moonmadness\" is probably their masterpiece, the most well-rounded, full-sounding, and consistent album of those years. They entered the studio in January 1976 and the album was on the street just two months later which is a testament to how efficient they must have been at that moment. Moonmadness seems the most mature of these albums and corrects the shortcomings of the fan favorite \"Snow Goose\" by eliminating the more docile spaces between the great moments in an album that was already low-key enough. Liner notes indicate that new producer Rhett Davies sought to give Camel a more spacious sound on this album and it's a difference you can really notice when you listen. Lush, melodic, and with improved writing, Camel's fourth turned out to be an album that would live up to the fantastic cover art and grand intentions.The stage is set instantly with properly noble introduction titled \"Aristillus\" which likely gave fans in 1976 plenty to be excited about as they began to explore the lunar concepts. But it is on \"Song Within a Song\" that you realize this is going to be special. Few bands do the pastoral this fine: lush keyboards, beautiful flutes, restrained guitar and drums, mellow vocals. This is one of those very difficult albums for me to describe because the adjectives just begin to repeat. Beautiful, gorgeous, et al. \"Chord Change\" sees an uptick in the energy level with Latimer and Ferguson playing off each other very nicely. It chills out a bit as Latimer lets flow one of his most fantastic solos ever with Bardens using restrained organ behind him. After Bardens takes his own solo the pace picks back up until the end. A brief respite with the great piano and rippling voice on \"Spirit of the Water.\"The roll they were on just kept rolling with \"Another Night\" which was chosen as the single being an upbeat rocker with suitable vocals. \"Air Born\" may be the single most beautiful melancholic prog track ever written with the flute and synth perfectly setting up Latimer who executes both acoustically and electrically. The vocals here are sufficiently dreamy to fit well with the mood. The closer is the instrumental \"Lunar Sea\" that puts this album over the top. The soaring atmospheres created by Bardens and Latimer absolutely bath the listener in the smooth rocking lunar vibe that the album is selling, wide-open, propulsive by Camel standards, and fun! The hero on this piece is Andy Ward who's understated but tight percussion holds everything in perfect orbit.How fitting that this review is being posted tonight, about an hour before I will be stepping outside to view a full lunar eclipse on a clear, freezing cold night. No, I didn't plan that, this album just happened to be on the top of the pile tonight. An essential title for a wide range of progressive rock fans who adore melody and accessibility. There is nothing abrasive here, this is plain and simple musical comfort food. 4 � stars for me."
    },
    {
      "reviewer": "The Pessimist",
      "date": "Posted Friday, February 22, 2008",
      "rating": 4,
      "text": "Camel's second best album, I consider this to be the younger and slightly less interesting twin of Mirage. Indeed this album is superb in almopst every way possible: melodic, climatic, unpredictable, beautiful and classically based; it just lacks a certain quality that drags Mirage to the top of my Camel collection. Anyway, here is a track by track:1. Aristilus - 7/10 2. Song Within a Song - 9/10 3. Chord Change - 9/10 4. Spirit of the Water - 7/10 5. Another Night - 9/10 6. Air Born - 10/10 7. Lunar Sea - 10/10The thing I love about this album is that it goes out with a bang, the last two tracks being the strongest of the 7. I haven't given descriptions for each track as I don't feel it necessary; you need to find out for yourself. I will tell you this - it is definitely worth the money. 4 stars."
    },
    {
      "reviewer": "LinusW",
      "date": "Posted Sunday, March 23, 2008",
      "rating": 2,
      "text": "There is something I dislike on this album. It could be the sometimes spaceous structure, the annoying emotionless vocals (sparse, but nonetheless) and vocal effects OR the knack for repetition this band seems to have, especially when it comes to basslines. Most likely it's a mixture of all of these elements, paired with the lack of enthusiasm I think that some bands seem to emit.In short: Moonmadness just doesn't offer me much of a thrill.The reason to why I decided to get this record was Aristillus, and Aristillus alone. I heard it once and really liked it. Great powerful keyboard-driven tune with a cold, crisp atmosphere to it. Some distorted, electronic bass sounds make it even colder.Song Within a Song is a perfect example of what I can't appreciate here. It's not that it is bad per se, but the intro reeks of something I can only categorize as blandness. My first thought was 'MIDI!' and the next was 'polyphonic phone tunes!', production- and otherwise. Not very exciting, eh? After the intro finishes, there is this Floyd-esque spacey part that will repeat itself a couple of times during the song. I've never been a big fan of that, making this a STRICTLY subjective objection (but even I like the introduction of Lunar Sea, where this feels natural and really builds up the atmosphere of a cold, moonlit night. Bullseye!). I'd also appreciate a more powerful organ sound, instead of the often meandering performance. The rest of the songs are all somewhat close to this one, at least big parts of them, when broken down into individual passages. So chances are that if you like this song, you'll like the album. But if you don't...Another Night is more powerful and classic rock-ish. But I still feel that it suffers from overuse of to few musical ideas, drawn out for 7 minutes. Or perhaps that the ideas don't get time enough for development.All this makes it sound like I despise this record, but I really don't. Found here is also some very emotional and enjoyable guitar solos and nice flute and as I said earlier, nothing is actually bad, as in sloppy, or untalented. I think there's a fair amount of material for three stars, even the rare four/five star-thingy. But I can't let go of that feeling that this is a band trying really hard to sound like a lot of other bands, all at the same time, somewhat lacking in a clear musical direction.Taken as a whole: 2.5 stars (going down), as I'm sure fans of this musical blend (obviously, just look at the rating!) will enjoy this.//LinusW"
    },
    {
      "reviewer": "kenethlevine",
      "date": "Posted Sunday, May 11, 2008",
      "rating": 5,
      "text": "After the breakthrough success of \"Snow Goose\", Camel could have played safe and gone with another instrumental concept but instead chose to combine the best aspects of that album with \"Mirage\" to produce arguably their finest album.Unlike in its predecessor, Camel is less interested in slow mood setting on the opener \"Aristillus\", and more in immediate impact, drawing the listener into the work from the first moment. With plenty of synthesizers almost overpowering in their attack, an intricate melody emerges and prepares us for the journey. \"A Song within a Song\" is practically a flute led ballad to begin with, with vocals reintroduced for the first time since \"Lady Fantasy\", these sung by Doug Ferguson. But after the 2 verses, we are treated to a veritable keyboard fest, and to Camel's ability to turn minimalist themes into magic. \"Chord Changes\" should please very early fans of the group, with many of those jamming qualities present in their debut but also greater quality control, and the first hints of Mr Latimer's great improvement as an axeman. A slight influence of Mr Carlos Santana is suggested in a variety of ways such as the subtle but clear Latin tinge. \"Spirit of the Water\" is sung spacily by Bardens and demonstrates Camel's aptitude with short vocal melodies. You might expect a little throwaway ditty but you get anything but.\"Another Night\" is one of my personal favourite Camel songs, more of a rocker but with a lot more structure than during the Mirage era. More of an emphasis on minimalist qualities is evident here, and it works perfectly thanks to the ensemble approach. The vocals are also unusually strong and as close to harmonious as you will get from pre Chris Rainbow Camel. \"Airborne\" is one of Camel's softest and most beautiful songs, featuring a lovely flute led melody, gentle vocals, and spacey keyboards. While I feel that \"Lunar Sea\" is somewhat overrated, most consider it one of Camel's all time best works. It debuts under a wash of mellotron and gives prominence to synthesizers, bass, drums and guitars at different times.Not for the first or the last time, Camel proved with Moonmadness that they were an evolving band, swayed more with the madness of love of their craft than commercial fortune."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Sunday, May 18, 2008",
      "rating": 2,
      "text": "Review 33, Moonmadness, Camel, 1976StarStar(Star)This album was my third Camel album, and like The Snow Goose, it simply failed to captivate me like Mirage did. At first, I was fairly impressed with Andy Ward's more substantial drumming contribution, and the band seemed to have cracked what they wanted to do with the vocals. However, the problems with the album soon seeped through. I didn't, and don't, like either Lunar Sea or Chord Change, the former, especially, being boring as Hell. The keyboards often sound weak to the point of being ineffectual, and Ferguson's bass isn't especially impressive. Additionally, the album as a whole is quite conservative, unlike Mirage, which was consistently interesting and daring, or The Snow Goose, which, while not my cup of tea, was pretty diverse throughout. Pieces from Mirage, especially, developed a little, while those on here remain pretty static.Aristillus begins the album with a fairly whimsical synth-driven track with Pete Bardens' keyboards everywhere and occasional background muttering. After a minute, slightly more substantial moog-work is brought in to bring the song to a conclusion. Generally meh.Song Within A Song is the first of the softer, vocal-inclusive offerings of the album, with a combination of rather ineffectual Bardens keyboards and Latimer flute introducing us to the song. The highlight to this opening is an interesting percussion contribution (providing some mysterious textures) from Ward with an accompanying Ferguson bass-part. Once the vocals come in, the song improves substantially, seeming more directed, with a soft, relaxing mesh of voices and the flutes and synths feeling much better placed. A good groove with a neat keyboard riff and some Latimer-Ward created textures in the background lead us on for another minute. A slightly funky (for want of a more sonically pleasing word) section doesn't really do much for me, with its synths again feeling meaningless and light, but the conclusion with clashing percussion from Ward and renewed synth or guitar (can't tell which) is much more satisfactory.Chord Change is the first of the two mainly uptempo and rather dubious pieces on the album. We get rather weak set of guitar parts from Latimer, monotonous bass and drums and occasional irritating 'dah-dah dahdahdah-dahdah dah-dah-dadah' vocals. A brief break with a soft guitar solo accompanied by a capable rhythm section, glockenspiel and swelling background organ included. A gradual build-up with some rather strained organ-work leads up a return to blandness. This piece is rather characterised by a fairly cheerful, conservative nature, and I wish that Latimer had perhaps rocked out a little more.Bardens' Spirit Of The Water (originally a piano solo) is dominated by piano, a watery, distant vocal and a couple of flute additions over the top of the piano. The night-time, watery feel is handled perfectly. I'm not sure whether I prefer this version or the demo solo.Another Night is definitely the most rocking of the songs here, with a comfortable chord-based Latimer, some delightful block organ from Bardens and some sophisticated and interesting drumming from Ward. The vocals work smoothly in conjunction with the music. An interesting combination of the organ and guitar soloists and the rather blunt bass-led rhythm section gives a springboard from which the guitar-part and hollow drums can burst in again. Two enjoyable solos from Bardens and Latimer respectively lead us on to an unfortunately awkward fade. Still, I like this one.Air Born begins with a rather pastoral flute solo (and some piano beneath it), and then takes off with a relaxed groove, very nice mellotron and some excellent guitar-playing from Latimer. A tolerable (I'm not really sure if a stronger one would have helped or damaged the song) vocal brings us through the song. Flute and acoustic weave together a light atmosphere for us, but a wallowing moog and slightly tacky sound effects could probably have been left out. Latimer's gentle vocal brings us on to the conclusion with grandiose drumming and mellotron complimenting the acoustics. Another good piece, but not approaching the masterly levels on Mirage.A deep, shimmering set of keyboards (though overly repeated, in my opinion) gives rise to the groove of Lunar Sea, which is the second of the conservative pieces on the album. Latimer throws in an extensive guitar solo, but listening to it feels like a chore rather than a delight, and a repetitive rhythm section (especially Ferguson) does nothing to help. Bardens takes the next solo, which has its moment, though I find it difficult to get the irritating bass part out of my head and just enjoy it. Following that, Latimer and Bardens gradually become more cooperative in their soloing, with a completely bland and damaging-to-the-song groove from Ferguson, who provides the songs highest moments by not playing. Another solo from Latimer, while Bardens joins the rhythm section, leaves me rather cold, but again, I think it's the background and not the solo that's the problem. A yawn-worthy combination of the guitar, the opening keyboards and some windy effect leads us out. In short, a terribly bland piece of music.Onto the bonus material:The single version of Another Night is a welcome addition, as it has all the great parts and none of the un-helpful ones from the original piece. The piano solo version of Spirit Of The Water is nice, perhaps preferable to the one finally included. A live version of Song Within A Song has a better sounding opening, and is overall a rather more satisfactory and fleshed-out piece. Good inclusion. A ten minute live version of Lunar Sea has a slightly less prominent and annoying bass part and more emotional soloing (especially from Latimer), but is essentially the same song at heart. So, not masterly, but much better than the studio one. Finally, this segues into a live rendition of Preparation and Dunkirk from The Snow Goose, with a very successfully conveyed atmosphere and feel in Preparation giving way nicely to the great guitar soloing and martial drumming of Dunkirk. This inclusion provides a very nice end to the 'full' remaster, which is something I have to compliment the Camel re-release range for: despite including bonus material, the album always ends very neatly.All in all, I'm not that big a fan of the album proper, with a couple of enjoyable highlights. I'd give the remaster complete with bonus material three stars, but the original album's material only two. Two stars it is. The remaster is a generally good album, which I enjoy listening to. Fans of Camel obviously like the sections from the original studio album, but I really don't, and think that someone who hasn't shown much interest in other albums by them could pass it over without really missing anything. Mirage (and, to a lesser extent, The Snow Goose) is much more exciting, in my opinion. Sorry for the stupid overuse of remaster meaning 'album with bonus material', but my brain is scrambled today.Rating: Two Stars (Three for the remaster with bonus material) Favourite Track: Another Night (or the live version of Song Within A Song)"
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Wednesday, June 4, 2008",
      "rating": 4,
      "text": "Moonmadness is the fourth album from symphonic proggers Camel and the highlight of their career IMO. It was the end of the original line-up as bassist Doug Ferguson would leave after this album. The first four albums from Camel do have a special place in my prog rock collection even though I�m not the most devoted fan in the world. Their music has always been strangely calming to me. Very pleasant listening experiences. They have the most soft sound in the world as if they played in cotton.The music is symphonic prog rock with lots of vintage keyboard sounds, flute and the melodic guitar playing from bandleader Andy Latimer. The vocals are not very dominant and they only appear in about half the songs. People always bitch about Came�s vocals but I have always found them nice and calming. They are not fantastic but they suit the music fine. The vocals duty is split between the members of the band which really can�t be heard as they all have similar sounding voices. I think their vocal style reminds me of some of the Canterbury scene vocalists.Unlike most of my fellow reviewers I wasn�t too impressed with The Snow Goose which I quite frankly found a bit boring. It means the world to me that Camel have chosen to add vocals to Moonmadness even though they are pretty sparse. Not surprisingly my favorites on Moonmadness are Song Within a Song and Air Born which are the longest songs with vocals on the album. Another Night even though it is a good song is a bit too much on the commercial side for me. Chord Change and Lunar Sea which are the longest instrumentals on Moonmadness are very good songs too though, so don�t think I don�t like the instrumental songs. Chord Change is the most exciting for me.The musicianship has reached it�s peak in Camel with this album, and everything just sounds so good.The production is excellent. A school example of how seventies prog rock should sound if you like the softer version.I think Moonmadness is one of the best albums Camel has ever made. I don�t feel that it�s an essential album for prog rock even though it�s excellent. I�ll rate it 4 stars and I will recommend this to anyone who likes soft progressive rock that doesn�t offend anybody but still has enough substance to please just about every prog head I know."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Saturday, July 26, 2008",
      "rating": 4,
      "text": "One of the definitions that can be applied to the word extraordinary would be \"a work of art where the difficult seems effortless.\" On \"Moonmadness,\" as the group known as Camel smoothly traverses through intricate passages involving tricky tempos and unusual time signatures, that rare ability is abundant and makes this collection of tunes a joy to experience. Coming off the heels of their celebrated \"Snow Goose\" album, this one finds these gifted musicians to be more confident than ever and the cohesive tracks presented are a testament to their professionalism, dedication to their craft and their hard-earned, accumulated experience. (And is this one fantastic example of glorious cover art or what?) The shame is that well over three decades passed me by before finally discovering this band's unique charm. Yet I think many proggers who grew up in the USA adoring British bands like Yes, Pink Floyd and Genesis are in the same clueless situation because Camel received little or no radio play over here and they were never promoted properly to garner the attention of those who would have flocked to their sound. Like me. Alas, better late than never, I say.A delightful little ditty called \"Aristillus\" opens the album and, despite the fact that it was written by guitarist Andrew Latimer, it's almost all synthesizers layered over a marching percussive beat and establishes an unassuming, playful air right off the bat. It's nearly impossible to dislike this short but endearing instrumental number. \"Song Within a Song\" follows and it is one of the most seamless performances you'll ever come across in prog. As you'll hear throughout the proceedings the vocals are good but so subdued that they tend to blend into the background. That's the sole aspect of their talent they seem to be insecure about but, for the most part, it doesn't detract from the overall presentation. Latimer's excellent flute playing is exquisite here, the interjection of a lively guitar/bass riff prevents the song from becoming boring or predictable and Peter Barden's tasteful synthesizer ride towards the end is hypnotic. It's a first-class cut of prime prog from start to finish.The band shifts into a higher gear for the jazzy \"Chord Changes,\" a harmony guitar-based tune where drummer Andy Ward shines like a supernova as he slides and glides gracefully over the musical landscape behind the group. Midway through they slow things down and allow Andrew to dazzle with warm electric guitar runs and Peter with a stunning Hammond organ solo that can only be described as magical. Aficionados of that majestic instrument will undoubtedly be impressed. After a return to the initial up tempo jazz motif the song slowly fades away but remains firmly seated in your prog consciousness. Just when you think they've peaked, along comes the heavenly \"Spirit of the Water.\" Beautiful doesn't do it justice. A serene union of flute and keyboards joined with a haunting vocal fed through a Leslie speaker cabinet (giving it a cool underwater ambience), the only criticism I have is that it's entirely too brief in duration. I could blissfully swim in it for another five minutes or so.\"Another Night\" is a more commercial venture somewhat rooted in the then-popular Alan Parsons Project style. But here the diminished vocals are a distraction, making the opening verses come off as rather pedestrian until the all-music break arrives and the tune veers off into a very engaging direction led by Doug Ferguson's strong bass lines. The song develops well-needed drive as it evolves and both Latimer and Bardens contribute spirited solos toward the end. \"Air Born\" starts nicely but loses momentum the moment the vocal melody enters, marking the nadir of the album. Don't get me wrong, it's not bad at all but it's also not particularly memorable. \"Lunar Sea\" serves as a wonderful finale, though. This instrumental piece begins with mysterious synthesized strings hovering like mist over a still pond before a sizzling, jazzy groove rises like the summer sun and takes over with Ward again splintering sparks from his drumkit, guiding the group through the song's exciting hills and valleys. I consider the ARP synthesizer (so very popular in the seventies) to be one of the most misused and horribly abused inventions of that era but, in the hands of a master, it could be wholly entertaining and that's what Peter accomplishes with it here. His lead is tactful and leisurely performed, showing all keyboardists how it's done. Andrew tosses in a white hot guitar solo prior to the number dissolving back down into the spacey aura of the introduction. This is great progressive rock not to be overlooked.I'm not partial to hearing loose studio run-throughs that often get slapped onto reissues but here the \"bonus\" tracks actually live up to their promising title. The single version of \"Another Night\" actually benefits from the vocals being more upfront in the mix than on the original. The unadorned demo version of \"Spirit of the Water\" not only surprises but mesmerizes. It's just Bardens performing the song alone on the piano but it is nothing short of drop-dead gorgeous and I could listen to it over and over again. Maybe it's just me but all I can say is \"Wow!\" Including live recordings as extra cuts is most appreciated and the pristinely engineered and mixed performances of \"Song Within a Song,\" \"Lunar Sea\" and (from Snow Goose) \"Preparation/Dunkirk\" are perfect compliments to the CD. With Camel not being a \"jam\" band, they add little to the studio renditions but the way the band delicately fades in and out on \"Lunar Sea\" is awesome and Latimer's passionate guitar ride on the same song is remarkable.With so many reviews already posted for \"Moonmadness\" it's obvious that, when it comes to Camel, I'm an over-the-hill late bloomer. So be it. Can't do much about it now except to play catch up and start collecting and enjoying their fine prog creations one album at a time. It will be a pleasure. 4.3 stars."
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Tuesday, July 29, 2008",
      "rating": 4,
      "text": "Camel continues to explore the genre of progressive rock with the next release - Moonmadness. In my opinion, after these unique albums like Mirage and The Snow Goose, the band decided to take different way for its career. These two albums explored everything what one progressive rock band could dream for. And honestly Moonmadness doesn't produce the same feeling in me like these two predecessors. The musicianship is just completed and remind me to other albums played in the same slow technique manner - Pink Floyd's Wish You Were Here and Dark Side of the Moon and Premiata Forneria Marconi's Stati di immaginazione. But the one big thing that embarrass me is the songwriting. I don't consider the songs to be completed enough and I think this part of the album is far behind the musicianship on the release. I can't forget to mark the last song of the album as the best by far here - Lunar Sea. It is full of surprises and tempo changes. It comprises of irregular time signature - just beautiful. For the song - 5 stars. I consider the album is much weaker than Mirage and The Snow Goose and little weaker than the homonymous Camel album. For the album around 3.75!"
    },
    {
      "reviewer": "LiquidEternity",
      "date": "Posted Monday, November 24, 2008",
      "rating": 4,
      "text": "Many consider this to be Camel's best album, and if it weren't for the two of theirs that are better, I'd probably be inclined to agree.Coming off the heels of the band's excellent prog rock powerhouse Mirage and their gently brilliant instrumental album The Snow Goose, Moonmadness mixes both of them without truly foraying into as much adventurous genius as either of them. The songs are all great, but they do not come across quite as convincing nor as enthralling. The vocals are much less inspired to me than on Mirage, and the compositions a bit more jam-oriented than on The Snow Goose. Do not mistake the meaning of all this. Camel's third strongest album simply implies a wonderful release of progressive music, and not one to be ignored by any means at all. Fans of Camel will love this. Fans of Pink Floyd will likely love this. Fans of prog in general can probably find plenty to love here. It's just not quite on that plane of quality that its two most recent predecessors find themselves on. The flute is not quite as prominent nor as unfettered, but the drums and bass form the rhythm section in a way that actually is much more remarkable than on any other Camel album.The first track is the short instrumental bit Aristillus, opening the album with a mildly upbeat sound over which an odd-sounding keyboard jingles out the melody. It turns quite nicely into Song Within a Song. This track is mostly slow-moving, beautiful guitar/bass unisons displaying the melody. About four and a half minutes in, the song changes for a bit (song within a song?), featuring more driving rhythm and a nifty keyboard ditty bounced around. The music turns majestic for a few moments, drums flying with cymbals and snare quite evocatively, before turning around at the last moment to remind us of the way the song sounded at the beginning. Chord Change sounds more like earlier Camel at the get-go, fast harmonized guitars marking out a melody. Andy really shines on his frets here, completely showing up his often-considered rival David Gilmour. In truth, this track in a lot ways hearkens back to The Snow Goose. A spiraling clean guitar solo makes up the middle section of the tune, slowly giving way to a new keyboard melody that slowly gains ground and intensity. It suddenly launches into a quick solo. The tempo and feel keeps growing under the force of a guitar as the song fades out. Short of Lunar Sea, this is the strongest track on the album. Spirit of the Water wraps up the first side, being a gentle song with a good melody and kind of lackluster vocals.Side two begins with Another Night, a cowbell driven rock tune marred only by a slightly weak vocal melody. The mid section features a wonderful bass line that truly powers the song much further than its verses can provide. The guitar once again harmonizes with itself to play the melodic lead throughout the instrumental interlude here. Finally, a snappy guitar solo closes out the tune in true Latimer flair. Air Born waltzes in next, though this track is a more straightforward and less clever ballad than its predecessors. It's not terribly remarkable save for some quirky and tasty flute. The true highlight of the second side is the near ten minute track Lunar Sea. Akin to Chord Change, this song features no vocals. However, much of it is gentler. It opens with a bit of keyboard soundscaping, before the bass lays down the ground and the guitars walk all over on top. It settles down after a moment so that an electronica sort of key sound can play a melody (which eventually becomes a solo), but the tempo will return. With it comes some organ and another guitar solo, all still completely held in check and at the same time propelled forward by some absolutely wonderful bass guitar. The music then changes and grows even wilder about seven minutes in, with Andy Ward flailing about wonderfully on his drumset. This fades into a closing soundscape.In all, Moonmadness has too many weak spots to truly qualify as a five star album, but it quite easily stands in the four star range. Any fan of Camel needs to listen to this one. It's not the best place to start, but it's a great second or third one to listen to. Highly recommended."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Wednesday, December 3, 2008",
      "rating": 5,
      "text": "Camel's fourth studio album is brilliant, and one of the best they have ever done. After the instrumental concept album The Snow Goose, the band decided to do something more in line with what they had done previously. There isn't a weak moment on this offering, and every passage of it is so memorable.\"Aristillus\" This short instrumental marks the beginning of lush journey of sound. It has the feel of a march, and is laden with synthesizers. Drummer Andy Ward can be heard chanting \"Aristillus Autolycus\" over and over, apparently because he was the only one in the group who could do it. The piece ends with a descending, whistling synthesizer.\"Song Within a Song\" One of the best tracks on the album, this one has several phases, each of which is never repeated. After a satisfying introduction, there is a pleasant flute section that leads into both of the verses. Doug Ferguson sings lazily here; the dreamy lyrics actually demand this serene vocal style. After two verses, there is an uplifting section of guitar that builds up to a simple but effective synthesizer solo section. The final moments of the song are even more elevating than what came before.\"Chord Change\" One of two lengthy instrumentals, \"Chord Change\" has a solid guitar theme and several respectable transitions. It gives Latimer an ample opportunity to shine, and shine he does. The anticipation of some parts and the sudden but surprisingly smooth shifts from briskness to calm and back again mean that this song would have been right at home on their preceding album, The Snow Goose.\"Spirit of the Water\" Fleeting and mystical, flute and piano soon give way to Peter Bardens's pensive and hushed voice. The effects make him sound as if he is singing underwater. This is a song about inevitability.\"Another Night\" Several layered guitars fade in before breaking down to the main riff. Latimer's singing is similar to that of Ferguson's on \"Song Within a Song.\" The chorus lays off the distorted electric guitars and employs a flanging effect. During the instrumental interlude, there is a clever bass line, organ in the background, and eventually, some beautiful dual guitar work. The third verse forgoes a chorus in favor of an upbeat organ solo, and soon enough, a well-done electric guitar solo.\"Air Born\" Soft flute and piano begin this lovely song, after which strings and electric guitar take over. This time, Latimer's singing is comparable to Bardens's on \"Spirit of the Water.\" The vocal melody is agreeable, as is the interlude of flute and acoustic guitar that follows. The instrumental section features electric piano runs, long guitar notes, and the sound of something like air rushing past. After a vigorous third verse, the whole band reprises the introduction. It is a song full of variations, but one that is tightly orchestrated.\"Lunar Sea\" After an atmospheric opening (featuring Ward blowing into a container of water through a hosepipe), the bass and drums fade in, in a rapid 10/8 time signature. Latimer delights us with a soulful guitar performance on this lengthy instrumental, before Ferguson brings about a merry bass line that provides a solid foundation for an extensive and spirited synthesizer solo. After the keyboard part, Latimer steps into the spotlight once more, this time delivering a fiery solo on electric guitar. The song ends as it began."
    },
    {
      "reviewer": "crimson87",
      "date": "Posted Saturday, March 7, 2009",
      "rating": 3,
      "text": "I can't believe it's another symphonic prog album!!!!!Moonmadness is the last album released from Camel's best period in the 70's. After the incredible \"Snow Goose\" the record company put some pressure to the band so they would not release another instrumental record again. There is not a change of direction for the band in the sonic department since the style is typical symphonic prog ( a little bit watered down may I add) with Camel's features: Emotional guitar parts , athmospheric keyboards and equal participation from every one of the band members.Aristillus is a short instrumental drenched with synthetizers , although I don't think it will be revered as a masterpiece , there is nothing annoying about it as well. The second number is a typical Camel song it starts with very nice flute by Latimer. Unluckily , this song features vocals and these are quite uninspired. But that's the only flaw I can find on \" Song within a Song\" since it features very well made athmospheric parts both with synthetizers and guitar. The melodies are memorable as well. As a note , I can add that both Latimer and Bardens share the vocal duties here. \" Chord Change\" is not as strong as the previous number , I have heard loads of instrumentals like this one. Probably the wrong thing about it it's that on the previous number the song felt like we were on a space voyage and suddenly we are taken back to a jam section with the next tune. Still , this song has an interesting middle section that reminds me of the Snow Goose which is good in my book . \" Spirit of the Water\" was originally intended to be a keyboard solo but it features some really depressing vocals instead.\"Another Night\" starts strong , with interesting riffs. But soon the band runs out of ideas , the song feels almost like a leftover from another recording session. And on top of that we have our classic \"vocals\" issue. Finally , the song fades away without having achieved anything.. The weakest track on this record by far. \" Air born\" , in comparaison is a much stronger song: Starts with flute , emotional guitar patterns and spacey synths much like \"Song within a Song\". The vocals feel the mood of the tune right now which is quite a compliment. As a disgression , am I the only one to find similarities between the middle section and Beatles \" Flying\"? Finally the record ends with the majestic \"Lunar sea\". Camel really goes space rock here! There is some heavy syntherizer work by Bardens all over this song , but also Andy Ward offers his best drumming performance on the record. This number is by far the most energetic of the album. After the synths there is some frenetic soloing by Latimer pretty much like Mirage's wildest moments. I think this album couldn't have had a better closer than \"Lunar Sea\"\"Moonmadness\" is sort of a mixed bag: A couple of exellent tunes , another good ones and finally some forgettable ones. I don't think this record may sound annoying to anyone's ears but I don't think of it as the most thrilling record you'll find on the site either."
    },
    {
      "reviewer": "Raff",
      "date": "Posted Thursday, March 12, 2009",
      "rating": 3,
      "text": "Camel's highest-rated album was released in 1976, when the original prog movement was already on its way to a slow but steady decline. As often happens in all forms of art, the products of those inevitable stages in the creative cycle have a languid, somehow world-weary quality that many people find very appealing. In fact, their beauty, even perfection in a strictly formal sense (think of the elegantly curving shapes of Art Nouveau artifacts) is often undeniable.Moonmadness is one such product: harmonious, full of softly flowing melodies, devoid of any sharp edges, definitely soothing. The very names of the songs project a peaceful, vaguely New-Age vibe, with all their references to air, water, and the inevitable moon. The music is flawlessly executed, the vocals soft and muted, the tracks blending almost seamlessly into each other. It is the polite face of prog, offering just enough compositional intricacies to keep fans satisfied and avoid accusations of sell-out. However, those listeners who need to have their attention constantly engaged and stimulated will ultimately find this album disappointing, even boring. Moonmadness soothes the ear, but never once does it challenge it in the way prog milestones like Close to the Edge or Larks' Tongues in Aspic can do.Even more so than its predecessor, Mirage, which occasionally featured some slightly more energetic moments, Moonmadness is an orgy of lush keyboards, tasteful guitar licks, and sweetly pastoral flutes (check in particular Air Born). Andy Latimer's vocals sound even flatter than usual, which in a way makes the instrumental tracks stand out - the actual songs are often nothing short of soporific, as is the case of Song Within a Song (greatly enhanced by Richard Sinclair's vocals in the live version featured on A Live Record). It is not a coincidence that the album's highpoint is the 9-minute-plus instrumental Lunar Sea, possibly Camel's finest hour. Initially driven by Doug Ferguson's pulsing bass lines and Andy Ward's measured beat, it slows down in the middle in order to allow Andy Latimer and Peter Bardens ample room to display their skills, then picks up the pace again. Latimer's guitar work is particularly good here - there is no denying that he is a fine guitarist, no matter his vocal shortcomings.The 2002 Decca remastered edition of the album offers a real bonanza for Camel fans. Not only does it feature alternative versions of Another Night and Spirit of the Water, but also three previously unreleased live recordings - respectively Song Within a Song, Lunar Sea, and a tantalising excerpt from the band's third album The Snow Goose, the solemn, majestic Preparation/Dunkirk. None of these versions, however, differ significantly from those already present on the album.Don't get me wrong, in spite of my criticism of the album, I find Moonmadness a thoroughly pleasant listen, and even give it a spin with some frequency. However, as I already stated in my Mirage review, calling it one of the best-ever albums in prog is, at least in my opinion, somewhat of an exaggeration. It is perfectly all right to want to avoid the excesses of the more avant-garde subgenres of prog, and go for music that does not tax the brain (or the ears) too much - and Camel are excellent purveyors of this kind of 'undemanding' prog. On the other hand, I find that a band like PFM does 'beautiful prog' much better than Camel - unfortunately, their not being English undeniably plays against them (and their English-language albums are anything but representative of their better output).Therefore, I will stay with a solid 3-star rating. Good album indeed, but in no way essential. If you bother exploring a little further afield, you might find that there are so many real masterpieces just waiting to be discovered, and even change the way you see prog."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Monday, May 18, 2009",
      "rating": 4,
      "text": "Camel explore very unique territory with each release. This is their fourth album and definitely one of their best featuring some of their most eclectic symphonic prog tracks such as Song Within a Song and Lunar Sea. I had heard these tracks on a compilation and knew I would sooner or later be getting this CD. The album features in the top 40 best prog albums in the Mojo magazine prog special.I was not disappointed. Each track is beautifully, masterfully executed with incredible musical virtuoso playing from each member. Latimer's guitars are perfectly balanced by Ward's drumming and the keyboard talents of Barden's. The keyboardist also trys his vocal talents on Spirit of The Water which is phased out psychedelic beauty. The instrumental sections of each track are the highlights, not taking anything away from the vocal talents of the band who all take turns on this release.Song Within a Song is what it purports to be, a song hidden within another song and it does feature many metrical time changes as is akin to the music of Camel. Air Born is a beautiful sonata style piece that virtually ebbs and flows on the air. This is a similar style to The Snow Goose, the previous album that was purely instrumental.The best track on the album is Lunar Sea, a 9 minute extravaganza, that works as a multi movement suite, in the great classical tradition, but this is symphonic rock. It has become a staple of the Camel live concert and features as a bonus live track, equally as well executed. In fact the bonus features on the Decca remastered CD are a definite drawcard. There are 5 in total - the single version of Another Night, a demo of Spirit Of The Water, and live 1976 versions of Song Within A Song, Lunar Sea and Preparation / Dunkirk. The bonus material clocks in at over 30 minutes! This caps off a great CD release. The best of Camel is right here, make no mistake."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Sunday, September 6, 2009",
      "rating": 4,
      "text": "Moonmadness is a favorite among many of us and so it is for me. However, to praise it with 5 stars seems a bit exaggerated and it's no match for the two preceding albums.The reason is that Camel have adopted a more light and mellow sound that listens away a bit too easily to catch my attention for 40 minutes. I miss the bite and energy that made Mirage so enjoyable. On top of that, the album also features the kind of toy-moog leads that are hard to stomach for me, especially so on Song Within a Song and Chord Change, of which Chord Change almost dives into muzak prog. Too undemanding for a 5 star prog album.However, from Spirit Of The Water onwards the songs are a lot stronger and the laid-back atmosphere starts to work. Spirit Of The Water, Another Night and Airborn are high points of 70's prog and essential. But, since the first half of the album contains too much spoiling moments for me."
    },
    {
      "reviewer": "friso",
      "date": "Posted Tuesday, December 8, 2009",
      "rating": 5,
      "text": "This English symphonic (and stylistically part Canterbury) prog group needs no further. After their already strong debut, the wild and imaginative heavy prog 'Mirage' album and the conceptual & melodic 'Snow Goose' record the band now sets out to perfect their art. With a top notch production and not a single trace of naivety Camel now presents a faultless album full of strong song writing, instrumental parts and imaginative symphonic prog. Though a tad polished, the band does actually rock out quite a bit on 'Chord Change' and 'Another Night'. Opening with the melancholy (and personal favorite) 'Song Within a Song' is an original way to introduce this mature and sensitive Camel album. The short piano ballad 'Spirit of the Water' is a strong moment that would appeal to listeners of that early psychedelic folk as well. 'Air Born' offers a nice spacey and dreamy atmosphere. The longest track, 'Lunar Sea', is of course one of the bands biggest accomplishments; spacey, melodic and full of that amazing guitar of Andy Latimer; by far the best guitarist I ever saw live. Though in a sense perfect, this album could be criticized for being a bit sterile - I found it does open up a lot on a good stereo or headphones. Perhaps not the album that will instantly incite admiration, but it is ultimately among the best mid-seventies prog has to offer."
    },
    {
      "reviewer": "The Quiet One",
      "date": "Posted Monday, January 18, 2010",
      "rating": 5,
      "text": "Camel MadnessWhile I'm not used to reviewing a popular *prog* album giving it the same rating as most reviewers give it, but nevertheless I feel I have to give my own opinion about this album since I see a lot of the non-Camel fans that either consider this their only decent effort or, on the contrary, a weak effort compared to Mirage. Being a big fan of Moonmadness, I understand most of these people's opinions and can't denie many aspects that the album is associated with, yet I love it for what it is.To start with, Moonmadness, but generally Camel overall, were never and will never be considered much of a rockin' Progressive Rock band, if not quite the contrary, a rather melancholic and chilling affair which is quite clear on The Snow Goose. However, with Mirage and, in a lesser extent, their debut showed Camel clearly playing in a pretty heavier way than they're known for, thus prog fans who prefer a more active and instantly memorable Progressive Rock definitely consider any of these two albums their best albums, and by far since The Snow Goose and Moonmadness(their other highly acclaimed albums) tend to delve into the melancholic and jazzier progressive kind of affair, definitely albums that are neither instantly grabbing nor meant to rock out with.Nonetheless, as a big fan of the four aforementioned albums I've always considered Moonmadness to be their musical peak, in both senses, compositionally and instrumentally. While Moonmadness definitely follows the instrumental and melancholic mood of The Snow Goose, Camel expanded from there and added the rock substance that The Snow Goose, while it's not that it lacked in a negative way, but simply didn't have because it didn't need it. This new rock substance however is not used in the way Mirage used it(for a rawer and energetic sound); Moonmadnessfusesthis with the melancholic aspects and as a result they created the perfect, matured, balance between the lovely tranquility of The Snow Goose and the edgier Mirage. The perfect example of this is the outstanding performance on Chord Change which changes drastically from the semi-frenetic jazzy-esque intro with Doug and Andy Ward giving a splendid rhythm, to a totally calm and charming atmosphere with Andy's delightful guitar playing and then leaving the spot for the overlooked, great jazzy keyboardist, Peter Bardens to finish this brilliant soulful passage.Anyways, Lunar Sea and Song Within a Song are also pretty fine examples of the this blend between The Snow Goose's charm and Mirage's more symphonicrockstyle. However, something I've noticed specifically in these two tunes is the jazz-fusion feel which works as a main feature unlike in the three previous albums which served as an additional feature solely. To enter in more details with these two brilliant tracks, Lunar Sea is undoubtly the epitome of Camel in the instrumental side of things: it has a one-of-a-kind spacey atmosphere all through the tune in which the rhythm section settles a very addictive pattern in which at first Andy adds an emotive guitar solo but later on it's the turn of Peter and his mesmerizing synth which takes your mind to a ''lunar sea'', simply gorgeous. After that wonderful experience, Andy reprises but with a more ferocious guitar playing and the rhythm responds the same way. About Song Within a Song, it's a much chilling track full of lush keyboards and some sweet flute work very alike that from The Snow Goose. The few vocals that the song has are drowned with a watery-effect and fits with the song and the album perfectly. The song finishes with a great instrumental passage with Peter's fabulous synth work.The four remaining tracks are a bunch of pretty good tunes which full-fill the album's mood very well. Air Born and Spirit of the Water belong to the gentle, melancholic and dreamy style of The Snow of Goose, very beautiful. Another Night, on the other hand, is Camel playing the rock style of Free Fall again but without the rawness neither the edge of it, still pretty decent with a rockin' organ solo at the end. Finally, Aristilus is a pompous introduction to Moonmadness played solely by Peter Barden's set of keyboards.As you have may noticed, my conclusion is definite: this album is essentially Camel's peak; it has the group's whole heart and soul in it and still there's room for their underrated talents at full shape. Surely not one of the best Prog Rock records ever made, but it's still a very unique masterpiece even when it doesn't feature any innovations or lots of complexity: the same goes for Pink Floyd's masterpieces, though you can add the innovation bit to them."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Sunday, August 29, 2010",
      "rating": 4,
      "text": "Camel's follow-up toMirageand theSnow Goosewas basically an album highlighting the best features of the two. Starting with short instrumental titledAristilus, clearly intended to reminds us of the latter release, followed by a strong reminder of the former album withSong Within A Song!Still, it's not all that simple with this release since we do also get a few hints of the things that are to come in the near future for Camel.Spirit Of The Wateris keyboard-arranged ballad with a distortion effect added to the vocals that, I guess, are suppose to created a watery effect. This new approach is then followed by a song that could almost be considered a straightforward pop tune, luckilyAnother Nightis saved by its instrumental middle section from becoming just that. We would unfortunately hear more of the abuse in the sound-effect department and a steady decline in Camel's songwriting in the next couple of years. But before worrying about all that, let's indulge ourselves in the beautiful conclusion to this excellent release!Since it was impossible for Camel to top their previous releases, the band decided to make a slight change in their direction. Even though this was not entirely apparent onMoonmadness, the decline would be slow but steady over the course of the next few releases. This has of course little to do with my appreciation of this great album well worth it's excellent addition-rating!***** star songs: Aristilus (1:59) Song Within A Song (7:18) Air Born (5:04)**** star songs: Chord Change (6:48) Spirit Of The Water (2:09) Another Night (7:00) Lunar Sea (9:14)"
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Saturday, November 20, 2010",
      "rating": 4,
      "text": "Camel at their BestIn the second tier of classic prog groups sits Camel, a talented group of Englishmen who draw on many of the classic bands of the time. On Moonmadness, the sound has shifted from the Santana of their debut to a distinctively Floydian tone. However, where Pink Floyd were masters of atmosphere and emotion, Camel takes their palette and ups the compositional standard. The instrumental sections are significantly more complex, while vocals take a secondary role. Camel is truly prog where Floyd was a category of its own.Camel's music is always mellow - slightly behind the beat, snoozy moods, long sustains and reverbs. But hidden in this atmosphere is some very impressive single note lines, guitar- keyboard interplay, and tight drumming. Truly musician's musicians, on this album Camel has perhaps created the prototype of classic prog. Songs like \"Chord Changes\" and \"Lunar Sea\" would have a reasonable place in a disc of \"This is Prog.\"I've come back to this album numerous times, and have always been simultaneously impressed with the instrumental parts and flabbergasted at the uselessness of the vocals. Most of the vocals are processed and monotone, not painful but also adding almost nothing to the songs. There's no surprise why the band had chosen to do a completely instrumental album previously.What makes Moonmadness my favorite Camel album is the compositions. Each one maintains identity as a song, has some gem of sound to offer the listener. The melodies are better, avoiding some of the awkwardness of even the band's greatest hit \"Lady Fantasy\" from Mirage. Here the vocal lines act as a layer in small helpings, which is an appropriate use. This was never a band with a great line or hook.This was another hard to rate album. It is perfect for what it is, but also has its inherent flaws. Four stars but highly recommended. If you get only one Camel album, get this one."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Tuesday, November 23, 2010",
      "rating": 4,
      "text": "While Side 2 of the original album is one of those oh-so-rare nearly flawless sides of music, Side 1 rarely drew me back for more. \"Song Wthin a Song\" is pretty--almost too pretty--though the vocals are a weak point. Flutes are pretty but nothing like IAN ANDERSON, THIJS VAN LEER or JOE FARREL. The song structures are so simple and single layered, single melodied. The later CD had a much better version--the 'demo'--of \"Spirit of the Water.\" Also, I never really lliked the Camel drumming style--call it the Michael Giles school of soporific drumming. I'm glad to have heard some of Camel's live recordings to know that there can be a little life in the songs--that the drums don't always hold them back. Still, string together \"Another Night\" (9/10), \"Air Born\" (9/10), and \"Lunar Sea\" (10/10) and you have one helluva twenty minute ride into liquid space!"
    },
    {
      "reviewer": "snobb",
      "date": "Posted Friday, November 26, 2010",
      "rating": 3,
      "text": "With their fourth album Camel turned on US market. What means after quite ambitious Mirage and Snow Goose, they simplified music, made it easier accessible and added more elements of jazz fusion in it.On this album Camel doesn't sound as British art-rock band any more. Long synthesizer's passages and multi layered relaxed guitar sounds over them sound far from sophisticated sound of early albums (some even counted early Camel as Canterbury scene band).They still have some great melodies, musicianship is competent and well balanced, music if a bit too much polished and simplistic still has signature of their early years. Much more spacey, aerial and relaxed, this album's compositions shows their turn to more commercial direction they choose for years to come and what in fact destroys their future just few years later.Possibly best Camel release showing their more commercial side. Far not so good as earlier works though. For real good Camel's music go to Mirage or Snow Goose."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Friday, November 26, 2010",
      "rating": 4,
      "text": "Warm, poignant and moving; this might be the most touching Camel album I've heard, and I'm not a guy known for giving emotion a weighing factor. Somehow, Camel always goes under my own radar and I never really figure out how good they are until I pop in an album and listen. MOONMADNESS really defines symphonic prog well, something that I really can't say about most symphonic prog albums I've heard.Only ''Chord Change'' and ''Lady of the Water'' are clunkers. Even the opening ''Aristillus'' and its ominous march like theme is enough to turn heads and rupture the spine. The emotion and grandeur just pours out ''Song Within a Song'' and ''Air Born'' with some of the best vocals I've heard from Camel. But it's the rocker ''Another Night'' and the frantic synth piece ''Lunar Sea'' that really steal the show offering the full potential of Camel's songwriting abilites as well as the potential of the whole genre.If you're looking for a good experience from a symphonic prog album but without overloading on the bells, whistles and bombastic decorations, MOONMADNESS is for you. Keep a box of tissues handy just in case."
    },
    {
      "reviewer": "octopus-4",
      "date": "Posted Thursday, December 16, 2010",
      "rating": 5,
      "text": "This is very easy to review. It's Camel's masterpiece: the album on which they have finally found their definitive sound, but as it happened with Pink Floyd, their first big international success is also the starting of their troubles and the beginning of a huge number of changes in the lineup. It's unfortunately the last studio album featuring the very prog bassist Doug Ferguson.The short opener \"Aristillus\" is no more than an intro that could have been developed a bit more. The album starts effectively with a great track. \"Song Within A Song\" is a 7 minutes track that contains all the elements of an epic and my favourite track of this album.On \"Chord Change\" we discover for the first time the jazzy side of Camel. This track has unusual signatures on which Latimer plays very cleanly. A taste of the albums to come. Only when it slows down there are reminds of Snow Goose. It features also a great hammond background.\"Spirit Of The Water\" is Pete Bardens' masterpiece in terms of songwriting. Until now Camel weren't famous as lyricists. This two minutes song is a poetry. In two minutes Pete Bardens is able to transmit the feelings that Dave Gilmour has put into the 8 minutes of High Hopes.The side B is opened by \"Another Night\". it's strongly connected to Snow Goose even if it has lyrics. What makes this album a mastepiece is also the fact that it contains elements of both the early Camel and what they were going to become.As Another Night, \"Air Born\" is a fantastic slow song. The vocal effect enhances the voice of Andy Latimer. This song is effectively made of a part with lyrics, in line with Snow Goose and an instrumental part which anticipates the athmospheres of Rain Dances.\"Lunar Sea\" is the epic. It features great solos of both Bardens and Latimer. The odd signature on the jazzy part is strongly sustained by Doug Ferguson's bass and Andy Ward sweats a lot on the drums. Another little masterpiece (little only because it's below 10 minutes). It's technically speaking the best track and an excellent closer.Maximum rating of course."
    },
    {
      "reviewer": "baz91",
      "date": "Posted Friday, April 8, 2011",
      "rating": 4,
      "text": "After the ambitious but largely successful 'The Snow Goose', 'Moonmadness' showed Camel returning to a more conventional prog rock sound. Indeed, this album and 'Mirage' show Camel at their proggiest, whilst 'The Snow Goose' puts the 'symphony' in symphonic rock. However, whilst 'Mirage' sounds more rocky, 'Moonmadness' has a very airy spacey feel to it, largely due to Barden's keyboards. It's good to hear them return to the technical playing heard on the first two albums again.The worst track on the album is unfortunately the opener.Aristillusis one of the most annoying instrumentals you'll ever hear, with squeaky squeaky keyboards and a stupid bouncing riff. Good news is it's only two minutes long.Song Within A Songactually sounds more like two songs stuck together. It's very easily to split this track in half, one part including all the vocals, and the second being the 4 minute instrumental at the end. It is an extremely beautiful song, and the instrumental is spectacular. There are more subtle time signature changes scattered around as well. One of my favourites off the album.Chord Change, likeSix Ate,ArubalubaandEarthriseis another Camel instrumental lying in the six to seven minute range, and it sometimes gets confusing to remember which is which, as they all have similarities. I suppose the major difference withChord Changeis that, whilst the other three end with themes heard near the beginning, this track doesn't recycle used themes but instead evolves as the piece goes on. The beginning of the song is misleadingly energetic, because most of the track is extremely relaxing. The majority of this song is extremely pleasant. However, because none of the themes are reused, this track lacks direction. It also fades out at the end, which seems highly arbitrary for an instrumental track. One wants to ask 'Surely you could have faded out at any point. How come you couldn't finish the song?' Listening to live versions reveals that they didn't really have a very good ending at all. This is my least favourite of the \"Six-minute Camel instrumentals\".Spirit Of The Wateris one of the few songs where I prefer the demo version over the album version. The demo of this track is just Peter Bardens performing this song alone on the piano, and it sounds beautiful. On the album version, there is a slightly annoying flute playing intermittently and the vocals have had special effects done to make them sound watery. In most cases, voice effects are bad, and this is no exception, as it takes away from the acoustic feel of the song. A slight disappointment really.Another Nightis another of my favourites from this album. This might be because it's not airy or spacey at all like the rest of the album, which probably says something about me as a prog fan. This song is similar toNever Let Goin structure: a pop song with a long instrumental and a guitar solo outro. The 'pop song' parts of this song are great! The melody is very catchy and also in 6/8. The instrumental is in some bizarre time signature that I've found impossible to count. The whole song rocks and is extremely enjoyable. For those listening to the bonus tracks, there is also a single version of this song. However this isn't your normal run of the mill shortened single edit. It becomes evident upon listening that the song was completely rerecorded (except maybe the iconic guitar solo at the end) in a shorter format. The middle instrumental sounds really different here. Because of this, the song completely works as a single version, as Camel were able to rewrite it as a short song. Genious!Latimer's flute opens what is undoubtedly the most beautiful track on the album.Air Bornis a soaring peice, with beautiful guitars, keyboards and flute. For the long spacey instrumental, an interesting use of time signatures is made: listening closely shows the instrumental is based around a 4/4 + 5/4 + 4/4 + 4/4 structure.The longest track on the albumLunar Seais an extended prog rock instrumental work out. The track title is a play on words: 'Lunar Sea' sounds like 'lunacy' and hence the connection to the title of the album 'Moonmadness'. Beginning with some very spacey keyboards, this song starts to get exciting after the 1 minute mark. When the band do come in, they are playing in speedy 5/8, so we know this is going to be good. After the 5/8 section there is an epic keyboard solo, lasting around 2 minutes. Following is some stunnnig guitar work, played in 5/8, which might just be Latimer's most impressive guitar solo. All too soon though this track dissolves back into the spacey keyboards heard at the beginning, and finally to the sound of wind (overused prog clich� much?) Definitely one of Camel's better instrumentals.Sadly this was the end of an era for Camel. Following the completion of this album, bassist Doug Ferguson would leave the group, to be replaced by the very famous Richard Sinclair, changing their sound forever. As it stands, this album is a must-have if you've ever liked Camel, but there are a few poor moments. Between the first three albums, Camel did not score a single one-star rating in over 1500 ratings! Unfortunately, they failed to score a home run, as the number of one star ratings is 1% for this album. Shame! Moonmadness is Camel's last truly progressive album, before they took a more commercial route. Housed in a striking gatefold sleeve, this is a wonderful example of progressive rock."
    },
    {
      "reviewer": "colorofmoney91",
      "date": "Posted Monday, April 11, 2011",
      "rating": 4,
      "text": "My breath was taken away the first time I heard Moonmadness from Camel. This is some of the best symphonic progressive rock available and it really does take you on a lunar journey. I've always admired the slight Canterbury sound that Camel has been able to retain while managing to have roots firmly planted in symphonic progressive rock; it really gives their music a unique touch that only they have.\"Aristillus\" is a short, synth heavy intro with a steady beat. I've never found this track to be anything better than a good introduction to the album, which I'm sure is its purpose.\"Song Within a Song\" is the first absolute classic on the album. It starts with a gloomy synth motif that turns psychedelic smooth jazz with a beautiful flute solo. I probably could have preferred this track as an instrumental, but the lyrics here are equally as gloomy as the initial music, and everything picks up pace eventually to reveal some spacey synth melodies.\"Chord Change\" is another classic, but with a swift guitar melody at its inception with fantastic drumming and bass backing it. After some vocal doodling, the pace slows a bit with atmospheric synthetic organ chords and beautiful blues/jazz inspired guitar soloing.\"Spirit of the Water\" is mostly composed of a single beautiful flute melody and watery flute solo. This song is beautiful, definitely, but not much more than a beautiful mediator between the previous song and the next.\"Another Night\" starts out a steady paced rocker with a straight groove and some funk inspired guitar playing. The vocals here fit very nicely and give the track a very epic feel. The music eventually becomes bass dominated while the guitar softly drones and plays fading notes over the top, creating more of the epic atmosphere. The funk-rock riff reappears and we're treated to both organ and guitar solos that mark the end of the song.\"Air Born\" begins with more of the beautiful flute that has been so present on this album, accompanied by some soft piano. Eventually, ethereal synth effects and a beautiful guitar solo fill the soundscape before being dominated by watery vocals and a fantastic bass tone. The rest of this track is mostly an airy guitar solo before more of the vocal sections reappear.\"Lunar Sea\" starts with spacey and watery synth atmosphere before rushing bass and flying guitar lines soar from the mix. The bass line that comes next is very reminiscent of Canterbury scenesters Caravan, and spacey synths solo over the bass. It picks up pace later for a shreddy blues-rock inspired guitar solo before reverting to this track's spacey beginnings.Really, this is a fantastic album and really stands out as one of the best in the Camel catalog. It's mostly symphonic progressive rock, but with strong space-rock and Canterbury scene leanings. The music here is full of moods, often being either playful or incredibly gloomy . I highly recommend this to anyone looking for some of the best symphonic prog available, and I'd say this also has great crossover appeal for Canterbury scene fans."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Wednesday, October 12, 2011",
      "rating": 5,
      "text": "The final album of the original Camel lineup sees vocals making a return, but the band's newly acquired expertise in playing mellow, melodic, calming prog is still in effect, creating an intriguing blend between the song-based approach of Mirage and the tranquil nature of The Snow Goose. Standout songs include the dramatic Another Night and the majestic Song WIthin a Song. All the band members take a turn providing vocals (though in Andy Ward's case this involves making nonsense noises for the background of the opening track), but the album is particularly notable for the development of Andy Latimer's singing style. At points, his vocals kind of remind me of Richard Sinclair, making the imminent entry of Sinclair into the Camel lineup make a strange sort of sense."
    },
    {
      "reviewer": "Second Life Syndrome",
      "date": "Posted Friday, July 5, 2013",
      "rating": 5,
      "text": "Love love love this album! As the first Camel album I'd heard, I was surprised by the sound. I'm not sure what I was expecting (maybe a Yes clone?), but what I got was spectacular synth- driven prog with some gentle vocals, wonderful flutes, and maybe some space rock influence, too.Right off the bat, I was wowed by the short \"Aristillus\" with its spacey vibe, and I was continually impressed with \"Spirit of the Water\", \"Another Night\" and \"Lunar Sea\". This music is right up my alley, and now I can see the influence of this band in newer neo-prog bands such as Hidden Lands and Oblivion Sun (both are worth the time). The playful, spacey synth elates my nervous system every time Peter Bardens goes off on another solo. I'm really looking forward to checking out the rest of their discography."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Friday, June 13, 2014",
      "rating": 4,
      "text": "Camel followed up \"The Snow Goose\", a wordless album that finally elevated them into prog greatness, with this, the album that cemented their place in the 70's prog annals.On the positive side, Camel at this time had completely eschewed the psychedelic jamming that made the first two albums sound like they were recorded almost ten years before their release, and replaced that with more discernible prog compositions, the type that defined the classic mid-70s prog heyday. Musically, they blend a Canterbury-like jazz rock style with more symphonic passages, evoking at times lighter King Crimson, Genesis, and a bit of Pink Floyd.What holds them back is a tendency to keep songs too light, and often reverting to this lightness after first revealing strong musical themes. Admittedly, however, this quality is what makes me enjoy this album as background music when having guests at an evening patio party.Standout tracks areChord Change, which has some dual guitar tracks that remind me of some of the classic Allman Brothers hits, before it changes lanes into some fine solo backgrounds, andLunar Sea, which just might be the best song Camel ever recorded.Another solid four star album."
    },
    {
      "reviewer": "apps79",
      "date": "Posted Saturday, September 13, 2014",
      "rating": 4,
      "text": "By mid-70's Camel were reaching their peak in terms of popularity.The band was voted as ''The Brightest Hope'' in a Melody Maker poll, followed by a monumental presentation of ''The Snow Goose'' in October 75' at the Royal Albert Hall in London, with the London Symphony Orchestra.Next album finds the band collaborating with producer Rhett Davis at the Basing Street Studios in London.''Moonmadness'' was somewhat of a concept album, where individual tracks refered to the individual band members with the lyrics becoming again part of Camel's music structures.It was released in 1976 on Decca.With each new album Camel were getting closer and closer to a jazzier sound and ''Moonmadness'' was no exception with the band flirting more than ever with the Canterbury sound.Soundwise this was definitely one of the most, if not the most, energetic albums produced by the classic line-up of Latimer/Ward/Bardens/Ferguson.With a deep sense for melodic interplays and more complex instrumentals Camel fused elements of Classical, Canterbury Fusion and Jazz in equal doses to deliver a fantastic work, filled with tremendous keyboard parts, genuine guitar moves and some impressive solos on keyboards and guitars, supported by the flawless rhythm section.As a result the music can become very rich at moments with furious battles between organ and guitar, while a number of breaks lead to more mellow themes with a slight psychedelic touch of the past.The symphonic elements are still present (melodic flute parts, atmospheric synths and sentimental guitar lines), albeit more refined and discreet, and the increase of jazzy rhythms and loose soloing (via the Canterbury-styled keyboards and electric piano) eventually offers a unique combination between smooth arrangements and dense instrumental activity, while the addition of vocals is rather preferable compared to the previous album due the emotional voices of Latimer and Ferguson.However the album is mostly instrumental and the band's inspiration is absolutely fantastic at this point of career with some of the best music ideas they ever recorded.A classic of the mid-70's.Pronounced synthesizers, unique guitar touches and old-styled keyboards complete a work, where Rock, Classical and Jazz Music meet in a fascinating way.Not much more to add, this is at least a highly recommended album from the endless British Prog scene."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Wednesday, July 22, 2015",
      "rating": 5,
      "text": "Review N� 3Camel was my second love after Genesis. In 1975, when I was born to the progressive rock music, the first vinyl record purchased by me was \"Selling England By The Pound\" of Genesis and the second was \"The Snow Goose\" of Camel. Even today, Camel and Genesis are the two bands from the 70's, which I listen to with more pleasure.Although I love \"Mirage\" very much, my favourite studio album of Camel is and always was \"Moonmadness\" followed by \"The Snow Goose\". These two albums have the participation of the two best composers of the band, which are Andrew Latimer and Peter Bardens. In my humble opinion, \"Moonmadness\" is the last great studio album from the band with the participation of Bardens as band member. It belongs and closes what is usually known by their classic line up and their classic era, which is for me, their best.The line up on the album is Andrew Latimer (lead vocals, flute and guitars), Peter Bardens (vocals and keyboards), Andy Ward (vocals, drums and percussion) and Doug Ferguson (vocals and bass).\"Moonmadness\" is their fourth studio album and for many represents the highest point of the musical career of the group. The album was released in 1976 and was also the last album to feature their original line up. Their bassist Ferguson left the group and Richard Sinclair, ex-Caravan, replaced him on their next fifth studio album \"Rain Dances\", released in 1977. Mel Collins (saxophone and flute), increased the band to five members, for the subsequent tour, beginning an eight years association with the group as a band member or guest.The concept album \"Moonmadness\" has seven tracks. The first track \"Aristillus\" written by Latimer is the smallest track on the album and is an instrumental piece that serves to open the album. It's an atmospheric song, very melodic and is dominated by keyboards. It represents an excellent mood to the rest of the album. The second track \"Song Within A Song\" written by Latimer and Bardens is a very calm, beautiful, and melancholic song which contrasts with the deepest voice of Ferguson. It's an excellent song with a nice and relaxing guitar and flute works. This is a typical Camel's song. The third track \"Chord Change\" written by Latimer and Bardens is one of the tracks chosen by the band to define the personality of each member. This is the song about Bardens. It's an instrumental track that explores magnificently the Latimer's guitar fills and Bardens' keyboard work. This is a very well constructed song with some jazzy touch. The fourth track \"Spirit Of The Water\" written by Bardens is another short track with a very beautiful piano work complemented by a distant vocal singing. It's an atmospheric ballad, very pretty, and built around piano and synthesizer with Bardens' distant voice adding a very special feel to it. The fifth track \"Another Night\" written by Camel is the song about the personality of Fergusson. In my humble opinion, this is the rockiest song on the album with its great riffs and the strong Latimer's vocal work. This is the most aggressive track on the album, but still it keeps the usual, special and very unique Camel's charm. The sixth track \"Air Born\" written by Latimer and Bardens represents Andrew's track and is, for me, one of the most memorable songs ever from the band. The track begins with flute and piano, in a classic style, and suddenly explodes with all instruments and the Latimer's voice. Musically, this is an excellent and very well developed song. The seventh track \"Lunar Sea\" written by Latimer and Bardens is another instrumental track this time about Ward. It's the lengthiest track on the album and represents, in my humble opinion, one of the best tracks on the album. It's a song with great individual and collective musical performances. The melody of the song changes and evolves all over the theme. It reminds me something spatial, as its name suggests.Conclusion: After their more experimental and audacious work, their previous studio album \"The Snow Goose\", the music on \"Moonmadness\" is more akin to the more traditional English progressive rock scene. The music we can found on it is something between space and symphonic rock. It has a very homogeneous musical quality with a dreamy space ambient and a very peaceful musical atmosphere. Sincerely, if you don't know yet this album, you must listen to it. After all these years, it remains an album very fresh, cool and nothing dated. However, with \"Moonmadness\" the band's English audience declined, but in USA it reached number 118, the highest chart position that the group ever attained in that country. It's a real must have this album. It sounds cool soon of its first listen, but it grows more and more each time you listen to it. So, I recommend it to everyone who likes melodic progressive rock music. It's recommended to symphonic and psychedelic/space rock fans, particularly to Pink Floyd fans, and it's also recommended to Opeth's fans.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "Magnum Vaeltaja",
      "date": "Posted Saturday, October 3, 2015",
      "rating": 3,
      "text": "\"Moonmadness\", Camel's fourth studio album, shows the band continuing to develop the sound that they had introduced on \"The Snow Goose\". Like \"Snow Goose\", this release shows Camel's signature mellow symphonic style in full bloom. For some, this meant the peak of their discography, but it's kind of left me a little disappointed. With their debut and their studio masterpiece \"Mirage\", Camel was a truly unique beast in prog. A sort of Canterbury/symphonic crossover, with light jazz touches and an occasional psychedelic flair. By \"Moonmadness\", though, the stripped-back symphonic purity of their music moved them from the realm of progressive innovators to nondescript easy listening.Perhaps that's being a little hard, though. Even though \"Moonmadness\" is less distinguished, this period in Camel's discography did still retain its own special charm. And don't get me started on the melodies; they're absolutely splendid on here. Indeed, if lush symphonic ballads are your thing, there are a handful of them here that should satisfy your cravings. \"Song Within A Song\" and \"Air Born\" are both Andrew Latimer flute showcases, with all sorts of Bardens synth splurges to tug at the heartstrings a little. The album has two true highlights, though. The spacey instrumental \"Lunar Sea\" offers solos galore and is something of a fan favourite. My personal favourite, however, has always been \"Chord Change\", perhaps the strongest instrumental in the Camel catalogue. It opens with a fast, playful pace that soon slows down and changes tone (hence the name?) into a stirring instrumental ballad. Andrew Latimer's guitar playing is absolutely stunning on this track, with his aching string bends and soulful runs. It's a real must-hear for fans of beautiful electric guitar music.Wonderful as the album can get, though, the music tends to be quite tired sounding. I suppose that that's always a risk that artists take when trying to achieve a softer sound, but \"Moonmadness\" often slips below the ideal balance of mellow and energetic. Consequently, I tend to prefer a lot of the bands who have moulded their sound off of this album (e.g. Asia Minor, Sanhedrin) than the original. \"Moonmadness\" still has its place, of course. It serves as a fine starting point for those new to prog in general (it was certainly one of my first prog loves), and of course Camel fans should find plenty to love throughout. I also find it to be an ideal album to listen to on still winter nights. With all things considered, this is a good symphonic release that wouldn't be out of place in any prog fan's record collection. 3 stars."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Friday, December 8, 2017",
      "rating": 4,
      "text": "Moonmadnessis a tough one for me. On one hand, the dreamy and pastoral symphonic vibe feels prosaic and at times even bland; on the other, the band blends in moments of upbeat energy and lush beauty. It's a mixed bag, which I don't feel deserves the 50+% 5-star rating it has here on the Archives. As of this writing, I've listened to the record 20 times, and am still wondering where the \"masterpiece\" label is coming from. With that being said,Moonmadnessis still quite good. Let's dig in.Overall this album blends approachable symphonic prog with a delightful rock energy. At it's heaviest, Camel is still somewhat wimpy rock, but that's not a problem here. ForMoonmadness, it's all about the vibe, which is quite enjoyable. We're given mostly instrumental works with good variety. If you like dreamy flutes and lush keyboards--you're covered. If you like excellent instrumental chops and a jazzy undertone--you're good. If you like the occasional up-swell of guitar rockin'--don't fret. Basically, this album has something for everyone ... with one notable exception: the vocals. Ferguson's vocals here are not good. They sound processed and pushed into the background, maybe in an attempt to mask their unenergetic feel. Lyrically what few moments of singing are fine, sort of simple but evocative. Bottom-line here is that you won't be touched or inspired by vocals, but by the atmosphere.Musically the songs are deft and played quite well. Keyboard standouts by Bardens deserve attention, while the rhythm section of Freguson and Ward sound great. Camel's instrumental proficiency really can't be balked, which is maybe what pushes this album into 4-star territory for me. It's hard to pick a standout, because the songs flow nicely and each have a lot of twists and turns packed into each.If you're in the mood for thoughtful, meditative prog-rock that sort of unfolds as you listenMoonmadnessis right up your alley. It's not a masterpiece in my opinion, and may leave some listeners feeling like they just took a dose of ambien, but most fans of classic prog will be ready for another hit.Songwriting: 4 - Instrumental Performances: 4 - Lyrics/Vocals: 2 - Style/Emotion/Replay: 3"
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Monday, April 6, 2020",
      "rating": 4,
      "text": "Fourth album by Camel's. After the half misstep of the instrumental Snow Goose, Camel return to alternate instrumental songs with sung songs, and churn out their most epic album.1. Aristillus (1:59) is a very sustained and electronic short intro, which however is not developed, and gives way to the first real song, Song Within a Song (7:18) . The sequence does not flow well, the song in turn has a sustained intro which then becomes pastoral with Latimer's flute to weave the best music, while the choir voices seem distant, weak, listless. The song proceeds alternating between very soft pieces and more sustained pieces, then around three minutes, with a typical change of rhythm prog the guitar intervenes to liven up the song and a long instrumental piece starts, with an emphatic Bardens' solo too repetitive. But overall it is not entirely successful. Rating 7,5.3. Chord Change (6:48) is an instrumental piece Guided by the guitar but with great play of percussion, perhaps too intrusive. The Camels aim at the saturation of the sound and the continuous digression on the theme, which arrives around two minutes, with a stretched piece always guided by the guitars, which risks becoming monotonous, routine stuff, then the keyboards of Bardens arrive luckily towards the 5 and a half minutes the piece comes alive and returns rhythm. But we are close to the exercises of style, to the ramblings on ramblings, without having the fantasy of jazz that makes every second different. Rating 7+4. Spirit of the Water (2:09). melodic song with piano and voice (Bardens) treated with echoes. Flute in evidence. Short but pretty, more melodically inspired than the previous two. Rating 7,5/8.Good but Not so great A-side.End of A-side Side B opens with Another Night (7:00) Beginning syncopated, blues, then again the distant, not very incisive choruses. The vocal part is the weak point of the LP. Then an instrumental part starts where Ferguson's bass shows off virtuosity. In the finale the chorus voices return. Evocative, dreamy song. Rating 7.5 / 8. Final with Latimer guitar's solo. Rating 7,5/86. Air Born (5:04). Beginning with a good melody played by the flute, then start an electric ballad. Treated voice, electronic effects, ambient music. Then come back the choirs. Good ending, succesfull song. Rating 8.7. Lunar Sea (9:14). Slow, lunar beginning (precisely) marked by the keyboards and some sound effects, then the mighty rhythmic section arrives towards the minute and a half, and we witness a flashy piece with the bass (Ferguson) that makes virtuosity, then after a minute the lunar plane returns with the keyboards by Bardens. At about 5 minutes Latimer's guitar takes the place of the keyboards and shows off a solo at a fast pace, with the rhythmic section playing jazzy below. Here there is very little lunar, we are very bombastic, a lot of emphasis, and meanwhile Bardens does the numbers with sound effects, sonic violence fades and the lunar keyboards of the beginning remain. Good piece, always very descriptive rather than narrative, in their style, but ends the album with good style. Rating 8+.Camel produce an album similar to Mirage but with more instrumental parts, and more determination. They are always halfway between symphonic prog and the Canterbury scene, they offer liquid, descriptive music, with many changes of rhythm and atmospheres but always soft, without causing strong emotions, without any violence, at most a few small neuroses. I see them as excellent prog craftsmen but I feel that the genius, the pathos, the creative fury, the passion are missing.Rating album: 8+. They reach four stars."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Sunday, August 20, 2023",
      "rating": 4,
      "text": "After the excellent \"The Snow Goose\", which allowed Camel to finally have a greater appreciation and general recognition, the British band maintains a superlative level with \"Moonmadness\", their fourth album. Without being a conceptual work like that of the famous goose, the album maintains a coherence and sense of unity despite the fact that not all the tracks have a common storyline, relying on sung passages to reinforce the instrumental developments.With atmospheres generally vaporous and detached from the ground, from the lunar and marching \"Aristillus\", where Peter Bardens is the protagonist with his cosmic sounds courtesy of the synthesizers, \"Moonmadness\" opts for sculpting relaxed landscapes and transcendent connections, like the sensorial \"Song Within a Song\", the hypnotic \"Spirit of the Water\" and the aquatic voices of Bardens, or the restful \"Air Born\" and Latimer's flute sweetening its lysergic becoming.And just as at the beginning of the album, \"Moonmadness\" concludes amidst spacey sonorities with the mysterious \"Lunar Sea\", drawn from Bardens' keyboards and Latimer's lively guitars in jazz mode, both musicians determined to move away from earthly limits, correctly backed by Doug Ferguson's persistent bass and Andy Ward's incisive drums.Most valuable of the 2002 and 2009 remastered editions is the 1976 London concert, with very good sound, where the band demonstrates all their instrumental mastery and, on the other hand, that the vocal part was not their strongest point.After \"Moonmadness\", disagreements over the musical direction the band should take led to Ferguson's departure, thus culminating Camel's most recognisable and glorious period.4/4,5 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album961b.html",
  "last_parsed": "2025-05-18T12:56:08.878639"
}