{
  "album_title": "BITCHES BREW",
  "artist_name": "Miles Davis",
  "artist_page_link_local": "artist93ee.html?id=3906",
  "year": 1970,
  "rating_value": 4.27,
  "rating_count": null,
  "review_count": null,
  "genre": "Jazz Rock/Fusion",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/3906/cover_7221312112010.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Pharaoh's Dance",
      "duration": "20:06",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Bitches Brew (Listen To This)",
      "duration": "27:00",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Spanish Key",
      "duration": "17:34",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "John McLaughlin",
      "duration": "4:26",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Miles Runs the Voodoo Down",
      "duration": "14:04",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Sanctuary",
      "duration": "11:01",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Feio",
      "duration": "11:51",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Friday, August 15, 2008",
      "rating": 5,
      "text": "Directions In Music or Music In Directions??On the heels of ISAW, Bitches' Brew extended the electric formula, and slapped the jazz world, starting with the stunningly beautiful artwork gracing the gatefold (courtesy of Klarwein, also responsible for Santana's Abraxas) of this double album. BB also receiving the subtle subtitle \"Directions In Music By Miles Davis\", which I find is an honest description, only a little vague. With BB, Miles even throws away the idea of a \"line-up\" per se, since we seem under the era of everybody plays with everybody and whoever is missing, too bad. Actually it sounds chaotic, but it's not: Miles' strongest point was to assemble musicians and loosely direct them, but leaving them a great freedom, accepting their input, probably not always giving the writing credits where due (Zawinul and Shorter getting the nod here). Among the missing is Hancock (Off to Fat Albert Rotunda and latter Mwabdishi), Tony Williams (off to, his own group Lifetime) and Ron Carter. Newcomers to Miles' realm are Larry Young (from TWL), Benny Maupin (future Hancock sideman and nothing to do with Elton John), Harvey Brooks, Jack DeJohmette (future Abercrombie &Jarrett), Lenny White (future RTF with CC) and a few more in Billy Cobham and Airto Moreira. With BB, Miles returns to a bit longer albums as both discs well over the 45-mins tiling, somewhat far more than the unusual IASW.Although the album will be released in April 70 (creating a real shock, not just electrically or artwork-wise, but Miles' brutal playing), this album had been recorded in just three days in august of the previous years (so six months before its release), and Miles once called this session \"a living composition\".. The BB Complete sessions will show there was a warm up the day before recording, but that's it. So in most of the tracks, Miles' cohorts include at least two drummers (one in each channel) two bassist s (but only one is electric) and two keyboardists. Just six tracks over four vinyl sides is again very much keeping with the times, where such amounts were sign of quality and developed \"songwriting\". Right from the first few notes, the album will let you know that you're in for a fascinating ride if you want to follow the master of ceremony, Miles himself. And there is no better starts to a Miles album than with the vibrant Pharoah's Dance. One of the thing that strikes is the lo-register wind instrument, Benny Maupin's bass clarinet, which will give throughout the whole double album so much of its distinctive sound. The 27- mins title track fills the flipside, much of which is an hypnotic trance, and Miles' eructions through his horn can appear brutal compared to just a few months before in FDK.The second disc starts on the incredible Spanish Key, a track where Miles shows again his fascination for the Hispanic world, although, we're far from Sketches here. Particularly impressive is Maupin's drones done by his wind instrument, here the bass clarinet.. This is Maupin's sole contribution to Miles' classic fusion era, as he will move into Herbie Hancock's Mwandishi era group. The album's third side is closed by a shorter Davis-penned Homage to J McL., where you'll guess, McL gives an excellent bout of guitar and shines brighter than the sun. The fourth side of the album starts with Miles Runs The Voodoo Down, which is a bit contrary to the album's artwork (where it looks like he's running it, period!!) and with Maupin again contributing with the bass clarinet underlining the soloists (Miles mainly here), this track smokes and is somewhat reminiscent of the previous album, IASW...The much quieter Sanctuary closes one hell of an albumThe now-previous remastered version boasts one bonus track, the 12-mins Feio, a tracks that's also available on the BB Complete Sessions boxset. This track This track is right in the line of Sanctuary, remaining calm and low key, butt it's got a bit of a menacing mood to it, from the sinister lines of wind instruments or electric guitar, but also a bunch of creaking noises, evoking probably the wooden masts on ships travelling between continents, and also dogs, probably used to catch the runaways freedom seekers. Anyway, as you'll guess over the course of this double album, there are some inevitable lengths, but nothing bothersome, drums solos are avoided as are most unaccompanied solo from any instruments. How can one not give the maximum rating for such an influential album, even if it is not flawless.Mmmmmmhhh!!! In 2010, a new Legacy version appeared of this legendary album, featuring different bonus tracks (four with only two alternate takes, the other two seemingly from the Big Fun sessions), but Feto is gone and even more important a Live In Copenhagen DVD 1969 (this was circulating as boot for years, but it's now legit and in prime quality, both image and sound wise. Holland, Corea, DeJohnette, Shorter and Miles are in a fairly dissonant mood (for that time), more so than Live Evil but nothing close to Black Beauty or Fillmore, but we're closer to Brew (three tracks from that album but jazzier) than in Silent Way, even if the only electric instrument used that night is Corea's Rhodes. Miles had also spray-painted (I think) his trumpet red to appear more psychedelic and match his very trendy shirt. This 3-disc slipcase-less digipak affair suffers from a few flaws, the discoloured original artwork (incomplete on the outside cardboard cover too), and a badly calculated (and too tick) width that makes it bend on its rear-side. Of course de DVD is indispensable to Miles buffs, but I preferred the previous package with its slipcase, especially so that the new (colour) booklet is not any more complete, just adapted."
    },
    {
      "reviewer": "Easy Money",
      "date": "Posted Saturday, August 16, 2008",
      "rating": 4,
      "text": "Here it is, that odd bastard child of Ornette Coleman and The Grateful Dead that ended up being called Bitches Brew. Whereas jazzers like Coltrane and Albert Ayler, and rockers like The Cream and Hendrix took an aggressive approach to improvisation, Ornette and the Dead were more relaxed in a rural sort of way. This album, with it's meandering interacting semi-solos has a strong resemblance to a Dead live concert, but with the freer jazz approach of Ornette.It's no mystery why this album is more popular than some of Miles' more focused and better composed albums such as Get Up With It, Agharta and Big Fun, from the beginning this album was all about promotion and making big bucks for Columbia records. A lot of older jazz musicians hated this album before they even heard it because they saw all the 'rock star' hype that it received. Subsequently, the older jazzers still see almost all jazz fusion as an attempt to cash in, and often for good reason.Despite the lack of composition and direction, the music on here is interesting because all the performers involved are so talented and great at interacting with one another. Corea and McLaughlin in particular are the glue that keeps this wandering jam on track. Another star is Bennie Maupin and his subtle, almost humorous contributions on bass clarinet, often sounding like that annoying friend who hums along with records at a volume that is barely audible.Although Miles would later do full-blown hard rock music, the music on here is still closer to jazz, with the bass (basses) mixed low in volume and the drum beats often vague and abstract. Although brilliant in places, some of this music has not aged well. The song Sanctuary in particular seems overwrought in it's slow buildup to Miles' blasting trumpet notes. Also, other songs on here seem to meander forever, we certainly had a lot more patience and time on our hands back in the early 70s.The songs that have aged best are Miles Runs the Voodoo Down, with it's relaxed semi-funk groove that foreshadows much of Miles' music in the mid-70s, and the song John McLaughlin, which hints at the weird futuristic African grooves on Get Up With It and On the Corner. Thanks to the contributions of the ultra- talented performers on this record, Miles' large group improv experiment 'lucked out' and he came up with a pretty good record, but stick around, within a year or two much better things would be on the way."
    },
    {
      "reviewer": "Chris S",
      "date": "Posted Sunday, August 31, 2008",
      "rating": 5,
      "text": "Is this the definitive Miles Davis progressive release? You would have to think so however for this reviewer knowlege regarding Davis's latter day career is sketchy at best so not qualified to speak on those albums. Bitches Brew has all the makings of a gnashing, snarling improvisation of electric free form jazz fusion and it does this very effectively. From the opening and dark Pharoah's Dance and the self titled tracks to my peronal favourite Miles Runs The Voodoo Down which is sheer mesmerizing, one wonders how influential this album was on so many great progressive or jazz releases. There are many I am sure. When listening to this epic album it always makes we wonder why Jimi Hendrix has not made it to the PA site yet, anyway that prompts a different discussion. Great musicianship throughout makes for an excellent album worthy of entry up there with some of the best amongst progressive music musical output. Both internally and externally this album is a work of art."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Tuesday, January 20, 2009",
      "rating": 5,
      "text": "\"On August 19,1969, the day after Jimi Hendrix's sunrise set concluded the now-legendary Woodstock Music and Art Fair, Miles Davis began recording Bitches Brew...\" These words are on the back of my \"Bitches Brew\" cd. I have this picture in my head, like a photo of my only memory from 1969, of this girl who I liked, driving by my house in the summer, smiling and waving at me from the passenger seat of her dad's mustang. I was 8 years old and that event made my summer. Haha. You could call this double album the crazy, adventerous, over-the-top brother of \"In A Silent Way\". You can tell they are brothers, there are similarities, but while the older brother is the quiet one, the younger one is at times out of his mind. So yeah \"Bitches Brew\" turned as many people \"off\" as it did \"on\", but the fact is you can't ignore it, it won't let you. I love all the information and interviews in the liner notes. I like when Zawinul talks about hanging with Miles and going to watch fights (boxing) and how they rarely talked about music. They just did what friends do.Disc one features two side long suites. First up is Zawinul's \"Pharoah's Dance\" which starts of in a fairly laid back way reminding me of \"In A Silent Way\". It's slowly building though with all these beautiful sounds filling the air. Joe Zawinul, Larry Young and Chick Corea are all on electric piano while Lenny White and Jack DeJohnette are on the drum kits. Shorter on sax, Davis on trumpet, McLaughlin on guitar, Holland on bass, Brooks electric bass, Maupin on bass clarinet, Alias on shaker and Riley on cogas.This same lineup played on the first track of the second disc \"Spanish Key\". Back to \"Pharoah's Dance\" where before the 4 minute mark the trumpet starts to lead the way and congas comes in. Amazing section. It then settles before 8 minutes and changes as piano comes more to the fore. Trumpet's back leading less than a minute later. Great sound ! It's intense 12 1/2 minutes in as sax and trumpet blast away. McLaughlin comes in around 13 minutes and makes some beautiful noise with his guitar. So impressive. Piano gradually takes over until a calm before 15 1/2 minutes.Trumpet and sax start to dominate before 17 minutes until it settles 18 1/2 minutes in to the end. \"Bitches Brew\" has the same lineup as the first track except Larry Young isn't on it. Outbursts of sound come and go including the trumpet which sounds very cool. Bass clarinet after 3 minutes as the song settles and piano and light drums come in as it builds. This is groovy man. Miles comes in at 4 minutes and starts blasting away. Check out the drumming 5 1/2 minutes in. It settles a minute later as McLaughlin comes in.This is tripin' music. The piano sounds so good. Miles is back 9 minutes in and he gets intense 2 minutes later. Love all the intricate sounds and band interplay here. It settles before 13 minutes. Drums and piano start to lead the way. There's that trumpet from the intro back 16 minutes in. Settles again 17 1/2 minutes in to a beautiful soundscape.The trumpet is back 19 1/2 minutes in as it starts to get intense again. It calms right down 22 minutes in and starts to build again. Another calm 24 minutes in before we get those trumpet blasts a minute later like earlier in the song.That's how it ends. Nice.Disc two begins with \"Spanish Key\" which starts with a good beat and bass clarinet as trumpet comes in. Shorter and Davis duel it out. Tasteful guitar before 4 minutes. Great sound a minute later. So much going on here. Intense sound before 8 minutes until it settles with guitar and paino before 10 1/2 minutes. The trumpet is back. A fuller sound after 14 minutes especially the drums and piano. It settles down a minute later and bass clarinet returns. \"John McLaughlin\" opens with drums, piano and guitar standing out. Love McLaughlin's style here. This is so intricate and amazing. Drums are impressive as well. The bass clarinet adds some depth too. \"Miles Runs The Voodoo Down\" has Alias replacing White on the drums. Some funk on this tune.Trumpet starts to lead the way before 2 minutes. Guitar before 4 1/2 minutes as the trumpet stops. Nice bass too. Great sound here. Sax takes the lead and then the piano becomes prominant. The trumpet is back late and blasting away before 12 1/2 minutes. \"Sanctuary\" is where it gets pretty chaotic as they contrast those laid back sounds with the intense outbursts throughout. Fantastic song !This is not only an influential recording but one that I also really enjoy from start to finish."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Wednesday, February 4, 2009",
      "rating": 2,
      "text": "I'll stick my neck out here and say that, unless one considers themself ajazz-guy(or girl)-- there simply isn't much to get excited here with Bitches Brew; it leans heavily on the jazz side of fusion, and delves deeply into creative space too etheric and ambitious to be much use to someone not already a fan of experimental jazz.Here we're presented with 20+ minute jams that sound very improvised, which is the point (it's jazz!). However, for those coming from the rock sphere, this sounds conspicuously directionless, gutless, and boring. The two principle pieces are very atmospheric and best suited to background music during other mental activity-- if actively listening, people like me would simply be bored to the point of restlessness.For fusion fans listening for McLaughlin or Corea (from the much more rock-oriented Mahavishnu Orchestra and Return to Forever), prepare to be very disappointed. This is Miles' album, and from what I hear its one of his best... if you're into that kind of thing.Songwriting: 2 Instrumental Performances: 3 Lyrics/Vocals: NA Style/Emotion/Replay: 2"
    },
    {
      "reviewer": "The Truth",
      "date": "Posted Monday, July 13, 2009",
      "rating": 5,
      "text": "This is the album that got me started into becoming a fan of jazz fusion, a genre that before had never impressed me. This album made me see things I had never seen before in music, such as the dominance of the trumpet. Before I had heard music with trumpet as the backing instrument but never the lead. I was impressed by his ability to play but, I guess I should've because he has been compared to Louis Armstrong on more than one occasion. John McLaughlins guitar playing is some of the best I've ever heard, he is undoubtedly the best fusion guitarist ever IMO, and this shows on his guitar solo track, rightfully named John McLaughlin. Tracks to listen to are the title track (great stuff just plain good music), Miles Runs the VooDoo Down, and if you have the bonus track version, Feio."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Friday, October 23, 2009",
      "rating": 4,
      "text": "Logical continuation of IN A SILENT WAY, but taking it a bridge too far. Still, I didn't get this album for the longest time writing BITCHES BREW off as a slight mess of overlong jams. I still say the length of the tracks is the weak spot of BITCHES BREW, but the additions to the lineup and the noticeably different sound are strong suits.IN A SILENT WAY is more atmospheric in approach and had more textural goodies; this is more aligned with funky grooves, experimental structures and slight rock leaning (this is hard to hear). The title track is one of the more avant-garde fusion pieces out there; it fiddles with a few dissonant chords before settling into a long groovy pattern. This takes time to get acquainted with, especially those not into jazz or avant-garde pieces.The more vibrant pieces are the opening ''Pharoah's Dance'', ''Miles Runs the Voodoo Down'', ''Spanish Key'' and the short ''John McLaughlin''; each piece has its own little groove that can take you away if you let it. They give the album character and the musicians involved really showcase their talents without overdoing it.One part of me enjoying BITCHES BREW is the acquisition of woodwind player Bennie Maupin, later a member of Herbie Hancock's entourage. His bass clarinet lines are the most soothing things I've ever heard, easily the instrumental highlights of the album. McLaughlin is also more noticeable in the sound, especially in the tune named after him.This is a rough album to get into because of the track lengths, the structures and the pretty busy lineup. Comparable to Soft Machine's THIRD album; hard to crack open, rewarding when that happens."
    },
    {
      "reviewer": "Kazuhiro",
      "date": "Posted Sunday, November 15, 2009",
      "rating": 4,
      "text": "The opinion and the research will have various parts when talking about the content of this album. As for the flow, if the age was considered when Jazz approached Rock and it united, I will have felt a different part at that time. Miles Davis that created music would be an interest and, of course, be proof to the act of doing to make the element received to the antenna that the part and oneself from whom limited had been calculated were putting an embodiment and the music that derived naturally.Mode Jazz that oneself is taken the lead and advocated repeats dismantlement and restructuring with own hand. Help of the musicians who were necessary to actually create music of course might have been given, too. However, it was an act that became a nucleus the music along in the age that Miles Davis caught to the end and was done.It announced in 1968 \"Miles in the Sky\". And, \"In a Silent Way\" announced in 1969 is [wa] [ndei] [su] and [**] as for order new for the music that oneself advocated. The opinion of the approval or disapproval is also true in recent rapid [no] possession. critics in the contrary ..the flow that revolutionized Miles Davis is natural..There was an opinion made for Miles Davis to have destroyed the item of Jazz completely, too. However, the creation of aimed Miles Davis would exactly be an act and be a creation of nature in the flow of various music that Jazz/Fusion faced in the 70's in the history and the 60's recently. It might not be able to be said indiscriminately whether the history of Jazz Rock and Fusion greatly faced the time of the revolution on the boundary of this album. However, the work in this age will be able surely to be enumerated as establishment of Jazz Rock/Fusion if the directionality of the aimed music of Miles Davis at that time is extracted and it says.The creation of Miles Davis that attempted the differentiation with the musician who performed Jazz with the element of Funk might certainly have been different existence at that time. However, the instinct and order might have been included in the music character of man who had them listen in the first half from the latter half of the 60's to the 70's. In Jazz after John Coltrane departs this world in 1967, it might be also true that there was the future of Jazz that doesn't adhere the forecast. The revolution was rapidly accomplished as music since Coltrane in the future when Jazz had to face it. And, it would have been one purpose in the road for which Miles Davis had to head to take Rock, Funk, and various elements to Jazz that oneself had been advocating. Shape of Jazz since John Coltrane. And, the existence of Jimi Hendrix and Sly&The Family Stone might surely have stimulated the antenna of Miles Davis for Miles Davis. The music at which Miles Davis should aim has been decided. He by the attainment might have been reflecting the counterplan in this album since the latter half of the 60's and. And, a recent work's influencing music and having pulled it are also true.It multiplied on August 19th - August 21st of 1969 and this album was recorded in the studio in New York. And, it is announced in April, 1970. It might have had the part where the method such as giving work to increase the organization of musical instruments and to distribute the channel of an individual performance for the recording was novel. And, the attempt of the performance that makes the musician who plays musical instruments of each charge overlap gives an anacatesthesia, a tension, and a chaotic impression to the entire flow at the same time as surely improving the album-quality.The element with a complex flow in a chaotic sound of \"Pharaoh's Dance\" gives the whole of the album as an impression by this tune. Twining of the trumpet that does the mute surely visits the whereabouts of the performance. The rhythm creates an existing concept as standard Jazz and the space of one overturning is created. The flow that gives the gaga impression might be splendid.The element of Jazz Rock of \"Bitches Brew\" might be certain. Twining of the guitar and the flow of the trumpet receive the top of the tune at once. The performance advances in union. It is a task accomplished by Miles Davis that involved all almost elements for music. The industry of Miles Davis that surely catches the musician whereabouts and adjusts it is certain. A flow not advanced is proof as simple Improvisation where order exists surely as a direction that should be aimed. Music might surely be directionality and be a result in the point that the piano and the guitar, etc. are raised degree of freedom and performed based on some order. Wayne Shorter is Wayne Shorter and Joe Zawinul as for this album though it resigns from the combo of Miles Davis at the end. And, the influence that this album exerts for the following Weather Report might be large. The flow of the performance that chaotically repeated order had a big influence on the item of Jazz.\"Spanish Key\" might have shown shape as complete Jazz Rock. Part to raise perfection of this album. Especially, the part where the rhythm is detailed and the part of the guitar that puts out the element of Rock forward might be the points that should make a special mention. And, rhythmically of Rock in close relation to a chaotic flow. And, Sax of Wayne Shorter and the guitar of John McLaughlin. The flow surely became it.\"John McLaughlin\" might be a tune for the guitar. This tune is a fraction that is shorter than other tunes. It is said that it is a tune that extracts a fragmentary element of this tune for the tune with the fraction that \"Bitches Brew\" is very long when the tune is collected to the album and is composed. Ad-Rib of an exactly hard guitar has gone out to previous. The sound of the piano and the Bass clarinet in close relation to the flow gives the extension of the tune.\"Miles Runs The Voodoo Down\" starts by a heavy flow and a glossy trumpet. A consistent rhythm is assumed to be a subject and it has a steady flow. The flow from which the guitar has come to the front as an impression of the album might be appearance of proof to which Miles Davis started bringing the element of Rock in very. Soprano Sax that receives the instruction to Miles Davis gives the tune glittering.\"Sanctuary\" is given the impression of a quiet melody and the tohubohu and starts. Twining of the melody and the wind instrument with a piano tension promotes the anacatesthesia and the tension further. The part where Jazz/Fusion is good has already been established by this tune. The piano might contribute considerably. And, the wind instrument receives the top. The tune regains the anacatesthesia and hurtles through space. And, the top is received again.The combo of Miles Davis appoints Keith Jarrett and Steve Grossman in the latter half of 1970 after this album is announced. The performance has developed into the performance by Fillmore East. And, the creation of the music is shown more remarkably in the appearance of \"The Isle of Wight Festival\" on Sax player's Gary Bartz on August 29, 1970. There is an opinion made that this album is a work in the question for the item of Jazz, too. However, the album of Jazz/Fusion and the lever should have become one index. The album is at the position in which people's opinions have already been exceeded."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Tuesday, January 26, 2010",
      "rating": 4,
      "text": "With this album Miles Davis made his historical step to jazz fusion territory. Not his first experiment with electric instruments and rockish elements in music, this album is first border crossing, when great hard bop and post bop musician left his jazzy lands for more nervous, energetic and electrified world.Compositions became longer, often LP-side long. And sound is changed radically - mostly electric (even if still with some acoustic sounds), Davis music became heavily jazz influenced jazz-rock jamming. With extra talented musicians on board. I believe that for the time of release it was almost revolution.Looking from now, I still enjoy this work very much. Rare balance between growing importance of usual rock instruments (as electric guitar, electric piano, electric basset) and classic jazz trumpet. Excellent musicianship of all band members ( will become highest standard level for years to come). You can hear there almost all future jazz fusion stars in their very beginning (Wayne Shorter, Bennie Maupin, Chick Corea, John McLaughlin, Dave Holland, Lenny White, Jack DeJohnette, Larry Young, Joe Zawinul,Billy Cobham,Airto Moreira between others). Never later you will be able to listen all of them playing as one orchestra (with Miles Davis as leader!).Yes, now some jams sound a bit loose, obviously there is more free improvs dominate against musical composition, not always for good. But this great free atmosphere, open experimentation and so high-class musicianship just made this album golden classic and cornerstone of all jazz fusion.My rating is 4,5,rounded to 5."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Tuesday, May 18, 2010",
      "rating": 5,
      "text": "After the wonderful quiet atmosphere of the jazzyIn A Silent Way, Miles Davis boosted the voltage amongst his troops and created one of the landmark albums of fusion.Jazz is not really my field of expertise, so I'll leave it to other reviewers to discuss both the relevance and the hype surrounding this album. I can only give testimony of what my ears tell me, and that is: pure bliss, mesmerizing atmospheric jazz music with enough electrical energy to keep a rock fan like myself going for its entire 90 minutes duration.Most of the pieces are built around a repeated rhythmic standard with a prominent role for both bass and drums. The rhythms are very dynamic and provide for a constant change and motion within the pattern, guaranteeing a continuously motivating groove. Miles Davis' emotional trumpet playing supplies most of the solos, but the remainder of the crew is no less important for the result. The interplay of the trumpet with the keyboards and guitars is simply amazing, as if all instruments are in unceasing conversations, challenging, tempting and answering one another constantly.One of the main attractions in this music is how the high level of musicianship never becomes an end in itself. This music is very concentrated but also free and open, with musicians that really listen to one another and work towards a common purpose which I can only describe as pure emotion. One of my all-time fusion favourites, right from the first time I heard it."
    },
    {
      "reviewer": "Muzikman",
      "date": "Posted Monday, August 30, 2010",
      "rating": 5,
      "text": "Miles Davis-Bitches Brew Legacy Edition (2 CD/1 DVD)So where do you start with a recording that created a genre? Bitches Brew and its legendary and iconic status has not waned one iota since the celebrated release of the set in 1970. Miles Davis changed jazz forever more than once from the 50s all the way up to this marvelous concoction of jazz-rock fusion genius.To honor the 40th anniversary of Bitches Brew Sony Legacy has completely outdone everyone else with a remasters series by releasing three different exceedingly tempting configurations. This is the Legacy Edition then there will be the Legacy Collector's Edition and to follow that, if that wasn't enough for you jazz enthusiasts, the Super Deluxe 40th Anniversary Collector's Edition, which has a previously unissued performance from Tanglewood in August 1970. I happen to have the advance copy of that Tanglewood performance however this edition includes a live performance from Copenhagen in 1969. Confused yet? I guess it depends how much of a Davis fan you are and how many dollars you are willing to drop for these sets. You can snag up this gem for $18.99 at Amazon right now.I think Bitches Brew remains unmatched for flat out jazz-rock fusion albums and then some considerations are necessary for the influences you hear in world music as well. There is a reason for that, several actually. The primary driving force, Mr. Miles Davis was an innovator of the trumpet the day he picked it up and as for his collaborators that lofty status applies as well. You cannot have one innovator and the rest of the band in a box musically, they all need to be flexible and stretch the boundaries of their genre and instruments to come up with a classic recording like Bitches Brew. I don't have to remind you of how great this recording sounds but I will anyway. With the Columbia/Sony Legacy stamp adorning each disc you will see underneath that text '360 Sound' STEREO '360 Sound' with little arrows pointing in either direction. That little advertisement lives up to its billing you can be sure of that.As the opening track \"Pharaoh's Dance\" kicks off you are immediately challenged to listen intently yet Miles and his cohorts gradually pull you in with more mellow passages and it all builds into amazing crescendos of sound with Miles leading the way. \"Bitches Brew\", \"Spanish Key\" and \"John McLaughlin\" are jaw dropping examples of jazz-rock fusion, monuments in time and a tribute to men at the top of their game, With Shorter, Holland, Corea, DeJohnette (look up the names in Wikipedia) and a host of other musicians passing through the studios during the recording sessions it was like a hall of fame jazz gathering. Miles was the definitive leader of the pack and everyone else followed and the resulting music that was captured was groundbreaking and still totally mind blowing to this day.The four tracks on disc one cover some ground; \"Pharaoh's Dance\" (20:04), \"Bitches Brew\" (26:58), \"Spanish Key\" (17:31) and \"John McLaughlin\" (4:22). The title track alone is nearly one full LP and the Davis tribute to one the greatest six string benders, McLaughlin, seems like a short running single in comparison. Was this self indulgent, bombastic and long drawn out improvisation? You better believe it, and it was all so breathtaking. Where do you think progressive rock got its inspiration from besides classical music?Disc two has some nice treats to offer as well including single edits and alternate versions. The opener \"Miles Runs The Voodoo Down\" is a real burner featuring that incredibly powerful rhythm section of Dave Holland (bass, who is stellar on the first four tracks as well) and check this out - dual drummers with Jack DeJohnette (right) and Don Alias (left) and some Congas for extra flavor. All that together created an amazing exercise in surround sound syncopated rhythms. And that is just the first track! You get seven more tracks after that then you can put on the DVD and watch some of these amazing performances in a live setting. The DVD is the icing on the cake of one phenomenal exhibition of flawless musical magic that can only be absorbed in chapters like a long, intense novel. To finalize the package a 23 page booklet is included; jam packed with photos and the most fitting and eloquent liner notes from Greg Tate.I say no more, now the choice is yours what package you want. Anyway you look at it you are going to love every second of this if you are a jazz-rock fusion fan. Just think for a minute where music as a whole would be without brilliant individuals like Miles Davis to show us the way?5/5 StarsKey Tracks: Bitches Brew, Spanish Key, Miles Runs The Voodoo DownKeith \"MuzikMan\" Hannaleck-August 27, 2010"
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Wednesday, October 13, 2010",
      "rating": 4,
      "text": "Many times I have heard this album proclaimed \"the first jazz rock fusion album\". I don't believe that it was. What it was, was the album that legitimized fusion to the jazz world, and opened the door for bands like Return To Forever, The Mahavishnu Orchestra, and Weather Report. Just look at Miles' band on this album: Chick Corea, Lenny White, John McLaughlin, Bill Cobham, Joe Zawinul, Wayne Shorter. It's amazing how many fusion giants came out of this band, and it's future lineups.The music is not as structured as fusion soon came to be. This is closer to be-bop than the symphonic styles of RTF and MO. But this was the jazz side of fusion in it's infancy. Miles' playing is much more fluid than he became in the years to come. You can still hear the styling that made him a star at an early age. And while the rest of the players stay somewhat low-key, they do play enough to fill the sections where Miles isn't playing.Three stars for the music, add one for it's historic value."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Friday, November 19, 2010",
      "rating": 3,
      "text": "I am no Miles Davis fan, nor an expert on jazz, but I have a fair amount of his albums simply due to the importance of the man to jazz fusion and indeed his influence on prog. As in the case of Mahavishnu Orchestra, I can take this music in small doses and I would hazard a guess that this review will simply be a pebble in the ocean as one of the reviews that didn't rate this a masterpiece but I have to be honest. It didn't really blow up my skirt tails, gentlemen. I can see the appeal as an innovative example of jazz fusion at it's most experimental, with wild flourishes of African drum beats and crazy trumpet solos. At times it is Santana meets Osibisa. There is no doubt that the fusion on this is inspirational and a Milestone, but for me it really blends together as an overlong jam session, and sounds rather dated these days. The 60s hippy movement and drug culture may have revelled in this but I found it increasingly irritating in places. Perhaps it is too repetitive and heavily reliant on congas and percussion. It has become an early 70s icon no doubt. The voodoo beat is not my cup of tea, however, as it all feels a bit witch doctorish, like the soundtrack to the scene in \"Live And Let Die\" where the voodoo dancers are tripping out around the fire.There is no real compositional structure from track to track though perhaps that is the appeal of the album; the improvisational feel is hard core fusion and the mood is always darkened by the competing instruments and non synchronic metrical patterns. As a double album it was groundbreaking for jazz rock but the music tends to drone on for a long time, repeating motifs and non variations of funkadelic grooves that simply lock in. Jazz fans of course would love this and that is the main target audience, and will remain so for all of Davis' albums. The instrumentation of bass clarinet and tenor saxophone is marvellous and the real drawcard for subsequent listens, along with Davis' trumpet brilliance.If you are looking for a highlight track to listen to as an example, perhaps the 27 minute Bitches Brew, and Spanish Key at 17:34 are worthy contenders. But you will need patience because this music builds painfully slow at times, with random blasts of trumpet and dissonant chords that jolt constantly, and if you are not a fan you may find yourself wanting to switch to something else with more structure. I prefer Davis' 'Kind of Blue' or 'In A Silent Way', but 'Bitches Brew' is still an interesting curio that stands alone in the extensive Davis' catalogue."
    },
    {
      "reviewer": "Man With Hat",
      "date": "Posted Friday, January 21, 2011",
      "rating": 2,
      "text": "Historical context is everything.Yes, when this album was first was released I'm sure it was incendiary, controversial, heart stopping, interesting, engrossing, fascinating, and completely out of left field. Unfortunately, in 2009 (when I first heard the album) none of those adjectives seem to apply. I've read many reviews of this album (and Miles' albums in general) and am astounded by the undying praise. All the things people say...powerful, jaw dropping, earth moving, mind exploding, unyielding...and I find that I can not agree with any of these words. The music is so...lifeless, meandering, unfocused, uninteresting. As if it is just occurring in the background, not meant to be focused on, just existing in some form for some time and then stopping. Occasionally, things do get interesting, get worthy of spending time to listen to, but they are soon replaced with something else, usually less interesting. However, for that point, this isn't a complete failure. Pharaoh's Dance is probably the best (or perhaps most interesting) track here. (Maybe its just because its first on the bill when this album can keep my attention.) The inclusion of multiple drummers and bass clarinet, certain gives Bitches Brew some brownie points as well, as I'm a fan of both of those things.This review may seem alarming. Giving two stars to such an iconic album, a milestone even, may seem blasphemous. But for me, its perplexing. I love jazz, I love avant-garde, I love things that don't have structure, I love improvs, and I love things that just sound strange. This fits most of those criteria. And yet...it falls almost completely flat to my ears. Certainly the players have talent. Some of the biggest names in jazz play on this record. Yet, for me, this talent doesn't shine through enough to give it that certain pizazz, even though I can see the appeal of having all this talent in one place and that same time.All in all, this is one of the most important albums in jazz. From this historical context, this should be rated alot higher. However, for me, this formula has been done better (by Davis and others) since then. Also, this is a progressive rock website, and this is a jazz album. Progressive jazz to be sure, but still, jazz. For all the reasons given, I must rate this 2 stars. (If this was jazz archives this would be 5 stars, no question.) Miles did it better. Start elsewhere."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Monday, May 30, 2011",
      "rating": 5,
      "text": "Emerging from the fog of In a Silent Way, Bitches Brew coalesces Davis' new electric sound. Not yet featuring the heavy funk influence which would dominate the likes of On the Corner, this iteration of Miles' fusion experiments involves a seamless melding of traditional jazz improvisations and more rock-influenced playing in loose, hypnotic frameworks that yield more and more surprises with each listen. Again featuring a grab-bag of future fusion pioneers, the dark, brooding atmosphere would eventually be taken to an extreme by the Mahavishnu Orchestra, although the playing never really gets as fast as that on, say, The Inner Mounting Flame and in fact is usually somewhat laid back (though there are occasional outbreaks of volcanic, frenzied playing, as in Sanctuary just after the four and a half minute mark). In truth, there isn't very much that quite sounds like it, though many imitators would try over the ensuing years. Five stars."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Wednesday, August 31, 2011",
      "rating": 2,
      "text": "Since I joined Prog Archives back in 2004, I must have read one million times how important \"Bitches Brew\" is for Jazz Rock Fusion, so in 2006, bought the album expecting something emotional and revolutionary, but it was so boring that I couldn't finish it the first time. After years of trying to discover the hidden magic in it, my conclusion is that more than a fusion between Jazz and Rock, we are before a Free Jazz album played with electronic instruments.After reading the names of the crew like John Mc'Laughlin, Billy Cobham, Chick Corea or Harvey Brooks, I was so impressed that expected something coherent, intelligent even magnificent, but I was wrong, it consists of 93 minutes of virtuoso musicians playing different tunes one over the other with almost no structure or coherence...Maybe it's a fantastic work for really die hard Jazz fans, but for me is too much improvisation and too little consistence.Now my mother taught me that if I haven't anything nice to say, better not say a word, so I will not mention sides 1 and 2, which are like Sanskrit for me, so will go straight to \"Spanish Key\"that has some good moments and guitar solos, but after this track will avoid the rest of the album.The problem is that even when I'm not a fanatic of the genre, I like to listen the classic Jazz of musicians as Louis Armstrong, Duke Ellington or Dizzy Gillespie (who I saw in my country), and if we talk about Fusion, give me Brand X, Return to Forever or even Mahavishnu Orchestra, but \"Bitches Brew\", no matter how important is considered, sounds like collective improvisation (A style that Ornete Coleman developed in 1961) with electronic instruments that changed nothing of it's essenceDespite the massive recognition \"Bitches Brew\"receives (Probably deserved), my rating of an album must be solely based in my honest impression. so even when it's a great album for the vast majority of people and the musicians are amazing, the lack of melody and coherence, plus the almost exclusive use of dissonances, are beyond my comprehension so will rate this legendary MILES DAVIS album with two stars, which would be one if it wasn't for \"Spanish Key\".Luckily the album has such a high average, that my rating won't affect the respect this album receives, so I won't feel guilty for taking down an album that is a masterpiece for so many people but not for me."
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Saturday, January 21, 2012",
      "rating": 4,
      "text": "'Bitches Brew' - Miles Davis (8/10)Held as one of the most celebrated works of one of the most celebrated artists of our time, Miles Davis' 'Bitches Brew' is a work of art that will never be forgotten for as long as jazz is around. Regardless of individual opinion, the album's status as a classic is now established as a fact. Looking past the masterful ensemble performances standard of Davis' recordings, 'Bitches Brew' holds a very influential place in the world of jazz. Although the previous work 'In A Silent Way' helped outline the fundaments of the then-revolutionary 'fusion' style, it was here where Miles Davis nailed down the elements and proved that 'Silent' was not just a one-off experiment. We have here, a sprawling double album, a work heavy on improvisation and subtle performance. The loose nature of 'Bitches Brew' may keep some listeners from connecting with it on an emotional level, but the sheer skill and chemistry of Davis' company is more than enough to plant the album as one of jazz' most enduring recordings.Particularly on the first half of this journey, the music of 'Bitches Brew' is divided between urbane improvisations, and more collected passages. The most evidently composed sections of 'Bitches Brew' are actually the most challenging. They rarely evoke 'themes', but rather pursue a sense of subtle atmosphere. 'Pharaoh's Dance' and 'Bitches Brew' both feature sections where the band softens up, and a moody atmosphere takes over. Although jazz is usually not a style of music that I find atmospheric in an emotional sense, Davis incorporates very eerie, even creepy moments into the jams. Not only does it help break up the longwinded nature of the music, but it also adds a jarring element to the music that may not have been so evident otherwise. This atmospheric tension would be elaborated upon in later works of his, such as 'Aura'. Here however, they are a relatively minor aspect of the music, but they're fiendishly effective.Perhaps more than any other form of modern music, the potential for success in jazz music lies in the playing skill of the musicians themselves, even overriding composition. Miles Davis' sense of direction definitely leans towards an apocalyptic and ever-jarring feel, but his greatest accomplishment here is being able to draw together talent meshes. Some of the era's greatest jazz icons are here to perform, including future Mahavishnu Orchestra guitarist John McLaughlin, Chick Corea, and saxophonist Wayne Shorter. Many of these instruments have been 'electrified', in the sense that the sound is no longer purely organic, but amped up and often modified. The electric piano is the most notable fusion element here, almost perpetually backing up the soloists with challenging chord progressions and tight flourishes. The aptly titled 'John McLaughin' may be the most fusion-heavy track on the album, focusing on the eponymous guitarist's inventive guitar explorations. As the album's shortest piece, it is also the best put together, and a bit of a refreshment from the indulgent jams that usually dominate 'Bitches Brew'. Indeed, the length is the most challenging aspect of the album, and like so many albums that seek to break the double-length barrier, I will say that the same message could have been conveyed with less time. Of course, Miles Davis and company aren't rushing to get anywhere here. Instead, they are taking a few themes, and going wherever the music takes them. Some listeners may find themselves wanting a more dynamic composition, but the performance lends more than enough subtlety to engage a listener fully. 'Bitches Brew' may lack the timeless hooks of his top tier work, but his performance talent is as clear as ever."
    },
    {
      "reviewer": "thehallway",
      "date": "Posted Thursday, March 15, 2012",
      "rating": 5,
      "text": "Jazz giant Miles Davis had ambitions of Bitches Brew while making In A Silent Way, which saw him dip his toes in the muddy waters of jazz-rock mega-jams to see how people would react, not that he cared much about their reactions anyway. Consequently, this colourful mammoth of an album was born, and its legacy is much deserved. There are two drum kits being played simultaneously and often a wealth of other percussion, plus several basses and the jangly guitar of John McLaughlin. Then two or more electric pianos take ownership of part of the stereo spectrum each, topped off by spontaneous flurries of brass and woodwind, and when he feels like it, Miles' own trumpet. This seems like it would be a thick, messy sound. At times, it grows like this, but the music is organic and the musicians competent enough to know when to let each other's timbres breathe, and when to go full out. The result is over an hour of pulsating mood music that feels \"alive\" in the way it evolves and devolves without pre-structural ideas in place.'Pharaoh's Dance' is a great piece of music and an introduction to this style of fusion. It has a riff from Joe Zawinul that crops up from time to time, but is generally held down with nothing more than a bass pedal point, with various solos and anti-solos going on throughout the 20 minute duration. 'Bitches Brew' is even better, with a intro section that really plays with dynamics, and heavily echoed trumpet, and then moulds into a jam built on a bass ostinato. The intro section returns a couple of times, giving this track more structure. You can tell it's all of the moment though, and that's what makes it so exciting, particularly the nuances of the bass clarinet and the tasteful percussion here.'Spanish Key' opens side three with more urgency, heading straight for uptempo solos and a grooving beat. The great thing about this piece is the frequent changes in tonality that always make you feel like you've 'gone up another gear'. It's a high energy thrill ride that is perfectly complimented by the more thoughtful 'John McLaughlin', which obviously highlights him. 'Miles Runs The Voodoo Down' is more aptly titled, because he really goes for it on the trumpet, something that would be rare at this point in his career when he favoured not actually playing anything himself. Then, 'Sanctuary' is a nice, more relaxing way to end the album. It's smooth and yet dark, with everyone on the top of their game, clearly listening to each other.In short, this is a beautiful project. It's not really an album and the tracks aren't really compositions. Instead, this is an example of what happens when brilliant musicians gather under strong leadership and \"do their thing\". It's cool, colourful, thick, wide, and full of space to get lost in. Hours of fun, and a benchmark for all fusion since."
    },
    {
      "reviewer": "Eetu Pellonpaa",
      "date": "Posted Sunday, August 19, 2012",
      "rating": 5,
      "text": "Though I adore more tamer and romantic classic releases of Miles Davis, I have found most enjoyment from this epic fusion record. I based on my own smaller knowledge of his recordings, I believe \"Bitches Brew\" would be the album fitting most smoothly to psychedelic jazzy fusion rock context, and thus be recommendable album also for the space cadets. Possible arguments for this feelings I have gathered are the emphasis on John McLaughlin's recognizable electric guitar licks, which unite to electric piano lines and dance on rhythm from drums assaulted by Jack DeJohnette along with Lenny White and Charles Alias, these elements creating the most dominant sonic texture of the album, following the trumpet fiercely leading the way on pastures of mutual innovation. Mati Klarwein's visionary painting on the gatefold album covers set the tone for the magic conjured from hallucinatory compositions, which are edited from open improvisation sessions, utilizing the both methods of freeform playing and controlled post production in creation of phantasmal and unique tonal entities. I remember I was first slightly troubled by the edits, possibly as I had been immersed to King Crimson's live improvisations quite heavily during the time of discovering this record, but understood quite fast the opportunities of this approach. The unedited live flow from these musicians are also presented on film recordings of \"Isle of Wight 1970\", so I could ensure \"they didn't edit bad moments out as they can't play together smoothly\", heh.The first album brews ingredients for the hypnotics with two LP side-long compositions, \"Pharaoh's Dance\" staying on steady rhythm basis, allowing the melodic instruments to prowl the surrounding dense jungle with amazement during the marathon run to the heart of mystical voodoo sphere's. This magical sensation explodes for me most strongly on the other side's title track, having three \"conjuration\" themes in the start, middle and on conclusion. On these motifs the rhythmic tensions of bass are released by rich percussions, the descending element bringing me an association of some sort of tribal casting of bones ritual, the spell being realized from screaming trumpet lines of Miles. In the middle of these open evocation sequences lie long tales of most enjoyable lounging on pulsing beats and explorations of sounds. The second LP rolls open with one of the most catchy rhythms I have ever hear, \"Spanish Key\" repeating it's call relentlessly for the bass clarinet and piano's call, waiting for the power increase from impressive rhythm culmination peaks, turning twice the flow of this wonderful impressionistic sound river. John McLaughlin has been honoured with one track bearing his name, and in my opinion not without unjustified merits. The final LP side has two songs, Miles running the Voodoo down with cautious approach, possibly wise when dealing with them magick powerz. The supernatural forces tamed, the record concludes to \"Sanctuary\", a more soothing visit to more traditional calming jazzy moments with Miles' trumpet's familiar melodic calls. In addition of the Japanese vinyl reissue I got chance to listen the CD version from my friend, and the featured bonus track \"Feio\" is quite fun atonal floating in abstract sound scenarios, but doesn't appear crucial for the musical experience from the original double album, maybe extending the chill out recovering from the vigorous mythical electronic fusion trip from its own part.I think one proof for Miles Davis music's universality is the fact that all people which I have shared this record have liked it, even though improvised surreal music wouldn't be part of their own listening preferences. Though I adore the earlier recordings of Miles Davis and his 1960's quiet cool tones, I still return to this aggressive double album of spiritual conjurations most often, I would recommend it for anybody browsing these web pages for some good quality psychedelic music experiences."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Tuesday, October 23, 2012",
      "rating": 4,
      "text": "I've been listening to this album with great attention for the past couple years, trying to fully comprehend the accolades it has received over the years--especially from a prog perspective--as well as in the context of Miles' own personal evolution. What I've truly come to appreciate, more than anything else, is Miles' amazing, almost unique desire to grow, to absorb all that he hears, to gather, listen to, and integrate the leading innovators of the younger generations around him. His track record is truly astounding (and perhaps a bit of a psychological issue: feeding like a vampire off of fresh, young blood and then taking all the credit). For fifteen years Miles had been learning how to command and squeeze the best out of his studio musicians in as little time as possible, and Bitches Brew offers yet another example of this. After a year of introduction to modern psych-pop culture via socialite wife Betty Mabry, the changes in Miles manifest in everything from clothes, food, and cars, to music, social circles, and concert attendance choices. Miles was now hep to Hendrix, Sly Stone, James Brown, The Byrds, Aretha Franklin, and Dionne Warwick/Burt Bacharach. Then came the 1969 Newport Jazz Festival in July. Witnesses say that after that--after seeing James Brown staged next to Frank Zappa and the Mothers and Dave Brubeck and Art Blakey, as well as a roster that included Sun Ra and his Arkestra, Roland Kirk, Herbie Hancock, Bill Evans and Freddie Hubbard, B B King, Sly and the Family Stone, Led Zeppelin and Blood, Sweat and Tears--Miles was super stoked to get back into the studio. (His first funk-infused album, In a Silent Way was already in the can but would not be released for another three weeks!) He was itching to try out some of the musicians and styles and recording techniques that he'd been hearing, seeing, learning about. Over the course of three days in August, using a kind of revolving door of musicians and multiple instrumentalists at each main instrument (three keyboard players, two drummers, two bass players [one acoustic, one electric], four drummers [not all at once; two at a time], and three percussionists, three horn players and electric guitarist John McLaughlin, the expanded or \"new style big band\" ensemble rehearsed and laid down six long tracks, only one of which had been composed and performed before (\"Miles Runs the Voodoo Down\" was one of the songs he played in his 24-minute set with his quartet at Newport--which may be one reason that song occupied all of Saturday, August 20). Then it was Miles' permission given to producer Teo Macero that led to much of the magic that we hear in the final release as he used many editing techniques in the post production, including tape loops, tape delays, reverb chambers and echo effects as well as splicing and micro-edits. In effect, it is the production work of Teo Macero that really brought Miles' work and Bitches Brew into the realm of modern sound recording and, thus, the attention and adulation of experimental rock and jazz musicians. While not the start of the jazz-fusion movement (that honor would have to be wrestled for between Gary Burton, Herbie Mann, Don Ellis, Larry Coryell, and Jimi Hendrix [this latter due to his influence on The Soft Machine), Bitches Brew was certainly the album that blew open the floodgates for musicians EVERYWHERE to experiment and dabble in the \"dark arts.\" For me, the contribution of Bitches Brew is more in the story, the lineup, the production, the rather noticeable (some might say \"drastic\") shift in the direction of Miles' sound, not in the songs, per se. I find the songs interesting but none have ever found their way into my jazz-rock/jazz fusion playlists. Thus my four star rating: while the entire album is fascinating and essential for the observation of the evolution of Miles Davis, I would not recommend any of these songs as introductions to the world of jazz-rock fusion.A \"Pharaoh's Dance\" (19:25) the long, slowly developing opening is kind of unusual for its meandering, amorphous way, but eventually the band members seem to get into their own individual grooves. One can easily sense that the trumpet player is in command with each other soloist getting a nod of permission for their turns in the spotlight, no more. The song chugs along, moving but never really getting anywhere; it's like a 19-minute video clip of a train motoring through Wyoming. (35/40)B \"Bitches Brew\" (26:45) this one is quite a bit more diversified and dynamic than the opener: with enough twists and turns, stops and gos, to keep it interesting. (48.5/55)C1 \"Spanish Key\" (17:30) definitely a more rock-oriented rhythm track, which is probably why the keys and guitar (and drums) are more aggressive and abrasive. (31/35)C2 \"John McLaughlin\" (4:23) If this was Miles' nod to John, why didn't he let the guitar innovator use more of the distortion and other effects he was using on his other State-side shows and recording gigs? (8.75/10)D1 \"Miles Runs The Voodoo Down\" (14:03) just a little too much on the bluesy side of R&B for my tastes, though I actually love the perfect recording and mix of all the instruments in the weave. My favorite part is the tenth and eleventh minutes when the Chick Corea's dirty Fender Rhodes and Larry Young's organ (as well as the bassists) go bat [&*!#] crazy--not a typical phenomenon in a Miles song. (26.5/30)D2 \"Sanctuary\" (10:54) opens with rich Fender Rhodes support of Miles' plaintive, almost-tender trumpet play. I love it when Dave Holland and Bennie Maupin join during the second minute, Bennie trying to second Miles' melody line (but being a bit off). Until the song gels into its \"solid form\" at 3:!5 the drummers feel as if they're just warming up, each in their own universe. Joe Zawinul also has a rather unusual way of play off the beat (Teo Maceo's choice?) and yet, this is probably the album's most accessible song for me and, thus, my favorite. (18/20)A little more exciting, diverse, and dynamic than its predecessor, In a Silent Way, I still have great difficulty understanding what people see in this album's music that elevates it to such high ratings. I understand the landmark it represents historically in the rise and development of that which will become the Jazz-Rock Fusion sub-genre, but there are very few moments on this album in which my blood gets pumpin' or my brain gets blown away by the solos, duels, or interface of these expanded lineups and their \"new and exciting\" electrified instruments. I mean, had I heard them in the day--in the context of what was going on sonically, evolutionarily, at that time, sure I would probably have been impressed. But, would it have made me inspired to become a musician? Would I have been blasting these songs across the Quad from my dormitory windows? Would I have been wearing out the grooves of my vinyl copy because I was playing it so much? I seriously think not!Total Time: 93:00B/four stars; a ground-breaking album, as they say, but to me this is just a rather messy conglomeration of highly creative musicians who have been given a certain amount of instruction, a little more freedom, and a lot of time. I mean, let's give credit where credit is due: Teo Macero took the tapes from the recording sessions and made whatever he thought sounded good to him, right? I mean, how much say did Miles or any of the other musicians have in the finished product that was released seven months after the recording sessions? Probably very little, so, then, in reality, how much credit should Miles receive for this product? Did he ever perform these songs live, in concert, the way they appeared here on vinyl? I seriously doubt it. I think we've been giving too much credit to a bandleader who had very little to do with the product that the world and posterity can own when in fact it is, according to what I've read, Teo Macero who shaped the finished product."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Tuesday, December 17, 2013",
      "rating": 5,
      "text": "Does it get any more classic or classy than this? This double album from 1970 just cries out sophistication from the very first note and no doubt considering the lineup. Some of the absolute best in all of jazz is here to offer up some of the tastiest fusion ever to grace the eardrums and despite being more on the jazz side of the equation than rock it still does both and unapologetically surpassing all that came before including Miles' own attempt on his previous album IN A SILENT WAY.Although Miles opened the doors with fusing the jazz side of music with rock features on that album, this was this album that burst open the flood gates and allowed the slew of musicians to cross-pollinate all the musical ambitions that had been veering closer together throughout the 60s. In fact John McLaughlin on this album would soon go on to up the ante even more with The Mahavishnu Orchestra as well as Chick Corea with the revered Return To Forever.The rest of the lineup is none other than absolutely phenomenal and Miles has never sounded better on his trademark trumpet and that I must say is a tall order indeed since he has more classic jazz albums than should be permitted by law single-handedly ushering in everything from cool to modal jazz. A triumph in the first degree. Not only did Miles utilize the current technology of the day and expanded it beyond previous limitations but also utilized the songwriting techniques of other world music such as the Indian raga in his fusion to create long symphonic orchestral pieces. I'd give this more than five stars if I could."
    },
    {
      "reviewer": "patrickq",
      "date": "Posted Monday, February 18, 2019",
      "rating": 4,
      "text": "It's fascinating to try to figure out what an album is trying to say, especially an instrumental album that might have some underlying concept. What do the song titles mean? The album title? The artwork?And I don't buy the idea that listeners have no right to impose their own meanings onto music. Artists know that once they publish their work, it is no longer exclusively theirs - - especially when they sell more than a million copies of it.So what didBitches Brewmean in late March 1970 when it was released? I know very little of the state of jazz in the late 1960s and early 1970s. I wasn't even born until a few months afterBitches Brewcame out, and with a few exceptions my interest in music only made it to jazz very recently. So while I see Louis Armstrong's criticism of \"modern jazz\" in the early 1960s, and Miles Davis's criticism of that criticism, as part of a cycle inevitable in art, I don't actuallygetit. The stipulated facts seem to be that Jazz, like all art forms, was going to change at some point; that the change would have both external and internal causes; that Davis challenged the jazz status quo from the inside; and that his vision wound up exerting outsized influence on the future of jazz.So one meaning attached retrospectively toBitches Brewis that of some sort of \"knockout punch\" or \"final nail in the coffin\" of the old jazz - -In a Silent Wayhaving been the penultimate punch or nail. Another meaning involves producer Teo Macero's postproduction:Bitches Brewmeans what it means not only due to Davis's artistry, but equally to Macero'sex post facto\"composition\" of the material using techniques similar tomusique concr�te. In this viewBitches Brew's place in history would've been assured even if its style hadn't been an affront to prevailing conceptions of jazz; after all, fifty years later, post-performance dicing and splicing is essential to nearly all forms of popular music.In any event, in late March of 2019,Bitches Brew, subtitled \"Directions in Music by Miles Davis,\" still sounds avant-garde. Ok - - maybe safely avant-garde, but experimental and formidable nonetheless. Compare this to the Doors, whose music of the late 1960s and early 1970s was apparently considered ribald. By 2019 standards, it's still good music, but no longer racy.Bitches Brewstill sounds way out today. There's no way this is going to get confused with Michael Buble, whoseLovecurrently holds down the top spot on the Billboard Jazz Albums chart, as it has every week since it debuted seventeen weeks ago. (A Miles Davis - John Coltrane concert from March 24, 1960 reenters the chart at #17).My attempts to identify the meaning ofBitches Brewhave thus far failed. Luckily, the music is very good, both in terms of composition and performance. My only quibble is this: I appreciate the sonic and stylistic shifts, both within and between songs, more than I enjoy them; I'm not sure that this is Macero's editing or the pieces themselves. On the other hand, the overall sound of the album, which I certainly attribute to Macero, is fantastic, better thanIn a Silent Way, which sounded pretty good.I own four Miles Davis albums, and thus farBitches Brewis my favorite. Sure, once in a while it seems like the band is doing weird stuff just to see if they could get away with it. But consider \"Feio,\" a bonus track on most versions ofBitches Brewcurrently in print, to get an idea of how avant-garde the album might've been. Most of the time,Bitches Brewis daring but still consummately musical. Maybe that's its ultimate meaning."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "albumbd5f.html",
  "last_parsed": "2025-05-18T00:12:52.050103"
}