{
  "album_title": "SPECTRUM",
  "artist_name": "Billy Cobham",
  "artist_page_link_local": "artistdacc.html?id=2922",
  "year": 1973,
  "rating_value": 4.27,
  "rating_count": null,
  "review_count": null,
  "genre": "Jazz Rock/Fusion",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/2922/cover_39268182010.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Quadrant 4",
      "duration": "4:20",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Searching For The Right Door / Spectrum",
      "duration": "6:33",
      "is_sub_track": false
    },
    {
      "number": "a",
      "title": "Searching For The Right Door",
      "duration": "1:24",
      "is_sub_track": true
    },
    {
      "number": "b",
      "title": "Spectrum",
      "duration": "5:09",
      "is_sub_track": true
    },
    {
      "number": 3,
      "title": "Anxiety / Taurian Matador",
      "duration": "4:44",
      "is_sub_track": false
    },
    {
      "number": "a",
      "title": "Anxiety",
      "duration": "1:41",
      "is_sub_track": true
    },
    {
      "number": "b",
      "title": "Taurian Matador",
      "duration": "3:03",
      "is_sub_track": true
    },
    {
      "number": 4,
      "title": "Stratus",
      "duration": "9:50",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "To The Women In My Life / Le Lis",
      "duration": "4:11",
      "is_sub_track": false
    },
    {
      "number": "a",
      "title": "To The Women In My Life",
      "duration": "0:51",
      "is_sub_track": true
    },
    {
      "number": "b",
      "title": "Le Lis",
      "duration": "3:20",
      "is_sub_track": true
    },
    {
      "number": 6,
      "title": "Snoopy's Search / Red Baron",
      "duration": "7:39",
      "is_sub_track": false
    },
    {
      "number": "a",
      "title": "Snoopy's Search",
      "duration": "1:02",
      "is_sub_track": true
    },
    {
      "number": "b",
      "title": "Red Baron",
      "duration": "6:37",
      "is_sub_track": true
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "clarke2001",
      "date": "Posted Sunday, April 8, 2007",
      "rating": 5,
      "text": "Here's an album that I could easily recommend to any fan of jazz-rock and to anyone who doesn't like jazz-rock, actually. Many people bought a set of drums because of this album. Many drummers sold their drums after hearing this album.This album is technical perfection, with emphasis on drums - but how many drum-oriented albums that deserve a masterpiece status do you know?This is not only a masterpiece, this is a desert island album. It will continue to grow on you every time you are listening to it- it's one of those damn albums where you can discover something new every time you are listening to it, even if you are familiar with it for ten years or more.I prefer to call this one rock-jazz rather than jazz-rock; my impression is that this is a full-blooded jazz album and it rocks. It's a perfect balance of freshness & youth and maturity & musicianship.The drums are incredible, astonishing and that is all I'm going to say about it. I do not like drum solos - but William Cecil Cobham is undoubtedly a genius, capable to balance everything in a song perfectly.Most of the songs are interplays between keyboards and guitar with incredibly complex drumming and incredibly simple bass in a background. This formula is applied to almost all songs in the album - plus, there's usually a drum solo as an intro to the song (note the (a) and (b) parts in the track listing).So, if the album is following some rules so strictly, what is so good about it?Everything else. Controlled monstrosity, rock mannerism on a jazz background, brief and effective solos. Excellent musicianship. This album is pleasant, furious, focused, groundbreaking. Anything you want.This albums is highly recommended to anyone on this planet who have some credibility as a fan of serious and intelligent music. Especially recommended to people who are not the fans of jazz-rock/fusion.This is one of the masterpieces for the centuries to come."
    },
    {
      "reviewer": "Chus",
      "date": "Posted Sunday, April 8, 2007",
      "rating": 5,
      "text": "A rock album with jazz sensibilities?; Get in and be amazed at the skill of that drummer!!. Billy Cobham has brought some of the Mahavishnu spirit for this album, with some drum interludes. In fact two song are introduced by two drum spots: \"Searching for the Right Door\" serves as an introduction for the title track and Anxiety opens for \"Taurian Matador\". The sax and the flute, unfortunately, serve mainly as accompaniment instruments (with only few solo spots), so the instruments that stand out the most are electric piano/guitar and Moog synthetizer.The album sets sail with an explosive guitar/drum duo (I believe the guitarist is Tommy Bolin, as it fits his approach to guitar technique and fireworks); a speedy rock n' roll/blues song. Then Spectrum with it's great reed/woodwind arrangements and exquisite electric piano improvisation and the one crazed sax bridge. How about the Moog/guitar duo on \"Taurian Matador\"?... simply fireworks; amazing interplay!!!. \"Stratus\" is the longest track on the album andit takes about 3 minutes between studio tricks and drum display, then it builds up as a slow rocking jam. The insightful \"To The Women In My Life\" (a piano prelude) serves as opening for the latin-injected \"Le Lis\" and we get to the finale with a wicked \"studio trick\" track called \"Snoopy's Search\" which is followed by the legendary \"Red Baron\", one of my favourites tracks of the album.A real treat for rock and jazz fans alike, and one of the most memorable fusion albums of the 70's. A 5 star!!"
    },
    {
      "reviewer": "Guillermo",
      "date": "Posted Wednesday, April 11, 2007",
      "rating": 4,
      "text": "I listened to this album in 1985. It is a very good album, with very good compositions by Cobham who also is a brillant drummer. It is an album in the very \"Fusion\" style, and maybe it is one of the best examples of this style of music. Cobham selected very good collaborators for the recording of this album. In particular, guitarist Tommy Bolin (who died in 1976) and keyboard player Jan Hammer shine on this album, with Bolin playing very good lead & rhythm guitars on most of the songs (John Tropea also played guitar in one or two songs). Bolin`s playing is particularly good in the song \"Quadrant 4\". In my opinion, his style was more adequate for the Jazz-Rock music, so I don`t know why he played with Deep Purple years later, as his style wasn`t very similar to Ritchie Blackmore`s and Deep Purple`s. Hammer also plays very good synth solos in his very own style, and also other keyboards. Hammer plays piano in the brief and beautiful song called \"To the Women in my Life\", which sounds more like an introduction for the next song called \"Le Lys\", which has the same melody from \"To the Women of my Life\", but played with drums,congas, electric piano, synth, bass, guitar and wind instruments. In conclusion, is a very recommendable album."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Wednesday, April 25, 2007",
      "rating": 5,
      "text": "Billy Cobham already had a top-notch pedigree stemming from his sessions with Miles Davis on his revolutionary \"Bitches Brew,\" but his awe-inspiring drumming with The Mahavishnu Orchestra made him a household name among musicians of all genres in the early 70s. This well-deserved popularity helped him to land a record deal, assemble a group of virtuosos and cut his first solo album in 1973. But rather than write the kind of complex and difficult-to-assimilate tunes that had characterized his previous musical involvements, Billy optioned to string together a collection of powerful, energized instrumentals that placed a heavy emphasis on the rock dimension of Jazz Rock/fusion. Aware that he wouldn't have weeks of studio time to allow for unlimited takes in the pursuit of perfect tracks (not that these are loose by any means), Cobham aimed for emotional spontaneity mixed with adrenaline and the result is a joyous, unbridled album of great songs.The extraordinary keyboard wizard Jan Hammer and Billy waste no time loitering in front of the album as they come charging out of the gate in a full sprint on \"Quadrant 4.\" With Cobham's double bass drums rumbling like a freight train, the tune's laughing melody pulls you in without a struggle and sets you up for the full brunt of Tommy Bolin's fierce, fire-breathing guitar. The indispensable gadget he utilizes so expertly, causing his solo to explode out of your speakers is the famous Echoplex and I'm not convinced that modern technology has yet to fully duplicate (much less improve on) its unique capabilities. This project most definitely sprang from the mind of a drummer so from time to time you are treated to short but very expressive percussion forays like \"Searching for the Right Door\" where Billy shows off his meticulously fine-tuned kit. It leads to \"Spectrum,\" a fine modern jazz piece that spotlights Joe Farrell's flute and soprano sax and Jimmy Owens' flugelhorn. It's presented in a tricky 7/8 time signature and Joe's sax break in particular is exquisite. \"Anxiety\" is another quick-to-pass drum sequence that serves as the intro for \"Taurian Matador,\" a fast and funky strut with a more involved melody line that ends up in a battle of riffs between Hammer and Bolin that will tear your head off. A word here about Tommy. With his sterling reputation Billy could have recruited any number of incredible jazz guitarists to play on this album but I think he chose Bolin because he didn't want intricacy, he wanted dazzling fireworks and to hell with precision. Tommy was the right choice because he turns in some of the most intense guitar rides you'll ever hear.\"Stratus\" is the tune that got the all-important radio airplay and everybody's attention. And for good reason. It's a monster cut. Smooth, spacey sounds from Jan and Tommy are followed by Cobham's light-speed noodlings and samplings on the Moog synthesizer drum, then a clean closed roll ends with a hard snap of the snare and off you go. One of the most appealing things about Billy's compositions is his ability to come up with memorable melodies and this is one of his best. Here Cobham and bassist Lee Sklar lay down a rhythm track that's tighter than the seals on a submarine but Billy's not content to just sit back and play the downbeat. He's an interactive drummer. When Bolin gets to shredding on his Strat Billy is right there with him, lifting the whole song into orbit. Same thing with Hammer's solo, then Cobham flies over the skins and a repeating riff as the song trails off into the ether. The tune is just under 10 minutes of pure sizzle. Billy wisely inserts some serenity at this point with Jan's beautiful acoustic piano rendition of \"To the Women in my Life,\" followed by the Latin-flavored \"Le Lis\" that glides along gracefully like a lithe dancer. Hammer supplies a tastefully restrained synthesizer lead to complement Owens' skill on trumpet. \"Snoopy's Search\" is a final but furious taste of the drum synth that slows to a lone pulse before the band slides into \"Red Baron.\" The song has a contagious funky feel and one of the coolest melody lines ever. Tommy's subdued tone is priceless and he throws in a few harmonics hither and yon to keep you intrigued. Hammer storms in with some lightning from his electric piano and guides you the rest of the way home.This is a masterpiece not because it is immaculate or world changing or absolutely mind- blowing but because it is so consistently and undeniably GOOD. And I mean that in the best way. There's not a skip-over track to be found and there's a delightful atmosphere of shared, mutual gratification emanating from the musicians involved that seeps right out of the music directly into the heart. It's a one of a kind album that will appeal to and entertain your progressive ears even if you don't usually venture anywhere near jazz rock/fusion. Do yourself a favor and add this to your collection. Play it when you need some pep in your step. It's like sunshine for the soul."
    },
    {
      "reviewer": "tszirmay",
      "date": "Posted Friday, April 27, 2007",
      "rating": 5,
      "text": "The recent inclusion of this unsuspecting artist, owner of a timeless crown jewel with this recording, compelled me to register my complete elation in welcoming yet another masterpiece into the Prog Hall of Fame (hello, Cincinnati). My esteemed colleague (and seemingly highly adroit scribe) Rollie Anderson hit the proverbial nail smack on the head, with his highly explosive review, unable and unwilling to hide his unabashed awe. Simply put , and then we can move on, this is among the cream discs from the 70's new prog-fusion (once and then better described as jazz-rock), up there, onstage with the illustrious Mahavishnu Orchestra's \"Birds of Fire\", Return to Forever's simply ripping \"Romantic Warrior\" , Al DiMeola's blistering \"Land of the Midnight Sun\" and Weather Report's suave \"Sweetnighter\" . Yeah! It's that kind of pedigree. Mind blowing! No need to give a blow by blow account of each track's virtues, the whole is even better than the sum of its parts. To start, the sheer quality of the musicianship veers straight into the ridiculously insane. Both Cobham's drumming and Jan Hammer's synthesizing are well-documented inspirations to countless learning musicians, so the shift is directly aimed at the super cool bass patterns of famed and then busy LA session bassist Leland Sklar, enough to sit up and notice. Only need a good guitar to seal the deal and what a left-field choice. So enters \"I died too young\" Tommy Bolin, still revered today by knowledgeable rock fans whose jaw dropped at this first and fierce six-string recital, a guitarfest that has all the flair of sheer genius. The compositions just groove, at times intensely so, a controlled fury sculpted by warp speed fingers and sensitive hands. Even the brief drum solos , as well as the manic synth noodlings accent the creative package which is best showcased by the legendary (and oft sampled ) \"Stratus\" one of the finest instrumentals of all-time. When the brief synth- drum ends, the main bass-led beat is laid down like an anchor, propelling the groove (Ozrics style) and it's take-off time. What a detonation! When Tommy kicks in with a tectonic plate shaking guitar solo that defies description but will shatter your doubts and turn you into a fan, the apex has been achieved! One of those\" You must be joking, take a running jump\" kind of solos. I strongly suspect that this record will be heavily reviewed in the future and deservedly so as I cannot comprehend someone slamming this extremely original rock icon. Did I omit to mention Billy's titanic drumming prowess throughout? Not surprising as each return audition pursues the quest in \"driving me mad\", (I want you, I want you so bad, it's ..) . Any proud prog collection cannot afford the exclusion of this pentastar offering. Remembering 1973 when this was recorded , I am reminded that it was the nec plus ultra prog year, with tons of inspiring musical masterworks (just go through our site's top albums all-time section and chalk em up). Get, keep, treasure and forever enjoy 5 red barons"
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Thursday, December 13, 2007",
      "rating": 4,
      "text": "This is one of the easiest reviews I will ever write. Do you want virtuosic playing? Do you want music that sounds \"cool\"? Do you want music that will challenge you, yet still not make you feel like nerd with non-prog friends? Do you want a variety of instrumentation, styles and tempos on an album? If your answer to any of these is yes, then you simply need this album.Quadran 4. An absolutely blistering opener, Bolin and Hammer engage in some fierce duels, while Cobham simmers on drums. Sure, it's a relatively simple jam, but it's also light-years more in-your-face and intense than your average rocker.Searching for the Right Door. A great change of pace from the opener, this track is a light, intricate, fllute-oriented number in 7/4 that features excellent drumming (of course!) and ultra-cool keys and synths from Hammer. If I was a high-roller in Vegas, this would be my theme music.Anxiety/Taurian Matador. Here the boys tone down the rock a bit from the opener and throw in some funk, but the blistering interplay between Bolin and Hammer remains. And of course, Cobham keeps right on cooking, with killer fills and nice change-ups throughout to always keep things interesting.Stratus. This highlight of the album for me, this is one hard-working song, and Cobham and crew have cranked the funk to the max, and the results are simply awesome. A great spacey intro, including one of my favorite drum solos of all time, lead into the funky groove that takes up most of the track. Bolin gives us a guitar jam with a nasty attitude--too bad he only had so little time on this earth, though the song is captivating throughout.To the Women in My Life/Le Lis. After the funk-filled Stratus, a classy grand piano intro, followed by a subdued yet lively trumpet groove is just what the doctor ordered.Snoopy's Search/Red Baron. To round out the album, we're treated to a brief freakout and then a cool funk groove. Hammer's tasteful keys really keep this one interesting, though let's not forget Bolin's restrained, Beck-like riffs. Anyone listening to this will strut a bit more and feel a bit cooler.As you can imagine, I love this album--tons of great tunes, incredible playing, and excellent variety. This is an essential addition to any fusion or progressive rock collection."
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Friday, March 14, 2008",
      "rating": 4,
      "text": "3.5 stars really!!!While still on board with Mahavishnu Orchestra, Billy Cobham started thinking about releasing his own solo album as a solution to his frustration, which he shared with his bandmates. Most likely due to McLaughlin's authoritarian leadership of MO, the group was starting to implode by the summer of 73 and some conflicts lead to the \"loss\" of the Trident sessions that was supposed to the group's third album and Columbia released a live album instead. The fact was that most of the group resented McL's being the sole songwriter. Hammer, Laird and Goodman where often at odds with McL, but Cobham avoided the feud, because he was planning his future solo album Spectrum. So when MO did implode, Billy was ready with his project and entered the Electric Lady studios (Hendrix facility) with ex-MO Jan Hammer, bright hope guitarist Tommy Bolin (future Purple disaster) and studio-rat bassist Sklar. On two tracks, he opted on calling Ron Carter, Baretto and horn player Owens and Farrell.As collab Hammer was toying around with the Moog, the mood was for experimentations throughout the three weeks it took to record the album, but this risk-taking might mean that the album hasn't aged all that well. One of the amazing things is that Spectrum doesn't sound like a MO offshoot, but more like a later 70's Jeff Beck album, this right from the energy-packed opening track Quadrant 4 all the way to the closing Red Baron track. With Hammer being an obvious link (but then again to MO as well), then it leaves Tommy Bolin's guitar to induce that JB sound. The only track where you might hear a hint of MO is the title track's start (in 7/4), but as soon as Owens' sax enters, it is gone. Taurian Matador again gives you the JB feelThe album's centrepiece (opening the flipside) is the 10-mins Stratus, starting on spacey sounds, with Cobham's lightning fast drumming and Hammer's electronic twiddles on the Moog for an intro, before Bolin takes the track into the open some three minutes into the track. Soon followed by Hammer's delightful electric piano (almost Manzarek crossing Auger), the album hits its peak with the improbable certainty that it won't be topped again.Three drum solo are spread throughout the album and for this writer finding just one of them being more than enough, this might sound like pure hell. Only Cobham's extraordinary skills makes that these three drum pieces manage to get past the first few repeated listens without much harm, they inevitably hamper the album's enjoyment in the long run. Nevertheless, no matter how you feel about drum solos, Cobham is shining harder than the sun throughout the whole album, extending his craft beyond reason, playing with two sticks per hands on most tracks. The Women/Le Lis combi track is rather different with Hammer doing the intro, and the extended line-up bring the album into softer territory, but it doesn't lmean anyless challenging. Hammer repeats his Moog noodlings in Snoopy's Search, but again the experimentations sound dated (more than Tangerine Dream's experiments really). As mentioned above, Red Baron reeks again of JB feel, the track having a lovely funky reggae almost-lazy beat, allowing Hammer's electric piano tio tear up, the place, Bolin remaining in the background, thus negating the Beck experience.Difficult not to give less than essential rating to such an album, but the repeated drum showcases (show-offs) are somewhat a drawback and unfortunately the album gets a below 4 stars rating, while retaining its essential status."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Wednesday, June 18, 2008",
      "rating": 5,
      "text": "There's no question that Billy Cobham is one of the most talented and influencial drummers on the planet. I had high hopes going into this one that it would be another \"Birds Of Fire\" shred-fest. Not quite, although the first song delivers big time in that style. Jan Hammer, his old MAHIVISHNU ORCHESTRA band mate helps out, while Tommy Bolin doesn't disappoint on guitars. We also get some bass, sax, flugelhorn, trumpet and flute to round out this mostly jazzy sounding album.\"Quadrant 4\" opens with heavy, fluid drumming while Bolin comes in with some intricate melodies. A fuller sound 1 1/2 minutes in. This is so impressive. Ripping guitar after 3 minutes as the bass continues to throb. \"Searching For The Door / Spectrum\" opens with intricate drum patterns before we get to \"Spectrum\" which is very jazzy with plenty of keys from Hammer, as well as flugelhorn and flute. Guitar 2 1/2 minutes in. The drumming is incredible ! Sax after 4 1/2 minutes with liquid keys a minute later. \"Anxiety / Taurian Matador\" opens like the last song with the first part taken up with Cobham's complex drumming skills.The second part kicks into gear quickly. This is another jazzy tune with some great keyboard and guitar solos trading fire as Cobham does his thing.\"Straths\" opens with 2 minutes of spacey atmosphere. Nice touch. Drums then come in sounding so amazing. The guitar in this one is excellent as well. Great tune. \"To The Women In My Life / Le Lis\" opens with piano before the second part arrives which is light, uptempo and jazzy. Alto sax, trumpet and congas all chip in. Hammer offers up some moog as well. \"Snoopy's Search / Red Baron\" opens with experimental sounds and ends with percussion. The second part features a nice drum / bass rhythm as keys then guitar join in. Great sound 5 minutes in.A must have for MAHAVISHNU ORCHESTRA fans but i'm sure you already know that."
    },
    {
      "reviewer": "Moatilliatta",
      "date": "Posted Sunday, September 7, 2008",
      "rating": 3,
      "text": "While outdoing Mahavishnu is completely out of the question, Billy Cobham put out a strong solo debut, possibly stronger than any of McLaughlin's solo albums. Spectrum is a rockin' fusion record that obviously showcases the talent of the great drummer. great rhythm work is complimenting by solid improvisation. 2/3 of the record are done by a quartet comprised of Cobham, Jan Hammer, Tommy Bolin and Lee Sklar; the other third features some additional instrumentation (horns, woodwinds, auxiliary percussion). While the performance value is there, I can't say that there is anything especially memorable about the album. There aren't any stellar riffs or melodies to suppliment the soloing. We can expect something like this because it is, after all, a drummer's record.It will suffice to say that Spectrum is a good but forgettable record. It is thoroughly enjoyable when you're listening to it, but you will never find any of it stuck in your head later on, and when deciding what to throw on when you're in a fusion mood, this probably won't be the first title you'll think of. Fans of predominantly jazz or jazz fusion would probably benefit from owning this one, especially those who can't get enough of the first form of the Mahavishnu Orchestra."
    },
    {
      "reviewer": "Gooner",
      "date": "Posted Friday, November 7, 2008",
      "rating": 4,
      "text": "I admit, of all the fusion bands out there(and I consider myself a huge fusion fan), I've never been able to get into Mahavishnu Orchestra. I have, however, always appreciated the talents of Billy Cobham and Tommy Bolin. Billy Cobham's _Spectrum_ album is a match made in heaven. If you want great guitar work, look no further. I would consider this album the framework of all things _Jeff Beck_ in relation to Beck's fusion period(especially _Blow By Blow_ and _Wired_). If you like those Jeff Beck albums, then Bliiy Cobham's _Spectrum_ is a must have since they are similar. Highlights are Quadrant 4, Spectrum and Stratus(this track has been sampled by several hip/hop artists). I seriously don't know how Billy Cobham pulls off this drumming at breakneck speed. It's simply incredible. The other tracks are mellow jazz/fusion and 1 minute drum workouts(intros to many of the pieces). After this album, Tommy Bolin would eventually join Deep Purple on their album _Come Taste The Band_(not my favourite, but it has since grown on me...worth checking out). _Spectrum_ is an almost masterpiece of jazz/rock fusion, but definitely a classic. It should be in every prog.rock collection."
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Thursday, April 23, 2009",
      "rating": 5,
      "text": "Intersection of Two Fan Bases Secret Favorite = ClassicAs a young guitar nerd in the late 80's most of my heroes referred back to jazz-rock pickers from the 70's as their influences. I checked out McLaughlin, DiMeola, and the usual suspects but for the most part the music was over my head at the time. And then I found Tommy Bolin. Bolin was a rocker with jazz sensibilities, rather than the other way around, and for some reason his playing just connected with me. Rather than relying on monster theory or note choice, he used everything he could to create dynamic cascades of sound out of the guitar. He became the absolute master of a 70's effect box that was archaic, noisy, and difficult to harness, the Echoplex. That effect became the defining aspect of his playing and he the defining player for the effect.The absolute apex of Tommy's adventurousness is found on Billy Cobham's debut album, Spectrum. The opening song, Quadrant 4, is a strangely sparse solo duel between Bolin and keyboardist Jan Hammer. Tommy builds from pentatonic runs to early whammy bar aggression to finish with the Echoplex in its crazy glory - and jazz-rock may still have never reached that peak of rocking fire again. Later in the album, we get a good sampling of other elements of Tommy's playing including his funky comping, more extended lines, and a range of tones, but the Quadrant 4 solo is considered one of, if not THE high point of Tommy's playing by the TB fan community. (This has included me for over 20 years. For those interested, those \"other\" aspects are on even greater display on Alphonse Mouzon's allegedly copycat album to this one, Mind Transplant.)Spectrum's significance at the time had little to do with Tommy Bolin, whose inclusion probably had some jazz fans scratching their heads prior to hearing the album. The album is first and foremost Cobham breaking free of the confines of Mahavishnu Orchestra and what a fine, funky, frisky emergence it is. His chops dazzle but always with a deep groove. Before Phil Collins brought in the gated snare or beats were corrected with Pro Tools, the 70's were the golden age of the drummer. And this drummer and this album are perhaps the primary standard bearers. Cobham takes many extended breaks for himself (yes perhaps a little indulgent, but it is his solo album) but as you take in this album a couple of times, they are a natural part of the flow of the music.As others have said, this album is also a transition point between jazz fusion which included rock elements and true jazz-rock that Jeff Beck went on to remake his name performing. The time is more straight, the chord progressions more linear, and the attitude is just more rocking. Hammer plays like a demon, set loose and spurred on by both Cobham and Bolin. The group just sounds like they're totally enjoying the music they're making. It's a treat to listen to.It doesn't get much more essential than this."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Saturday, June 27, 2009",
      "rating": 5,
      "text": "Billy Cobham, after a stunning career playing with a number of jazz giants, most notably Miles Davis, began his solo career by creating one of the best jazz/rock fusion albums of all time. The album, more than any I know of, perfectly straddles the line between jazz and rock, without ever venturing completely over to either side.This disk contains two of the coolest fusion tunes ever created, \"Spectrum\" and \"Stratus\". Both of these tunes, fueled by driving rhythm sections, feature fine melodic sections, fantastic solos, and of course, some of the most amazing drumming you'll ever hear.And while we're on the subject of drumming. Usually, drums solos on any recording are a point of boredom. Not so here. While there are drum solos interspersed throughout the album, they are all very short, each under two minutes, and extremely amazing.Even the laid back \"Le Lis\" is just too cool for words.And Jan Hammer, keyboardist on Jeff beck's best recordings, just flies high here.I cannot recommend this album any higher."
    },
    {
      "reviewer": "friso",
      "date": "Posted Friday, October 16, 2009",
      "rating": 3,
      "text": "Very impressive instrumentation here and Billy Cobham is obviously a musician who contributed a lot to the development of the use of instrument. Cobham played with Mahavishnu Orchestra and this work is in that vain of highly technical fusion (with funk and rock influences) with little melody or musicality when it comes to writing completed pieces of music. All instrumentalist play great solo's and the rhythms are great, but I find this type of record quite dispensable. If you do love this you can also look for works of Jean Luc Ponty, Mahavishnu, Al Di Meola and Return to Forever. I myself prefer to listen to international prog-fusion like Leb I Sol, Finch, Tassavalan Presidenti (Lambertland) and Finnforest."
    },
    {
      "reviewer": "The Quiet One",
      "date": "Posted Sunday, October 25, 2009",
      "rating": 5,
      "text": "The accessible, though effective and addictive, entry to the Jazz Rock world...Being a huge fan of Deep Purple, specially of their record featuring Tommy Bolin, Come Taste the Band, I was searching back then what else had this incredible and unique guitarist had made. First thing to come up was obviously this record, Spectrum by a unknown drummer for me at that time. Bought it with no hesitation, and when I first played it I can assure you that I was no less than astonished! Already from the initial blast-off of Cobham's rapid show-off drumming and Jan Hammer's fast paced Moog, I had to raise the speakers volume up to 11.After having listened to the entire album, I really felt that Tommy Bolin's guitar work in here had really outdone his already marvelous work he had done with Deep Purple. In here he's capable of expressing much more than what he was allowed to express with Deep Purple; a totally mind-blowing mix of powerful rock-esque tones with funk and jazz sensibilities, as well as completely unique crazy sounds: this was immediately shown in the opener, Quadrant 4, though in Stratus can also be easily heard.However that's as far how Tommy Bolin sounded, that said, he's not the only one sparking in here. Already knowing it's a solo album by a drummer, Billy Cobham, (and he's not any drummer) you must expect lots of show-offs by him as well, that is in each of the tunes the intro is done by him solely and of course all along the tunes his presence is always worth of mention; indeed a master of the drum-case.Also, let's not forget of the Moog-master player, Jan Hammer, who few other players can match his proficiency on the synths, Hancock, Duke and Corea come to my mind. In this record he also standouts with lots of fresh sounds and ideas very much alike as he did with Mahavishnu Orchestra, worth mentioning is the eternal duels against Tommy Bolin, in which in the end you really can't be sure who really won, since both offer such creative and blasting solos: clear example of this is Taurian Matador.So far from the descriptions from the standout members makes it seem more of a Rock record than a Jazz one, doesn't it? Well, don't think it's like that, you got Joe Farell, from the early Return to Forever line-up, delivering jazzy sax/flute melodies among some of the tunes, these are: Le Lis and Spectrum. And of course let's not forget that Tommy Bolin, Jan Hammer and Billy Cobham are very inclined towards jazz, so in the end do expect a full- blown Jazz Rock record with lots of funky and rock leanings, but still faithful to the jazz-roots.5 stars: The musicianship on board needs no more mention, while the compositions not actually being the most inventive nor most complex and definitely any of the classic Jazz Rock bands really outdo anything on here on those terms(composition), they still all groove with such energy and become instantly addictive since day one, which in this case few of the classic Jazz Rock bands can manage to do that.Masterpiece by Billy Cobham, Tommy Bolin, Jan Hammer & Co."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Monday, July 19, 2010",
      "rating": 4,
      "text": "Billy Cobham's solo debut happily is different from his previous job in Mahavishnu Orchestra. More funky energetic jazz rock, based on Cobham's excellent drumming techniques and great Jan Hammer electric keyboards playing. Third soloing artist there is future Deep Purple guitarist Tommy Bolin, which is competent, but hardly more.With characteristic to early 70-s fusion sound, this album is really well played and enjoying. Billy demonstrates his great techniques, but in combination with great keys album's sound doesn't become more techniques demonstration, than music ( the problem, very usual for Billy's later works). Some compositions sound really heavy and are more jazz rock, than fusion (Bolin never was good jazz guitarist). The main album's problem in my opinion is there are not great compositions on it. Interesting and really pleasant listening, but not memorable music at all.Possibly the best Cobham's solo album ever, this release is one of important moments from jazz fusion golden age. If you're interested in jazz fusion, you just need to listen this album."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Thursday, November 18, 2010",
      "rating": 4,
      "text": "Spectrumis the first solo album from drum-wizard Billy Cobham, well known from his contributions to Miles Davis and Mahavishnu Orchestra albums. It's a true fusion classic with wildly rocking and engaging jazz-rock, but for a masterpiece it fails me a bit when it comes to the song material.The openingQuadrant 4offers a strange hybrid of big band jazz with frantic Mahavishnu Orchestra aggression. It's a good energizing opener but the mix of styles doesn't entirely do it for me, the main bass line remains a bit too simple and standard jazz.Searching for the Right Doorworks better. After a mystifying percussive opening, the swinging and catchy main theme opens. An intricate jam follows with focused soloing and - if needed mentioning - amazing drumming. The same song pattern is repeated onAnxiety / Taurian Matador, a short drum solo introduces another energy jam. It misses a quality lead melody though. The keyboards and guitar go in overdrive during the extensive soloing. Surely not the most remarkable composition from the album.But then comes true mastership.Stratusis one of the finest funk/fusion tracks ever. It opens with dreamy sound effects and percussion before the dead-catchy funky bass-riff kicks in. It's a phenomenal groove with beautiful melodies and a delicate spacious arrangement that gets more intense as it goes along. In the 90s this groove became famous amongst trip-hoppers when Massive Attack adapted the song by adding soulful female vocals to the main bass line and rhythm. It became quite a cult-hit and one of my favorite 'pop' songs (Safe From Harm).Time to relax to the smooth funk ofLe Lis, a catchy and cool tune with beautiful brass melodies. Also the last track revolves around a slow and sexy dub groove, this time with some bluesy guitar soloing.Spectrumis a fine fusion album with a wide range of compositions of which some are remarkably better then others. But with no real dips, the one masterpieceStratussure warrants a 4 stars overall."
    },
    {
      "reviewer": "Bj-1",
      "date": "Posted Monday, January 24, 2011",
      "rating": 5,
      "text": "You haven't heard drums being played until you have heard Billy Cobham playing them and his collaboration with John McLaughlin and the Mahavishnu Orchestra in the early 70's launched him a solo career after their first split. This is his legendary debut album and teamed up with top notch musicians, notably guitar virtuoso Tommy Bolin who rips it out great on all of the tracks, Cobhams compositions are tight, funky and highly memorable, including the massive fusion hit \"Stratus\" who is one of my favorite songs ever and the holy grail among fusion drummers for decades now. Cobham is a prolific soloist and some short solos occur between several of the tracks, and while they doesn't really add much to the rest of the material they do display Cobhams amazing dexterity around the kit, his speed is out of this world combined with sharply polished technique. A drummers bible and complete gem of 70's fusion music, massively influential and essential, with amazing musicianship."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Sunday, June 12, 2011",
      "rating": 4,
      "text": "Impressive albeit dense jazz fusion by an extremely gifted, energetic drummer and his studio hires, I never heard this album in its heyday but had to wait till seeing all of the acclaim here on PA to discover it. Again, the performances are impressive--and polished--much moreso than the Mahavishnu stuff that came before it--BUT there is not a lot of engaging meat or melody here--not a lot of \"fat\" to this meaty collection of songs. The few songs I return to are more as a reminder of how much growth Billy Cobham did from his 1970 stint with New York to here. The dude must have worked his fat off! The subtleties and nuances expressed herein by Mr. Cobham's virtuosic playing are truly astonishing, I just like a little more melody to keep me engaged. Plus, I'm not really much of a fan of Mr. Hammer's style or sound palette. (Also, I think I was always a bit turned off by his one-handed approach--something he may have perfected in order to promote his mobile keyboard play; left hand/bass clef play is often what really draws me into a keyboard player's style.) nor of Mr. Tropea's guitar tone selection and style. With horn, keys, and some guitar soli trying to attract and keep the listeners attention, it seems that I always fall into the playing of Mr. C. Plus, his drums are recorded so well: every sound and nuance captured so clearly and balanced.As everyone will attest, \"Stratus\" is a monster of a song--much more akin to the Return to Forever sound, in my opinion, than the Mahavishnu sound, but the rest kind of meld together into a kind of sonic mish-mash. (Has anyone else ever wondered if Ted Nugent stole the bass and rhythm tracks from \"Stratus\" to make his \"Stranglehold\" song. The similarities are just too striking.)A good album with at times stunning performances (especially from Mr. Cobham), it is, in my opinion, just not enough to earn \"masterpiece\" status.1. \"Quadrant 4\" (4:20) this must be a song that Jan Hammer and Billy Cobham had left over from their last Mahavishnu Orchestra sessions--the ones that left them frustrated for the lack of input allowed/honored/valued from bandleader John McLaughlin. Jan and guitarist Tommy Bolin get most of the spotlight as Lee Sklar and Tony run a pretty tight ship beneath--neither too flashy but so competent in their tight hold of the speedy rhythm track. Impressive performances but not my favorite kind of music. (8.75/10) 2. \"Searching For The Right Door / Spectrum\" (6:33) Bandleader Billy Cobham starts this one off as a drum solo right from the get go: just him playing as if a one man band with his expanded drum kit. The \"Spectrum\" second half is a horn-supported funk jazz-rock piece with one awesome Ron Carter double bass performance (and ear worm riff). Horns and keys get the first mini solos before Joe Farrell is pushed out front with his soprano sax. Billy and Ron are just chewing up that underside! Jimmy Owens gets the next solo on his flugelhorn. Jan Hammer's support on Fender Rhodes is exquisite. The horns team up for the bridge into Jan's solo as Joe Farrell switches to flute for support. Good solid jazz-rock. (8.875/10) - a. Searching For The Right Door (1:24) - b. Spectrum (5:09)3. \"Anxiety / Taurian Matador\" (4:44) more Cobham showmanship to open this one before the rest of the band are allowed to join in. When they do it's once more at break-neck speed--as if everybody's swarming down a country road on motorcycles, weaving rather recklessly among one another, with Jan and Tommy Bolin exchanging friendly and unfriendly shouts at one another as they go while Lee Sklar and Billy hold down the sane, steady pace. Impressive; I'm just not a fan of this type of speed jazz. (8.75/10) - a. Anxiety (1:41) - b. Taurian Matador (3:03)4. \"Stratus\" (9:50) is like hearing music from the future as Billy Cobham's partner in the opening 3-minute duet is a computer-sounding keyboard. But then everything bursts out of the cosmic soup into a celestial form that is quite similar in form and sound to something from the Mahavishnu project. The rolling bass line is undoubtedly that which prog lovers are drawn to (as well as the masterful drumming display) while the Fender Rhodes holds the song to a key and the fiery guitar of Tommy Bolin burns through the space-time continuum. Jan Hammer is the next artist to get a solo and it's a great one--despite my brain's insistence and listening to the rhythm guitar work of Mr. Bolin. All the while Billy Cobham moves around his kit as if he only has to think it in order for it to happen--it is at times unbelievable how little space is allowed to exist between his stick hits. Though not a great tune, it is catchy (especially that iconic bass line) and very impressive in the instrumental departments. (18.25/20)5. \"To The Women In My Life / Le Lis\" (4:11) now for a little of the future music that we'll soon be calling \"Smooth Jazz.\" The stellar solos are still there (Jan Hammer's Moog) and the contributions of the clavinet and horns definitely add a dimension, but the smooth Latin melody and Latin bass and drum & percussion lines are quite simple and melodic in a way that previous jazz-fusion artists were often loathe to supply. (9/10) - a. To The Women In My Life (0:51) - b. Le Lis (3:20)6. \"Snoopy's Search / Red Baron\" (7:39) a simplified funk piece of funk that harkens back to music like Herbie Hancock's for Bill Cosby Fat Albert and the Cosby Kids show as well as to other Southern Rock-funk R&B blues fusions. A solid song but nothing with plenty of nuanced performances that is nothing that I really feel compelled to sing, hum, or dance to. (13.375/15) - a. Snoopy's Search (1:02) - b. Red Baron (6:37)Total Time: 37:17A prog lover is want to compare this classic album to the one from the other great jazz-rock fusion drummer of the period, Tony Williams' New Lifetime's Believe It!, but they're really two very different beasts. Believe It! (which I just happened to review immediately before Spectrum) is the very clear and concise work of a jazz quartet whereas Spectrum shows a drummer with a more broad and very subtle-swift brushing of many more sounds with the sweeping motions of his sticks; Tony's mastery is shown through a tremendous variety of dynamics employed to his hits within very precise rhythms coming from a much smaller, more traditional jazz kit while Billy's drum kit seems to be a much more expanded Carl Palmer-like kit within which he tries to hit as many items with as fluid and fast a display as if to sound like a wind storm sweeping through a variety of landscapes, both natural and man-modified.B+/4.5 stars; a collection of solid songs from virtuoso musicians whose overall impression is one of a \"near-masterpiece\" instead of a true masterpiece. There is a difference between \"masterful performances resulting in songs that are very interesting to listen to\" and \"great songs that I'm drawn back to for repeated listens over and over because I love the music so much.\" For an album that is a masterpiece because it has eminently enjoyable music on it, go to Billy's three Drum 'n' Voice albums issued between 2000 and 2011."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Saturday, August 20, 2011",
      "rating": 5,
      "text": "Recorded just under a fortnight before the abotive sessions for the Mahavishnu Orchestra's third studio album (which would eventually see release as The Lost Trident Sessions), Billy Cobham's solo Spectrum is a drumming tour de force which also showcases Tommy Bolin's guitar mastery. Fellow Mahavishnu member Jan Hammer gets to indulge a quirkier side of his keyboard playing, and in general the album has a lighter and more playful mood than, say, The Inner Mounting Flame and Birds of Fire. Short, brief, and to the point, the album is a great listen for anyone wanting to explore the classic Mahavishnu lineup's careers beyond the group's first few albums."
    },
    {
      "reviewer": "J-Man",
      "date": "Posted Sunday, December 25, 2011",
      "rating": 4,
      "text": "Having already established himself as one of fusion's greatest drummers through his work with Miles Davis and Mahavishnu Orchestra, Billy Cobham's first solo album even further secured his position as a drumming god. Throughout the course ofSpectrum, Billy Cobham and company dish out some of the most impressive playing you'll ever hear on a fusion album - not at all surprising when you take a look at the star-studded lineup including Tommy Bolin on guitar, Jan Hammer on keyboards, and Lee Sklar on bass (to name but a few). In addition to being an unbelievable journey of virtuosic musicianship,Spectrumis also one of the most important albums in early seventies' fusion. While there's still a very firm root in jazz music, Cobham lets more rock and funk into his sound than many other fusion players were doing at the time. In short,Spectrumis an innovative, technically astounding, and downright essential example of classic fusion.Spectrumshows us right from the very beginning that this is an album that's every bit as directed towards the rock audience as it is for the jazz crowd - the blistering opening number \"Quadrant 4\" makes it clear through its fast-paced drumming and rapid fire guitar and keyboard soloing that this is one of the more unique fusion albums from its time period. The rest of the album rides the border between rock, fusion, and funk, often melding the three into a mix that's distinctly Cobham's own. Most of the album is excellent, but the title track, \"Le Lis\", and \"Red Baron\" have always stood out to me as particularly great. Though most folks disagree, I do findSpectrumoccasionally drifting into endless displays of technicality rather than anything particularly memorable - though the whole album makes for a fun listen, not all of it is especially noteworthy once its playing time is over. I think this is something that Cobham perfected on future releases, and I actually regardTotal Eclipseas a much more consistent release thanSpectrum. That's not to discount the music onSpectrum, however - Cobham clearly wrote some great tunes for this album, but I just tend to think that his skills sharpened even more over the next few albums.Even thoughSpectrummay not be my favorite release from Billy Cobham, there's still no denying that this is a spectacular classic fusion album. The musicianship is through the roof, the production is sleek and professional, and the majority of the music here is memorable - factor in the historical importance, and it looks likeSpectrumis an essential listen for any fan of the genre. I always have a great time when I hearSpectrum, and I'd say 4 stars are well-deserved for this impressive debut."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Sunday, October 21, 2012",
      "rating": 4,
      "text": "Mahavishnu Orchestra legend Billy Cobham is one of the drum masters and on his debut album he unleashes a furious tirade of percussion madness along with his amazing congregation of virtuoso musicians. The opening track of \"Spectrum\", 'Quadrant 4', is an incredible adrenaline charged belter, featuring frenetic lead guitar of Bolin that blazes with wah wah and high string bends that will astonish. There is a strong jazz rock feel present with the percussion but it is the lead guitar soloing and the Moog solos that makes this a masterpiece track.Next up is a drum solo that is very emotionally riven ranging from outbursts to restrained measured tempos. The track 'Searching For The Right Door/ Spectrum' is certainly a jazz fest of woodwind, bass, drums and guitar virtuosity. The sax soloing is as mind blowing as Banton at his best.Next is 'Anxiety/ Taurian Matador' that is again broken into 2 sections, the first being a short interlude of drum power, and then an outbreak of jazz lunacy. Bolin's guitar work is excellent again, with trade offs between the Hammer's keyboard phrases.'Stratus' follows a 9:50 piece, that received accolades over the years and even reached the masses as an edited single. I love Sklar's pulsating bass on this and melodic hooks that lock into a cool groove. This one simmers along beautifully, with some psych space rock sounds, and an overall jamming vibe like the psychedelic 60s.Next is 'To The Women In My Life/ Le Lis' with piano at first and then reaching deep into a well of Latin tones on trumpets. The funky vibe is cool but this is not my favourite style, though not a bad break from the wild music previous. 'Snoopy's Search/ Red Baron' follows, opening with space invader electronic effects that are outdated but fun in a retro sense. Then a cool as ice jazz groove locks in with some great guitar work.Overall this is an incredible procession of jazz brilliance focussing on the drums, similar to the infamous \"Let There Be Drums\". At least one of the tracks here ends up on a compilation, sometimes all three 'Quantum 4', 'Stratus' and 'Snoopy's Baron', and sometimes even more. It certainly is one of the best jazz fusion albums I have heard, on a par with Mahavishnu Orchestra."
    },
    {
      "reviewer": "stefro",
      "date": "Posted Wednesday, November 7, 2012",
      "rating": 5,
      "text": "Arguably the finest drummer to grace the 1970's rock sphere, fusion exponent Billy Cobham has truly enjoyed a lengthy and highly-successful career. As well as having played with some of the very finest in the business - the likes of Miles Davis, Mahavishnu Orchestra and Herbie Hancock come to mind - Cobham has also managed to produce two of the era's key fusion albums in the shape of this dynamic debut release and the atmospheric 1974 follow-up 'Crosswinds', albums that helped define a movement despite the fact that they both appeared several years after the genre's major trailblazer 'Bitches Brew'(1969) had been issued. Alongside the likes of John McLaughlin's Mahavishnu Orchestra, Return To Forever featuring Chick Corea and Herbie Hancock, 'Spectrum' belongs to that unique set of 1970's fusion artists who were informed by the late- sixties experiments of Davis, Ted Macero and Tony Williams yet also took the genre one step further, integrating funk, psychedelia, Eastern raga modals and cosmic sound collages into a what would now simply be known as 'fusion'. Of these albums issued, 'Spectrum' seems the most indelible, as well as being one of the most revered, both by older listeners who were there during the 1970's and by a new, contemporary audience of fans, critics and artists who have used the album as an influential cultural reference point. With the British dance trio Massive Attack sampling the gloriously-funky bass-line of 'Stratus' for their seminal track 'Safe From Harm', 'Spectrum' is now an album that has transcended the decade of its creation. It's an album that features an intricate electric sound, filled with blistering guitar strikes, galloping bass bumps and skittering beats when fast; dipped in fuzzy synthesizers and wandering off via neon-flecked keyboard ambles into that wonderful mystical midnight ambience that only jazz can create during the musics calmer moments. Apart from the nine-minute stealth rock of 'Stratus', highlights - which are many - include the twittering sonic swirl of opening track 'Quadrant', and the dreamy, acid-lounge-licked multi-parter 'To The Women In My Life'. Both tracks segue both furiously and calmly - sometimes at the same time - through a rapid-fire journey of thrilling instrumental face-offs, the interchange between Cobham's quicksilver druming and the neon-dropped keyboards, throbbing bass-lines and stammering guitars of his ultra-talented backing players(a set which includes Mahavishnu keyboardist Jan Hammer and guitarist Tommy Bolin amongst others) proves thrilling throughout, showcasing not just Cobham's technical prowess but also his deft compositional abilities, a fact imbued by the make-up of the songwriting credits; Only Cobham's name appears. Considering the overall quality of 'Spectrum', its fair to say then that Cobham truly deserves his place in the pantheon of great modern jazz men. This is a high sophisticated and technically dazzling record, filled with memorable beats, hooks and solos and undoubtedly one of the 1970's very best. STEFAN TURNER, STOKE NEWINGTON, 2012"
    },
    {
      "reviewer": "Magnum Vaeltaja",
      "date": "Posted Friday, February 26, 2016",
      "rating": 4,
      "text": "Billy Cobham's debut is a jazz fusion classic.Being written entirely by a drummer, this album is obviously quite drum-centric. And there's no problem with that because even though drums are the highlight of the album, there's still plenty of time to appreciate the other players, such as Tommy Bolin (soon to join Deep Purple) on guitar and Jan Hammer on keys. \"Spectrum\" is very evocative of urban, nocturnal moods and ranges from exhilarating up-tempo jams (\"Quadrant 4\") to subdued, more \"pornographic\" soundscapes, such as \"Le Lis\" and it's not hard to get lost in the grooves and get swept away by the music, which is exactly what great jazz should do. The production on the album is strong throughout and there are no weak performances. The only reason that I'm tempted to give this a 4 star review as opposed to declaring it a fusion masterpiece is due to the fact that the album was recorded very spontaneously in only 2 days and as a result a lot of the compositions don't seem fleshed out. The shorter tracks, especially the drum solos, tend not to move the listener nearly as much as the longer pieces, such as \"Stratus\" and \"Red Baron\".While not being \"perfect\", \"Spectrum is still a jazz fusion album that anyone can get into and that I would highly, highly recommend for drummers to listen to. 4 stars."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Thursday, August 8, 2019",
      "rating": 5,
      "text": "Panamanian born BILLY COBHAM moved to the USA at the tender age of 3 and started playing drums the very next year at 4 in his new Brooklyn, NY based place of youth and would go on to study at The High School of Music & Art. Unfortunately COBHAM got drafted into the US Army in 1965 but escaped the battlefields of Vietnam by playing in the US Army band but it was after his discharge when his career really took off when he played with Horace Silver and as a session musician for bands such as CTI and Kudu. After a short gig in the band Dreams with other jazz greats like Michael Brecker, Randy Brecker and John Abercombie, COBHAM hit the big time by appearing on Miles Davis' early contributions to the fledgling jazz-fusion scene on the classic albums 'Bitches Brew' and 'A Tribute To Jack Johnson.'It was playing with Miles where BILLY met another up and coming jazz-fusionist, John McLaughlin and the two would continue on to start one of the early 70s most revered bands in the form of the Mahavishnu Orchestra which took jazz, rock and ethnic fusion into the stratosphere and in the process created one of the most successful progressive bands of the entire era. The band played extensive gigs and released three albums but none of the members were really interested in the glory of rock star superstardom and the pressures and fatigue set in and the band fell apart. Fresh from the exhaustive journey with the Mahavishnus, BILLY COBHAM wasted no time working on his own material for his solo album and after recruiting a handful of talented musicians to accompany him on his new endeavors. The wheels were greased for the making of BILLY's debut release SPECTRUM which emerged in 1973 just as the Mahavishnu Orchestra was calling it quits.In many ways SPECTRUM was a recap of COBHAM's previous works with Miles Davis, the Mahavishnu Orchestra with the funk jazz of artists like Herbie Hancock. The album consists of six tracks of which three have subparts used as intros. The album is basically a mix of two lineups with COBHAM leading the way behind his massive drum kits along with keyboardist Jan Hammer following his footsteps fresh from the Mahavishnus himself. The rest of the musicians were technically sessions musicians with guitarist and future Deep Purple member Tommy Bolin and bassist Lee Sklar playing on four tracks (\"Quadrant 4\", \"Taurian Matador\", \"Stratus\" and \"Red Baron') and saxist, flautist Joe Farrell, flugelhorn player and trumpets Jimmy Owens, guitarist John Tropea, acoustic bassist Ron Carter and conga player Ray Barretto playing on the other two tracks (\"Spectrum\" and \"Le Lis.')This was COBHAM's debut as a composer and he steered his new musical creation into extremely diverse territories that offer a taste of the fiery bombast of what the Mahavishnu Orchestra offered as well as tender atmospheric funk driven grooves that offer touches of the zeitgeist of 60s psychedelia along with the Panamanian Latin roots of COBHAM's origins. The album was also a surprise hit for COBHAM as it hit #1 on the jazz album charts and #26 on the Billboard album charts signifying that the fans were along for the ride for COBHAM's next musical career change. The album is electrified from the very beginning as 'Quadrant 4' opens with an eruption of percussive beats and a ripping guitar solo that continues to build up steam until the bass and keys join into generate a top notch funkified jazz-fusion sound that marries the jazz-fusion sensibilities of Miles Davis with a fiery brand of heavy rock in the vein of Led Zeppelin, Deep Purple and many other popular bands of the era.After the no nonsense opening bravado, 'Searching For The Right Door / Spectrum' begins the process of more thoughtful jazz fueled compositions. Once again opening with a strong drumming solo performance the track bursts into the guitar free zone with the emphasis firmly placed on the Moog synthesizer, flute and ever present groovy bass. The track takes on some Mahavishnu characteristic with demanding time signature changes and keyboard tradeoffs along with some sizzling sax workouts along with a tremendously tempestuous trumpet performance. 'Anxiety / Taurian Matador' as the name implies begins with a fiery heavy rock drum soloing intro before another cleverly composed mix of jazz, rock and funk only Bolin's guitar antics that began the album are on full display once again.'Stratus' exhibits a more disciplined restraint with subtle atmospheric constructs slowly percolating up to the point COBHAM begins to deliver another stellar drumming frenzy with some experimental electronic keyboard touches but ultimate three minutes in the track turns into a groovy bass driven track with funk guitar only augmented with jazzy chord progressions and a controlled series of guitar licks that lead to more energetic outbursts of freneticism that manage to maintain a firm grip on the overall melodic construct. 'To The Woman In My Life / Le Lis' starts out as a piano ballad but quickly becomes a swinging sultry display of a groovy bass along with beautiful wind instrumentation. It's also unusual in that COBHAM didn't play on the track and allowed Hammer to create an unaccompanied piano piece. The album ends as brilliantly as it began with the ridiculously cool 'Snoopy's Search / Red Baron' which starts a series of experimental synthesized sound effects that sound like something off of a Klaus Schulze or Tangerine Dream album before finishing the album off with another strong jazz-fusion meets keyboard funk number with the now well established virtuosic displays of percussive drives and keyboard wizardry.SPECTRUM may not have been as revolutionary as COBHAM's works with Davis or the Mahavishnus but what he does accomplish on his debut album is to prove once and for all why COBHAM has been designated as THE top drummer in all the world of the jazz- fusion. Not only does he display a cool as a cucumber approach of restraint and a healthy mix of both allowing the other musicians to have their moments as well as letting loose himself but he also showcased his abilities as a composer that nurtured six super strong tracks into fruition. I have to admit that SPECTRUM was somewhat of a grower. It struck me instantly as a 4 star album for its brilliant performances but only after several listens did the subtle start to seep into my consciousness. SPECTRUM may not be a free for all display of virtuosic wankery that defined the Mahavishnu Orchestra and it may not carry the same abstract detachment and musical construct of the more surreal moments of Miles Davis but rather it took elements from both and crafted a more accessible funk fueled visionary approach that would be made popular by fellow jazz artists like Herbie Hancock. In other words, this is a flawless and totally fun album."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album56e9.html",
  "last_parsed": "2025-05-18T00:11:17.629958"
}