{
  "album_title": "H TO HE, WHO AM THE ONLY ONE",
  "artist_name": "Van Der Graaf Generator",
  "artist_page_link_local": "artist8c00.html?id=343",
  "year": 1970,
  "rating_value": 4.32,
  "rating_count": null,
  "review_count": null,
  "genre": "Eclectic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/343/cover_4614151042016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Killer",
      "duration": "8:07",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "House With No Door",
      "duration": "6:03",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "The Emperor In His War-Room",
      "duration": "9:04",
      "is_sub_track": false
    },
    {
      "number": "a",
      "title": ") The Emperor",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "b",
      "title": ") The Room",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 4,
      "title": "Lost",
      "duration": "11:13",
      "is_sub_track": false
    },
    {
      "number": "a",
      "title": ") The Dance In Sand And Sea",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "b",
      "title": ") The Dance In The Frost",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 5,
      "title": "Pioneers Over C.",
      "duration": "12:05",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Squid 1 / Squid 2 / Octopus",
      "duration": "15:24",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "The Emperor In His War-Room (first version)",
      "duration": "8:50",
      "is_sub_track": false
    }
  ],
  "lineup": [
    {
      "musician": "Peter Hammill",
      "instruments": "lead vocals, acoustic guitar, piano (2)"
    },
    {
      "musician": "Hugh Banton",
      "instruments": "Hammond & Farfisa organs, piano, oscillator, bass (2,5), vocals"
    },
    {
      "musician": "David Jackson",
      "instruments": "alto, tenor & baritone saxes, flute, Fx, vocals"
    },
    {
      "musician": "Guy Evans",
      "instruments": "drums, timpani, percussion"
    },
    {
      "musician": "Nic Potter",
      "instruments": "bass (1,3,4)"
    },
    {
      "musician": "Robert Fripp",
      "instruments": "electric guitar (3)"
    }
  ],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Wednesday, February 4, 2004",
      "rating": 4,
      "text": "With this strangely titled album, VDGG take you one step further into their sombre and lugubrious world. As potter exits throughout the album, Hugh Banton will handle that duty as well as most of the keyboards. However, as remastering job clearly reveals ( much better dynamics gives new life to bass lines) , it is obvious Banton is not as good as Potter was, but this is rather tenuous.With the concert favourite ( but not mine) Killer to start up side 1 with its rather silly (IMHO) lyrics lamenting shark's loneliness at sea, one can see/hear the difference the remastering does but this is even more obvious in the next House With No Door that gains a new life especially with the good Banton bass lines. However the track gaining most is The Emperor: this track used to bore me stiff but this is simply not true anymore with Monsieur Fripp making a superb appearance again much bolstered by the re-mastering job.The second side is a mixed bag as it contains my fave track, but also a very flawed second track. Lost is rather like the pinnacle of the album with the song meandering between the many moods and Hammill's voice together with Jackson's sax sends shivers down my spine still some twenty years after. Pioneers Over C has many orgasmic moments but also a few flaws, of which the weak Help Me chorus that is so obvious it becomes weak, the other being the semi Free jazz sax solo that gets simply ... lost! (Have they got their track titles mixed-up?) Not as bad as I make it to be , but here although the re-mastering job still does marvels , a good song-rewriting (correcting more an just the two flaws I mentioned) would help even more.The first bonus track is a real gift, being a live-in-the-studio track holding many improvs that can only give us a hint of what was VDGG in concert at that time. It holds some magic moments and some lengths, but it is an outstanding track. The second bonus track (The Emperor) is less interesting as it can be considered as an alternate take, although there are some notable differences. If it had the Fripp intervention on this version , I might even like it better than the album version.Again, this album is also available in mini-Lp sleeve and if you are to buy the remastered version, you might want to make the little extra financial effort to acquire the superb Paul Whitehead-signed gatefold sleeve."
    },
    {
      "reviewer": "Peter",
      "date": "Posted Tuesday, February 24, 2004",
      "rating": 5,
      "text": "1970 was a watershed year for progressive rock. That year saw the newly-born musical form -- in the shape of bands like Genesis, Yes, Jethro Tull, and Gentle Giant -- gain strength and conviction, consciously exploring and exploding the \"limits\" of rock, with a spirit of pure unfettered experimentation. Two pioneering bands who had been key progressive rock players from the genre's emergence each recorded their third albums late that year: King Crimson's eclectic LIZARD added overt jazz flavours to the mix, and Van Der Graaf Generator's oddly-titled H TO HE, WHO AM THE ONLY ONE (the first part of the title refers to the thermonuclear fusion of hydrogen to helium in the sun) further expanded the boundaries of progressive in the form of an oftimes dark, and sometimes disturbing masterpiece.The two albums have more than a passing resemblance: Like LIZARD, \"H TO HE\" has strong jazz influences, largely expressed through the dynamic sax of David Jackson. In addition, Crimson's Robert Fripp puts in a guest appearance on the Van Der Graaf album, adding his trademark electric guitar to \"The Emperor in His War Room.\" Furthermore, both LIZARD and \"H TO HE\" are prime examples of \"difficult\" albums that can be initially challenging, but ultimately very rewarding auditory experiences. I was a latecomer to the music of Van Der Graaf Generator, and I admit that it took several listens before this disc really began to \"sink its hooks\" into me. Yet I soon found that I was no longer playing the disc out of a sense of duty for reviewing purposes, but as a source of musical pleasure. I use the word \"pleasure\" guardedly, however, because founder and lead singer Peter Hammill's introspective lyrics are often illustrative of the axiom that \"some of the best art arises from pain.\"On the disquieting, almost menacing opener \"Killer,\" Hammill sings of a monster fish born \"on a black day, in a black month, at the black bottom of the sea\" that, though \"very lonely,\" kills all that draw near, then muses that \"I'm really rather like you, for I've killed all the love I ever had.\" Death, loneliness, and the need for love are recurring themes on this brooding work. \"House With no Door,\" aided by Hugh Banton's melancholy piano and Jackson's flute, offers an effective, sadly beautiful portrait of the artist as a tortured man, imprisoned in the cavern of his skull, whose self-made \"walls\" have shut out the love that he so desperately needs and craves. The aforementioned \"Emperor in His War Room\" deals, through gruesome imagery, with the wages of a misspent life: \"Begging for your life, as the impartial knife sinks in your screaming flesh.... You must pay the price of hate, and that price is your soul.\" The next song, \"Lost,\" is perhaps the album's strongest (with the final track, it also contains many of the disc's more up-tempo, heavier moments), and finds Hammill, with a voice that favourably compares to that of Gabriel in its embittered and impassioned delivery, addressing the spectre of a lost love.Throughout the disc, Hammill's singing is very strong. Sometimes he almost whispers, sometime he nearly screams and spits out his lines, while at other moments he affects a falsetto that may well have helped shape the later vocal acrobatics of Gentle Giant. Peter Hammill is certainly no boring or undistinguished vocalist! At several junctures, his singing reminds me of Bowie's during his MAN WHO SOLD THE WORLD era, and the final track, the bizarre, science-fictional \"Pioneers Over C\" has a theme which is reminiscent of Bowie's \"Space Oddity\" -- that of a lost and lonely spaceman.As with LIZARD, I wouldn't want to listen to this CD too much; hearing Hammill's searing depictions of inner pain, self-loathing and regret can be cathartic (he's likely worse off than you!), but also disturbing. Still, H TO HE, WHO AM THE ONLY ONE, is a classic recording that is a must for Van der Graaf fans, and essential listening for all who would discover just how wildly experimental, powerful and moving progressive rock could be in its infancy!"
    },
    {
      "reviewer": "lor68",
      "date": "Posted Sunday, April 4, 2004",
      "rating": 4,
      "text": "Another winner, a bit inferior than \"Pawn Hearts\", even though in a number of songs it's also more influential than \"Pawn Hearts\", sometimes with a major impact on the common listener. It depends on our tastes naturally: think of \"Killer\", but also \"Emperor in His War-Room (Part 1: The Emperor, Part 2: The Room) \", which is absolutely original and creative too, despite of being less influential for example than the mythical suite \"Plague of Lighthouse\", from \"Pawn Hearts\". It never minds, to me this album is recommended anyway!!"
    },
    {
      "reviewer": "Proghead",
      "date": "Posted Friday, May 7, 2004",
      "rating": 5,
      "text": "It's amazing how much this band improved in the span of three albums. Just listen to the AEROSOL GREY MACHINE and you'll find a band more or less sticking in the psychedelic realm, with some folk overtones. The Least We Can Do is Wave to Each Other is the band finally finding their trademark sound, thanks to the inclusion of David Jackson. But you can tell, just by listening to that album that even better things were to come, and that would be their next two albums. Of course, I'm focusing on \"H to He Who Am the Only One\". I own the American LP version on ABC/Dunhill which features the same basic artwork, but with different background, and the lyrics included in the gatefold, rather than the back cover.The album opens up with \"Killer\", dominated by David Jackson's sax. A little known prog band that recorded for RCA/Neon called Raw Material recorded a song called \"Ice Queen\" for their 1971 album Time Is, which bears more than a passing resemblance to \"Killer\". \"House with No Door\" is a piano-oriented ballad, while \"Emperor In His War Room\" features some killer spacy organ from Hugh Banton, Robert FRIPP even makes a guest here! The music gets lengthier with \"Lost\" and one of my all-time favorite VdGG compositions, \"Pioneers Over C\", in which the artwork in the gatefold represents this song. The lyrics obviously have strong sci-fi overtones, with a spacy sound. Might not be their most aggressive album, but a must have for all Peter HAMMILL/VdGG fans."
    },
    {
      "reviewer": "James Lee",
      "date": "Posted Monday, June 21, 2004",
      "rating": 2,
      "text": "Definitely one of the most important links in the psychedelic-progressive chain; a nice transition work somewhere between DONOVAN's storytelling and \"Court of the Crimson King\".\"Killer\" starts with easily approachable (for the time, anyway) sounds and hooks- organ and guitar rock, with a bit of sax. The vocal soon lets you know this isn't your typical freak-out; violent marine imagery wasn't widely used among the hippie bands. The normal disappears even further after the first chorus, with a lysergic guitar solo over tumbling keyboards. A queasy sax takes over, oscillating wildly, and eventually brings us back to the verse. This time there's no doubt he's using metaphor- he pretty much tells us- and then it's a quick return of the main riff and a big finish.\"House With No Door\" is another emotional metaphor song, couched in a laidback piano ballad. I think of pre-70s Bowie (you know, the album with Wakeman...), and unfortunately also of Tim Curry at the end of \"Rocky Horror\". Hamill definitely wants to get his point across, and carrying a tune- or fitting the lyrics to the space given- is a secondary consideration. It's a pleasant song, even if it does get a little redundant by the time they're done with it.\"The Emperor in His War Room\" gets a bit more like CRIMSON with the help of a guest guitarist, and also features some good flute work and harmonies. This is a bit moodier in tone, going from a dark and slow feel for most of the song to a wilder climax, and the lyrics are more abstract and dramatic than the previous songs.\"Lost\" tempts us with some jazzy passages and unusual chord changes, but the basic feel of the album remains the same in the vocal sections. It's romantic desperation here, and somehow feels like the climax to a larger work. Strangely, the guitar work is more characteristic of Fripp than \"The Emperor\"- even though it's no longer Fripp playing. The movement from opening to climax is well-paced and more natural than the other epics on the album, but the more progressive sections seem to have little to do with the rest of the song.\"Pioneers over c\" starts very like an early space jam by PINK FLOYD (\"Set the Controls for the Heart of the Sun\") but adds some spiky groovy sections to shake up the flow a bit. Hammill pulls out all his vocal tricks, for better or worse (the harmonies are nicely spooky but the falsetto is a little too Tiny Tim); there are some musical explorations here as well, especially near the close of the piece.VDGG has certainly earned a place in the hearts of fans of classic prog, despite (or, I suspect, because of) a much smaller recognition factor than the other giants of the first wave. It is a unique sound, mainly due to Hammill's vocal style, and captures the feel of those first movements on the road to prog as we know it. Personally, after years of attempts to find value in the band I'm still ambivalent at best; I appreciate them for their place in time, but I'm not bowled over by the musical performances or the theatricality, and the emotional content of the album is at best an uninspired, pretentious mawkishness. Many people have found real delight and satisfaction from this album, so I must grumpily defer (the way I do with DREAM THEATER, among others) and objectively rate this one rank higher than I believe the album merits on its own."
    },
    {
      "reviewer": "Carl floyd fan",
      "date": "Posted Tuesday, September 21, 2004",
      "rating": 4,
      "text": "A little bit of a let down after the 2nd album because there is only one mood for the most part and there are no real big changes of pace like the 2nd album (from calm to, literally, impending doom). Still, this is a classic in its own right and is worth the money you pay for it because the musicians are passionate about the music they play and very talented."
    },
    {
      "reviewer": "Eetu Pellonpaa",
      "date": "Posted Monday, April 4, 2005",
      "rating": 4,
      "text": "This album introduced me to the music of VAN DER GRAAF GENERATOR, which took some time for me to digest. There are some elements in their style that I don't like even today, but the good things really please me. A-side of the LP with three first tracks is awesome, but the seconds side is too cacophonic for me. Aggressive changes in and the moods created didn't please me very much. Still even so, the first side makes this as a worthwhile album. The lyrics are wonderful, and at least once the globe in the album cover doesn't show America in it."
    },
    {
      "reviewer": "Seyo",
      "date": "Posted Saturday, April 30, 2005",
      "rating": 5,
      "text": "I might have overrated \"Least We Can Do...\" out of personal and emotional reasons, but \"H to He\" is a bit stronger album for sure. Nic Potter is still present, while Fripp as guest in \"Emperor in His War Room\" gives a Crimsonesque sound to this track. The whole side 1 is amazing with \"Killer\" and \"House with No Door\", impeccable musicianship with confident Hammill vocals. \"Lost\" and \"Pioneers\" on the flip side (of a vinyl) are more requiring efforts, not very captivationg on the first listen, but very rewarding when finally you learn how to appreciate it! Overall masterpiece with dark gothic feeling, space philosophy and jazzy/avantgarde improvisations. 5+"
    },
    {
      "reviewer": "Bj-1",
      "date": "Posted Thursday, May 5, 2005",
      "rating": 5,
      "text": "Though their next album, \"Pawn Hearts\", is my favorite VdGG album, this one is the one that I return most often too. With one of the greatest songs opening the album the music slips deeper into claustrophobic darkness as the album progresses, builiding on one main conceptual theme - isolation. The contrast between haunting beauty and madness is really remarkable here and creates a very unique mood to it all. The bleak and haunting mood of the music really relates to Peter Hammill's lyrics, making for an intense and subtly unnerving listening experience that is hugely rewarding in the end, something that the band continued doing (for an even more frightening effect) on their next album. This is done superbly on tracks like \"Emperor in his War-Room\" and the closing epic \"Pioneers Over C.\" especially. This is definitely one of my favorite albums both musically and conceptually and should be listened to on headphones, alone in the middle of the night for best effect.Highlights: The whole thing."
    },
    {
      "reviewer": "penguindf12",
      "date": "Posted Monday, June 20, 2005",
      "rating": 5,
      "text": "This is VAN DER GRAAF GENERATOR's first mature album, with all musicians more or less established by now. The exception is Nic POTTER, who plays bass on some tracks before he had decided to leave and have Hugh BANTON cover on organ pedals. Otherwise, the lineup is as usual: the ever-strange Peter HAMMILL and his unique vocals, David JACKSON's haunting, and sometimes frentic sax, Hugh BANTON's ghastly organ textures, and Guy EVAN's virtuosic masterful drumming.VAN DER GRAAF GENERATOR is perhaps the most underrated and unrecognized band of all the 70s prog groups. They lie on the fringe of fame, and are perhaps the best band never to break the American market (although they were wildly popular in Italy). Their brand of dark symphonic rock and existentialist ponderings are simply magnificent, and it's really a shame they didn't do better than they did.All of the songs on \"H to He\" (which refers to \"the transformation of Hydrogen to Helium, creating vast amounts of energy with power our universe\") center around the universal theme of lonliness, aloneness, and recluse. The first song is \"Killer,\" a catchy, dark song about a fish who kills everything it loves, and is thus lonely. The lyrics are somewhat awkward and sophomoric, but the message still reaches through. There is a strange dark psychadelic jam somewhere in the middle, featuring a cavernous organ and freaky sax honks. Also noteable is the acoustic guitar which appears in the background, one of the few times HAMMILL actually plays.\"House with No Door\" is a piano ballad, with the main focus being the lyrics. There is also a bass somewhere in the track, which BANTON plays, that sounds excellent, and some flute courtesy of JACKSON that sounds wonderful. The song deals with the theme of being trapped in a house, a metaphor for yourself and the fact that we are all trapped within ourselves, essentially alone.War, and the decay and death which it causes and is created by is the theme of \"The Emperor and His War-Room.\" The main focus is a general, an emperor of war who knows nothing but how to kill. He is essentially a victim of his circumstances, doing what he does because it is all he knows. This is the literal interpretation of the fish in \"Killer,\" the real-life example that that song explained metaphorically. The first half, \"The Emperor\", is a pondering montage of shadowy imagery and ghostly flute and organ backdrops. Halfway through the song is a bridge over which Robert FRIPP lays down the only electric guitar on the album, which leads into \"The Room.\" This section is much more catchy, with lyrics that sum up the Emperor's situation and creates a final climax.\"Lost\" is the traditional theme of post-breakup loneliness and hopelessness, drawn out to great epic lengths by HAMMILL. The music seems to float in and out, tons of themes segueing together in random fashion. This doesn't make it bad by any stretch of imagination, just harder to describe.The final song, \"Pioneers over C\" is musically in a similar fashion as \"Lost\", with many themes strung together. This song is more epic and spacey than the last, the sci-fi theme of space pioneers travelling at the speed of light (C, as in E=MC2) and becoming trapped in a bodiless, empty world of eternal nothingness. The sax goes really insane towards the end, and a theme in 14/8 appears towards the end, looping on and on endlessly as it slowly fades into a spacey, atmospheric section.Overall, the album, is not quite as mature as \"Pawn Hearts\", but still every bit as good musically and lyrically. However, the structure is not quite as organized as the next album, giving the album a more drifting, haunting feel. Highly recommended to people who are in the mood for something different, something dark, or something good."
    },
    {
      "reviewer": "Trotsky",
      "date": "Posted Tuesday, June 28, 2005",
      "rating": 5,
      "text": "One of my favourite prog albums of all time, H To He is a compelling document of Peter Hammill and VDGG's dark vision. While other albums contain great songs such as Refugees, After The Flood, A Plague Of Lighthouse Keepers and Scorched Earth, none have hit me as consistently as this one.Every piece bristles with intensity. The opener Killer, about a mean-ass fish that craves companionship, is perhaps the ultimate example of VDGG's ability to rock without guitars. The sax of Jackson and organ of Banton (one of the deadliest and least acknowledged combinations in rock) hit the spot time and time again as the rhythm section of Nic Potter (who left halfway during the recording of this album, which led Banton to fill in on bass for House With No Door and Pioneers Over C) and the efferverscent drummer Guy Evans breeze through moods and time signatures effortlessly.And then there's the incredibly gloomy House With No Door (frequently cited as one of the bleakest songs in all of prog) which is another example of Hammill's extraordinary power to break your heart with just a few words. His uncertain screamed falsetto as his \"body rejects the cure\" is nothing less than a lethal weapon and aided and abetted by some glorious flute playing from Jackson and a double keyboard outro (Hammill on piano and Banton on organ) it ensures that House With No Door is yet another unforgettable VDGG song.The Emperor In His War Room is probably the closest VDGG comes to \"conventional\" symphonic prog as practised by the likes of Genesis. With Banton building up an enormous wall of organ sounds before a fusion-inspired solo exchange between Jackson and King Crimson's Robert Fripp guesting on guitar, this piece is a thing of beauty.The desolation that informs much of VDGG's music charts new territory on the totally intriguing sci-fi piece Lost, \"I know we'll never dance like we used to \" could easily sound lame in the hands of numerous other singers, but Hammill is nothing if not an artist. The strange interchanges between beautiful symphonic melodies and harsh, occasionally discordant jazzy passages are damn impressive and I also really like the space that the band find in the mid-section when they deconstruct and then recalibrate this 11-minute epic with a monstrous ending sequence.This wouldn't be a classic prog album without one whopper of a closing track and while Pioneers Over C probably has my least favourite vocal melody of the five brill tunes here, it is perhaps the most ambitious cut of the lot. At times barely audible, often ethereal and on occasion downright ferocious (and yet hardly containing a solo of note!) this is yet another VDGG tour-de-force that emphasises that the band's music is not for the faint-hearted.Overall, this album is a virtually flawless exhibition of inspiring, challenging, emotionally-draining progressive rock music, and it really must be heard by everyone. ... 92% on the MPV scale"
    },
    {
      "reviewer": "con safo",
      "date": "Posted Saturday, October 29, 2005",
      "rating": 5,
      "text": "The first VdGG Masterpiece.H To He Who Am The Only One was my first exposure to VdGG, it was a hard album to understand on first listen, but after a few listens its true beauty is realized. The exclusion of electric guitar in most songs may seem odd to some but VdGG create music like noone else. Hugh Banton (Organ) and David Jackson (Sax) create a swelling, swirling texture that is VdGG's alone. All complimented brilliantly by Guy Evans fantastic and original drumming style. But VdGG could not be mentioned without naming the seemingly insane but ultimately brilliant front man Peter Hammill. His vocal style is all his own, and his versatile delivery is unmistakable.The album opens with one of my favorite songs of all time, \"Killer\" a song about a killer fish living in the ocean who longs for love and companionship but is essentially doomed to be alone due to his killer instincts. Sounds quite silly but Hammill makes it work. The music is the real treat in this song, peter Hammill's slight acoustic contribution mixes great with Hugh's sinister organ, and David Jackson gives one of the most insane solo's of his career, squealing and unpredictable, this is a heart attack put to music.\"A House With No Door\" is a rather depressing track lyrically, but one of the most beautiful VdGG compositions as well. Mournful piano and beautiful flute, delicate and dark, all a perfect backdrop to one of my favorite Hammill performances. \"The Emperor in His War Room\" is again a very dark song about the consequences of living a life of war and death. The song describes the torture and eventual killing of the emperor without mercy, Hammill's delivery is very vivid and powerful. The song also features the guitar of King Crimson front man Robert Fripp, adding some much needed magnitude to the track.The last two songs are the high point of the album, two 10+ minute masterpieces. \"Lost\" is a song about lost love and the madness, fear and confusion that ensues. Quite frantic at times, but musically brilliant. David's eccentric sax is the highpoint of this song and remains one of Jackson's crowning moments IMO. The final song \"Pioneers Over c.\" is a brilliant closer to this album, a long spacey song about a space mission gone wrong, where upon reaching the speed of light the crew is sucked into an alternate universe, and all on the ship become lost in a place unknown, \"dimly aware of existence\" and doomed to float in a living death for all eternity. Quite the trip. Near the end of the track all structure seems lost when Dave's sax is the only instrument playing only to explode into a psychedelic and atmospheric freak out, an immense but eerily beautiful passage. The song regains structure and the song ends with only Hammill's voice: \"I am the one who crossed through space, or stayed where I was, or didn't exist in the first place\" classic Hammill, and a very fitting ending to this trip of an album!A masterpiece of progressive rock, and an essential addition to any prog fans collection! 5/5 - con safo"
    },
    {
      "reviewer": "Marc Baum",
      "date": "Posted Wednesday, November 30, 2005",
      "rating": 5,
      "text": "Van Der Graaf Generator - H To He, Who Am The Only One Review of Remastered Edition by EMI/Virgin 2005Years before, I listened to my original copy of \"H To He, Who Am The Only One\" and focused that it needs something like a new issued version. Well, EMI/Virgin must have been listening because my prayers have been answered. H to He is the first one I've picked up and based on the excellent quality I will absolutely be getting more. Peter Hammill himself handled the spiffy remaster, in consultation with his former bandmates, all of whom were involved in the production of this series. There is a 16-page book with lyrics, photos, credits and liner notes, and best of all two bonus tracks, a studio run-through of \"The Emperor in his War Room\" recorded 6 months before the album version, and the legendary \"Squid/Octopus\" recorded live in the studio.VDGG were a progressive rock group of the highest order, featuring keyboardist Hugh Banton, drummer Guy Evans, woodwind virtuoso David Jackson and the inimitable Hammill on vocals, guitar and piano. Outgoing bassist Nic Potter appears on about half of the record, with Banton filling in on bass pedals for the rest. \"H to He Who Am The Only One\" was their second proper record and remains a great album to this day. As much as I love \"The Least We Can Do Is Wave To Each Other\", I think this one is the superior record and marked the peak of creativity out of the first band period.The opening track, \"Killer\", is the all-time prog classic here and sounds amazing in remastered form. VDGG were one of a number of early prog groups on the Chrysalis label, along with bands like Lindisfarne and Genesis, that suffered from murky production that sounds dated to modern ears. The detailed, cleaned-up sound here is revelatory and a real godsend for fans. The melodic piano ballad \"House With No Door\" is also here, featuring Jackson's wonderful flute work. Sometime VDGG collaborator Robert Fripp turns up to lend some electric guitar bite to \"The Emperor in His War Room\". \"Lost\" (one of the most sad and depressing pieces I've ever heard, with brilliant lyrics by master Peter Hammill) and \"Pioneers Over C\" are two excellent prog epics, with the latter going completely over the top a la \"After The Flood\" on the previous record.But I'm saving the best for last! \"Squid/Octopus\" is a 15 minute jam filled to bursting with everything a prog fanatic could dream of and more. This is the only surviving track from an aborted live in the studio album intended to be part of \"Pawn Hearts\" before Chrysalis torpedoed the double-album idea. This is an absolutely killer prog epic of the highest order, unbelievably brought to light after all these years. Words really fail me except to say that it is reason enough to buy this CD. There you'll get also an early outtake of \"Pioneers Over C\", which sounds great and finishes this wonderful remastered cd nicely.This is one outstanding addition to my prog collection and I highly recommend it to progheads. \"H To He\" was favourite VDGG album beside \"Pawn Hearts and \"Godbluff\", now with the bonus material and the remastered mix with excellent bass sound, it stands alone. Pure prog excellence during 7 songs and about 71 minutes - what should a proghead ask for more?10/10 points = 99 % on MPV scale = 5/5 starspoint-system: 0 - 3 points = 1 star / 3.5 - 5.5 points = 2 stars / 6 - 7 points = 3 stars / 7.5 - 8.5 points = 4 stars / 9 - 10 points = 5 starsEssential: a masterpiece of progressive music"
    },
    {
      "reviewer": "belz",
      "date": "Posted Tuesday, April 4, 2006",
      "rating": 4,
      "text": "4.4/5.0This is a very good, emotional, smooth yet fluid album. The mood is often melancolic, with a soft piano and a warm voice (House with no Door). At other moment it is urgent, agressive, spatial with active saxes and keyboards (Lost). It ends with more experimentation and changing atmosphere (Pioneers over C.).This is very close to be a masterpiece, and this is surely an album that every prog fan should own. Can be listened in any situation, especially when you are in a melancolic mood.4.4/5.0"
    },
    {
      "reviewer": "greenback",
      "date": "Posted Sunday, April 30, 2006",
      "rating": 3,
      "text": "This is probably my favorite Van Der Graaf Generator's album so far! Well, this record is globally more melodic and catchy than the other next ones including Pawn Hearts itself: it remains very progressive all the same, despite many tracks are less complex compositions. There are less experimental parts that often use to go nowhere with VDGG: I notice a better overall structure. I automatically make a connection with the second album Divergence of the progressive band Solution: the same punchy and bottom bass, the weird sax parts that sound alike, the typical catchy and not complex piano, the very similar drums and the almost identical dirty organ in the background. I also find that Hammill's voice is often more in the background, so that it is more bearable. I must admit that many of the miscellaneous lead & backing vocals are more pleasant, varied and better arranged than usual. There are excellent mellow flute parts, like on the \"Emperor in his war-room\" track. \"Lost\" has a couples of interesting faster structured parts, which contrast with the usual slow rhythm of VDGG. The very progressive \"Pioneers over C\" is sometimes surprisingly good and sometimes too weird for nothing, flirting with minimalism and dissonance: that's why it is probably my least favorite track on this record.Rating: 3.5 stars"
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Thursday, August 3, 2006",
      "rating": 4,
      "text": "Van der Graaf Generator's third studio album is the beginning of what their fans consider to be their best era. Peter Hammill, David Jackson, Hugh Banton, and Guy Evans along with guest musicians Nic Potter and Robert Fripp create lush and dissonant songs with introspective lyrics that are highly metaphorical and have a singer that can belt out emotions in airy falsettos and jagged bass registers. Throughout the five pieces on this album, the listener is taken through many different themes, such as suicide or utter depression and the feeling of being lost, but the music is well conceived and well played on the parts of all musicians on the album. What's for certain, though, is that this album began a long string of excellent albums from this group and for the next five years they never made an album that was less than excellent.Killer has a nice piano/organ/sax motif that is really creative and catchy at the same time. Hammill's vocals are jagged and he recites the lyrical material quite well, although the music is a bit too overpowering during the vocal parts. A nice distorted organ comes in around the fourth minute giving a more uneasy feeling to the piece and Evans does some spectacular drumming during these sections, giving frenetic and precision fills every chance he gets. There is some nice acoustic guitar towards the seventh minute, Hammill's precise arpeggios add a more complete and wholesome feel to the piece as it comes to a close. House With No Door is one of the most depressing songs I've ever heard. It begins with a solemn piano motif and some heartfelt and sincere vocals from Hammill (who really shows his vocal skills on this piece. A nice organ/flute interlude adds a more triumphant and joyous feel to the piece, but then it slips once again into that manically depressed feel when Hammill's vocals return to the foray again. The piece then endures a long instrumental ending in which the main piano theme is reiterated and given a couple of runs at a solo (which is quite nice and it actually ends it well).The Emperor in his War Room is the only song on the album to feature guitar maestro Robert Fripp, and he really comes out of it swinging. Beginning gently with acoustic guitars and light flute and organ melodies, the piece quickly picks up in pace at the will of Hammill's searing vocal performance. Towards the middle a nice bass line lays the foundation for the ascending flute/organ unison riffing with a great snare pattern from Evans and some precision fills. The second half of the song is where things really get going, with some great breakdowns and some majestic vocals before the ending section which feels more like a jam, with some solid rhytmic underwork while Fripp belts out a superb guitar solo (that is double tracked with two different solos on top of each other) that is really fitting with the piece. It actually brings about the mellow ending section which ends the song off similarly to as it began. Lost starts off with frantic organ/flute melodies with a hectic drum pattern underneath. The song then goes through many complex instrumental and vocal passages before becoming an all out freak out musically. Add in some cool 7/8 breakdowns followed by a dissonant 6/4 riff and therein lies the latter portions of the song prior to the bombastic and grandiose ending with every instrument reaching a peak before hitting a final note and ending with a dissonant display of power in a fadeout. Pioneers Over C is the final piece of the album and begins with a moody organ riff and some great drumming and percussion from Evans. It ends the album with a very majestic yet uneasy feel, with some nice unison sax/bass/organ riffing and some calming Hammill vocals before the acoustic interludes. It tends to drag a bit towards the end with meandering riffs and a sax interlude that is really just varying noises from it, but on the whole I like the piece and it ends the album well.Overall, while not a masterpiece, H to He, Who Am the Only One is a spectacular album that began a long string of great albums from Van Der Graaf Generator (and yielded two masterpieces in Pawn Hearts and Still Life). There are many excellent moments, but the main problem lies in some dragged on bits in Pioneers Over C, but even that isn't that bad. It's a near masterpiece in my opinion and you can't go wrong with a purchase of this album (especially since now it's remastered with some killer bonus tracks from what I've heard, although I don't own a remastered copy). Highly recommended. 4.5/5."
    },
    {
      "reviewer": "Australian",
      "date": "Posted Wednesday, August 23, 2006",
      "rating": 4,
      "text": "I very recently had a dream in which I was listening to a Van Der Graaf Generator album, I don't know which one but it was good. I remember listening to a guitar solo and thinking \"woh, Peter Hammill is an amazing guitarist, I've never heard this solo before.\" I then remember thinking \"nah, that can't be Peter Hammill it must be Robert Fripp because he plays on some Van Der Graaf Generator albums.\" I woke up the next morning and reflected on this strange dream. For the rest of the morning I listened to some Van Der Graaf Generator albums searching for the album guitar solo I heard in my dream. If that dream tells me anything, its that I listen and think about prog too much.I here lots of talk about Pawn Hearts being the darkest Van Der Graaf Generator album, I however disagree and I think that \"H to He Who am the Only One\" is. Just take one listen to the album and you will see what I mean, the references to death and torture are very obvious. Even look at the song titles,\"Killer\", \"The Emperor in his war Room\" and so on. Also lines like \"Live by sword and you shall die so\" and \"bodies torn by vultures\" cement the idea into my mind. You're probably thinking \"so what?\" Well I'm just saying that \"H to He Who am the Only One\" is the darkest Van Der Graaf Generator album.Though I don't like very dark and depressing albums, I have to say that even though \"H to He Who am the Only One\" has many unpleasant references, it is in no way a bad album. When you compare the death vocals in stuff like Opeth to the stunning voice of Peter Hammill you may think Opeth is the more haunting of the two. You know what's funny? \"H to He\" is more haunting because unlike Opeth, Van Der Graaf Generator is able haunt you with eerie sounds, vocals and atmospheres, while Opeth relies on insanely loud music and death vocals. I'm not sure if Opeth is trying to scare anyone but I have to compare VDGG to something.The Saxophone and Peter Hammill's chilling vocals have always been the defining factor to the uniqueness of Van Der Graaf Generator's music, and this album is no different. From the Opening seconds of the first song \"Kille\"r, you'll get the feeling that H to He is going to have a lot of sax. And when the first lyrics come sounding like this \"So you live in the bottom of the sea, and you kill all come near you\" there is an immediate chilling atmosphere. This atmosphere spans the entire album but it is strongest in \"Kille\"r and \"The Emperor in his war Room\".The first song on \"H to He\" \"Killer\", sets the mood of the entire album as well as I've ever heard, as I've said earlier even from the opening seconds one can deduce a chilling album is immanent. The Saxophone is the standout here along with Peter Hammill's vocals. For once you are able to here the guitar on this song; it's not half bad either. Killer is perhaps the best song on \"H to He\" and for me it is on my most played tracks list. Following \"Killer\" is an equally good song called \"House with No Door\" which has an overall more pleasant melody and a more inviting feel, while not as prominent as \"Killer\" it is still a worthy song. Next on the board is the menacing \"The Emperor In His War-Room\", this song is genuinely disturbing and it is very effective at painting images of torn corpses and dead people. This may not appeal to everyone but I just have to say that it isn't as bad I make it out to be. \"The Emperor In His War-Room\" is another high point on \"H to HE\" and it shows true progressiveness and some flute for once! Lost, the next song starts off with a very lively tune which inevitably changes and becomes darker. Lost passes through several time changes and in the end has a crashing finish. The last song on \"H to He\" is another very chilling song which is proficient at creating.images. There is a long mostly instrumental section which starts around the sixth minute and leads to the almost unfinished end of the piece, and album.1. Killer (5/5) 2. House With No Door (4/5) 3. The Emperor In His War-Room (4/5) 4. Lost (5/5) 5. Pioneers Over C. (4/5) Total = 22 divided by 5 (number of songs) = 4.4 = 4 stars Excellent addition to any prog music collectionSo far its been all praise from me, and you are probably think why I only rated \"H to He\" four stars, well that's because it's difficult to enjoy. I'll let you find out what I mean. The remaster of \"H to He\" comes with two bonus tracks called \"Squid 1-Squid 2- Octopus\", a interesting 15 minute epic and the first version of \"The Emperor In His War- Room.\" I'd recommend this album to who ever."
    },
    {
      "reviewer": "Heptade",
      "date": "Posted Friday, September 1, 2006",
      "rating": 4,
      "text": "The most accessible album in the VdGG catalog (relatively speaking!), this album shows a young band with prodigious talents that would develop into the monsters of \"Still Life\" and \"Godbluff\". Peter Hammill in particular had not quite developed the \"stentorian\" roar that he would become famed for, but his style is already dramatic and full of abrupt quiet/loud dynamics. Jackson and Banton are already exploring the sonic limits of their traditional instruments, and Guy Evans is definitely already a fully-developed beast on the drums. This is very much a late 60s album, with lots of psychedelic touches that would later be absent from the band's more avant-garde work. The compositions are varied. \"Killer\" veers between King Crimson bombast and almost a proto-hard rock sound, a dramatic song that doesn't contain Hammill's best set of lyrics, but is entertaining nonetheless. \"House With No Door\" is a brooding ballad of loneliness and mental illness of a kind that Hammill would come to specialize in- its sparse arrangment and gentle vocals are very effective. \"The Emperor in his War Room\" is perhaps the least successful piece, being a little scattered and overwrought, but does feature some good work by Robert Fripp on electric guitar, and is an evocative story based on Marquez's \"The Autumn of the Patriarch\" (I think), with lots of disturbing imagery. \"Lost\" is another long piece that is also good, but like \"The Emporer in his War Room\" suffers a bit from a lack of focus. \"Pioneers Over c\", the most experimental piece on the record, is also possibly the most successful, utilizing bizarre melodies and unusual arrangements to portray space explorers crossing into a different space/time continuum and suffering the effects. VdGG was definitely never afraid to take chances, a policy that would pay off on the highly unusual \"Pawn Hearts\" and most of the albums thereafter. This is a great album for the frightened VdGG newbie to sample, but is also a wonderful listening experience on its own. Even if they'd never made another album, it would be a classic."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Tuesday, November 21, 2006",
      "rating": 3,
      "text": "A great, but overrated album.There's that term again. This album is really good, and shows how far VDGG had come in a matter of a few years, but its severely overrated by many fans here, and I'm one of them. This album might be one of the most mysterious and complex in VDGG's collection, though not in a techinical standpoint.Killer is a personal favorite of mine, and has an eeriely similar feel to the classic Sabbath riff in \"Iron Man\" (although this was produced well before it). This little track highlights the strength of VDGG well, the dark undertones, the wonderful organ rich tone, and the blending with the sax. Emperor in His War Room is good, but the first half of the song is much better than the second. Lost, is indeed, a very lost track, and the worst of the 5 presented here. It seems this track has tinges of the sounds from Aerosol Grey Machine in it as well. It ends well though, with a powerful cresendo. The last track is a mixed bag, overextending its welcome and paling in comparison to the epic to come on Pawn Hearts.Overall, this is another good VDGG album. I enjoy the first half of this record much more so than the 2nd, a bit odd considering on Pawn Hearts this would be completely reversed. VDGG really finds their sound here, able to craft dark pieces of music with the help of Hammill's voice and Banton's organ."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Thursday, November 30, 2006",
      "rating": 5,
      "text": "The theme of this record is isolation or loneliness.This third release from the band is more complex and darker than thier previous two albums.Things get started with \"Killers\" a dark song that is a fan favourite. I love Peter's vocals on this one, especially the way he carries a note. There is some crazy sax playing that is not melodic at all (haha). \"House With No Door\" is a mellow tune with gentle vocals, piano, drums and flute.The focus is on the lyrics on this one. \"The Emperor In His War Room\" is my favourite track, opening with flute. I guess it's kind of redundant to say the vocals are theatrical ...yeah I thought so. I really do enjoy Mr.Fripp's guitar solo more than half way through the song.\"Lost\" is a melancholic song about lost love, some great organ play on this one. \"Pioneers Over C\" is about getting lost in space, and is filled with many tempo and mood shifts. It just seems like a good melody is happening when it stops, this happens a lot in this song. I really like this record, I was reminded of KING CRIMSON at times and enjoyed the flute and sax melodies and of course Mr.Hammill's vocals.Great album ! Right there with \"Pawn Hearts\" as my fav VDGG albums."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Monday, January 15, 2007",
      "rating": 4,
      "text": "Each album of the VDGG first era (except The Aerosol Machine which I discovered recently - 2003) has had a strong influence on me. I really do not know why. I already have described my love for \"Refugees\" on The Least We Can Do ...so, let's hear what they have achieved here.\"Killer\" is an old number from Hammill during VDGG's prehistory (he wrote it 1968). It has the typical VDGG's sound. A bit heavy at times but good. Lyrics are talking about a killer fish living alone on the bottom of the sea. Quite simplistic according to VDGG standard. \"House With No Door\" is a beautiful pearl. Another example of Pete's great songwriting and interpretation: such emotion in his voice. Low tone, pleasant and quiet, so quiet. It brings you a feeling of tranquility. Jackson will play some flute as well on this number. Peter invites the other band members to join him in this melodic trip (you know, I love melody). IMO, it is the second best number of their first generation era (my fave one being \"Refugees\" of course).\"The Emperor In His War Room\" starts accordingly with a Chinese style instrumental intro. One can easily imagine the court of a Chineese Emperor ... Very quiet. One could think that is an ode to a beloved one while it describes the act of a tyran, with violent lyrics \"They stare out, glass-eyed aimless heads, bodies torn by vultures. You are the man whose hands are rank with the smell of death.\" These lyrics remind me those of \"One For The Vine\" (Genesis) : smooth and melodic song with warlike lyrics.Harmonious moments, soft song, not too complex (it is the second of the genre on this album, which is quite unusual for VDGG). Great bass from Potter and strong keys by Hugh. This is how I like the band the most and probably why I believe that the second VDGG generation will deliver the best output.On the contrary \"Lost\" is a more complex song : at times very melodious (oh boy, how much I love those moments !), at others quite difficult to approach, almost reaching the cacophony level (but that's VDGG). Jackson at his best. Peter so expressive. Just listen to the end of the section :\"The Dance In Sand and Sea\". It is pure emotion, so tense and subtle. A wonderful moment. The finale (quite usual) will provide a scary and dark feeling, the whole band exploding in a furious storm of bass, keys and sax. Another highlight (but it is almost the third one...).\"Pioneers Over C\" is another episode in the VDGG story. Peter will say that it was his sole attempt to write a sci-fi song. I quote Peter : \"In this particular case, my hypothesis (I reserve the right to other time/eventuality options) is that the pioneers go into a time warp, endless living death, the void: unable to get back to earthly reality at all\". At times (around the sixth minutes, for about 3'30\") they remind me of KC : impro and jazzy. These moments are NOT the ones I liked the most in their repertoire.A very good album that could have led to a masterpiece if \"Pioneer\" would have been shorter and less disjointed. Since I purchased the vynil version in 1974, I haven't heard yet the bonus tracks available on the remastered CD release. When reading the track list, I guess they should be interesting. Four stars."
    },
    {
      "reviewer": "el b�thy",
      "date": "Posted Tuesday, January 16, 2007",
      "rating": 4,
      "text": "Definitly a very good album, and a great place to start with VDGG...I didn�t start here and hated their music for almoust a year...had I first listened to this album it might not had happen that way, who knows?...back to the albumVDGG has finally found the winning formula in compositions which gives us an album with 5 strong songs that go from the more rocker Killer to the sad and beautiful House with no door to the more spacy Pionner over C with a good flow in between, making the album as a whole a very satisfing expirience. Hammill shines (as always) in vocals and lyrics, specially in House with no door, which supported by a piano and gentle drums shows VDGG softer side while being deep and never, not for one minute, cheesy. Same thing happens with Lost, one of the two suits along with The emperor in his war room for having different movements which (of course) have tittles of themself, this song, which is a song of lost love does not get cheesy at any moment, which makes the over emotional vocal delivery of mr Hammill so much satisfing. Still, my favorite song is The emperor at his war room, arguably the strongest of them all, with great work from all four of them, specially Evans, a drummer which I truly love, yet never seems to get enough press as the rest of the members. I love the chorus of this song, with Evans fast drumming while Hammill delivers one (of many ) incredible moments from his lyrics, sung as always, down right perfect. The only song I dont like that much, but still think is pretty good, is Killer, a live favorite of the fans. Therefor, I can�t call it weak, just...not something I like that much.Overall this is an excellent album, some weak moments here and there but the good ones make you forget them completly. Highly recommended to any prog fan, and, as I said before, great place to start with this awesome band!"
    },
    {
      "reviewer": "Matti",
      "date": "Posted Wednesday, June 13, 2007",
      "rating": 5,
      "text": "I can't add anything crucial, but for change I want to praise a Truly Outstanding Prog Masterpiece, and along with Pawn Hearts I have no difficulty to say so about this one as well. It's not a perfect album, but to me captivating enough to give full rating.'Killer' is built on a heavy sax riff and the lyrics are brilliantly strong and very metaphorical. 'House With No Door' has even more depressing lyrics - a painful plea for contact - but the piano dominating music is tender, beautifully matched with Hammill's emotional vocals. 'The Emperor in His War-Room' has some moments of pure magic. Moving seamlessly between calm and loud, it's one of my favourite VdGG tracks. Generally angst and violent contents in music is not my cup of tea, but VdGG has some extraordinary exceptions to the rule.The B side has two epics. 'Lost' is yet another painful longing for lost love by Hammill. It may not be among their strongest compositions as a whole, but again it has moments of hair- raising emotional strength. 'Pioneers Over C' seems to be the inspiration for the space- themed cover art. A classic, and in its improvisation-like quieter parts reminding of 'Plague of the Light-house Keeper'. Well, Pawn Hearts has three fantastic long tracks and here are five tracks, none of them individually in the level of Pawn Hearts, but still I love this album as much. Both would be on my Top20 of all time Prog albums. One hears its age easily, but it's the part of the magic."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Tuesday, August 21, 2007",
      "rating": 4,
      "text": "Take a prog band, now replace the guitar with a sax and organ... and make the frontman evil. Now it's Van Der Graff Generator!This band plagued with bad luck is always able to make such exceptional releases, and \"H to He\" is one of those. Starting with the choatic KILLER the album refuses to let up until the end. HOUSE WITH NO DOOR is a very well done slow song, one of the standouts of the album, LOST is equilly grand, if longer, faster and much more chilling. The two best tracks, however, come in the form of EMPEROR IN THIS WAR ROOM and the dark, scary, PIONEERS OVER C. The former would make a very nice song to play at a certain president in this the year 2007, with it's political lyrics, while the latter may seem a bit dated being that the story is focused on a space voyage that takes place in the far off year of 1983. PIONEERS... is still a great track, twisting and turning off the road that is typical music, coming to an end with the typical VDGG maelstrom of sonic fury, my personal favorite part of the album.When it comes right down to it VDGG has always been a band capable of many scary things; scary, haunting, and terrifying... did I say scary? This album is no exception, with many of the tracks capable of making you afraid of the dark. Maybe a bit of an exaggeration, but you get the point. 4 stars goes to the scary people with the scary music."
    },
    {
      "reviewer": "apps79",
      "date": "Posted Sunday, October 14, 2007",
      "rating": 3,
      "text": "''The least we can do is to wave to each other'' made it up to the top 50 of the UK charts with the Melody Maker magazine stating that ''if all bands sounded like this, the British scene would be ten times as great''.However Potter was not exactly enthusiastic with the more experimental path the band was taking.After playing bass in three tracks of the new album, he decided to leave (later to perform with Van der Graaf and the offshoot Long Hello group) after a last show in August 70 at the Plumpton Festival.The remaining members audiotioned one Dave Anderson for about a week, but as things did not turn out well musicwise, keyboardist Hugh Banton decided to play the rest of the bass lines and perform them on bass pedals on stage.The third work ''H to He, who am the only one'' was recorded as a result sporadically throughout 1970 at the Trident Studios, featuring also Robert Fripp in one track.The album's main themes were inspired by modern physics, this one was released on Charisma at the fall of 1970.Van der Graaf Generator would take the step to an upper level with this work, which marks them undoubtfully as one of the pioneers of the emerging British Prog scene.The intense poetry of the previous work is limited, leaving its place to a more melodramatic atmosphere full of complex ideas, influences from Classical, Jazz and Psychedelic Rock and a labyrinth of fine twists and abnormal song structures, with the exception of the more laid-back ''House with no door''.5 quite long and intricate pieces with powerful sax scratches and deep Hammond organ, a great rhythm section and even some discreet flute work.Guitar work seems now more balanced between acoustic and electric lines as a result of a more complex and progressive attitude.The tracks' length provided the band with plenty of room for impressive breaks, instrumental workouts and of course expressive, lyrical moments with Hammill's dramatic voice in evidence.Thus, the atmosphere is always changing between smooth, Psych-influenced parts, frenetic themes with sax and organ in evidence and strong, jazzy influences and delicate, somewhat orchestral moves with a more melodic aspect.The interplays are mostly great and very dense, only negative thing seems that sometimes the music sounds extremely complex and often switches tempos and climates too early.But the innovative approach of the band would have been a true shock back in 1970.Rather different from the previous album.Richer in sounds and instrumental interactions, this third effory by Van der Graaf Generator sees them entering their most mature period, playing 100% progressive, dark-sounding and groundbreaking music, that inspired so many groups over the years.Strongly recommended...3.5 stars."
    },
    {
      "reviewer": "Neu!mann",
      "date": "Posted Friday, November 16, 2007",
      "rating": 5,
      "text": "...a review of the 2005 re-mastered CD...VAN DER GRAAF GENERATOR was ahead of the curve in late 1970, at least compared to other Proggers emerging at the same time. In 1970 GENESIS was only beginning to find its voice on the band's second album, \"Trespass\"; YES was busy treading the backwaters of bourgeois orchestration on \"Time and a Word\"; KING CRIMSON was still in creative disarray after losing two of its original members; and the debut albums of both ELP and Gentle Giant were just then hitting the shops.Even so, the original 1970 vinyl edition of the second proper VDGG album \"H to HE\" probably shouldn't merit anything more than a respectable 4-stars, marking as it did a significant step forward in scope and sophistication, but for a band still with its best years ahead of it.Today, more than thirty-five years later, this 2005 CD reissue easily earns that coveted (and, in this forum, all-too generously awarded) fifth star of distinction. Not only has the re-mastered sound been polished to a surprisingly bright and vital sheen, but the addition of two long bonus tracks (extending the album by another twenty-four minutes) makes it an essential purchase, for students of Golden Age Prog in general and fans of Van Der Graaf Generator in particular.The first of these is the awkwardly titled \"Squid 1/Squid 2/Octopus\", an astonishing live-in-the-studio enlargement of two tracks from the early \"Aerosol Grey Machine\" era, recorded during the \"Pawn Hearts\" sessions and intended for the proposed but aborted second disc of that classic 1971 album. I'm amazed the song lay dormant in the vaults for so long: this is Van Der Graaf Generator at its untethered best, with more than fifteen minutes of tightly controlled psychedelic mayhem showing what a formidable unit this group must have been on stage.It begins with Peter Hammill singing a plaintive ballad over a solo acoustic guitar, but don't let your guard down too soon: within seconds the full band is firing on all cylinders and Hammill is screeching his lungs out as if possessed. The performances of all four musicians are electrifying (and near telepathic: notice the pinpoint accuracy of their stop/start unison runs), with highlights divided equally between the gothic majesty of Hugh Banton's organ, the aggressive jazziness (not an oxymoron) of drummer Guy Evans, and perhaps best of all the signature snarl of David Jackson on saxophone.Jackson was unique among horn players of the period, with a more experimental style owing nothing, repeat: nothing to any popular Jazz or Blues tradition. The band didn't employ a dedicated electric guitarist (enlisting the aid of Crimson King and kindred spirit ROBERT FRIPP on this and other albums), but Jackson easily filled that gap with sounds no mere guitar could match: check out his celebrated solo on the album opener, \"Killer\", sounding as if he's attempting to throttle a struggling alley cat. And his creative use of a wah-wah pedal on the extended \"Squid/Octopus\" medley anticipates the similar sound developed by the great MILES DAVIS during his primal \"Dark Magus\" years, shortly afterward.The second bonus track is a likewise live-in-the-studio rehearsal of \"The Emperor in His War Room\", almost identical in form to the final album version appearing earlier on the disc, but with the lack of any overdubbing (including the distinctive sustain of Fripp's guest guitar solo) giving the song a more appealing immediacy.The original album itself has already been thoroughly chewed and digested elsewhere in these pages, so I won't dwell on it long except to note how remarkably fresh the music sounds after all these years, despite (or maybe because of) the sometimes overwrought poetry of Peter Hammills's lyrics. Hammill was always one of the more literate songwriters of the era, and deserves high marks for youthful ambition even when his narratives shaded toward the melodramatic (as in the brilliantly tortured exposition of the 11+ minute \"Lost\").The album closer \"Pioneers Over C\" is a fascinating case in point. The C of the title is presumably Einstein's constant: the speed of light, proximity to which can do funny things to the fabric of space and time, as suggested by the enigmatic album title and equally obscure Paul Whitehead cover art (what exactly is that contraption floating in low earth orbit?).Science fiction themes were not uncommon in early Prog (think of the Space Rock of PINK FLOYD at the time), but this was Psy-Fi out of a J.G. Ballard nightmare: a pessimistic look at the inner terrors of outer space, with an uncanny lyrical sense of temporal dislocation (\"We are the ones they are going to build a statue for,\" says Hammill's astral traveler, his voice jumping unpredictably between octaves, \"ten centuries ago...or were going to, fifteen forward.\") The song offers an interesting perspective of the Final Frontier, especially after the mind-blowing evolutionary optimism of Stanley Kubrick's 1968 cinematic head-rush \"2001: A Space Odyssey\", and indicates how the 22-year old Hammill was, like his astronaut protagonist, a man sometimes uncomfortably ahead of his time.Well, so much for brevity. Add a dozen-page CD booklet filled with historical background, band photos, and song lyrics, and this already excellent album emerges in the 21st century as a belated masterpiece of truly progressive music."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Sunday, December 23, 2007",
      "rating": 4,
      "text": "\"H To He, Who Am The Only One\"is the third full-length studio album by UK progressive rock actVan der Graaf Generator. The album was released throughCharisma Recordsin December 1970. It�s the successor to\"The Least We Can Do Is Wave to Each Other\"from February 1970 and features one lineup change as bassistNic Potterleft during the recording sessions. He did however record the bass parts for\"Killer\",\"The Emperor In His War-Room\", and\"Lost\", before finally quitting, citing artistic differences as the main reason. Keyboard playerHugh Bantonrecorded the bass parts for the remaining tracks on the album (\"House With No Door\"and\"Pioneers Over C.\"). The 2005 remaster of\"H To He, Who Am The Only One\"features two additional tracks in\"Squid 1 / Squid 2 / Octopus\"and the first recorded version of\"The Emperor In His War-Room\". The former was recorded during the sessions for the band�s fourth full-length studio album\"Pawn Hearts (1971)\", but not included on that album. It was a track the band regularly played at their live shows.\"The Least We Can Do Is Wave to Each Other (1970)\"was a giant leap forward in quality from the rather rough around the edges debut album\"The Aerosol Grey Machine (1969)\", andVan der Graaf Generatorcontinue to evolve and develop their sound and the quality of their music on\"H To He, Who Am The Only One\". The band�s music is always a bit hard to describe as they sound quite different from most other progressive rock artists of the 70s, but it�s predominantly organ/piano, saxophone/flute, drums, and vocal driven music, and the bass and the sporadic guitar playing are secondary in the soundscape. Quite unusual for a rock band andVan der Graaf Generatordefinitely fall under the catagory or unusual, but they also fall under the catagories of exciting, powerful, and adventurous and the music on\"H To He, Who Am The Only One\"is filled to the brim with creative compositional ideas/lyrics and unique ways of expression.Lead vocalistPeter Hammillis a both skilled and distinct sounding vocalist who can express both deep longing melancholy and anger with equal amounts of emotion and passion, and his performance here is further enhanced by the poetic and rather interesting lyrics.\"Killer\"opens the album in a hard rocking and jagged heavy style and featuring sharp use of saxophone, while\"House With No Door\"is in the completely other end of the scale being a piano/vocal driven slow, atmospheric, and deeply melancholic track.\"The Emperor In His War-Room\"is a varied track showcasing all the different elements of the band�s sound. The lyrics are strong on this track too, as they function as a warning to the leaders of the world, that if you live by the sword, you�ll die by the sword. With great power comes great responsibility (said in the great wisdom of Pippi Longstocking). The last lyric line of the song says it all:\"Live in peace or die forever in your war-room.\".Hammillconjures up some pretty disturbing imagery of death and destruction during the song, and proves what a great lyricist he is.\"Lost\"and\"Pioneers Over C.\"are both long and progressive tracks, featuring intriguing structures, changes in pace and atmosphere, and both great instrumental work and even more paatos filled vocals and lyrics fromHammill. Both tracks are pure class and feature intricate unique approaches to performing and writing music.Van der Graaf Generatorwere arguably one of the most original sounding progressive rock acts of the era.\"H To He, Who Am The Only One\"also features an organic, detailed, and powerful sounding production, which suits the material perfectly. It�s definitely an upgrade from the sound productions of the first two albums. So upon conclusion it�s a high quality progressive rock album and one of the seminal releases in the genre. A 4.5 star (90%) rating is deserved."
    },
    {
      "reviewer": "sean",
      "date": "Posted Sunday, March 9, 2008",
      "rating": 5,
      "text": "This album, along with Still Life is my favourite after what I see as VdGG's magnum opus, Pawn Hearts. The oddly titled H to He, Who am the Only One is the direct predecessor to Pawn Hearts and it's here that you can see them really developing their signature dark, avant garde, jazzy prog. It all starts off with the fan favourite Killer, one of my favourites as well. Hammill's dark lyrics describe a fish that lives in the depths of the sea and kills everything. The music is befitting to these lyrics, and is alternately a simple catchy melody and some really twisted free-jazz type music with dissonant sax and organ parts contributing to the tension of the song. That tension is relieved by the next track, the ballad House With No Door, which though lyrically dark is a very mellow song with a dark mood that is rather haunting. The next track makes this worth buying for King Crimson fans, as Robert Fripp guests on The Emperor in his War Room with some of his signature guitar parts that you can tell are him immediately, as nobody else can sound like Fripp. Lost is one of my favourites on this album, as is the track that follows it, Pioneers Over C. Both are mini epics that are among the best tracks that the band has written. The former deals with themes of an unrequited passion and is alternately frantic and beautiful. The latter is about a group of people that become lost in space, confused about their very existence and is quite wonderful musically as well, with a memorable sax melody, a catchy bass line, and some frantic instrumentals. In my view, H to He isn't quite the masterpiece Pawn Hearts is but I am not hesitant to call it a masterpiece nonetheless, as I do enjoy every minute of this album and it is among the band's most intense, dark material."
    },
    {
      "reviewer": "LinusW",
      "date": "Posted Tuesday, March 25, 2008",
      "rating": 3,
      "text": "Another holy cow of prog, another revered record, Van Der Graaf Generator's H to He, Who Am The Only One takes the new record of longevity when it comes to the period I've listened to it. Before reviewing it, that is.I was warned that VdGG might be a little tough to get into, a statement both true and false. Musically I don't find this as challenging as I had imagined. It's complexity instead lies more in the dense, dark, whirling, mood-swinging atmosphere that cloaks this album, augmented by Peter Hammill's characteristic and dynamic vocal capabilities and the surprisingly stark lyrics. King Crimson is never really far away. A testament of this are the instrumental, more experimental passages that riddles especially the longer songs, plus a little dissonance here and there.Guitar isn't VdGG's instrument of choice. Walking that way might be a big drawback for those of you that can live without it, I hardly noticed it until Fripp delivered a trademark dissonant solo in the album's, in my opinion, greatest song, The Emperor In His War Room, a wonderful flute- and organ-laced song with some discreet acoustic guitar. Thick flute, some saxophone and sturdy Hammond organ drives the heavier parts, making it a thoroughly enjoyable eight minutes.All of these elements are all top-notch in my book. So most of the times I've listened to the album, with new hope and fresh ears, I've found myself analysing why I don't consider this a masterpiece. And after every listen I come to the same conclusion. What I can't fully appreciate is the vocals. Not Hammill's tone, no, that's just fine, but the overly dramatic, theatralic, way he delivers them. Perhaps it's even, as one of the previous reviewers noted, that the melody oh-so-often ends up carrying the vocals, over-shadowing itself in the progress.What is for sure is that I'm not finished with this album, and that I'll gladly will be sucked in to its unique atmosphere and...secrecy many times more. But still, three stars.//LinusW"
    },
    {
      "reviewer": "LiquidEternity",
      "date": "Posted Thursday, April 24, 2008",
      "rating": 5,
      "text": "This one absolutely stunned me. I had listened to Killer on this site, and couldn't get enough of it. I had no idea what was coming. H to He is, despite having references to physics in the title and some of the songs (I'm not a science person at all, but for those of you who are, the nerd element should make this album even cooler), a very slick package.Killer, as I mentioned above, stuck with me very seriously. Powerful brass work from David Jackson backs Peter Hammill's arching voice just beautifully. It's aggressive and menacing while still being flat out fun to listen to. Uptempo and filled with something of a rock sound, this song is a very good way to wean yourself or a loved one onto this band, as sometimes they can be a lot to swallow.House with No Door is my least favorite track on here, though many fans consider it one of the best Van der Graaf Generator songs of all time. It's mellow and pretty, but lacks the same impossible hooks that the other four tracks have. That's not to say that I don't really like it. I just don't love it, is all.The Emperor in His War Room is straight up awesome (I use that word at risk of sounding twelve, but I think it is merited here). The flutes are gorgeous. The melodies get stuck in my head for weeks at a time, sometimes. Robert Fripp plays a mean guitar throughout, and I think that the occasional addition of this instrument adds power to the times when it actually is around. Well, that, or the fact that it's Fripp himself playing it that adds the power. Sometimes it's hard to know for sure.Lost is long and beautiful. It builds and builds throughout its length, to culminate in Hammill's chilling I love you line being repeated. Very well done.Pioneers over C is probably my second favorite here, to The Emperor. I just love the way the song stops occasionally and drops into a nice little bass business, which is then each time promptly joined by the saxophone. The vocals are some of the most convincing of the entire album, I think, even when they are leaping around and sounding mildly like just randomly chosen notes. What a way to close an album. What a way.All in all, if you are going to start in on VdGG, do what I did, and start here. It's a great way to get a feel for them, while still saving their bigger releases for later when you are a bigger fan of the band. Or, at least, that's how I feel."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Thursday, June 19, 2008",
      "rating": 3,
      "text": "An odd album in the VAN DER GRAAF GENERATOR discography, 'H to He' doesn't achieve the greatness of subsequent albums.The subject matter is uniformly bleak, addressing the human condition and our tendency to drive away those we love, leaving us lost. The opener does this by using the extended metaphor of a shark as the killer of all who dwell in the sea. Surprisingly for VDGG the song is rather a standard rock piece, with a saxophone and vocal hook, and (despite the typical VDGG fan praising their complexity) has become a fan favourite. It's an odd beginning to the album, the edginess they introduced on the previous album missing here.It doesn't reappear on the second track, a laid-back piano ballad. Again, there is little of the usual sharpness: HAMMILL's voice is restrained (apart from a rather poor falsetto) and JACKSON's sax is given a rest. The whole thing reminds me of the sort of music ELTON JOHN was doing at the time: 'Tumbleweed Connection' and all that. All very sweet. Nor does 'The Emperor in His War-Room' do much to dispel the miasma of pleasantness, with a gentle flute and choral vocals. The second part, 'The Room', warms up a little, with the saxophone coming down from the shelf to accompany drums, bass, guitar and organ in a - I almost said pleasant - workout. Another hook makes this song one the listener wants to return to again and again.'Lost' brings us back to typical VDGG territory: a compelling mixture of assonance and dissonance, of melody and cacophony. Forget the ridiculous title to this album: this is in reality the album's title track. Though the beginning is gentle, it constantly threatens, finally breaking out for 'The Dance in the Frost'. The final track rounds off the album well, extending the metaphor of 'lostness' into outer space.This is a good place to start your VDGG collection: not because it is the best - far from it - but because it's possibly the easiest to penetrate, with the least amount of sharp edges to cut yourself on."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Tuesday, July 22, 2008",
      "rating": 5,
      "text": "H to He Who Am the Only One is an excellent album from Van der Graaf Generator, definitely one of their best alongside Pawn Hearts (their best), the much celebrated Godbluff and the incredible The Least We Can Do Is Wave To Each Other. The album begins with the dynamic 'Killer' which is easily the best track on the album and a concert favourite. It focuses on a narrative perspective from a killer shark who wants to be loved but has an impulse to kill outside of its control: \"You crave companionship... because the whole of your life you've been living alone\". Interesting enough, the real highlight beyond the lyrics is the way Hammill delivers with absolute conviction and the way that the instruments compliment the keyboards with saxophones and percussion that is off beat at times but never out of time. Perfectly in synch, all the instruments blend to create a soundscape of doom and majesty and it captures the imagination unlike anything the early 70s had to offer. At 8 minutes the track flows beautifully from one segment to another, and features an erratic instrumental break that almost transports you under the sea witnessing a shark attack, the shrill saxophone bursts could be a fish screaming in pain, and the deep rumbles could be the shark swimming to its next meal. 'Killer' is an instant classic and a must for anyone interested in this genre of music.'House With No Door' is one of the contemplative existentialist pensive tracks where Hammill contemplates life and the purpose for his existence.'Emperor in his War Room' gets back to the greatness of VDGG, a torrid saga of an Emperor who \"cradling his gun, after choosing the ones you think should die... crawling over the windowsill into your living room.\" The bodies that are \"torn by vultures\" are left to die by the \"saviour of the fallen, protector of the weak\". Once again terrific lyrics overladen by mellotron, atmospheric drums and saxophone, and the relentless bass.\"Lost\" is another brilliant track that begins with a swirling dervish of keyboards and wrong chords that are used to maximum effect. It's as good as it gets and moves all over the place, with time signatures that are difficult to emulate. This is one of the more complex tracks from the band, and features an excellent saxophone and keyboard solo that drives the song forward to the final section The Dance in the Forest. One part pulses with a driving bass while a thin saxophone contains a strong esoteric melody. The echo of the saxophone adds to the sense of alienation and bleakness. It all ends on an off kilter series of notes that speed up into a frenzy that finally fades out.'Pioneers Over C' is one of the best VDGG tracks and begins with a high pitched atmospheric note, then a low rumbling Hammond keeps the jagged rhythm in tact somehow, while the percussion kicks in. It's a great sound and prepares the way for Hammill's spaced out lyrics. \"Somebody help me I am falling down\" he cries. I just love the riff of the bass and sax in this track that stops and starts and even features quite a beautiful acoustic arrangement and spars saxophone. \"The universe is on fire exploding without flame\" - fair enough if the universe is going to go foom it may as well be to the melodies of VDGG. Heavy stuff throughout it never becomes overbearing thanks to the excellent structures of each track that range from tranquility to an out of control maelstrom.The bonus tracks are surprisingly good and worth the effort. \"Squid/Octopus\" is a fantastic lengthy 15 minute epic that works well on a number of levels. From the estranged vocals, \"I wish that you would set me free forever, but these rings on my arms are too deep...\", down to the way it blasts and spews waves of noise using instruments from acoustic guitar to mellotron. I love the way it loses control halfway through almost improvisational in places and then somehow finds its way again, nobody could jam like these guys. The end is stuffed up with an added cymbal hit and the band members curse and laugh. But who would care after the way this track spiralled all over the place, but I guess these guys were perfectionests.The early take of 'Emperor in His war Room' is more or less a curio and is a rare look at the makings of a classic track. It does sound different without the overdubs and atmospherics but is no the less the better for it.Overall, H to He... is absolutely quintessential VDGG and my CD collection would be the poorer without it. Along with Pawn Hearts and Godbluff, I can't recommend this more highly."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Saturday, August 16, 2008",
      "rating": 5,
      "text": "Review 62, H to He, Who Am The Only One, Van Der Graaf Generator, 1970StarStarStarStarStarStarThe hardest-hitting, perhaps the greatest, prog albums have an essence of their own, a certain SellingEnglandbythepoundness or Brainsaladsurgeryness (Plato can do it, so can I ;) ), rather than being a collection of song ideas with or without an underlying theme, by the same artist, in the same year. Htohewhoamtheonlyoneness is an oddity. Despite the fluent theme of loneliness, the songs are thoroughly different, with fiery dissonance and calm beauty coexisting within the album, and initially, the album, and indeed some of the songs. Nevertheless, regardless of the range, the elusive feel of the album is there, and impacts more powerfully every time. For me, such an album is without doubt a masterpiece.That waffle aside, H To He Who Am The Only One is a superior effort to its perfectly good predecessor in several ways. First, the lyrics have really fallen into place, and have moved on from simply interesting and well-constructed to incredible emotional journeys with enigmas and clever wordplay incorporated in them. This album in particular is lyrically one of the two or three strongest that I own. Second, Hammill's vocals, which were previously exquisite and superb, have begun to flex themselves inquisitively, trying out new ideas constantly rather than going for a sound/tone and sticking to it for a song. Finally, the songs are slightly more distinctive to my ears, which is merely a personal preference issue.Where we get to the really interesting features of the album, though, are the production and the album's basic 'features'. The production is clear and appropriate, with a very clear drum and bass sound leaving no mess or unhelpful material in the background to interfere with Bantom's crystalline organ chords, yet no feeling that there should be something else there when the organ or piano drops out. There's the space for the two leads to intertwine over the top of the organ and bass, while Hammill can display his incredible range, and the under-appreciated Guy Evans can use his classic rolling percussion sound with intense fills to full effect. And while all this goes on, there's no feeling of crowding, and nonetheless the feeling of loneliness, loss, rage, rejection and, finally, escape goes straight from the speakers to the soul. Van Der Graaf Generator at one of their many finest moments, and an incredible experience if you can really immerse yourself in it.Killer opens the album with style, moodiness and a thick organ-sax-piano riff that manages to, with supple variations, hold up the piece perfectly. The parable of the fish (coincidentally, this makes the album lyrically presenting loneliness in sea-break-land-break-space progression), representing men isolating themselves through alienating those around them, is delivered with a dark, almost watery, vocal, and the entire presentation gives a unique dark-sea feel (as opposed to the sweeping majesty of Echoes or Firth Of Frith). Hugh Bantom's organ-work is viciously choppy, using swelling jabs and swipes to full effect as a counterpart to the smoother (at least, outside of the solo) sax, while the first really Van Der Graaf Generator piano makes its appearance (as do brief, but brilliant acoustic swirls that appear and then are gone with no grating whatsoever), directing the mood intensifying without melodrama, and substantiating the background for some of the zany soloist parts on occasion. Guy Evans gives a phenomenally strong performance, keeping up a consistently interesting and mobile background percussion performance with his characteristic second-long intrusions on the lead. However, no description of the song would be complete without an acknowledgement of the three mindblowing solos, a swirling, aggressive, grinding noise, probably from Bantom's general direction, Jackson's chaotic sax whirlwind and his later gorgeous, smoother solo. Of interest, too, is the ending. Where it appears to be scaling up to the classic bluesy crescendo, the band have the restraint and taste to conclude it quite decisively without bowing to that convention. This leaves a smooth segue to...The beautiful and harrowing A House With No Door. Very much softer than its predecessor, but no less moving. Beautiful piano melodies take the lead, substantiated and backed by a more prominent and directional bass, and Evans' drumming and percussion taking an equally impressive and prominent role in a soft song (another reason I consider the man so overlooked. There aren't many percussionists who can really do that for a soft song). Hammill, however, remains the main focus, with his mournful, steadily unsteady, almost self-deprecating (in feel) vocal and perfect lyrics ('There's a house with no light/All the windows are sealed/Overtaxed and strained, now nothing is revealed...inside'). His voice manages to include majesty and, in the final verse, this incredible switching between his fairly high male voice and a (perhaps falsetto is the right word, but I doubt it) near-female, equally high, yet distinctly different sound flawlessly. An unforgettable vocal and lyrical performance, which is only made sweeter by the quality of the rest of the piece's components. Jaxon contributes a lush flute melody, with the unusual backing of an odd organ setting as well as the piece's basic components, and then heightening the feel with the addition of saxes (I think it could be the two-saxophones-at-once trick). Soft organ adds a touch of tasteful depth to the piece's conclusion, which is reached by a lush piano-bass duet. So different from the opener, but equally perfect.The Emperor In His War Room is a third style again, with a more earthly vocal from Hammill, emphasising the sharp edges of the imagery-thick, cleverly constructed and menacing lyrics about the fall and isolation of a dictator. Musically, the piece is very much augmented by the presence of the far-famed Robert Fripp, first on delightfully vicious acoustics, and then in a bizarre, winding solo running parallel to the solid work of the band. Another chief feature is the presence of the flute (complete with a couple of effects) as a lead instrument, and some very solid bass and organ-lines contrasting with its airy, escapist feel. Menace and tension ooze from the piece, but also a genuine pity for the subject. Evans extensive militaristic percussion provides another burst of intensity. Here lie both the tense atmospheres that would make A Plague Of Lighthouse Keepers and the more conventional features of H To He. The use of contrast is very strongly and subtly done, and the piece slows and thins very carefully to alter the listener's emotions.Lost is a very, very, very, very, very, very, very, very special piece to me. In addition to being one of at most five musical pieces that have reduced me to tears, it is so utterly, perfectly romantic. Hammill takes one of the most conventional, generic topics of rock and writes about it poetically, intelligently and with feeling. The delivery matches, stretching with desperation, almost-weeping with loss, and moving to majesty, anger, sadness and longing with a natural flow. The music, though at first I was somewhat taken aback by the frantic nature of the opening sax/organ line, is to match. The opening theme is often reprised much more slowly in the later parts of the song, softly echoing and remembering the perceived frantic passion of the old relationship. The playing is perfect throughout, with Jaxon's brief, emotive spins and warm, but mournful, hums making full use of the human breath resemblance of the sax. Piano and organ are both handled in much the same style, smoothly, but with a constant feeling of utter and crushing loss. Evans again contributes fantastically, never breaking the feel with his style, though even including a very subtle and low-key use of something quite like the eighties drum thwack. The bass-work is smooth, clear, and independent, giving emphasis wherever necessary. Individually, all of these components are superb, but together the scale and beauty leaves me stunned every time. The interplay between sax and organ leads, coinciding with the most exemplary of the shining organ chords earlier referenced, simply has to be heard. I wish I could describe it better, but Lost goes so far beyond words that these are insufficient. This song alone would justify an album.Pioneers over C (both a brilliant pun, and potentially a double-scientific reference, C being Carbon and c being the speed of light) begins with a soft, restrained rhythm and a crackling swirl, feeling distant (especially in the drum part, which sounds like a bongo to me). This initial distance is then varied throughout the song for force and effect, sometimes glaring with stark bass parts and at others slipping away with soft background organ and acoustic leads. Hammill again gives an absolutely stellar (pun not intended) performance, slipping away from our consciousness and roaring back into it, proclaiming exuberantly 'We are the lost ones', before slipping back around his own vocals. Harmonies are used with attention to detail, and the brilliantly stark lyrics are furthered by the stunning delivery. Aside from a slightly wider percussion set, and a much more prominent use of acoustic rhythms than previously, Pioneers Over C also features a greater role for the bass in providing active direction. Jaxon again manages to steal the show with sax bursts, including a particularly avant-garde breathless wandering. Pianos wander from ear to ear, and the organ provides both subtle and overt additions, as well as a rocking riff towards the end. The dark-space atmosphere (like the previous dark-water and dark-earth ones) is sustained flawlessly throughout, and the band clearly has a conviction in what they are doing that overrides any resistance. I have actually ended up on one occasion staring out of my window holding up my arms to the stars, so carried away by the atmosphere.So, in conclusion to the rather long preceding passage, Htohewhoamtheonlyoneness not only exists, but it is also utterly incredible, beautiful and tragic. In fact, it is almost unique in its effect on me. So, with it being my second favourite album of all time, I can only give it my most exaggerated score. Go forth, Htohewhoamtheonlyoneness, and prosper!Rating: Six StarsFavourite Track: Lost, though all are incredible."
    },
    {
      "reviewer": "horsewithteeth11",
      "date": "Posted Sunday, November 16, 2008",
      "rating": 1,
      "text": "This is the third album from a group of guys who are anything but Stoic.I've tried and tried and tried with Hammill and his little group so many times that I've lost count, and whenever I listen to them, they come off as either dragging their music out way too much or trying to be as emotional as possible, but not really taking it anywhere in developing songs. How so many people think these guys were major developers in progressive rock, I don't know. I find them to be anything but that. Hammill could actually be a good vocalist if he wasn't going back and forth in between barely comprehensible whispering and shrilling his lungs out. He'd make a fairly decent vocalist in a metal band for certain, or even an emo band, and it works here with the music, but the music isn't of very high quality anyway. Except for Killer, the rest of the tracks are absolute chaos. And even still, Killer doesn't reach mediocrity. To me, the ideas take way too long to develop or they try to develop them and then they end up going off to nowhere. This is a band that prefers to ride off of emotional highs (drug-inspired or otherwise) rather than work on trying to be competent instrumentalists, something that many other musicians I feel are much better at doing anyway. If Hammill knew just to tone down his vocals a bit instead of trying to be highly emotional, and the band developed these songs at least some, this would be an enjoyable album. I know some prog fans would want to drag me off to the gallows for saying such things, but I need music that actually takes ideas and sees how far it can run with them. For this album, the main idea is going for mediocrity, and failing at even that. I'm sorry, but I can't give this album anything other than 1 star. If you never listen to VDGG, consider yourself lucky."
    },
    {
      "reviewer": "The Truth",
      "date": "Posted Sunday, April 26, 2009",
      "rating": 4,
      "text": "Man oh man Van Der Graaf didn't get enough attention! This album is awesome! Killer could've been a killer mainstream prog song, (it sounds a lot like 21st Century Schizoid Man only a little bit better,) with it's jazzy theme and dark depressing lyrics. The lyrics are probably the reason it didn't become a hit because they are to bleak. On House With No Door the balladry is amazing when you compare it to the first track because of how much slower the pace is. The lyrics are just as, or maybe more, depressing as Killer but it makes for a great lyrical theme much like Pink Floyd. Emperor In His War Room is the song that keeps this from being a masterpiece. It's just slow and the theme isn't catchy enough to like. However they make up for it with Lost, another jazzy tune, which blasts off with excitement the minute it starts and just gets better as it goes on. Pioneers Over C has one of the catchiest bass lines I've ever heard and makes for a great listen! Overall what makes this album good is David Jacksons killer saxophone playing and Peter Hammills obscene yet amazing voice and songwriting! Great stuff here!"
    },
    {
      "reviewer": "friso",
      "date": "Posted Monday, April 27, 2009",
      "rating": 5,
      "text": "In arthouse movies that added layer of philosophical exploration is key to lift up a piece of art to the status of a masterpiece. On some album in the progressive rock genre there's also such an effect; and Van Der Graaf's Generator 'Who Am The Only One' is such a record. All songs deal - in their own way - with scenes of extreme loneliness and the effect is has on the human experience. On time and meaning.Musically the album expands on the progressive direction that was set on 'The Least We Can Do' with long organ-led compositions in which the commanding and expressive performance of Peter Hammill is key. Hammill leads us straight into his world of fantasy, an ability that makes him unique as a performer. The majestic sound and medieval influenced chords of the organ by Hugh Banton and the original uses of flutes and sax by David Jackson give the music its magical appeal. Robert Fripp (of King Crimson) adds some guitars, most notably on 'The Room', but I never felt his presence is that important for the impact of VdGG's music on this record. The later releases with alternative takes without Fripp are sublime as well.The opening song 'Killer' (with its wild avant-prog sax solo!) deals with the loneliness of the top predator, which turns out to an analogy for the performer's own social isolation. The wonderful ballad 'House with No Door' explores the human experience when cut of from all others. 'The Emperor in His War Room' is the most majestic song here and its main theme was the first thing I liked about VdGG. It tells about the loneliness of being the single one responsible for decisions about life or death. 'Lost' is about the craving for another person that is deemed beyond reach. 'Pioneers over C', perhaps my favorite, is about exploring outer space, but so far out that the fear of loosing one own's humanity in the utter emptiness of space takes on hold. Eventually the character looses his mind completely, which is aptly preceded by a breathy avant sax solo part by Jackson.I believe this is - both musically and lyrically - simply one of the most interesting records the progressive genre has to offer."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Friday, May 29, 2009",
      "rating": 4,
      "text": "Van der Graaf Generator is just not a band I love. However, for various reasons over time I have grown to appreciate their work in a way I wasn't able to before. That does not change the fact that they are still low on my list of not just progressive rock but music in general. The lyrics are free verse poetry but seem to integrate well with the music, even though the lead vocalist (I hesitate to use the word \"singer\") has a style that can be uncomfortable at times. The organ and saxophone are the primary instruments throughout, a combination I also never cared for, but for the most part the music is only mildly eccentric. I think I would recommend this to people looking to get acquainted with Van der Graaf Generator.\"Killer\" After a great saxophone introduction, Peter Hammill begins one of his most solid vocal performances. The subtle organ work is exceptional, and the even subtler acoustic guitar during the second verse grabs my attention. The instrumental section doesn't suit my taste at all, with that loud, low lead instrument, and I have never cared for the squeaking runs of David Jackson's saxophone, talented though he may be. The words are expressive and free-flowing, and describe a shark that lacks companionship because the other fish fear it (sounds like something a second grader might have come up with, but it has its own strange metaphoric charm).\"House with No Door\" A softer piece, with a great chord progression on the piano and gentle vocals from Hammill, the second track is another good \"introductory\" song for the uninitiated I think. I really enjoy its soothing nature and beautiful simplicity.\"The Emperor in His War-Room\" This track begins softly and darkly, with delicate harmonics, but soon screeching organ and harsh flute jump in to accompany Hammill. The guitar solo that introduces the second part of the song really reminded me of King Crimson, and with good reason- that's Robert Fripp playing there. All in all, this is a dark song that has some intriguing and masterful lyrics.\"Lost\" The sprightly introduction ushers in something a bit different from the previous melancholic and menacing songs. There's a lot of variety in this lengthy piece, while the organ and saxophone are steadfast throughout. A common and repetitive progression brings the song to a dramatic conclusion.\"Pioneers Over C\" The longest song on the album morphs through many different musical sections. Placid organ and percussion is the canvas on which Hammill paints his many words at first. A bass riff pops up from time to time unexpectedly. The acoustic guitar sections are my favorite, and the worst part of the song to me of course is the directionless saxophone bit in the middle (which proceeds without accompaniment). It is easily the most disjointed composition on the album, but Hammill's dramatic vocal theme is repeated often enough to keep it grounded. The ending is raucous and really not my thing at all. I think it's safe to say that for the most part, it's this last piece that drags down an otherwise excellent and creative collection of work."
    },
    {
      "reviewer": "The Sleepwalker",
      "date": "Posted Tuesday, September 1, 2009",
      "rating": 4,
      "text": "Van Der Graaf Generator's third release shows a much more mature and consistent band compared to their previous release, The Least We Can Do. H to He, Who Am The Only One contains some of VDGG's finest moments and doesn't have a weak moment at all. Every song, every riff, and even any single note played on this album is where it belongs and makes this album an album with no actual flaws (which is quite an achievement). This doesn't mean everything is perfect though, some songs are more interesting than others, and even more important, this is probably VDGG's most accesible release; That means the album doesn't have as much expressive vocals from Hammill as Pawn Hearts and doesn't have the raw power of Godbluff.H to He's opener is an anthem, and probably the least interesting song on the album. It is a killer though, it really is. \"Killer\" is a song that features different moods, styles and riffs. Definitely the second half is very good, and really is what I expect from the band; great music with emotion and progress. H to He features some very emotional moments, like the soft \"House With No Door\" and the fantastic \"Lost\". \"Lost\" is one of the best songs from this album and probably one of the best VDGG has ever made. The song moves from an upbeat first part to a haunting second part, definitely one of the best love songs I've ever heard.Though the album is pretty accesible for VDGG's standarts, it does contain some extraordinary moments. One of them is \"Pioneers over C.\", a very striking and experimental song. \"Pioneers Over C.\" moves from bombastic and dramatic moments to parts lead by ambient sax and soothing vocals. Really a brilliant piece. Another powerful and experimental piece is \"The Emperor In His War- Room\". This is what probably is the most powerful and extreme piece on H to He. The music here starts very soft, but makes some unexpected turns to mysterious moments, very powerful choruses. This combined with Guitar Playing by King Crimson's Robert Fripp creates a very memorable experience.H o He, Who Am The Only One really is among VDGG's best. Because of it being pretty accesible compared to other VDGG releases, this is the album I would recommend to people who are getting- or trying to get into Van Der Graaf Generator's music. Of course, this means it is a must for VDGG fans. I had a hard time deciding whether I would rate H to He four or five stars. For that reason, I give it four stars. It is a brilliant piece of music, which is very close to being perfect, but it does not have the same striking power albums like Pawn Hearts and Godbluff have though."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Thursday, September 3, 2009",
      "rating": 4,
      "text": "H to He is the first VDGG album where they come to grips with their dazzling musical strengths. The result is a solid album with some of their best material.I'm referring to Killer of course. This is one of VDGG strongest tracks and would wind up somewhere high in my favourite song list (if I would ever get to making one). The reason is that it combines all things typical VDGG (strong melodies, disturbing singing, weird instrumental sections, insane sax work) with a slightly ironic touch that gives it a nice extra twist.House With No Door and Emperor display a calmer side of VDGG and are both gorgeous tracks. With Lost however, they lose me. It fails to convince me and reveals one of Hammill's weaknesses: Even though he is one of my favourite singers, he needs a strong musical backbone. If the music is not good enough to sustain his vocally excessive style, then he easily becomes very irritating and spoils the entire track in the process.With Pioneers over C, they are back on the right track. I believe this is another fan favourite and indeed it has a lot of things going for it, but I think it is too long. With the middle section cut out it could have been twice as much fun.VDGG had not yet achieved the restraint of the Godbluff era and from time to time their ambitions run ahead of them, but the album has still some of their lighter, romantic side and might therefore appeal to the prog heads that aren't appealed by the anger of their later years."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Friday, October 16, 2009",
      "rating": 3,
      "text": "Third VdGG album is better than their fourth, \"Pawn Hearts\", for sure. Even if not perfect, but you can find some melodies, some structurised songs and much more music, then in their next work.Again, music is better mixed and recorded, but sound is far from perfect. But at least I can hear really strong drumming, many sax solos and quite nice ( in moments) keyboards. Hammil voice again is main accent, but at least all other sounds are better balanced.Still using more usual album structure ( 5 songs instead of \"Pawn Hearts\" 3 long amorphous compositions), in combination with much better drums it build much more musical atmosphere all around.Here you can find almost all VdGG is known - Hammil voice, sax solos , some moody melodies, some rhythm breaks. I think in fact that album represents VdGG music of that period as the best example.Again, I think it is far from masterpiece and sounds very dated now. But at least it's enough listenable with many interesting moments."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Tuesday, February 16, 2010",
      "rating": 4,
      "text": "My Van Der Graaf Generator story began withPawn Heartsand although that album has grown on me over the years I never considered it to be a masterpiece. This matter only complicated things because in my frustration with my first experience I swiftly moved on to the band's second period (1975-78) without giving the early material the proper introduction that it deserved.Luckily I revived my curiosity about a year ago and finally acquiredH to He, Who Am the Only One. Once I discovered this album it actuality put the material onPawn Heartsin a whole different light for me. Hopefully my experience will help some of you brave Van Der Graaf Generator explorers on your quest!So what exactly did this album have that made me change my opinion about the band's early material? I'll give you my first hint, it wasn'tKillerbecause if anything this track sounds almost as amateurish as the band's previous material but it's saved by the strong lyrical context.House With No Dooris a whole different story. Subtle, delicate and an overall pleasant experience all around. Still, most fans might argue thatThe Least We Can Do Is Wave To Each Otherhad an equally great little ballad calledRefugeesand they would be...right! So let's move on.Trust me when I say that this album has a few more aces up its sleeve andThe Emperor In His War-Roomfits that metaphor quite well. There is just nothing I could say that will do justice to this magnificent piece of progressive rock music. To this day I still haven't heard another Van Der Graaf Generator composition that could even try to challenge the highest regards I have for this work. Let's just say that it's an epic tale that involves the issues of power, injustice and the aftermath. In other words it everything that you want to hear when Peter Hammill's marvelous lyrics are combined with an equally great instrumental composition.Losthas the most ridiculous intro sections that I've ever heard and it does in fact offset the rest of the performance for me. Fortunately the ending section makes up for that miss in a glorious fashion and things get back on track with the somewhat lengthyPioneers Over C.which is a define improvement of the ideas that were explored onAfter The Flood.H to He, Who Am the Only Oneis my favorite album from the bands early years and I definitely recommend to start the journey here!***** star songs: House With No Door (6:03) The Emperor In His War-Room (9:04)**** star songs: Killer (8:07) Lost (11:13) Pioneers Over C. (12:05)"
    },
    {
      "reviewer": "The Quiet One",
      "date": "Posted Wednesday, March 24, 2010",
      "rating": 5,
      "text": "V to d, G to G, is this band the Only One (with those initials)?Van der Graaf's Generator's proper second album(The Aerosol Grey Machine was intended to be a Hammill solo album), H to He, Who Am the Only One, released in 1970 is, surprisingly, an extremely mature prog rock record, I can barely listen to a flaw in the compositional and instrumental aspects. While with The Least We Can Do Is to Wave Each Other the band showed that they were rather original and wouldn't start their career making covers or playing a blues tune like many bands from the time, they were still far from being top-notch songwriters.H to He is indeed a vast improvement over the, still great, previous album, and might be even better than Pawn Hearts, and of course up-there (or better than) with Godbluff and Still LifeAs you should know, this band delivers a one-of-a-kind style of Prog with lead instruments being Hugh's subtle organ and David's original saxophone playing, not something you hear from your everyday Prog band. Also, the other unique and surely most acknowledged feature is Peter Hammill's theatrical vocal delivery. These three components are what make Van der Graaf Generator so original and at the same time, so difficult to get into. If you're able to digest all these three ''special features'', then H to He, Who Am the Only One is definitely the best you can get.Already with the menacing ambience and the catchy organ/sax riff of Killer, the band easily demonstrated the 70's audience that they wanted to be remembered. Peter's vocal delivery is probably my favorite part of the song, he adds an essential strength to the music which very few singers manage to do. The song throughout doesn't have many time changes as you would expect, it's rather straight-forward and pretty structured, yet there's the sufficient subtleties and great instrumental playing to keep the listener's attention all through.The album moves on with House with No Door, giving the listener a break. It's a beautiful song all through, musically speaking, while the vocals can be seen as depressing, though undeniably suitable. The main performer is unquestionably Hugh Banton with his gorgeous piano, fitting bass playing and occasional silent organ playing underneath the piano. Once again, the originality and cleverness of this band can't be clearer.Next there's Emperor in his War-Room, definitely a more prog-oriented song compared to both previous songs. It has the never-ending contrast between delicate passages with David's flute, Peter's less edgy voice and Hugh's gentle organ, and more ferocious passages with the great, though overlooked, talent of drummer Guy Evans, Fripp's singular guitar sound and Peter's theatrical singing. Excellent song compositionally speaking, though I prefer the more simple-headed, though by no means less rewarding, previous songs.Follows-up the second longest song from the album, Lost. Alongside Emperor in his War-Room, these two are the more adventurous songs from H to He. With its windy introduction, you really can't predict what will come next; Peter soon follows the same odd windy melody. However, it's just a matter of time until it changes to a short transitional passage of dark and semi-dissonance themes, very similar to the dark and chaotic passage from Man-Erg. After that, the song mainly travels through tranquil territory, mainly some nice sax lines and floating organ. Still the climax occurs later on when Peter pronounces the words ''I Love You'' in a very meaningful manner, after those words the band gets denser though not necessarily heavier, indeed a fantastic ending to a great composition.The album finalizes with Pioneers Over C., my favorite song from the album and there's a good reason why it is. It starts with some obscure organ playing and resounding percussion which soon Peter would accompany. Suddenly, a groovy bass line abruptly changes the theme, and then once again it changes of pace, this time to a very mysterious one reminding me of Pink Floyd's magnum opus, Echoes. However, once again, this doesn't last long and the band changes of pace again. The band later on repeats all these themes, however with subtle modifications. The reason why this song is my favorite from H to He is that it features most of the great aspects this album offers; there's the tranquility and mysteriousness, there are catchy hooks, a bit of complexity here and there, plus all band members are essential for the final result of this song.As a conclusion, H To He, Who Am The Only One is undoubtedly a classic Prog Rock record for it having 5 highly original and well composed songs, and each different from each other showing different aspects that Van der Graaf Generator is so good of pulling-off, one of them being transmitting spine-chilling lyrics.5 stars: a masterpiece of Prog Rock."
    },
    {
      "reviewer": "SaltyJon",
      "date": "Posted Wednesday, May 12, 2010",
      "rating": 5,
      "text": "H to He, Who Am My Favorite VdGGSo, here it is, the album which I consider to be their best.H to He, Who Am the Only Onehas it all...the so-called \"progressive rock anthem\" of \"Killer\", a softer, melancholy piece in \"House With No Door\", collaboration with Fripp on \"The Emperor in His War Room\", and the truly epic, wild and crazy songs in \"Lost\", \"Pioneers Over C\" and, on the remastered version, \"Squid 1/Squid 2/Octopus\". I've only ever known the album with that track as the album closer, and I don't think it would sound right to me anymore to listen to it without it. I really love this band's sound, though. Some people have a problem with Hammill's voice, it seems. It is definitely an acquired taste, but once you're used to it his vocals are something incredible to behold. Beyond the vocals, the most important elements are definitely the sax and organ. Thankfully, we've got some incredible players for these, David Jackson and Hugh Banton. Jackson's sax always manages to cut right through me, with all his squealing and mad multi-saxing, and Hugh's organs are often truly demented. I love demented organ and squealing sax, so it's not too surprising that I really love this band. For me, the less interesting tracks are those which are more reserved...I loveVdGGat their all-out most chaotic. None of the tracks on this one are weak, though. \"House With No Door\" is probably my least favorite track on the album, though it's got a lot of good stuff going for it. It's just a bit too tame for my preferredVdGGsound. The last two (three, in my case) tracks, though are probably some of the most essentialVdGGtracks to listen to, for me. Ever since I first listened to the album, I was lost in the music from the opening dissonant flute/whatever lines of \"Lost\" on to the little bit of studio dialog captured at the end of \"Squid 1/Squid 2/Octopus\". These three are where the band really gets going to their chaotic best, and as I mentioned earlier I absolutely love the wilder side of VdGG. I realize that up until this point I've somehow neglected to mention Guy Evans and his drumming up until this point. His drumming is sometimes overlooked due to the power of the others, but he's a true force to be reckoned with as well. A lot of others have gone into detail about the vocals. I'll spare you all my poor attempt at that, because other reviewers have already done them good justice, though I will mention that my favorite vocals/vocal performances of the album are on \"Pioneers Over C\" and \"Squid 1/Squid 2/Octopus\". Those two tracks are my favorite EVERYTHING from the album, though, so it's not overly surprising. \"Squid 1/Squid 2/Octopus\" is possibly my favorite track from any of the \"big\" names in prog, and I'm continually amazed/saddened that it didn't make it to any of their albums.For my particular listening habits, this is the band's true pinnacle, followed ever so closely byPawn Hearts. This one is also what I would consider the best starting point for the band, asPawn Heartscan be a bit of a tough listen if you don't know what to expect, while this album sort of eases you into their world with the first few tracks. I definitely recommend seeking out the 2005 reissue of the album, because of \"Squid 1/Squid 2/Octopus\". The other bonus track is an alternate version of \"The Emperor in His War Room\", and while it's interesting it's not more than that to me. Overall, this album definitely deserves \"masterpiece\" rating. Five stars from me."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Saturday, May 22, 2010",
      "rating": 4,
      "text": "A few hours ago wrote a post in which I commented how much I dislike VAN DER GRAAF GENERATOR, but immediately remembered that I had not heard \"H to He, Who Am the Only One\" in decades, so even when my prejudices against this band are strong and never cared for it, decided to give it a new chance.The result is not surprising when you are a fan of Progressive Rock, because you may hate an album for years, but in the 100th listen, find something you haven't found before and start to like it. This is the case with this excellent release, probably have listened it 20 times before today and didn't like it, but this morning one listen was enough to prove me the music is great and enough to pay it at least 5 times in the last 6 hours.The album starts with the fantastic \"Killer\", a track that reminds me of \"21st Century Schizoid Man\", even when there's no real resemblance, probably David Jackson in the powerful Sax is the key for the similarity. But that's not all, \"Peter Hammill\" sounds more or less like \"David Bowie\" in his days as Ziggy Stardust mixed with some sort of Jazzy Psychedelia of great complexity but strong melody that I enjoyed from start to end..\"House with no Door\" starts with a piano and Peter in the vocals in a song that seems like David Bowie singing an Elton John song, a mood that goes on until more or less the third minute, when again a flute that takes us back to \"In the Court of the Crimson King\". Not a very complex track, but extremely beautiful and surprisingly for me, with great melodic sense, and at the end Peter Hammill nicely supported by Hugh Banton in the organ, prove how versatile they are.\"The Emperor in his War Room\" is simply brilliant, it has all the elements to be considered a Progressive Rock icon (even Robert Fripp), the interplay between Banton in the organ and Jackson in the flute is impressive, the radical changes are surprising but always respecting the melody, and of course Fripp performance is as good as usual. A song that has everything.\"Lost\" is a strange song, some sort of hard Rock mixed with a few troubadouresque moments all blended with a huge dose of Psychedelia and dramatics, keeps the listener in constant suspense asking himself what's coming next, and the good thing is that they never disappoint.The original version ends with \"Pioneers Over C\", which is the reason why I won't rate this album with 5 stars, absolutely cacophonic and makes me think that VDGG took the experimental thing too far, weak closer for a good albumMy version of \"H to He, Who Am the Only One\" has two excellent bonus songs, but as usual I won't review them, because I like to comment an album in the way the author released it, of course it's not a reason to leave \"Squid 1 / Squid 2 / Octopus\" (Specially the breathtaking organ solo) and \"The Emperor in his War-Room (first version)\" un-listened, because both are excellent tracks.As I mentioned before, won't go with 5 stars because of \"Lost\", but any rating bellow 4 stars would be unfair for an essential album."
    },
    {
      "reviewer": "EatThatPhonebook",
      "date": "Posted Sunday, May 23, 2010",
      "rating": 5,
      "text": "10/10\"H To He Who am The Only One\" is one of the best prog albums ever made.It's a shame that this album was always behind the shadow of the great masterpieces of VDGG, like \"Pawn Hearts\" and \"Godbluff\". This is the band's first real masterpiece, dense of all the elements that make them so unique sounding. In fact, I might prefer this album to Pawn Hearts. The style is typical Eclectic prog style: very present sax and flute, pretty heavy sounding organ, jazz influences, as well as classical ones.The opener is the sublime \"Killer\", one of Hammill's best creations, with an effective melody and with an impressive wall of sound. The song structure is impressive as well. One of the best eclectic prog songs ever. if the previous track was one of the band's best fierce and powerful songs, \"House with No Door\" is most definitely one of their best ballads. Once again Hammill's voice is stunning in it's beauty and delicacy. Such a fine piece of MUSIC. \"The Emperor in His War Room\" is another masterpiece, that alternates calm and suspended moments with the aggressive organ in the chorus. This is so far the most complex song. \"Lost\", though is even more complex. Another masterpiece, of course, of the same strong impact as the previous track, but it's a lot longer (it arrives to eleven minutes) \"Pioneers Over C.\" is the final track, the greatest maybe. Twelve minutes of what VDGG really wants to do: create some original music keeping at the same time some nice and hearable melodies.One of the best prog albums ever made. I recommend to whoever is a fan of the genre, or whoever is into Art Rock."
    },
    {
      "reviewer": "TheGazzardian",
      "date": "Posted Monday, May 24, 2010",
      "rating": 4,
      "text": "This puzzlingly named album (apparently referring to the basic exothermic reaction of hydrogen to helium, the chemical reaction that causes the sun and stars to be suc excellent sources of energy) shows a band, for the first time, completely comfortable in their own shoes. Their sound is nailed in this album, both their extreme moments as well as their ballads.Killer, for me, represents one of the best tracks from this version of the band. I quite enjoy the lyrics to it, and Peter Hamils singing finally reaches that unique, exaggerated theatric voice of his that I enjoy so much. David Jacksons sax is the other star in the song, squealing all over this epic, high energy track. In this album and the next, the band would experiment a lot with dissonance, (they did so on the previous album as well, to a lesser extent, especially in After The Flood), and we get our first real taste of that here.The next song, House With No Door, continues the theme of loneliness and alienation, although this one takes a complete 180 in approach, relying more on piano and the more emotional side of Peters vocals. Yet, being performed by Van deer Graaf means that this song is anything but a simple ballad; the drumming is far too dense for us to forget who we are listening to, and Jackson makes his presence known as well. I enjoy the lyrics to this track immensely.The next two tracks are both enjoyable, although I enjoy Emperor less than House With no Door and Lost is the only track from this album that seems to disappear from my mind as soon as it stops playing (although I enjoy it while it is on). Each of these tracks is closer to Vander Graafs ballad style than their epic, and the slow curve down in enjoyment is ultimately the low point of this album.Luckily, the low point of this album is not so low, and the album is bookended with the strongest tracks, so you are impressed from the beginning and leave satisfied.Pioneers Over C, like every other track on this album, deals with alienation and loneliness (the Who Am The Only One part of the album title should have given away that this album would feature this theme strongly). Musically, this one is the strongest on the album, featuring both the intensity of Killer and strong, quieter parts. The lyrics rival House With No Door in cleverness, and in this song, Nic Potter truly shines. (I would argue that this track is his best work with the band). It shifts between ethereally haunting moments to catchy sax-backed sections to spacy singing over guitar chords to dissonant sax and back without breaking the coherence of the piece.This leaves us with an album that should not be ignored by any fan of progressive rock who enjoys drama, darkness (11/11 or otherwise), clever lyrics, and an adventurous spirit.Special note must be given to one of the bonus tracks. I usually avoid mentioning bonus tracks, unless they are particularly impressive. (In fact, after the first few listens, I usually stop the album before the bonus tracks start). Squid1/Squid2/Octopus, one of the bands longest tracks at 15 minutes, sounds like it was only cut from the album due to space constraints. It features everything that made this album such a delight, and although it doesn't quite reach the heights of either of their official epics (A Plage of Lighthouse Keepers or Meurglys III), and seems a bit looser in in form than anything else from H to He, I still enjoy it immensely. It is largely an instrumental track, and contains some very adventurous moments from the entire band. This track makes it worth tracking down a copy of the expanded version of this album, even if you already own the original version,"
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Tuesday, January 4, 2011",
      "rating": 4,
      "text": "First of all, I have always loved the title of this album, HE standing for helium. The lyrics of Peter Hammill are great here. His singing is not too shabby either. I don't understand why some have a problem with his vocal delivery; do they prefer cookie monster vocals instead? This was the last VDGG album that bassist Nic Potter played on for awhile(he would be a member of Van Der Graaf, without the Generator, later on). Organist Hugh Banton plays the bass on \"House With No Door\" and \"Pioneers Over C\", while Potter does the other three songs. Guest Robert Fripp does a guitar solo on \"The Emperor In His War Room.\"Of course, we cannot ignore the contributions of saxophonist/flautist David Jackson or drummer Guy Evans, either. I love the early studio albums of VDGG because they have things on them that could not be reproduced in a live setting. The bass, for example, was missing in concert after Potter left; and sometimes you hear both sax and flute at the same time. Not to mention Hammill's sometimes double-tracked vocals which makes his vocal delivery even more powerful. This was released in 1970 when the distinction between \"progressive rock\" and \"heavy metal\" was not yet clearly defined. The riffs on \"Killer\" and \"Pioneers Over C\" have a lot in common with the heavy rock of the time.The album begins with \"Killer\", which is one of VDGG's best and most well known songs. This is simply classic prog at it's finest. Nice mix of organ, sax and piano. The acoustic guitar doesn't really stand out but the song would not be the same without it. Great drumming in this song. Cool harmony vocals in places. I love the modified organ solo in the middle; it almost sounds like a cello. There is some dissonant sax soloing here as well. \"House With No Door\" is the most mainstream sounding song. A great piano-based ballad. I like the echoed hi-hat. Sax and flute play in unison. Nice. Great instrumental middle section. Good piano playing at the end.\"The Emperor In His War Room\" has good flute parts. Some harmony vocals. Love the jazz- rock vamp during Fripp's multi-tracked solo. Some cool call-and-response vocals. I really like the beginning of \"Lost\" which sounds equally jazzy and folky. Great modified organ which gets phased before a jazzy section. Some martial drumming in the middle. Jazzy sax later on. Modified organ comes back and the music does a start/stop thing with modified sax. I like how how the tempo slowly increases at the very end.\"Pioneers Over C\" starts very spacey. Some tom-toms with a great organ riff. The lyrics begin: \"We left the Earth in 1983...\" Hendrix also had a song which mentioned 1983. Silly hippies, if they seen the state of the music industry in 1983 back then, they would have commited suicide. Love the riff on bass/sax/organ. This song changes a lot throughout. More harmony vocals here. Nice acoustic guitar with bells or something in the middle. Some tympani later on before some free jazz style sax playing. Then some fast classical piano and atmospheric organ. Goes back to the beginning parts near the end.The sound and production is really good for an album from 1970. One of VDGG's best albums, but not quite a masterpiece. The only reason I wouldn't give this 5 stars is that some parts of \"Lost\" and \"Pioneers\" are not as good or timeless as the rest of the album. Nonetheless, this is an excellent album and every serious prog fan should at least hear it once in their lifetime. 4 stars."
    },
    {
      "reviewer": "colorofmoney91",
      "date": "Posted Monday, April 11, 2011",
      "rating": 3,
      "text": "He to He, Who Am the Only One was my first Van Der Graaf Generator album, chosen by what I thought to be interesting artwork. After listening to the album, I pretty much decided that VDGG was a band that sounds kind of goofy. Peter Hammill's voice is something that I continue to find extremely annoying, but the music here isn't entirely bad.\"Killer\" starts with kind of a jazzy rock riff, but doesn't exactly sound strong and kind of reminds me of clown music. The song gets darker and more serious near the middle, and actually sounds cool and frantic. The following sax solo is equally frantic and is a nice touch to the initially goofy sounding track.\"House With No Door\" is a soft piano based track with exceptionally annoying vocals. The instrumental portion of the track is very soothing, especially after the frantic previous track.\"The Emperor In His War Room\" starts as a soothing and atmospheric track with beautiful flute playing, but eventually gets a little bit rockier. I find the track to be boring until just after halfway through, where a phat bass groove kicks in, but Hammill's voice ruins it for me.\"Lost\" kicks off on a goofy note, being swift and quirky sounding with Hammill's clowny vocals and quick drumming. There is a rather dark instrumental passage featuring heavy guitar and some slightly avant sax that sounds entertaining and soon gives way to a softer passage. The second half of this track is more enjoyable and is noticeably jazzier and heavier, ridding itself of the goofy impression left by the introduction.\"Pioneers Over C.\" starts out sounding dark and captivating, but Hammill's vocals again quickly set this song on a goofy feel. The music goes through many changes, some jazzy, some more avant, and even a beautiful acoustic passage.This honestly isn't a bad album, and the music is often quite pleasant and dark compared to a lot of progressive rock, but Peter Hammill's voice absolutely ruins the listening experience for me. He definitely has a love-it-or-hate-it kind of voice, and if you can get past it then you will find a terrific listening experience in this album."
    },
    {
      "reviewer": "baz91",
      "date": "Posted Friday, April 22, 2011",
      "rating": 5,
      "text": "The artwork may be one of the weirdest things you'll see, but the music here is as progressive as you can get! For those who are a little confused by the title, I can inform you that 'H to He' refers to the fusion equation where hydrogen is fused to form helium, and the equations are shown on the sleeve. What 'Who Am The Only One' means is anyone's guess . After 'The Least We Can Do...', it seems that Van Der Graaf Generator now threw themselves whole-heartedly into the progressive rock vein. There are just 5 tracks here, but in my opinion 5 is the magic number when it comes to 70s prog. To me, this is a loose concept album, with each of the 5 songs portraying a different story about being alone.WithKiller, we take the form of a shark at the bottom of the sea. The verses are very catchy, but not the sort of thing you'd like to sing out loud. The highlight is the immensely energetic instrumental, which is nearly three minutes in length. This is a great album opener.House With No Dooris a slow, moving piece, much likeRefugeesfrom the previous album. Hammill shows off his impressive vocal range in the last verse. The flute solo is lovely, and the outro is also remarkable in it's simplicity.The Emperor in his War-Roomis a longer track, which is split into two sections. This is a lyric heavy track with very little time for instrumentals. Fortunately, the lyrics are very evocative, with wonderful eloquent descriptions. I particularly like second section,The Roomas it gives great contrast to the otherwise rather repetitive song.If you like your music complex, thenLostis for you. In addition to being over eleven minutes long, this track sports changing moods, tempos and time signatures! This song has tons of verses and changes the perfect amount to stay interesting the entire way through. The musical themes all sound great, and I can find no fault with this track! One particular highlight is the mathematical approach to the instrumental at 8:34, which would be copied later by Rush inBy-Tor and the Snow Dog.Pioneers Over cis a sci-fi song, to go with the scientific formulas found on the sleeve. For example, thecin the title refers to the speed of light. As with the last track, I can find no fault with this epic song. The music is always interesting with musical ideas being thrown back and forth. A wonderful prog classic. The inner gatefold gives a haunting image of what the lost astronauts in the song might see; their galaxy is out of reach, and they are abandoned.If you have not heard 'H to He, Who am the Only One', then you are doing yourself an injustice. This is a shockingly good album, and is on par with 'Pawn Hearts'. Rarely will you ever hear so many good musical ideas on one album, which seems to be a norm with the legendary Van der Graaf Generator. Released in 1970, this album shows VdGG getting prog absolutely right before everybody else."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Thursday, June 30, 2011",
      "rating": 5,
      "text": "1970 was an absolutely fantastic year for the Charisma label. Genesis put out Trespass, Rare Bird released their masterpiece (As Your Mind Flies By), and the label gets to release not one but TWO classic albums by VdGG! H to He Who Am the Only One builds on its predecessors' achievements and diversifies the sound and mood a little - songs like the opening Killer show a bit more of a sarcastic sense of humour in the lyrics, with absolutely furious instrumental breakdowns (of which Jackson's saxophone work is surely the highlight), Pioneers Above C is a bemused puzzle about the implications of relativity for faster-than-light travellers, whilst House With No Door is a broken-hearted lament whose treatment of the everyday, down to earth subject of romance stands in stark contrast to the more esoteric concerns of the previous album.Add a Robert Fripp guest appearance on The Emperor In His War Room, a stark warning to all abusers of power, and you have a package to excite any prog fan. A more than worthy successor to The Least We Can Do..., H to He Who Am the Only One is even more impressive when you consider the status of other major league prog bands in 1970.- ELP were just making their first faltering steps and hadn't cut Tarkus yet. - Yes hadn't yet brought Rick Wakeman in to complete their classic lineup; the Yes album was certainly good, but it didn't yet have their classic sound. - Jethro Tull had yet to completely embrace a prog direction, and wouldn't do so until Aqualung came out. - Genesis were missing Phil Collins and Steve Hackett, and whilst Trespass was a decent enough start I think many will agree it was outshone by later albums. - Pink Floyd were meandering around *still* trying to find a new identity after Syd Barrett left. - Gentle Giant had just cut their debut and were still honing their craft. - King Crimson were undergoing a series of lineup changes, and hadn't managed to produce anything to match their all-powerful debut.All this is enough to convince me that, whilst all of the above bands would grow to their full potential in the 1970s, at the start of the decade there was simply no force in the progressive scene more innovative, creative, emotive, or powerful than the mighty, all- powerful, all-conquering Van der Graaf Generator. And this album, if you listen to it and compare it to any 1970 release from the above, is more than ample proof of that."
    },
    {
      "reviewer": "thehallway",
      "date": "Posted Tuesday, August 30, 2011",
      "rating": 3,
      "text": "How to characterise this strange band? Well, if Gentle Giant are the eclectic group who take Yes's bright harmonies and crazy complexity even further, then Van der Graaf Generator are the eclectic group who take Genesis's thick, chordal sound and dark, philosophical lyrics even further. This is evidenced by the common correlation that people who significantly prefer Yes to Genesis, also prefer Gentle Giant to Van der Graaf Generator, and I am one of those people.This album is not bad, but even it's best song did not blow me away (being the fairly straightforward 'Killer'). What I can say in favour of Van der Graaf is that they are ambitious and unafraid to take chances. The thing is, these chances are always the same: the band plays a riff or a chord sequence for a while, gets bored of it, and proceeds to play five other unrelated riffs or chord sequences, sometimes returning to an earlier one, and thinking that the end result is a \"song\". Okay, in fairness, this only applies to side two of this record, because the songs on the first side have a structure. 'Killer' is catchy, and explores little musical ground but makes up for it with killer organ and sax solos (pun definitely intended). 'House With No Door' is a melancholy ballad of sorts. It's nothing special, but I commend it for being the only song on the album where there isn't a relentless Hammond organ continuously grinding the same few chords into your ears. 'The Emporer In His War Room' is where things start to go downhill, with the pieces now being far too long for what they have to offer, and with no varying instrumentation at all. It is saved, by a decent guitar solo from Robert Fripp, from falling into the same meandering depths of side two.'Lost' is a very appropriate title for a structureless sequence of themes. Even when a couple of the riffs are quite good (which they are), I just can't get the same enjoyment from them when they have no context, no purpose. And this is barely differentiable from 'Pioneers Over C', which is in much the same vein. A few moody organ chords, some minimalistic sax riffs, a bit of dissonance here and there. There's nothing particularly wrong with it, but nothing that stands out from the endless sound collage either.And the whole thing has Peter Hamill's love-it-or-hate-it poetry splattered over the top.The lead singer takes a boring, 'submerged' album and makes it spacey and lofty with his singing, or acting, I should say. His dark poetry that seems to blend \"space philosophy\" with geeky, scientific topics, resulting in some of the most cringe-worthy lyrics I have ever come across. If you're fond of eccentric men theatrically screaming their thoughts on existence, death, time, space and antimatter, then you're in luck. Myself, I would struggle to tell it apart from a list of Progressive Rock clich�s compiled by Rolling Stone magazine, who probably haven't even heard this band.I was disappointed by this band. Although side one of this album is fairly listenable, and worth listening to more often, the other half doesn't benefit from a hundred listens. And thewholerecord is burdened by omnipresent squealing and grinding from the organ and sax, with the aforementioned poetry on top. \"Samey\" is not a good adjective to be describing a progressive rock band with, but that's what it is. I can stretch to three stars on this, mainly for Killer, but the overwhelmingly positive response to this album is a bit shocking to these ears."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Wednesday, November 2, 2011",
      "rating": 4,
      "text": "This album was my first experience with Van Der Graaf Generator and Peter Hammill. I picked up a used copy of the LP because I saw Robert Fripp was a guest artist. And I'll admit that at the first listen, I didn't like it. Hammill seemed overemotive, sometimes out of control, and the music itself, while interesting enough, seemed almost sloppy.But after a nuber of spins on the turntable, something clicked. and Hammill's voice, while still occasionally grating, actually started sounding good to me. And while the band often wrote lumbering prog tunes, the intricacies began appearing to me. And while I wouldn't say VDGG is one of my favorite bands, I do like them enough to own quite a few of their albums.Being the first to me, I still like this one at least as much as any of their albums. And of the five pieces, onlyHouse With No Door, the quietest piece on the album, fails to hold interest. The rest are majestic prog, with strong keyboard and drum work, with some simple outrageous sax work by David Jackson."
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Wednesday, November 16, 2011",
      "rating": 4,
      "text": "'He To He, Who Am The Only One' - Van Der Graaf Generator (8/10)The sixties had finally ended, and progressive rock was now finally standing on its own two feet. Although most of the recognition would go to the likes of King Crimson, Yes, and ELP, it is my opinion that Van Der Graaf Generator released among the most inventive music of the period. Whether it be their unique style, their brilliant use of keyboards, or the gorgeous voice of frontman Peter Hammill, I have found myself more drawn to this band's work than most any other 'classic' prog act. The oddly titled 'H To He, Who Am The Only One' is among the band's most acclaimed works, perhaps only dwarfed by the subsequent 'Pawn Hearts' and 'Godbluff.' Although the band's work here doesn't move me as much as my favourite VDGG music, 'H To He' deserves recognition as a classic in the band's canon.Van Der Graaf Generator is quite clearly a prog rock band, but one thing that makes them stand out is that they were a fair bit gloomier than most of their contemporaries. This reflects in both their music and the highly poetic lyrics of Peter Hammill. Although the concepts and themes that drive this music has much in common with a lot of 'prog,' Van Der Graaf Generator approaches it differently here. 'H To He' delivers Van Der Graaf Generator's signature style in droves; a tight blend of jazz, classical music, and psychedelia. To elaborate, VDGG feel like a jazz band playing classical music through psychedelic rock means. Also notable about the work here is that there is virtually no guitar in their work, although there are plenty of Hugh Banton's gritty keyboard textures that make up for it.The songwriting on 'H To He' favours longer compositions, often based in storytelling or metaphor. 'Pioneers Over C' for example, details the story of a space voyage gone sour, while 'Killer' and 'The House With No Door' are both allegories for isolation. Peter Hammill certainly has a penchant for the morose in his poetry, and this is sure to turn off listeners who want something a little more optimistic. As is common in all Van Der Graaf Generator album, 'H To He' becomes memorable not first as an overall album, but for its many 'wow' moments. Each of the five tracks here are given some amazing passages, be it a gorgeous vocal melody, dramatic climax, or jazzy break. The songwriting and structure of these pieces is excellent, although the main issue with the work here is that all of these songs feel just a little too drawn out for their own good. Even the beautifully tender 'ballad' track 'The House With No Door' feels as if it could have done with a minute sliced off. Much of VDGG's best work has been indulgent like this, but I do feel that 'H To He' contends with this issue a little more than say, my favourite of their albums, 'Pawn Hearts'.That's not to say that there is filler here, merely brilliant ideas slightly short of being used optimally. 'H To He' is not my favourite VDGG album, but there is more than enough here to demonstrate why I love them so much."
    },
    {
      "reviewer": "Prog Sothoth",
      "date": "Posted Tuesday, December 13, 2011",
      "rating": 5,
      "text": "Dem pesky kids 'en their cott'n pick'n noisy keyboards are at it agin. Wait...what?Yep, VdGG aren't your typical rock band with the guitars front and center ready to roast your brain and have your parents wondering where they went wrong weaning you & such. But the band can unleash quite a racket even without much usage of electric guitar fury. They didn't really need it. Blasting \"Killer\" with the windows wide open back in 1970 must've caused some neighbors to build bomb shelters in their back yards. \"Surely the end must be nigh!\"Winding down my obsession with 1970 albums, I figured it's about time to review possibly the cr�me de la cr�me of what prog rock had to offer that year, being H To Da He, Who Am Da Only One, or something like that. It's the highest rated album from 1970 at this time here in the Archives, and it's a doozy. Not only that, but it's the second album they released that year, with their prior album being another corker. These guys pretty much owned prog in 1970 in retrospect as far as their legacy is concerned, and neither of their efforts that year are considered their grandest achievements by many respected and a few derided prog historians. It was the end of one era and the beginning of another, and the Van dudes coasted through that critical juncture like kings on parade.Whereas The Least... had one foot in the sixties and the other looking forward to the seventies, H to He... was already firmly entrenched in the early 70s. The songs are more structure based and technical instrumentally, and experimental moments were based more on avant garde jazziness than acid freakouts. Musically the band had improved, but to be honest I'm one of those few weirdos that, if I had to choose, would have The Least... as my desert island album by the band, since atmosphere and mood are important elements to my listening experience. H to He certainly has it, but it's got nothing on The Least's foreboding sense of terror and hysteria. Still, H to He is one hell of a victory march towards the last days of 1970, and once I was finally able to absorb everything this beast threw at me, I knew I was listening to something special.\"Killer\" starts things off on one of their catchiest notes. Immediately the lyrics are dark and in your face like a freshly baked and freshly thrown apple pie. Cream pies tossed to the kisser is funny, but a 'hot off the oven' baked apple one planted square in the face will not induce laughter. Try it sometime, you'll see. There's a middle section with some wacked out soloing that introduces us to the fact that this band has no intentions of playing things safe. As a whole, though, this tune got me immediately hooked.\"House With No Door\" sounds like something that would have fit snug in Bowie's Hunky Dory, which wasn't even released until the following year. Yep, this band was ahead of much of the game.\"The Emperor In His War-Room\", also known as \"the song with Fripp in it\", is where things started getting rough for me the first couple of listens. The band are getting more adventurous and breaking their tunes into parts now. It's still a good number, and Fripp kicks in right when I needed it since I was feeling a bit, for lack of a better word, \"heavy\" by then.It gets tougher. \"Lost\" bounces around between tunefulness and meandering around for patches, but the payoff at the end is worth it. Hammill's harrowing cries of \"I Love You\" is a theatrical bombshell. If John Cusack was blaring the ending of this epic at Ione Skye in Say Anything instead of \"In Your Eyes\", she would have either ripped her shirt off or called for a SWAT team. Unfortunately we'll never know.\"Pioneers Over C\" is the most difficult of the lot, but still has quite a few memorable moments. David Jackson truly has mastered the ancient martial art of drunken sax playing, and he lets us know it.Unlike their other 1970 offering, this was a tougher nut to crack for me, but I did hear enough cool and downright incredible things rearing their heads here to keep giving it a shot, and now I love this bugger. I'm still having issues with Pawn Hearts even after all these years, and don't get me started on some of their later stuff. H to He, on the other hand, has completely won me over at this point, and yes, it's essential, clever and one hell of a ride if you give it a chance."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Monday, January 30, 2012",
      "rating": 5,
      "text": "Finally! A VDGG/PETE HAMMILL album that I absolutely love! Neither Pawn Hearts, Silent Corner, Camera, nor Godbluff were able to win me over. But this! This is glorious! Great singing, great variety in instruments, tempo and mood.With the opener, 1. \"Killer,\" (8:24) we get great, tight musicianship with powerful vocals. As a matter of fact, this is the first time that I've really felt the power of Hammill's vocals--and how they actually fit the song and the music supports and intertwines with them. Great drumming, and--a first! a truly awesome electric guitar solo. Amazing mix of the instruments, too. I love the wayward sax being mixed so far forward, and then moving all over--as if he's running from the law, trying to get away from the band. And then he fades to back (caught/subdued?) B-vox! Yes, there are strains of King Crimson, ELP, Black Sabbath, and even Moody Blues here, but this is a killer song! My favorite VDGG/Hammill song yet. (18.5/20)2. \"House with No Door\" (6:37) softens the mood with an almost-Hal David lyric, sung quite delicately--and quite melodically. Kind of a pop-blues song of the Procul Harum school, nicht wahr? Love the double flutes backed by flutey organ. Nice restraint from Pete. (I always expect that scratchy-screechy power voice at each song's climactic points.) (I wonder where this song went after the fadeout, i.e. what kind of jam it evolved into.) (8.75/10)3. \"The Emperor's in His War-room\" (8:15) explores some sounds that are more familiar to me from Uriah Heep (organ style) and Jethro Tull (breathy flutes) sounds. Here we also have the type of Hammill vocal that always turns me off: where the engineering/mixing effects used to 'compartmentalize' or 'quarantine' his voice make him feel so separate from the music. Not like \"Killer.\" 5:20 shift in music is very cool--kind of Moody Blues-ish. (17.5/20)4. \"Lost\" (11:17) brings us down the rabbit hole. A very engaging, mesmerizing beginning, swirling and spiraling until church organ and breathy sax comfort us for a few moments. Back to swirling--this is a rollercoaster ride! Now the flat 'recovery' zone--then swirling, climbing, swirling, climbing, until we're in free fall (3:00)--but no crash! Instead, we level out and get to catch our breath. Then a slow climb (military march drums). Where are we going? We're lost! In Limbo! Then it starts again: very slowly the swirling sneaks up on us. Hammill's trying to earn our trust--or hypnotize us! Love the Jefferson Starship \"White Rabbit\" chord change after Hammill sings out \"Reality ?\" Then the JC Superstar descending chords around 8:15 and continued starting at 9:15. \"I love you-u-u-u-u!\" fades Hammill as the train proceeds to its crash ending and souls fade away. Brilliant! (19/20)5. \"Pioneers over C.\" (12:42) starts quietly. I love that Hammill's voice is mixed 'into' the music at this point. A composition of amazingly tight twists and turns--performed to perfection! So tight! Great vocal tricks to portray the various persons/beings in the song. Amazing section from 5:10 to ! So sensitive--almost heart-wrenching! Hammill is a god! Love the tympanis. And the other-worldly sax. \"Help!\" 8:18 section is one of the best space music representations since 2001: A Space Odyssey. Truly a masterpiece of theatric rock. (24/25)No question: A masterpiece of progressive rock. Essential. By far my favorite VDGG/Hammill album."
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Thursday, May 17, 2012",
      "rating": 4,
      "text": "In one word - excellentVDGG is one of the most intresting and demanding band from progressive rock realm that no doubt about it, with Peter Hammill holding one of the most beautiful and haunting voices ever to be heared in this realm, with their third offer H to He, Who Am the Only One is no diffrent, they remains among the ginats of the gewnre untill today. The album released in 1970 at famous Charisma label the second VDGG album from same year is a totaly winner to my ears, when I hear pieces like Killer and specially House With No Door everything turns to pure magic. Little better in passages as previous one, but keeping the same attitude as on The Least We Can Do Is Wave to Each Other, Peter Hammill and co done a great and unforgetable job here. Every musician shines on every pieces, haunting vocal parts all over, all is top notch. It is very surprising to see across the years how this band despite their enormous talent and inovation brought in prog rock zone they remaining in the shadow of names like Genesis, Pink Floyd or Yes. Is strange isn't it. So, this album must be held high when we talk about pioneers of prog rock music. One of the most intresting and catchy albums from their discography and among their best from their first phase. recommended for sure, 4 stars easy."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Monday, June 30, 2014",
      "rating": 5,
      "text": "For this second masterpiece in a row to grace the year 1970 from one of the earliest of progressive giants..... VAN DER GRAAF GENERATOR, I have to put on my Freudian psychologist's hat in order to understand the complexities of the allegories going into the truly poetic lyrics of Peter Hammill, who IMO is the best of the best in terms of singer / songwriter sensibilities in a progressive rock context. Every verse is constructed to milk out the desired emotional response with the musical accompaniment designed to heighten those precise desired effects.This was my very first VDGG album that I ever heard and upon first listening I actually didn't like this at all. It seemed like a very bad pompous version of David Bowie, an art rock artist who to this day I feel has some similarities with Mr Hammill, however as we all know Bowie went in a more accessible direction and garnered well deserved success for his art rock contributions to the musical world and VDGG, sadly, while going down the same path and adding layers of complexities on their work bench didn't quite get the same results and although the magic can be clearly heard after many listens, the contemporary listening audience wasn't ready for such startlingly complex, darkened and mournful music when it was released much like my first encounter.The title of this album has always intrigued me and it is by no means obvious as to what its reference may be, however after listening to this album several many times and studying the lyrics, it seems to me that the odd title H TO HE, WHO AM THE ONLY ONE taken with the obsessive fascination with abuse of power as well as the cover art depicting a lonely pair of legs in space with two rounded objects representing a pair of over-sized testicles makes me think that the actual meaning of this album is to represent the disconnecting nature of improperly used testosterone.H TO HE symbolizes the fusion of hydrogen to helium and the WHO AM THE ONLY ONE changes the chemical symbol He from helium to the subject pronoun \"he.\" This represents the mindset that male humans are the next logical step in creation after the primary building blocks of matter and that a man who is filled with testosterone and damaged psychologically can usurp power and go on to do nasty things by placing himself as the center of the universe and therefore making it possible to justify ruthless actions no matter how brutal or cruel. As far as anti-war stances go occurring in music, it just doesn't get any more poetically perfect or musically masterful than this splendid album by Peter Hammill and the gang.Outer space and inner space seem more similar than not and a true poet like Hammill supplicates these portrayals like no other. \"Pioneers Over C\" perfectly represents this theory IMHO while referencing the laws of physics, it actually has a second meaning euphemistically referring to the tyrannical abuse of power. I see this piece as representing the domination of the natural and social worlds in a detached and frozen manner. The image of a man lost in outer space looking down on the world below viewing the world in disdain as he becomes increasingly isolated from the human family below and as this downward spiral escalates the desire to control and destroy only becomes stronger and stronger until....This album really ramped up the experimental tendencies started on the previous album and because of the musical direction, bassist Nic Potter just couldn't get down with the whole thing and left the band in the middle of recording this album. Organist Hugh Branton whose keyboard playing is a major ingredient to the band's sound picked up bass duties and went as far as incorporating the bass parts with his foot pedals when playing live in addition to his already complex and haunting organ playing. David Jackson continued to amaze everyone with his rare ability to play two wind instruments simultaneously and with Guy Evans staying on as percussionist the band found a stable lineup that would be considered their classic lineup and they would go on to pump out some of the absolute best music ever made on this planet.As with the last album every song flows perfectly into the next mixing pleasant melodies with jarring outlandish outbreaks of cacophonous sounds that perfectly emphasize lyrical subterfuge in their deliveries. Despite my countless listens to this masterpiece of music I am still floored by it. It not only ages well but because of the roundabout way of presenting the lyrics i'm constantly considering new meanings in the lyrical content. An intellectual teaser to say the least but one that fascinates me and keeps my constant interest. Of all the albums I have rated five stars this one comes close to the top of my list for best albums of all time. A timeless classic that I never tire of and sounds better after every listen."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Friday, March 18, 2016",
      "rating": 5,
      "text": "Review N� 64In my humble opinion, Van Der Graaf Generator is with Gentle Giant and King Crimson, probably, one of the three most creative, original and progressive bands that ever existed. With the exception of King Crimson, which always had an impressive number of fans, Van Der Graaf Generator and Gentle Giant, had only a very small but very faithful group of supporters, probably due to the originality and the difficulty of their music.This is my fifth review of a Van Der Graaf Generator's album. The others are their fourth, fifth, sixth and seventh studio albums 'Pawn Hearts', 'Godbluff', 'Still Life' and 'World Record' which were released in 1971, 1975 and the last two in 1976, respectively. 'H To He, Who Am The Only One' is their third studio album and was released in 1970.The line up of the album is Peter Hammill (lead vocals, acoustic guitar and piano), Hugh Banton (vocals, Hammond and Farfisa organs, piano, oscillator and bass guitar), David Jackson (vocals, alto, tenor and baritone saxophones and flute), Guy Evans (drums, percussion and tympani) and Nic Potter (bass guitar). The album has also the presence on guitar of Robert Fripp of King Crimson, as a guest musician. Potter left the band mid-way through the recording sessions. After it, the group decided to carry on without a new bass guitarist, with Banton alternating bass guitar and organ bass pedals. Therefore, the Hammill, Banton, Jackson and Evans quartet is considered the classic Van Der Graaf Generator's line up, and were they, that recorded and released their following great masterpieces.'H To He, Who Am The Only One' has five tracks. The first track 'Killer' written by Hammill, Chris Judge Smith and Banton is a catchy and beautiful dark song. The saxophones of Jackson and the organ of Banton are present continuously and are very well supported by a brilliant rhythm section by Potter and Evans. This is one of my favourite songs from the band. It portrays the usual hunting musical atmosphere that this band is able to create with their music. The second track 'House With No Door' written by Hammill and Jackson is probably the most calm and beautiful ballad composed by the band and it's also a rather depressing track, lyrically speaking. It's a very delicate and dark song and is also one of my favourite songs from the group. It can show us how great this group can be, even in their quietest musical moments. The third track 'The Emperor In His Room' written by Hammill is a track divided into two parts: 'The Emperor' and 'The Room'. This is another very dark song, which is about the consequences of living a life of war and death and describes the act of a tyrant with torture and the dying of the emperor, with some very violent lyrics. It's the fear and aggression that speaks here. This is another brilliant piece of music with great lyrics and with a magnificent flute work by Jackson. Here we can listen to the guitar work of the master Robert Fripp who plays guitar as a guest as he also did on their next album 'Pawn Hearts'. The fourth track 'Lost' was written by Hammill and is also divided into two parts: 'The Dance In Sand And sea' and 'The Dance In The Frost'. This is another brilliant track. It's a song about loneliness, lost, love and madness, also with very good lyrics, which is a Hammill's traditional trademark. There is a lot of musical variety in this piece of music. 'Lost' is one of the most depressing pieces of music written by this brilliant artist called Peter Hammill. The fifth track 'Pioneers Over C' written by Hammill and Jackson also contains the usual hypnotizing sax and keyboard musical lines. 'C' is the scientific name of the speed of light, and this song is a sort of a musical interpretation of faster than light travel and its consequences on the travellers on their voyages. Musically, it's one of the strongest songs on the album, which sounds great, and finishes perfectly well, this wonderful masterpiece. 'Pioneers Over C' represents a mature and complex end to a superb collection of songs.Conclusion: In my humble opinion, Van Der Graaf Generator have five studio masterpieces, 'H To He, Who Am The Only One', 'Pawn Hearts', 'Godbluff', 'Still Life' and 'World Record'. Unfortunately, of all these five masterpieces 'H To He, Who Am The Only One' is the only one that I own a copy only a few years ago. Due to the high quality of the others, I had never paid much attention to it and I always thought that it probably wouldn't be at the same quality level as the other four. I was truly wrong and I'm deeply ashamed of it. But now, I'm finally doing justice to this another great album released by this so fantastic and unique band. To my taste, this is probably the most beautiful of all their albums. 'H To He, Who Am The Only One' was probably released too early for the progressive standards, but it remains, as unique as it was then. It has so many parts of Van Der Graaf Generator's music that have set the benchmarks for many bands to came next. I really think that every musical progressive collection should have, at least, three Van Der Graaf Generator's albums, 'H To He, Who Am The Only One', 'Pawn Hearts' and 'Godbluff'.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Sunday, August 4, 2019",
      "rating": 5,
      "text": "After a few months from their progressive debut, Van Der Graaf Generator released a new album that is similarly based on the two sides of \"The Least We Can Do\": 1) anguished/scary song 2) melodic ballad 3) dramatic song or suite with many changes. In the second side of \"From H to He\", however, \"Lost\" summarizes the distressing and melodic song before \"Pioneers\", that is a mini- suite, arrives.Side A. \"Killer\" is a powerful song, very rhythmic and aggressive, very structured (verse-chorus), with an instrumental interlude where we listen to a throbbing solo of Jackson's electronic sax, that are sounds that are unparalleled in progressive. Hammill's extraordinary voice and Evans's overflowing drums do the rest (Banton is on the bass but here Potter would have done better). After Darkness (The Least We Can Do), again an absolute masterpiece as incipit. Rating 9.5.\"House With No Door\" is a wonderful piano ballad, with melodic openings to the flute, and with a certain prog restlessness that has the merit of not making it monotonous; in the ending Hammill's voice touches more acute notes, the listening becomes sublime and gives way to the beautiful tail with the variations of the piano. Gorgeous, masterpiece, as far as it doesn't reach the superlative level of Refugees. Rating 8.5.\"Emperor\" has got verses with dreamlike atmosphere punctuated by organ and flute that create a very beautiful space-rock mood, it seems to be suspended in space, then chorus with rhythmic progression and dramatic voice by Hammill, which are repeated twice, then bridge, then again verse and chorus that are repeated twice, and new bridge, then variation with largely instrumental interlude where you finally hear Fripp's electric guitar and Banton's overflowing drums, but to punctuate the rhythm there is always the mighty bass played by Potter, then the verse and rhythmic progression with Hammill's voice becoming more dramatic, and a greater sound orgasm, until the slight ending. Very studied and structured song in a controlled way. Rating 8.5.Side B \"Lost\" begings well rhythm, with great work by Banton, followed by a wider part, where Hammill shows off his expressionist singing, let's call it chorus, then another verse and chorus, then instrumental variation dominated by Jackson, I would say almost bandistic; it returns Hammill's dramatic voice, the an interlude with Hammill touching the high notes, it follows pause with organ and sax (we are halfway, 5'30''), Hammill expresses his solitude (\"truly lost\") and returns to sing with an unfolded voice, it seems we are coming to the climax but... this is prog, and then again the instrumental banding digression comes back that extinguishes the emotion for give pleasure to the brain, until finally the voice of Hammill returns that concludes this tiring epic by desperately singing \" love you\" It's a melodic song of love, dramatic, potentially with a lot of pathos, which could have been developed more linearly reaching probably a greater intensity and instead Hammill wanted to offer these continuous variations in prog style that take away some of the emotional intensity but that in a certain way go hand in hand with the emotional ups and downs of the artist, of the lyrics, making the emotional experience more complex and articulate. Rating 8.5/9.\"Pioneer over the C\" starts slowly, starring Banton, then Hammill explains that the pioneers who travel beyond the speed of light left Earth in 1983, and then the bass, here again played by Banton, inaugurates a new passage where Hammill sings \"It's all dark around\" and the music, like a symphonic poem, describes well the emotional state of the singer, with all his ups and downs; the rhythms change continuously while Hammill proclaims \"We are the lost ones, we are the pioneers\", Hammill's astral journey traces his solitude in the world, Banton's bass returns for another progression that leaves space for new atmospheres suspended in the space followed by dissonances and here the piece becomes a suite that, like the last song of The Least We Can Do, constitutes the sum of the whole record, summing up the whole music heard so far in a synthesis that also assumes avant-garde connotations thanks to experimental sounds to the sax, atonal, followed by a jazzed space-rock diversion, which fades while the voice of Hammill returns; finally, for the third time the bass turn, confirms that this piece must be heard as a sung symphonic poem, until the dissonant ending arrives. Rating 9.\"The Least We Can Do\" and \"From H to He\": We are facing the second consecutive absolute masterpiece by Van Der Graaf Generator (difficult to choose which is the best), surely, in my opinion, the two best English albums released in 1970. Compared to \"The Least We Can Do\", compositions are on average less melodic and more elaborate, i.e. progressive. We have seen in this album, starting from the first two pieces, the deconstruction of the song form to arrive at increasingly longer and more articulated pieces, composites, with various melodic and instrumental passages assembled together to finally arrive with \"Pioneer over the C\" to the mini suite that describes a journey with music and lyrics representing a program music, a symphonic poem sung. Hammill marvels at his state of inspiration, his ability to transform in music the mood of his verses and confirms himself as one of the most gifted songwriters of all time, with exceptional intelability and depth.Rating album 10/10. Five stars (and more)."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Sunday, June 18, 2023",
      "rating": 4,
      "text": "The rock effervescence of the late 60's and early 70's inspired many bands to express themselves incontinently, and the progressive side was a clear catalyst for this. Albums followed one after another, even within the same year. King Crimson with \"In the Wake of Poseidon\" and \"Lizard\" (1970), or Yes with \"The Yes Album\" and \"Fragile\" (1971), are a couple of examples of this. VDGG was no stranger to this contagious phenomenon, and after the release of \"The Least We Can Do Is Wave to Each Other\" at the beginning of 1970, they hit the road again towards the end of the same year with another fundamental work of their discography, \"H To He, Who Am The Only One\".With their particular style, VDGG continues to experiment between the earthy and the fantastical, always with a deep somber look. As with the rabid \"Killer\", the story of the ruthless and troubled shark condemned to solitude by his own murderous nature, crudely narrated by Peter Hammill and accompanied by David Jackson's stormy saxophone; or the reflective \"House With No Door\", with Hammill's nostalgic whisper that towards the end becomes a lure; or the dark \"The Emperor In His War-Room\", and Hugh Banton's timeless Hammond.But it doesn't stop there, \"H To He, Who Am The Only One\" reserves for the end two extensive instrumentally demanding themes: the sorrowful \"Lost\" a poem that develops between tension and despair, and the fictional \"Pioneers Over C\" that floats in the space between melodic harmony (the delicate acoustic guitars and keyboards, impeccable) and bewilderment (the detail of Jackson's hesitant and dysphonic saxophone abandoned to its fate in the middle of the song is only comparable to the Crimsonian ramblings of Robert Fripp).A final not minor detail, the 2005 remastered edition includes the remarkable \"Squid 1 / Squid 2 / Octopus\", a huge gift from the \"Pawn Hearts\" recording sessions, accompanied by the interesting first version of The Emperor In His War- Room\".Excellent album.4 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album9ddd.html",
  "last_parsed": "2025-05-18T12:42:49.159657"
}