{
  "album_title": "FEAR OF A BLANK PLANET",
  "artist_name": "Porcupine Tree",
  "artist_page_link_local": "artistdc59.html?id=290",
  "year": 2007,
  "rating_value": 4.29,
  "rating_count": null,
  "review_count": null,
  "genre": "Heavy Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/290/cover_2318171952016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Fear of a Blank Planet",
      "duration": "7:28",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "My Ashes",
      "duration": "5:07",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Anesthetize",
      "duration": "17:43",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Sentimental",
      "duration": "5:27",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Way Out of Here",
      "duration": "7:38",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Sleep Together",
      "duration": "7:30",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "TRoTZ",
      "date": "Posted Monday, April 16, 2007",
      "rating": 5,
      "text": "There is music. And there's music with substance. Music which, from feeling to feeling, touches our soul, even for a glimpse. Music to be loved. Art. How many artists can we say, 18 years later, to have sensibility to build, one after another, true odes to Human Feeling. And so, this is no immediate music. This can only fully be understood by a focused commitment, a strong and willed desire to understand, to seek for the inconspicuous beauty on it. The album is one of the most cohesive and intense albums Porcupine Tree have ever made, flowing, from piece to piece, to a glorious 50 minute journey of self consciousness and liberation.10 year-old kid. \"The pills that I've been taking confuse me\". Pills for emptiness. Futility. Ephemeral. All the drugs that seem to take out the humanity in us, which make we forgot that the most beautiful is not what is seen, but indeed what it is felt. And in this way the title track flows, an energetic and blasting convincing rock opener, resembling the mood of \"Deadwing\" track: anger-climax-peace, with some psychedelic piano paintings in the middle. But the album then evolutes to a different kind of feeling, different from the overall nostalgic, sad, quasi-romantic feeling of its predecessor. Strings put \"My Ashes\", a sweet quasi-acoustic layered track, to an ethereal level, elevated by the kid's comprehension that part of him is empty \"And my ashes find a way beyond the fog, and return to save the child that I forgot...\". And then the album flows into its art peak. All the subtle feeling, all the utterly blistering sonic rock power blended in one song. Anesthetize. Memorable refrains, impressive riffs (with some touch of post-metal), disturbing soundscapes, splendid cascades of celestial backing vocals and even ethereal zen moments, all together fueled by some precious moments like \"You were stolen... there's black across the Sun...\". It ends. Terrifying, only 17 minutes? Next one, Sentimental. Sentimental is the moment to cry. All the emotions evoked until now explode in the piano-laid dreamy guitar tone of the track: \"I've wasted my life... I'm hurting inside...\". No excesses or dramas, just feeling as the way it is. Time to recover is not encountered on \"Way Out of Here\", another moving track, with some anger explosions, leaded by its disturbing soundscapes, marking bass lines and with the delicious original guitar solo. And then it comes the last track, \"Sleep Together\". Class. The band had reinvented themselves again. They did what it seemed impossible. To fuse perfectly the most bizarre and psychic electronic industrial a la Nine Inch Nails with the most majestic symphonic arrangements. The album ends in a cathartic explosion of strings. We're literally disintegrated in particles, voyaging through the cosmos infinitude. \"Let's leave forever\". Leave forever. Forever from this, many times, inhuman place we call Earth.Then the album ends. We're shocked. We want more. And then we put the album from the beginning. Feel, cry and leave again. Like we were in an intense and beautiful dream. The dream of escaping from this blank society, in which we assist growingly to the terrifying indifference of pointing a gun, of causing suffering, of killing. Lives guided by destruction.This is truly one 50-minutes piece track, divided in 6 movements. These movements seem to obey almost perfectly to the Freud's sequence of the human behavior after a shock: denial/rage -> consciousness -> depression -> motivation to change -> liberation. This understanding transform the album perception in an disturbing and dramatic voyage to a stereotyped kid's ego.And so, this album was made to represent the manifest against the emptiness that plagues humanity. Steven Wilson has the power to touch people. Every single album of the band has its own feeling. I still can't resume what I feel in this album. But it feels a lot... Masterpiece."
    },
    {
      "reviewer": "Heptade",
      "date": "Posted Tuesday, April 24, 2007",
      "rating": 4,
      "text": "It's safe to say this is the most anticipated album of the year, and will probably remain that way. Just released in Canada, bought from iTunes this morning, so here we are! And darn, if it isn't really the heaviest and lightest PT album of all time, as some have said. The metal riffs on this album are even more metal than those on Deadwing, but are much better integrated into the tunes, as they were on some of the earlier albums, and the spaciness is still very much evident. It also really feels like a band album, as Gavin Harrision and Richard Barbieri perform wonderfully (note the extensive use of mellotron-like and string- synth textures. Tasty!) No \"Shallow\" here, thank god. Wilson has returned to some of the \"Floydian\" (note the \"-ian\". There's no Floyd cloning here) textures of yore. The long track \"Anesthetize\" does indeed go through some convolutions, going from mellow to heavy to an ethereal finish. Nice to hear Lifeson's usual great taste on his solo. The Beatles by way of Marillion \"Sentimental\" is another highlight, a nifty little ballad, as is another morose ballad, \"My Ashes\". Overall, this album may seem like more of the same from Wilson, but the various strands of PT's sound (metal, ambient, prog, dream pop) are pulled together better than ever on this record. The lyrics work much better for me than many of SW's more personal lyrics of the past, although I must admit that I am a sucker for a topical concept album. One more note- I had feared that \"Deadwing\" seemed to cater too much to the new rock market, but if Wilson was really concerned about appealing to the teens of today, I doubt he'd have written a concept album analyzing their behaviour and their future, an exercise that many kids would probably have considered patronizing. I'm a lot older though, so I dig it! Not quite a masterpiece, but definitely on a par or perhaps even better than In Absentia, Lightbulb Sun and Stupid Dream....4.4 stars!"
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Wednesday, April 25, 2007",
      "rating": 5,
      "text": "What is it? Porcupine Tree fully embracing progressive rock songwriting but with a sound and lyrics that instead reflect the perspective of a depressed, angsty teenager.Voice (4 stars) ? Singing style improved upon 'Deadwing' with 'Way Out of Here' showing better utilization of the vocal effect that makes him sound distant (as if singing through a telephone). Vocals take a more angsty route given the perspective of the teenager. An excellent album lyrically ? with the juvenile lyrics often memorable and/or hard-hitting (take 'My Ashes' or the beginning of 'Way Out of Here'). Vocal delivery is at its most simplistic and juvenile in the title track, but I can't help but smile hearing him sing lines such as 'xbox is a God to me', 'my mother is a bitch', 'their music is crap', among other childish phrases. The age of the singer unfortunately comes through, killing the immersion a bit, particularly on parts of 'Anesthesize'.Sound (5 stars) ? We have again reached perfection in terms of instrumentation, this time the musicians themselves. Steven Wilson's guitar playing reaches its pinnacle, the bass lines are as good as ever, the keyboards create all needed soundscapes in the best way possible. Last but not least, Gavin Harrison's performance established him as one of the best drummers in rock history ? often playing extremely complex odd-metered rhythmic patterns, sometimes in the form of polyrhythms, yet such complexity musical, borderline melodic. The band plays symphonic balladry ('My Ashes'), angsty punk rock (title track), loud prog metal bursts, industrial/electronica, eerie extended prog rock passages and in the case of the long 'Anesthesize' all of the above. The best example of the musicality of the band is the last 90 seconds of 'Way Out of Here'. The sound production of this album while very competent is not among Steven Wilson's best work, but it is hard make a deduction given the instrumentation present.Song (5 stars) ? The songs are part of a concept album though stand on their own. The album is dynamic, but avoids accidental tonal whiplash, given the right placement of heavy metal bursts and changes of mood. Other than two powerful, emotional ballads ( the string-laden 'My Ashes' being particularly heartbreaking), we have a lengthy angsty title track (that may work best edited down to a compact 4-5 minute song), the dynamic but always haunting 'Way Out of Here', the electronica-tinged 'Sleep Together' that also includes a strings section, and of course, the very impressive 17-minute long 'Anesthetize' that has a lot to say, but takes its time developing its brilliant themes. My favorite themes being the tribal percussion blending with stretched vocals, or the odd-metered industrial riff around minute 5.Key Tracks: My Ashes, Anesthetize, Way Out of Here, Sleep Together"
    },
    {
      "reviewer": "Slartibartfast",
      "date": "Posted Wednesday, April 25, 2007",
      "rating": 4,
      "text": "Not another Fear of a Blank Planet review, oh no! Afraid so.Not much I can add to what's already been said. I had the deluxe edition with audio DVD on order, but when I saw it hadn't shipped on the U.S. release date, I cancelled and went to the local record/electronics store. I got the last copy on the shelves. I was hoping to get Marillion's new one, Somewhere Else, but they didn't have any, or any Marillion at all for that matter, so I'll be getting it somewhere else. I'm afraid this one's going to overshadow it anyway so it's probably a good thing I had to put in a mail order. This one does pair up nicely with the new Nine Inch Nails, Year Zero, that came out the week before. They even have similar color schemes for the covers.There's no groundbreaking music here, but it's basic Porcupine Tree, and therefore quite good. I've got most of their studio releases except for Lightbulb Sun (hope to see a remaster soon), since I didn't discover PT until late '04, and like everything in the catalog, even the sometimes maligned On the Sunday of Life. Fans will hear a lot of musical elements they've heard before. Thematically the lyrics are similar to a lot of Deadwing's. The opening song, Fear of a Blank Planet, is very similar to Deadwing's opener, starting out like gangbusters. You have the occasional heavy metal gunk gunk gunk guitar, but it's certainly not overdone and I think PT has actually taught me to enjoy it. I know as a musician it's fun to get loud and heavy sometimes. It's a great album to just sit down and listen to, which is the hallmark of any good progressive album. I also appreciate getting the lyrics in the package, which was missing from Deadwing.I'm still absorbing this album, but I find it one of their best, which isn't saying much since they're ally good. The music is very rich and worthy of sitting down and listening to with your undivided attention."
    },
    {
      "reviewer": "The T",
      "date": "Posted Sunday, May 6, 2007",
      "rating": 5,
      "text": "A few years from now, whenever people name the most important progressive rock bands of each decade, the list would look something like this: Yes and Genesis in the 70's, Rush and Marillion in the 80's, Dream Theater in the 90's, and I think now it's safe to say that, from the 00's, there won't be any doubts in which band to single out as the most important for our beloved genre: Porcupine Tree. And if that analysis was correct a few months ago, after the release of FEAR OF A BLANK PLANET, now it's easy to say that it's the complete and absolute truth.Porcupine Tree has been a band in constant movement. After the psychedelic/spacey era came a more \"pop\" era, when brit-pop-ready melodies where mixed with prog arrangements and obscure, depressive sounds; then, as times went, their music shifted towards a more metallic side, no wonder as the group's main mastermind, Steven Wilson, collaborated and a lot with Swedish progressive-death-metal formation Opeth. After two releases filled with heavy sounds and morbid stories, The Tree has finally joined all their influences together in what may be their most accomplished album to this date, a record where all the elements of the past are here, maybe with the exception of the dance rhythms of UP THE DOWNSTAIR: we have metal a la Tool and even heavier riffs bordering on extreme; we have beautiful melodies with those dreamy, atmospheric choruses where Wilson doubles himself in vocals and sends all of us to the lands of narcolepsy, we have soft parts that could pass as pseudo-brit-pop but with that blue, sedated flavor that Wilson injects in his music; we have psychedelic sections, and we also have true prog moments, where The Tree seems to have finally accepted their belonging to the same genre of some of their most respected figures as King Crimson's Robert Fripp (who, by the way, lends his \"soundscapes\" to the song \"Way Out of Here\"). To put it briefly, take a dose of DEADWING (specially the harder parts, don't expect a \"Lazarus\" moment here), a little bit of STUPID DREAM (the darker parts), a little bit of SIGNIFY (the return to some grooving bass-lines and narcotic vocal harmonies), add some new ideas and influences, and you got FEAR OF A BLANK PLANET as the result. A darker, if lighter, album than its predecessor.I can't go into the songs without saying a few words about the playing itself. This is probably PT's best album in regards to performance and level of musicianship. Steven Wilson is, as always, right on target with his accurate playing, nothing too virtuosic, never showing-off, always doing things for the overall atmosphere's sake; Barbieri, as usual, proves a valuable right-hand to Wilson, adding to the musical ambience with enchanting sounds; Edwin, an underrated bassist, with a precision and a sense of \"groove\" that few bassist possess, some of his bass lines just make the listener want to, again, groove; and, finally, the best proper instrumentalist in the band, Gavin Harrison, a true master behind the drum kit, an expert in groove, in rhythm, in precise fills, phantasmagoric rolls, aconnoisseurof the art of playing with the cymbals, and in this album, even a master of the double bass. If there's a performance here that deserves some extra credit, is Harrison's.Let's review the songs:Fear of a Blank Planet (9.5/10) If we were to divide this album by corresponding parts to earlier records, this would be the \"DEADWING part\". Very much like the song of the same name in that album, this one starts with a fast, grooving rhythm that seems unstoppable. Wilson sings - almost speaks - with utmost quietude, just like in \"Deadwing\". The movement is relentless, as is the ordeal that Wilson describes to us in the lyrics, a no-exit meaningless life. The chorus is somewhat melodic, just as a hint of morbid, sick color in an otherwise black-and-white existential nightmare. The middle section is dark, somber, atmospheric, with a fantastic fill by Harrison who, without doing much, shows, curiously, so much. Near the end we enter the final stages of the nightmare, a more slow passage, when the narcotic vocals announce us that, though the dream is nearing its end, we won't wake up, we'll be sedated, narcotized, drugged in a senseless life forever.My Ashes (9.5/10) This song takes us back to the STUPID DREAM-LIGHTBULB SUN era, with Wilson singing/lamenting over a sleepy acoustic guitar and some touches by the piano; then the chorus, with Wilson doubling his coma-inducing voice sending us all to non-optimistic territories. The music is so sedated, it's like musical-heroin (not that I've tried the real one, nor would I advise to do so, but it HAS to be like this). Some strings cooperate in making this track a complete dream-like experience. After it's over, we are not sure if we actually heard it. Great song.Anesthetize (10/10) The first proper 15+ minute epic by The Tree since the SKY MOVES SIDEWAYS days, it doesn't disappoint. It's sort of divided in three big sections. The first big section starts with percussion and Wilson singing with his rather simple-yet- unique nerdy voice, before growing and showing us he actually can sing. Another narcotic experience, this is not good; I don't mean it musically, as this is fantastic, but in general, feeling like thiscan't be good.. Incredibly atmospheric part, it evolves into a harder, distorted section with keys that make it feel even more epic than its length foretold us, or, to say the truth, that give it true EPIC status. Then a bass line in an oddly-chosen grooving, almost jazzy time with drums adding to the driving energy. Alex Lifeson of Rush provides a guitar solo in this track, and it works, but it's nothing essential as the quality of the song ultimately eats it, makes it look just like another section in a brilliant track. Harrison's drumming is inspired. Then we enter a more metallic arena, with dissonant chords that sound almost Opeth-ish in their violence. This section sounds a lot like some parts in DEADWING, yet with a groove that wasn't present as much there as it is here. Some measures sound like straight progressive-metal (I won't dare mention who they remind me off, I would be crucified). But only a FEW measures. Brilliant, Opeth's partnership with Wilson has helped in both ways, making Akerfeldt's outfit better and also enhancing The Tree's sound. An awkward double bass drum section that sounds too heavy for The Tree leads us to the final \"chorus\" in the second big section and serving as bridge towards the third. The tempo is slower now, meditation, analysis, constant reflexion upon one's own putrid life. But with such beauty. Telling a horribly pessimistic message while making you dream with prairies full of dark trees and rainy, grey clouds above, that's what Wilson achieves in this song. He paints an atrocious beautiful atmosphere, he creates a musical contradiction where we hear beauty that conveys ugliness, light that means darkness. Superb. One of the best songs in this bands' catalogue.Sentimental (10/10) After such a rollercoaster what can we expect from Wilson but. more narcotic atmospheres? Some piano chords that sound like Coldplay immediately followed by a masterful vocal line by Wilson, in a song that sounds like a mix from the styles of SIGNIFY and STUPID DREAM. The chorus is just pure beauty. Perfect. And, as always, we're talking beautiful darkness in here. As the covers says: a child, the image of innocence, with eyes that announce evil, not evil embedded in his soul but in his surroundings, which eventually will reach his soul. What a piece. Wilson is really the songwriter for the End of Light, yet his pen writes with bursts of luminosity that only help to denounce the blackness of what lies around it. The end of the song is pure SIGNIFY-era PT.Way Out of Here (8.5/10) Robert Fripp's \"soundscapes\" guest-star in this song, which doesn't really need them. But the homage is correct: when I first heard IN THE COURT OF THE CRIMSON KING I couldn't help but feel dazzled at how ahead-of-his-time Fripp was in 1969 when I realized he was one of the major influences behind Wilson's music. Now, Wilson has invited him and the master joins the pupil, yet for me, it's Wilson who has turned into this age's true master. Another atmospheric, dark song, with more energy but no more hope than the last ones. The song is longer than needed but it's great nevertheless.Sleep Together (8/10) The weakest track in the album is very good anyway. My problem with this song is that it's too cold, too life-less. Whereas all the preceding tracks, though somber and disturbing, were full of emotion, this one sounds cold, mathematic, Crimson-esque. It's good narcotic music but lack the feeling of all the previous ones. But the band is so good that even their less brilliant song is a good song that could work on any other album by any other band.I have such a big pleasure in saying that here I finally have a new album by one of my favorite bands that hasn't disappointed me and that actually, if not towers over, at least lies at the same level of their best works. Actually, even though I'm giving the album a 5/5 score, it's really a 4.75/5. Without the last track, I could've said without any hesitation that this IS Porcupine Tree's best record to date. Unlike Pain of Salvation, Spock's Beard, Threshold, and, sadly, maybe unlike Dream Theater (I don't expect that much from their future release), Porcupine Tree has delivered, Wilson has lived up to the expectations, this album finally has forced me to include Porcupine Tree among my top 5 or 6 bands. It's just fair justice.Recommended for: every fan of good progressive rock, mostly, of course, to fans of Porcupine Tree, psychedelic prog, dark, depressive, narcotic music.Not recommended for: I don't know whom not to recommend this album to. Maybe to people searching for soul-lifting music, optimistic music. This is not going to give you any hopes for the future of your life.. but it surely does for the future of progressive rock and music in general. So get it anyway."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Monday, May 7, 2007",
      "rating": 5,
      "text": "One of the principal attractions of progressive rock music is the mental adventure it provides in my otherwise uneventful life. Back in the 70s I knew that when I acquired a new album from Yes they were going to take me somewhere music-wise that I had no inkling I'd ever go and they never led me to the same place twice. This also applied to Genesis, King Crimson, Pink Floyd and a host of similar groups and artists. In the 80s and 90s I got the empty feeling that that kind of exploratory spirit was gone forever but I'm pleased to say that in the 21st century, with Porcupine Tree and some others leading the way, that essence of inquisitive risk-taking and aural experimentation is alive and well. With \"Fear of a Blank Planet\" this talented band has once again given the world a work of art that is intricate, brilliantly stimulating and thought-provoking. It's all I could possibly ask for.The opening title cut is primo PT in that their highly focused, intense music blatantly contradicts the unengaged subject matter of the lyrics. While the tight track cuts the sky like a vapor-trailed jet, the words describe a young person who is but a shell of a human as he proclaims \"Don't try engaging me/the vaguest of shrugs/the prescription drugs/you'll never find a person inside.\" Modern medicine and society has somehow scooped all the life and ambition out of him to the point where \"there's nothing left/I simply am not here.\" It's the very juxtaposition of electrifying music over depressing lyrics that elevates the song into the realm of true art. Gavin Harrison's drums in particular are forceful and direct as he continues to improve with every record and the blend of different instrumentation keeps the tune from ever becoming predictable. Steven Wilson and Richard Barbieri intertwine guitars and keyboards into a tapestry so deep and rich that it's hard to distinguish one from the other. \"My Ashes\" is a slower ballad that mixes acoustic guitar and piano with an orchestral score that is refreshingly understated. The lyric here is much more indistinct and stream-of-conscious as the singer seems to be a disembodied personality reviewing a life full of wasted chances. Wilson's undeniable gift for melody is intact and his charismatic voice is more versatile and mature than ever before.\"Anesthetize\" is a suite in three parts that engulfs the senses. Starting with Harrison's Phil Collins-like rumbling drum patterns rolling over sparse guitar, keyboards and a glockenspiel, the song describes a troubled kid who is seeking help but is being answered with an unsympathetic response of \"shut up/be happy/stop whining/please.\" The tune then segues into a more rocking beat with guest Alex Lifeson contributing a biting guitar solo before things take a distinct metal heading as you learn more about the protagonist's confused life. The help he sought has come in the form of numbing pills instead of loving interaction. He tells us he's \"watching TV/but I find it hard to stay conscious/I'm totally bored/but I can't switch off.\" Again the driving music contrasts the hopelessness of his existence. It's like a river that keeps twisting and turning across the land, never allowing itself to stagnate. This second part of the suite builds and builds to a ferocious explosion of double-bass drum propulsion and metallic density that would rival Dream Theater and make them proud. Dropping down into a 12-string- dominated vocal collage of cascading words, the dreamy third section is elegant in its simplicity. I get the impression that the boy in question has met an untimely death and his mourning friend is sitting by the ocean, thinking about him and his brief time on earth. \"The water was warm that day/I was counting out the waves/and I followed their short life/as they broke on the shoreline/I thought of you\" That is poignant poetry, my friends.The next song, \"Sentimental,\" expresses a universal feeling that every generation of teenagers shares. \"I never wanna be old/and I don't want dependents/it's no fun to be told/that you can't blame your parents anymore.\" In other words, it's no easier growing up now than it was 40 or 50 years ago (and it was no piece of cake back then). Here Gavin utilizes just his toms and high hat in the beginning, creating space for Colin Edwin's underrated bass playing to act as the glue holding the song together. Toward the end the band tosses in some dynamic accents and a strange, diffused carnival-in-the-distance sound whispers hauntingly around the ethereal music. Beautiful. \"Way Out of Here\" follows and it is a stupendous union of Wilson and the great Robert Fripp wherein they create something so unique that it's almost indescribable. (But I'll try). It features another subliminal lyric about someone wanting to escape the guilt of a horrible deed be it real or fabricated in his spaced-out brain. Fripp is credited with \"soundscapes\" and on some subconscious level I actually know what that means. The tune alternately lulls you to sleep, then smashes into metal heaven profundity. Harrison's drums are phenomenal and the ending is almost spiritual as the orchestra slowly ascends into the upper reaches of the stratosphere. Wow.Wilson has never been one to shy away from embracing the darkest corners of the psyche in his music and \"Sleep Together\" is no exception as it starkly bear-hugs the tragedy of suicide as a solution for all this ennui. A pulsing synthesizer pattern establishes an ominous aura before Gavin slams into the song with a power that would impress even the legendary John Bonham and Dave Stewart's string arrangement of the orchestral climax is nothing short of exhilarating. It's a perfect album ender. The couple in this tune sees no point in continuing their walk on this planet and they contemplate whether they should dramatically \"switch off the future/right now/let's leave forever.\" Of course that doesn't work because it's my belief that you will pick up right where you left off in the next world. And so it goes.I find it interesting that Steven writes so fluently about the apathy and torpor of today's youth, yet he is a classic introvert who refused to succumb to inaction or sloth and has never stopped in his determined effort to find and express his inner visions. He may be a tortured artist but he's a fabulously prolific artist, nonetheless. This album is another masterpiece in a string of astounding recordings by this band and the fact that they're still not universally recognized and admired is a befuddling mystery to me."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Saturday, May 12, 2007",
      "rating": 5,
      "text": "An Album That Stirs my Emotion!This album came to me, right after I completed my 1,000th review at this site, altogether with Steve Hackett's \"Wild Orchids\" (well, I know, I'm quite late in ordering this CD). I was considering quite a long time on decision which one would go first for my CD player? After asking opinion of prog colleague Purwanto (Prog Reviewer) finally I decided to take \"Fear of A Blank Planet\" first because I was quite curious about rave reviews made by reviewers at this site. To be fair, I had to use a decent (not luxurious!) stereo set at home: NAD Integrated Amplifier, Phillips CD Player and B&W series 6000 bookshelf speakers. As usual, I expected something great sonic quality from any CD that Porcupine Tree has ever released, so I turned the volume LOUD to enjoy any subtlety that would be produced from the CD. Boom! Yeaaaahhhhh ..!! Man . I was totally satisfied at first spin of this CD that I enjoyed in its entirety at first listen. I even played many times and by the time I'm writing this, I have been spinning (including this time while writing) 8 times. The fourth spin was through my LifeDrive PDA because I managed to rip the CD into MP3 with 192kbps bit rate. But most of them I spin at home with LOUD volume. One thing for sure, this album stimulated my hormonal activities and stirred my emotion at first spin! It's truly awesome! Honestly, while you are reading this review, you might feel a sense of \"energy\" transmitted through my fingers which type this review with great enthusiasm because I have been experiencingnggeblakfor many times while enjoying this album. Am I exaggerating? Of course NOT! For your information, I'm quite sensitive anything related to music, especially prog! And .. this album makes me totally paralyzed - mind-wise! Well, you should try by yourself!\"Stupid Dream\" and \"In Absentia\" MarriageMusically, this album is a great mix of the band's \"Stupid Dream\" and \"In Absentia\" albums, leaving off almost completely the mundane (my view, and it's very subjective!) \"Deadwing\" album. Why do I say so? There is basically minimum component of psychedelic ingredients in this album as in the case with \"Deadwing\". A very clear proof of my view is demonstrated through second track \"My Ashes\" which is actually a mellow track. Observe this track carefully and you will find that this music is composed with a basic structure of Stupid Dream's \"Even Less\". \"Even Less\" was initially a track that bored me (Hey, this is an opening track of Stupid Dream! What will happen if the first track is already a boring one?). After couple of spins of Stupid Dream I finally could enjoy the album in its entirety and .. not only that, I adore this album! \"My Ashes\" and \"Even Less\" are somewhat interconnected - basic structure and melody-wise. While enjoying \"My Ashes\" you might tend to sing along \"Even Less\" melody. Try it!The mix of these two albums into \"Fear of A Blank Planet\" album represent soft as well as heavy side of Porcupine Tree music. Why? As you might read my review on \"In Absentia\" album, you might discover that this is an album that represents the heavy side of Porcupine Tree. I believe, in part, it was due to close relationship of Steven Wilson with Opeth. Yeah, I believe that there was a very close relationship, musically, between Steve Wilson and Mikhael Arkedfelt of Opeth.The result of this marriage is an awesome music!Dark NuanceFrom the cover with bluish style, it can be expected that the music is going to be dark. In fact, the CD inlay, lyrics and the website of the band are showing something with dark nuance. Free interpretation of \"blank planet\" might vary from one to another. AS the lyrics convey something to do with kid who is so engaged in front of computer screen. This can be enjoyed on the opening title track which starts where a kid is typing the keyboard to log on certain site. Lyrically, the song depicts a situation where a kid is busy with his own life: x box, mother is a bitch, father never talk to him, pornography (over internet), etc. The verse also says: \"My friends says he wants to die / He's in a band / They sound like Pearl Jam / The clothes are all black / The music is crap\". The music in this opening track is somewhat in the vein of \"In Absentia\" album and a bit lighter even though the riffs are similar. The second track \"My Ashes\" still projects about darkness, in mellow style.Great Guest MusiciansThis album welcomes the contribution from very talented musicians: Alex Lifeson (Rush's guitar player) and Robert Fripp (King Crimson's composer and guitar layer). This represents the marriage of vintage rock and modern rock. I believe the result must be awesome! \"Anesthetize\" (17:42) is the song where it gives opportunity for Alex Lifeson to fill his guitar solo at minute 4:03. What makes so wonderful about this track is the distinctive guitar solo by Alex during interlude part, even though just before his solo there is a short guitar solo by Steven Wilson. The guitar solo by Alex is really stunning and I can imagine how Rush style blends beautifully into Porcupine Tree's music.Robert Fripp is given a tough job, i.e. to create soundscape for \"Way Out Here\" (7:37) track. You might be wondering with this arrangement because basically Robert Fripp is an excellent guitar player. The decision to hire Fripp as soundscape creator is right because come to think of it, many Crimson album which were created with great soundscape.Does Steve Wilson anything to do with Steve Hackett?It might be just coincidence with the fact that \"Fear of A Blank Planet\" by Porcupine Tre has similar style with Steve Hackett's \"To Watch The Storm\" album in terms of cover artwork. Of course, Hackett's one is more scary and darker than Porcupine Tree's, but both of them are similar. It's okay actually but I'm wondering how does it happen? But of course this is only the cover artwork and there is no such music style alike.ConclusionI highly recommend this album because it's a true masterpiece of prog music. I dare to say that anyone who is still new to the music of Porcupine Tree can start with this album and I am sure s/he is going to be satisfied! A will spin this CD over and over as until now there is no sign of being bored with the music. In fact tonight I will play the title track in the radio program that I host regularly right here at Trijaya Network FM Station 104.6 in \"Saturday Night Rock\" program conducted weekly from 7:30 PM - 11:00 PM. I will discuss the topic on \"The Groove Maker\" and the title track of this album fits into this category: it has great groove!Peace on earth and mercy mild - GWDragonForce \"Inhuman Rampage World Tour\" Live in Jakarta, 19 May 2007, Tennis Outdoor, Senayan.Featuring The Fastest Metal Guitar Virtuoso."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Monday, May 14, 2007",
      "rating": 5,
      "text": "I was surprised to read a review in the Toronto Sun newspaper of this album and I want to share the short analysis with you. \"For most bands, six songs is an EP. For these veteran U.K. proggers, they're a 50-minute concept disc about technology and teen escapism, complete with mathy time signatures, widescreen arrangements, swirling orchestrations, psychedelic textures and impeccable musicianship-including contributions from like-minded guitar heroes Alex Lifeson and Robert Fripp.\" Not bad eh ? I must say this one took a lot longer than I thought it would to really like it. I wasn't wowed right away that's for sure. In fact it took seeing them play these songs in concert three different times for it to click with me. I have to mention that the band thanks in the liner notes OCEANSIZE, ANATHEMA and PAATOS. This record doesn't have the commercial sounding songs that are found on most of PORCUPINE TREE's records as the focus is more on the album as a whole (the concept) than individual songs.The subject matter is about teens who are hooked on drugs and modern technology and so are detached from reality. The overall feel is dark and melancholic.The first song \"Fear Of The Blank Planet\" really lays out the story of the concept for us. Lines like \"TV, yeah it's always on\" and \"I'm stoned in the mall again\" and \"X-box is a god to me\" and \"My father gave up ever trying to talk to me\" and \"The pills i've been taking confuse me\" and \"In school I don't concentrate\".You get the picture i'm sure. As for the music of the title track ? It's an uptempo song with a great beat although it does have some spacey moments. I love the background synths.The drumming is incredible ! \"My Ashes\" can be described as dark, beautiful, melancholic and emotional. There is some orchestration as well. \"Anesthetize\" is the epic at over 17 minutes in length. The drumming is relentless and Alex Lifeson graces us with some guitar 4 minutes in. We get vocals after 7 minutes, but it's the drumming that impresses me the most on this song. We get some brief heavy riffs as period of calm settles in then the dreamy vocals slowly rise out of the tranquility. Clearly one of PT's best tracks ever. \"Sentimental\" opens with a piano melody as drums and vocals follow.\"Way Out Of Here\" doesn't really kick in until 2 minutes. Nice guitar solo and Fripp adds his special soundscapes to the song. Some heavy riffs arrive later. This song blows my mind. So emotional. The final song \"Sleep Together\" is a beauty. I read where Steven Wilson said this was his favourite song off of this record.The vocals are almost mechanical sounding and it's very atmospheric and spacey.The drums kick in as the song gets intense. There is a prolonged instrumental to the end of the song.Favourite songs are \"Fear of the Blank Planet\", \"Anesthetize\", \"Way Out Of Here\" and \"Sleep Together\". To me this is a combination of \"Deadwing\" and \"The Sky Moves Sideways\" with a blanket of darkness thrown over top of it."
    },
    {
      "reviewer": "Prog-jester",
      "date": "Posted Wednesday, May 16, 2007",
      "rating": 3,
      "text": "It seems these guys rule the 2007’s Top!Well, I’m gonna ruin this ideal situation a bit. I was awaiting for new PT since it was announced, I tried to be in touch with all the news and updates, I didn’t load it – I bought it, but boy, I was awaiting for NEW PT…Again I’ll use “the three notes” scheme in my review . First of all, it’s TOO gloomy. I like dark music, but FOABP seems to step over that line I can endure and it has become too dark for me. Second – I actually liked only 3 songs here: the namesake killer (guaranteed earworm!), the 17-min monster (great structure – heavy, milder and then mellow) and depressing “Way out of Here” (though heavy part irritates me a bit). Other songs are not PT ones – this is BLACKFIELD in its darkest. Good ballads (though “Sleep Together” is even more depressing than “Way out of Here” and the whole album is too sinister closer to the end) but nothing more. Third – I see no evolution since “Deadwing” was released.PT moved a bit further to metal areas, they still mix old Prog tricks (heavy mellotrons in the title track, which is, actually, a lot like “Deadwing”’s namesake opener…) with modern “indie” sound, they still sound great (though none of new songs don’t even come close to flawless “Arriving somewhere”) but they fail to amuse that much as they did to me before. Maybe I was too high with my expectations and I should haven’t compared this album to previous one(s)…but that’s how I feel after 3 weeks of heavy listening sessions. 3.5 stars – could have been more challenging and exciting. Still recommended, especially for Modern Prog newbies."
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Sunday, May 27, 2007",
      "rating": 4,
      "text": "\"How can I be sure I'm here\"FOABP is a compelling and ambitious piece of modern rock music that aims high and really achieves it goals. The subject matter is dark and relevant and also cyclical, isn't it? We get the stories of disaffected youth in every generation and I'm reminded here of \"Subdivisions.\" While I think Mr. Wilson lacks the poetic pen of Mr. Peart (\"Any escape might help to smooth the unattractive truth.But the suburbs have no charms to soothe the restless dreams of youth\") he still does a reasonably good job of explaining the emptiness that this generations of kids is dealing with.The title track starts things out quite well I think with the ominous guitar riff and catchy crunch. \"How can I be sure I'm here?\" is a key line of the track and gets those of us one generation on from these kids to think to ourselves: what exactly can we say, what can we do to respond to that need, to that blank despair they have? We know in ourselves that Blank Planet is a mess and yet we couldn't stop ourselves from allowing another generation to fall prey to the same crap. We segue nicely into \"My Ashes\" which features some gorgeous melody although to be quite honest, Wilson owes Thom Yorke a royalty check for this track. Is this an outtake from \"OK Computer\" or what? Maybe so but it is still a pleasing track.At near 18 minutes \"Anesthetize\" qualifies for epic length status, featuring blissful noise guitar and lots of room which is very good. Alex's solo is fitting and quite nice although with 18 minutes to spare they could have easily given him a bit more space to elaborate. We later get into some near metal moments that nicely balance the rather pop sounding chorus in this track. What makes the track is the section from 12 minutes on where things are calmed down before a last perfect guitar lick goes to flatline. Nice ending to a truly great track.\"I never wanna be old and I don't want dependents.\" What a line to open \"Sentimental\" with and one that too many of us can relate to. This is an absolutely gorgeous song that again strikes me as pretty Radiohead but much more palatable to me. Where Radiohead will usually bore me before making me care PT seems to be able to make this work deliciously well. \"Way Out of Here\" is really, really good. Lots of variance in texture and pace, a beautiful chorus, Wilson's best solo, and some very inventive drumming in the metalish sections. Listen closely to this track as it might be the best on the album. \"Sleep Together\" unfortunately ends the album on a slightly weaker note. The \"big\" drums joining in at one minute are the first mistake, they should not be there or they should have been far more soft and ambient. The chorus seems pretty contrived to me and the song plods in places. I think \"Way Out\" would have been a better closer personally.The material here focuses mainly on youth but I'm sure given Wilson's age that he is seeing more than \"kid and x-box\" when he speaks of the Blank Planet. We are entering a century with problems that seem insurmountable, from the cultural to the environmental, war, disease, poverty, justice, personal responsibility, religious fanaticism, on and on. These things and many more are what we all have to deal with, let alone the challenge of having a fulfilling and happy personal life. I'm sure that Wilson feels the kids have the potential to confront these problems. But are we giving them the support they need and are we listening to their concerns about themselves or is it easier to give them another gadget to distract them? Can we put aside our demands from our jobs to spend that extra time with them?Have we really gotten to the point where a prescription for anti-depressants is an essential part of growing up? All of the tenets of our prized economic system that hold things together have the downside potential to the human condition and perhaps Wilson will delve further into the broader picture on future albums. Are we better off continuing down this road of success as defined by profit growth potential or will there have to be a scaling back of expectation of material success at some point?While such a shift would hurt us short term economically, would not it shift back the emphasis of life to personal relationships, time to slow down, to perhaps embrace art over yet another \"goal\", and to leave the electronic Blank landscape for a one with a heart, pulse, flesh, earth, water, soul. Smaller community based existences for which family and connections to each other are enough, for which we are not fed this message that to succeed means \"you must want it ALL, and then push for MORE.\" I don't mean to go off the deep end here with personal musings but these are the thoughts that FOABP brings to my head and maybe some of you have the same thoughts.Just one more: I remember being a kid and longing for summer vacation. I remember endless days with no structure, roaming the fields behind our neighborhood with friends and exploring. Playing. Being free. Hanging out in the basements of friends or riding bikes down to the park. I remember dreading the beginning of the next school year. Perhaps those of you who grew up in the 60s and 70s know of the world I speak. Last week I heard a 13-year old exclaim how she is dreading the END of the school year and it's going to be SO boring in summer. How things change. But is that for the better? Is growing up now so about learning conformity and structure that kids today cannot deal with down time? Have they forgotten how to be kids?Does every moment of a child's life have to be filled with structured activity? League sports? Summer school programs? And is the only alternative to that the Blank Planet? I don't know but my gut tells me that kids today have been cheated out of a certain type of childhood that I can't imagine missing. What I do know is that I'm glad I'm not a kid in today's world. And we need to explain to these kids why summer is NOT boring. Again sorry for the long story but I feel it relates to the music in question. The sobering subject matter of FOABP hopefully will help lead to these discussions in the place that matters most: living rooms."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Saturday, June 9, 2007",
      "rating": 3,
      "text": "Well the present music effort dated April 2007 is very interesting, even though I have to remark a few defects inside, as for a certain spacey refrain within their main tunes, which seem to be just a little bit forced , above all in comparison to their usual standard. Nevertheless there are some gems inside such as \"My ashes\", especially regarding of the stunning chorus performed by Wilson in the best manner...then you can appreciate the 17 minutes long mini-suite`Anesthetize', the most melodic among their best tunes, as well as such an interesting Alex Lifeson solo, introducing the most heavy part of the album!! Therefore I can't forget the psychedelic touch of `Way Out of Here', perhaps the most experimental song of the whole cd, but for instance the lyrics of \"Sleep Together' seem to be quite far away from their best moments, as a sort of controversial artistic expression ...anyway the mood of their work is strong and quite original too, despite their strangest songs sometimes not being inspiring at all... so at the end make your own choice, especially if you are an old fan of the American band and you can forgive them this way for every diverse - sometimes controversial - kind of expression you will find here!"
    },
    {
      "reviewer": "richardh",
      "date": "Posted Friday, June 15, 2007",
      "rating": 5,
      "text": "Steven Wilson likes to plumb the deep recesses of your soul ,especially the dark bits! Paranoia and fear abounds in most PT albums I've heard since the brilliant Stupid Dream. Wonderfull atmospheric electronics and beautifull rythmic structures are two of the very pleasing aspects of their music that I particularly enjoy and this album may well be their finest moment to date. The centre peice Anesthetize (clocking in at 17:42) seesm to have caused the most debate. Is it a proper long peice or just 3 seperate peices cobbled together? I go for the former.You need to listen to this (and the rest of the album) at least 10 times to realise that (perhaps) but there's no mistaking it. My favourite track though is Lets Sleep Together.The rising crescendo as the track gains pace is almost orchestral like and extremely impressive.The whole album works though.If there was an extra gold star for album of the year then this gets it by a country mile in my book."
    },
    {
      "reviewer": "King of Loss",
      "date": "Posted Monday, June 25, 2007",
      "rating": 4,
      "text": "This is the new release from the Progressive Rock band, Porcupine Tree and this is really following the formula of the latest two releases, of which all being a little melodic, a little metallic and a little dynamic.The album kicks off with the catchy FEAR OF A BLANK PLANET or the commercial song on this album. This song is of course the catchiest and it is my choice for favorite song on the album. The lyrics on this song is quite interesting in that it is following the formula of SHALLOW on Deadwing, while talking about angsty teenage thoughts. Brilliant! I must admit, this song is a real rocker, a perfect way to start any Porcupine Tree set! MY ASHES is sort of a transitional song, in between the rocker and the epic to follow. Its a very good song with a lot of emotions, following the more mellow and melodic Porcupine Tree format. ANESTHETIZE is the epic in the middle of the Porcupine Tree album, it is the song that reminds me of SOMEWHERE... On Deadwing, but this song is a truly remarkable piece of work by Porcupine Tree, one of their best songs they've ever made. Remarkably contrasting feeling and some of the nicest chords they've ever written. The next song is a more ballad type ofsong and it is called SENTIMENTAL. Its a song much in the mode of LAZARUS without the poppy, catchy feeling. Of course, the latter being much more pop, while SENTIMENTAL is just a straight-forward melodic ballad.The album finishes off with WAY OUT OF HERE and SLEEP TOGETHER. Too good songs, but rather lacking compared to the stellar start.Ratings of single songs: Fear of A Blank Planet- 96% My Ashes- 90% Anesthetize- 94% Sentimental- 92% Way out of Here- 85% Sleep Together- 88%Overall, I must say Fear of A Blank Planet is a great release from Porcupine Tree and one of my favorites alongside Signify, In Absentia and The Sky Moves Sideways.An album that is in between 4 and 4.5 stars, but could go either way.About 92% on my scale, really."
    },
    {
      "reviewer": "1800iareyay",
      "date": "Posted Friday, June 29, 2007",
      "rating": 5,
      "text": "After two straight hits with In Absentia and Deadwing, Wilson and co. score a hat trick with Fear of a Blank Planet, PT's most lyrically brilliant album. However, whereas I don't care too much for Deadwing, I absolutely love this album. The album is conceptual and deals with technology's and society's desensitizing affect on modern youth. As a member of Generation Y, I can tell you that Wilson knows his stuff. The standout star here, however, is drummer Gavin Harrison, who places himself high on the list of greatest prog drummers with this release.The title track opens the album with a look into the true \"blank generation\" (eat your heart out, Richard Hell). TV addiction, drugs, and meaningless sex are all touched upon. The lyrics wouldn't sound out of place on a Fugazi album, honestly. This track is one of the more metallic pieces in the PT repetoire.My Ashesis a great ballad in the vein of the ballads of Stupid Dream.Anestethizeis the highlight of the album, a near 18 minute epic complete with absurdly good drumming and a killer guest solo from Rush's Alex Lifeson. The song goes from opressively heavy to hauntingly soft in the course of it's epic length, and the lyrics are masterful.Sentimentallives up to its title with it's look into the emotions of the empty youth. It is one of the most beautfiul ballads I've ever heard.Way Out of Herefeatures soundscapes from Mr. Robert Fripp. The song deals with the pain of a a failed relationship and the feelings of depression and isolation that come with it. Fripp and Wilson mesh wonderfully.Sleep Togetherends the album with the teen trying to cope with the scale of his emptiness with suicide. This is the one song on the album that does not have awe-inspiring drumming, but it's still a great tune.With this album Wilson takes a snapshot of today's youth. We are no longer allowed to learn and discover things on our own but rather are force fed what a school board believes is useful. The answer to any problem is mediaction rather than trying to discern the root of the problem (ADD, depression). Every child gets a trophy so no one's feelings are hurt. Schools lower test standards so everyone passes. With all of these issues, it's no stretch of the imagination to see teens committing suicide once they realize the emptiness of their lives. It amazes me that a middle aged Englishman has his finger so accurately on the pulse of American youth. Musically, this manages to be both Porcupine Tree's heaviest and softest album. It is even more atmospheric than the early psychedelic material. The influence of Opeth (who Wilson produced several albums for) has never shone through as beautifully as it does with FoaBP (In Absentia is another good example of the positive effect of Opeth on PT). The album is not without flaws, but it's PT's best studio effort yet (even surpassing the wonderul In Absentia).Grade: A"
    },
    {
      "reviewer": "kunangkunangku",
      "date": "Posted Friday, June 29, 2007",
      "rating": 5,
      "text": "Well, as almost every reviewer here has already put it, that's right, this is the most anticipated album of the year. With huge expectation in it, of course. The most obvious reason, if it has to be mentioned, is previous porcupine tree album's (deadwing) high status as the best in its genre, as voted by none other than members of progarchives.com.There's an indication of some kind of mighty burden to the band by saying that, either it is realized or not. And it seems as if the band should compete with themselves.But when the first sound flows out from the speakers and can be heard clearly in the opening track, the title track \"Fear of the Blank Planet\", which is followed by crisp guitar arpeggio, and then taken over by gradually-growing-faster groovy rhythm, every imagination about unmatched expectation disappeared just like that. Not only it, confirmly, is porcupine tree's signature sound. More than that, what can instantly being sensed is that the band delivers once again irresistible, intelligent, intense and awesome music.And that's definitely true. Throughout the album, there's always melody, sounds, rhythm, and also space textures that make each transition from one song to another flows like one's driving in a freeway. Even small contributions from Rush guitarist Alex Lifeson and King Crimson guitarist Robert Fripp --both are respected professor in the progressive rock landscape --also has the capabilities to strike a deep chord with the listeners. Each of the six songs --totally clocking in at less than 60 minutes --can be enjoyed on first listen. To dive further, and to absorb every aspect the band's offerings, what's needed are only patience and willingness to understand the kind of problem the band addressed.Among them is concerning the bleak future for kids whose life is dominated by computers and MTV. The band deliver it in the song titled \"Anesthetized\". At nearly 18 minutes, this epic is a journey across imaginary manacing atmosphere. It started with the twinkling opening where Steve Wilson's plaintive vocals intensify his brooding lyrics before reaching majestic peaks of devastating sonic grandeur. It's easily the best track.Like the band previous efforts, from each phase of development since releasing \"On the Sunday of Life (1991), this latest output still combines rock, psychedelia and ambient elements. And with the injection of metal sounds, as it has been doing more recently, the band stretch a proper canvas on which they paint gloomy colors that represent the choosen theme."
    },
    {
      "reviewer": "Dim",
      "date": "Posted Monday, July 2, 2007",
      "rating": 4,
      "text": "Stoned in the mall again... and againIt was very hard not giving this album five stars, but the song's like Sleep together and Sentimental, though good, dont let this album take home the masterpiece trophy.This album is much more mature than it's predecessor \"deadwing\", with deeper subject matter and more precise musicianship. Song's like Fear of a blank planet, Anesthetize and Way out here make this a must for any Space rock fan!Fear of a blank planet- Probably the best opening riff of any modern prog album there is, it's dark acoustic then evolves into a luquidy space rock jam with Steven's muffled vocals acting as a teenager kid complaining about everything that's possible from his Xbox to his mom to pills he's poppin. Afterwhich the song turns into the clasic PT metal that we have all come to know and love, then burnes down to a sweeter more ballady groove. This song also uses the quote \"Stoned in the mall again\" Which is used in three of the six songs on the album! 4.5/5My Ashes- People give this song a lot of crap, but I find it quite pretty. I like the meloncholic keyboards in this song that really set the mood. This song is also a statement saying that you dont need the most beautiful voice to make a very enjoyable ballad. This song kinda goes off the cocept of the first person view that we were given and point's towards Steven Wilson's probable view towards modern Britain. A very nice song with an excellent chorus, but has a weird noise at the end that extends the song to five minuetes, for prog cred maybe? 4.5/5Anesthetize- I probably dont need to say what's already been said about this song except, the drums rule! Thumb's up for the otherwise boring Gavin Harrison! 5/5Sentimental- I dont quite get this song, it seem's like filler that's part of the concept for me. I like the piano riff and the electric drum's, but otherwise the song dosent really click for me. 3/5Way out of here- Great song, with the help of some soundscapes from the king of guitar's Robert Fripp! It start's very nicely, but after the first verse the song builds into a misleading faster section just to go into a much heavier one, his show's bad aong arrangement. When the Guitar solo comes in though, nothing else matter's! The soloing has been cut down extensively from deadwing, but is much better on this album! The song ends on a very nice metal riff leaving you very stoked for the next song.Sleep together- I would probably like this song a lot more if it wasnt the closer. The chorus is very cool, sound's like Wilson's voice is sucked right through a machine, and the ending part is pretty nice as well with the weird middle eastern instrument. Otherwise a very weird song, with a very uneeded drum fill at the end.3.5/5"
    },
    {
      "reviewer": "el b�thy",
      "date": "Posted Wednesday, July 4, 2007",
      "rating": 4,
      "text": "Porcupine Tree's ninth studio album comes out as one of the best of their whole career, as well as a strong contender for album of the year (I for one would put some money to that. but I don't have any jejeje).The album, as you all might already know is a conceptual one about a kid who goes through life having \"seen\" and \"heard\" it all at such an early age that nothing surprises him anymore, living in a numb state, doing (prescription) drugs, having problems with his parents. etc. It seems this concept is something Wilson sees in today's youth. Now; if that is all youth or just a small percent, it's not clear, and because of this unclearness there has been a bit of controversy and debate surrounding the album; which, in my eyes, is good by the way! Personally I think Wilson takes a small but important group of today's youth (which might grow in the next years or not, it's anyone's guess), he doesn't say \"This is what is happening to YOUR kids!\", but, in order to make that \"view\" powerful enough, he has to go a little over the top, because other wise. it's just not interesting enough. Would you buy an album about a kid who is a bit confused in life and has a few social problems? Well, probably you would, because the music here is incredibly good none the less. YET it wouldn't be the same. So, I for one like the concept, think it works and give Mr. Wilson two thumbs up!Now, let's talk about the music. As many have gone into details about each and every song and note in this album, I won't, I will keep it more on the surface. Two songs are good, two songs are very good and two songs are little masterpieces. The first two, the \"weakest\" sort to say, the opener \"Fear of a blank planet\" and the closer \"Sleep together\". Now, this is kind of a problem cause, normally when it comes to good albums, it's the opener and the closer the ones that take the cake. Well. not the case here. Yet, there is nothing wrong with this songs, the others are just better. The two very good ones are the second one \"Ashes\" and \"Way out of here\", which leads to the little masterpieces (one of which isn't that little either): \"Anesthetize\", the album's 18 minutes epic and \"Sentimental\", third and fourth tracks. Mmm. funny thing, the opener and the closer are the weakest, and the third and fourth song are the strongest, it's like a pyramid or such. interesting indeeeeeed!!! Now, back on topic, this last two songs, \"Anesthetize\" and \"Sentimental\" are by far two of the band's best ever. with \"Anesthetize\" taking the medal when it comes to the best song in their catalog. ever! Yes, it's that good, believe me, the hype is true, this is THE song. I won't give away anything, just listen to it, you will agree with me and then maybe we can have a beer or two and talk about how good this song is, who knows.The album is fantastic, but it's not 5 stars material. Had the opener and the closer be just as good as the rest of the album, it would have been. It's something like a 4,5 this album, but for me it leans more towards the 4th star than the 5th. so I guess it's a 4,40 or something. I don't know. I'm no good with math."
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Tuesday, July 17, 2007",
      "rating": 3,
      "text": "3.5 stars really!!!The least I could say is that I was less and less a fan of Porcupine Tree's later albums, which seemed to ever more metal music than the previous one, even if I always thought this was not a linear phenomenon. And with Deadwing proving their utmost metallic album (with Stupid Dream), they had reached an almost unbearable level to this listener. This is all very subjective of course, but I find IFOABP much less so, with the exception of the centrepiece, the almost 18 mins Anesthetize, which rocks out loudly, helped by the guest appearance of Rush's very own Alex Lifeson on guitar and Way Out There where Fripp appears for some Frippertronics doodling and some mellotrons, real or not.As much as I think this might be Porcupine Tree's best album since Lightbulb Sun (and maybe even since Signify), I still can't get myself to get heavily involved in Wilson's angst and fears, which always seem a little too nightmarish to actually make sense quickly enough. There are some real fine tracks present on this album, but they are the shorter ones (still over 5-mins, though): My Ashes (starting out like Zep's No Quarter, but .. evoking Talk To The Wind) and the quiet Sentimental (also starting and mainly on piano) and the closing Sleep Together (where the mellotrons reappear, real or fake) and ending in a full symphonic feast.As said above, IFOABP could well be Porcupine Tree's best album in a long time, but this hardly makes me think that it could be anymore essential than any of their albums, all periods considered. But with this album, PT might just have signed one of the better high-profile prog albums of the year."
    },
    {
      "reviewer": "Blacksword",
      "date": "Posted Thursday, July 26, 2007",
      "rating": 4,
      "text": "I'm not sure there's much I can add to the discussion on this album. I'm sure it's been said, but for me this is one of the best new albums I've heard in years. I'm new to Porcupine Tree, and my God, have I been missing out!! 'FOABP' is my first PT album, but this is typical of me; to work backwards....I also have 'In Absentia' which I absolutely love. I guess I just had to have my say, and here goes. From the moment this album started I was captivated. Every note, every word held my attention. It cast a spell over me; an effect which I have not felt from listening to music for a long time. 'FOABP' is an emotional rollercoaster of an album (excuse the cliche) The despairing lyrics set against the driving powerful rock of the title track is a very powerful combination indeed, and from that moment you are reeled into Porcupine Tree's dark and doom laden urban nightmare. Tales of pale, depressed mediacted kids sitting in front of a TV, or an X-Box, not really taking anything in, just existing. Blank. Their medication a substitiute for parental guidance, attention and love.'My Ashes' is a wonderful moving song. Wilsons lyrics and the bands mastery of atmosphere and melody make this something of a tear jerker: \"And my ashes fall beneath the silver sky where a boy rides on a bike, but never smiles. And my ashes fall on all the things we said, On a box of photographs under the bed\"\"Anesthetize\" is a contender for one of the best prog rock songs ever written. A bold statement perhaps, but based on the impact this song has on me, it proudly sits alongside 'Xanadu' by Rush, 'Awaken' by Yes or 'Dance on a Volcano' by Genesis, and why not I ask..? Each section of this song has been thought through and executed to perfection. I'm not big on metal these days, but the very heavy interludes in this track, add to the exitement, and provide brilliant contrast to the darker sections, which are reminiscent perhaps of some of Radioheads work. Alex Lifesons contribution is superb. A classic Lifeson solo.\"Sentimental\" is another track where the melodies haunt you, and work beautifully with the lyrics. After listening to this album just once, it was the chorus to this song I found myself humming the next day: \"Sullen and bored the kids stay..\" Perfect.\"Way out of here\" and \"Sleep Together\" are good solid PT tracks, and continue the albums themes powerfully until the last note, but for me the first four tracks are simply magnificent, and together with Rush and Tinyfish, I think PT have made 2007 a very good year for progressive music.Is it all doom and gloom? Well, yes, pretty much, but dont let it get you down, hey. Porcupine Tree took me on a journey with this album. A journey which made my eyes water, brought a lump to my throat, sent a shiver down my spine, depressed me and thouroughly elated me. Thanks Porcupine Tree. You guys use music as weapon, but in a bloody marvellous way. Thankyou very much for 'FOABP' What more can I say? 4 stars."
    },
    {
      "reviewer": "evenless",
      "date": "Posted Monday, August 6, 2007",
      "rating": 5,
      "text": "\"Fear Of A Blank Planet\" was inspired by the book \"Lunar Park\" by Bret Easton and is based on a generation of kids who have grown up in an over saturated technological society, where they have everything at their fingertips - and thus have experienced so much growing up that they have nothing to live for.It seems like this horrifying image of society has become pretty accurate today already. I just read in the newspaper the other day that, especially British youth has become very bored with their lives and thus spend their time drinking, having sex, doing drugs, being violent and so on and so forth. Apparently Mr. Wilson is concerned and he has every right to be! As a young parent myself I do feel that this is becoming the worst threat of raising our children. I wish they will continue to play outside while they are still young and don't become \"couch potatoes\" or worse. Not even thinking about doing drugs, having unprotected sex and being beaten up by other children for no reason at all.So that's for the dark theme of the album. Now let's continue with the songs itself. \"Anesthetize\" surely is the heart of the album clocking 17 minutes and 41 seconds. I heard this song (previously called the beast, since people were not familiar with the title yet) for the 1st time during one of PT's FOABP tryouts. And what a tryout it was! Especially Gavin Harrison's drumming on it is absolutely amazing! No wonder Gavin was chosen by the readers of \"Modern Drummer\" as best progressive rock drummer of the year! Simply amazing!Just before the heart of the album we find the mellow song \"My Ashes\" and the album kicks off with the title track, being a more up-tempo track in the style of the Deadwing album. After the heart of the album we are treated on another mellow, sentimental track called, hmmm, \"Sentimental\" On this song multi instrumentalist SW trades in his guitar for a keyboard and his playing reminds me of the \"Stupid Dream\" and \"Lightbulb Sun\" era. Wonderful mellow song you can dream away on.After \"Sentimental\" there's \"Way Out Of Here\". It starts with a mellow intro accompanied by an almost whispering SW. After the whispering SW cries out \"Way Out Of Here\" and after that we get a more up-tempo song. Near the end some great guitar riffs! Pretty cool song.The final track of the album is \"Sleep Together\" and it has an absolutely great beat and rhythm! This is one of my favourite tracks on the album, together with \"Anesthetize\" and the album title track.Conclusion: With FOABP Porcupine Tree might very well have recorded their best album up to date. Was PT going into a somewhat heavier direction with \"In Absentia\" and \"Deadwing\", now it seems they found a nice mix between those two albums and for example the \"Stupid Dream\" and \"Lightbulb Sun\" albums. As long as Mr. Wilson continues making albums like these we surely don't have to have \"fear of a blank planet\"."
    },
    {
      "reviewer": "sleeper",
      "date": "Posted Tuesday, August 21, 2007",
      "rating": 2,
      "text": "Fear of a Blank Planet is Porcupine Tree's most recent album and the follow up to the highly acclaimed, though personally very disappointing, Deadwing, and musically builds on the melodic metal approach that they seem to be heading towards, but without the technical display of other bands. This time its a concept album of sorts were all the songs follow the central theme of the youth of today being apathetic towards the world at large.Obviously, as with any social observation made by art, it paints all, or most, of modern youth with a wide brush to get across its points but the big success of the album, in my opinion, is that Wilson has succeeded in creating a series of songs, that all fit together into the larger concept, each exploring separate sections of the \"problem\", without having to judge it himself. In this way he has succeeded brilliantly in creating a piece of art that highlights an aspect of modern society without passing judgment and leaving that entirely up to the listener. This is not something that is easily done but lyrically Wilson pulls it off brilliantly creating probably the strongest album concept of the year. Its just a shame that the music doesn't back it up.Musically this album fails badly. I have listened to Fear of a Blank Planet many times and each time I feel as apathetic towards it as the people it portrays, surely this cant be a good thing? Each song carries one or two decent ideas but never are they really expanded upon and what they have seems to be left to play itself out to death. The only exception to this is the album closer, Sleep Together, which is a brilliant track that builds to a sudden climax with the tension being piled on by the excellent performance of a string orchestra, really adding feel to the song. However, 43 minutes is a long time to wait before you get any really good music, with the epically long, if not epically styled, Anaesthetise being the worst culprit. Its just far too long and I find myself begging for a change in pace, or song, before halfway. Its the same story with the other songs as well. Though this album is an improvement over its predecessor, Deadwing, I find its mostly down to the fact that it isn't as totally aimless but I cat help but feel that the members of the band lack the technical ability to pull off what they are trying to achieve, with the possible exception of drummer Gavin Harrison who is not bad at all, if nothing special, and the guest musicians of Alex Lifeson and Robert Fripp, who need no introduction.Overall I could have done without this album and I swear its the last time I'll get carried away with the hype (yeah right). Its better than Deadwing but only because it feels more focused and is lyrically very strong, but its not enough to make me consider coming back for more than the occasional listen and so it gets stuck with only 2.5 stars, rounded down to 2 because it not quite 3."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Saturday, October 27, 2007",
      "rating": 5,
      "text": "What can we say more?There's been a godzillion reviews of this album, and what to say that hasn't been done. I'm still not sure if I prefer Deadwing over this one, but this is veeeery textured album with (hurrray) with lots of incredibly good segments (the end of Anesthetize and the Lifeson's solo, the melody of Way out of here) and some pretty ear pouding moments a la Deadwing.The songs are indeed rich, but the subjects are soooo depressing. Fear of a blank planet traces a portrait of today's youth, supposedly brain-stuffed with video games, Adderal and pornography. What the ?!? I don't know where Wilson hangs out, but it's certainly not in my neighbourgh. To say that most kids are lost in a cloud of confusion is somewhat real, but awfully blunt for parents, teachers and people who still believe in the goodness of humans. Before I break out the Welbutrane, I understand clearly it's all part of a marketing package. Porcupine Tree always fueled on dark and gloomy moments, but this canvas is really bringing me down!Once again PT's stellar talent is showing us that accessible prog is alive and well.Do not play this at your wedding."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Friday, November 2, 2007",
      "rating": 3,
      "text": "I have listened and reviewed many recordings from this band. I have rated most of their studio albums with three stars because I couldn't really be overwhelmed with their music. There were always great songs featured of course, but consistency was lacking and the felling of too much of the same thing prevailed.Actually, I preferred some live recordings which sounded more interesting in terms of tracklist. Even if they changed from genre during their career, starting with spacey psychedelia to evolve towards a heavier music at no moment I could hardly discern any masterpiece in their production. And it is the same with \"Fear...\" I'm afraid.The title track was very promising. In line with a traditional song of theirs. \"My Ashes\" has a definite feeling of \"No Quarter\" (\"Led Zep\") but does not reach the upper level of its ankle. \"Anesthetize\" seems to come out from \"Dream Theater\" 's repertoire.But that's the evolution Wilson wanted to give to the band since his early relationship with \"Opeth\". Not that it is a bad song, on the contrary. But it lacks of personality. I can reasonably tolerate true prog-metal (which is the case here). When the prog side picks up versus the metal one. Actually, this long song holds a bit of all the styles that \"PT\" has undergone throughout their prolific career. Some sort of testimonial work. This song won't anesthetize you; that's for sure. I consider it as a highlight.\"Sentimental\" is the archetype of an average \"PT\" song. Can't really blow me away. Soft and mellow, feelingless and boring. Like if Wilson had taken sleeping tablets while composing it. \"Way Out Of Here\" is much better of course. More energetic and truely heavy as well during the second part. Great riff and guitar play here. But \"Fripp\" is featured as guest musician...I am still hesitant in terms of going to their Brussels gig in a few weeks. Maybe that the opening act \"Anathema\" will give me the extra kick to decide me to go...This album is much better than \"Deadwing\". Seven out of ten. Rounded down to three stars."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Thursday, November 8, 2007",
      "rating": 3,
      "text": "It seems I adopt the minority position in saying that \"Fear of a Blank Planet\" is, sadly, far from the masterpiece it is being lauded as. In fact, I would go so far to say that it is the weakest album the band has recorded in decades, featuring nothing we haven't heard before (or worth hearing, more appropriately) and progressing little beyond the heavy groundwork so brilliantly established in their prior two albums.The principal problem is that, with the exception of the immediately catchy vocal melodies of Wilson, the songs are simply not up to par with what we've heard before; some sections sound like \"Blackfield\" outtakes. The always great shifts between the band's eerie soundscapes and heavy riffs sound terribly contrived here; they come from no where, and disappear having added nothing to the song's depth. Rather, just when the listener is getting into and enjoying say, the dreamy textures of \"Way Out of Here\", a pointless explosion of simple, chugging crunch destroys the mood. Wilson does, however, give some very catchy and beautiful vocal deliveries on some songs.The centerpiece, \"Anesthatize\", has a few highlights, but sounds more like three different songs connected together just for the sake of variety; if fails to evoke the same energy and emotion we heard last time around on the much shorter, and much more interesting \"Arriving Somewhere\". Alex Lifeson's contributions are a fun addition, but could have been utilized more.The message, while certainly relevant, is practically beaten into the listener's head by the album's close, and lacks the creative subtlety found in Wilson's usual lyrics.As a side note, did anyone else who saw this album performed on the last tour notice the amount of teenagers in attendance? Were they text-messaging their friends throughout the concert as much as they were at the one I was at? Maybe SW should dedicate \"Fear of a Blank Planet\" to his widening fan base...Songwriting: 3 Instrumental Performances: 3 Lyrics/Vocals: 3 Style/Emotion/Replay: 2"
    },
    {
      "reviewer": "progrules",
      "date": "Posted Friday, November 9, 2007",
      "rating": 4,
      "text": "I admire Porcupine Tree for a long time, somehow it's not really my cup of tea where the style is concerned but their superoriginal approach and pioneering tendency deserve every credit. And because they explore so many different directions not all of those directions appeal equally to me and then I'm talking about the Voyage/Metanoia/Coma Devine kind of material.But this is just another regular album by PT and it's always interesting to check them out. After a few listens I want to concentrate on the epic on this album. Anesthetize is another amazing effort of Steve Wilson and the other band members. It's with these kind of compositions I can only bow in admiration of what he has achieved. I'm really in love with this track. It's so versatile, moving fluently from one passage into the next and I keep wondering: how do composers do this ? They have to be brilliant and real genius.Anyway, this track draws all the attention and leaves the other ones palish in the background. The others aren't really significant objectively spoken. Just Way out of here is a very nice one but the rest is less. And because of that I can't give this 5 stars but of course 4 is the least in this case."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Saturday, December 1, 2007",
      "rating": 4,
      "text": "Feverishly anticipated, swiftly reviewed (far too swiftly - how can people make an informed judgement on a record on first listen?) and ultimately less than fully satisfying, 'Fear of a Blank Planet' is an enigmatic album.First, it has been dumbed down for the masses. Rather than the general morose, almost misanthropic assessment of the human condition we normally get from PORCUPINE TREE, this album is based on the well-worn concept of losing our humanity to soulless media. Many of the themes explored with subtlety in previous albums are regurgitated here: family dysfunction, muzak and malls, killers and guns, suicide. But they are accompanied by a hammer. The listener is bludgeoned with the concepts in a way I've not seen since ROGER WATERS let megalomania finally overwhelm him. And not only the lyrics are recycled: as many reviewers have noted, the riff from 'Trains' pokes its head up in 'Sentimental'. What is WILSON trying to evoke? Or is this a play for a broader audience, a remixed selection of their best lyrical and musical ideas, a last push for superstardom?Second, while much of STEVEN WILSON's lyrical beauty remains, the album is structured to feature riffs and percussion. These have always supplemented excellent compositions, but they now seem to lead the music. I find they make a number of the songs almost indigestible, including the much-lauded but oddly-shaped 'Anesthetize'. There's no doubt the combination of a simple concept and dumbed-down compositions and instrumentations make for a more widely appealing album, but, for the fan, there's much less to savour than one would expect after the excitement of the first listen.Fundamentally, I suppose my unease is that of a person left out of the conversation. On this album WILSON talks directly to teenagers. He's inhabiting their universe, trying to address their concerns, at once empathising with them and lecturing them. Well, it's been a while since I was a teenager, and back then I was far from apathetic. My greatest wish was that someone could invent a pill so I didn't have to sleep, so full of life was I. I'm therefore separated from WILSON's concept by time and temperament, and the one-sided (and dangerous) nature of the album's treatment of teenage ennui makes me uncomfortable.The avowed centrepiece is the aforementioned 'Anesthetize'. Taking a moment to think about it perhaps reveals my unease with this album, and the direction the band appear to be taking. At 17 minutes it seems on first listen to be a progger's godsend, but at heart it's a six-minute song surrounded by eleven minutes of unrelated instrumental work. This middle section, let's call it 'cod philosophy' for short, is a wonderful example of PT's ability to write compelling hooks and produce glorious prog-influenced pop. But what's it doing buried in this combination of slab drumming and riffs? Why do we have a LIFESON solo even before the main part of the song? Solos allow us to contemplate what we're hearing, but nothing has happened for us to contemplate. Far too much has been made of this solo: most of WILSON's own solos are far more satisfying. And what's the last section of the track about? Who doesn't sit there waiting for the next song to start?No, for me this centrepiece simply doesn't work. It's the length of 'Close to the Edge', for example, but apart from the central section contains only a fraction of that track's ideas and energy. And it's a very odd shape: rather than beginning with a theme, developing and varying it, departing then returning to it, this track gives us a six minute prelude, an unrelated six minute pop song and a pointless five minute outro. The shape feels dreadfully awkward to me.That said, there are some excellent tracks on this album. 'My Ashes' shimmers with PT beauty, and 'Way Out of Here' is a monster track rudely spoiled by an out-of-place central riff. I find the closer 'Sleep Together' extraordinarily convincing - showing that I'm clearly out of step with most listeners, who love 'Anesthetize' and hate 'Sleep Together'. It's a chilling euphemism and metaphor for suicide, and is the only time on the album the music builds to the sublime heights I've come to expect from anything WILSON's involved in. In particular, the 'Kashmir'-like keys at the end raise the crushing weight of the track another notch.Perhaps something essential could have been fashioned from bits of this and bits of 'Nil Recurring', the outtakes released later in 2007. As it is, there is enough here to merit many listens, but I cannot see this heavier version of PT - ironically, conceptually PT-lite - being an essential part of my regular listening experience in the way at least four of their earlier albums are.The main effect of this album is to make me yearn for NO-MAN's next release."
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Monday, December 17, 2007",
      "rating": 4,
      "text": "\"Only MTV and cod philosophy\"\"Fear of a blank planet\" is Porcupine tree's latest album at time of writing. The first things which catch the eye before even listening to the music are A) the presence of a couple of notable guest musicians, and B) the inclusion of an 18 minute track.In all, we have just six tracks here, the album running to a rather brief 50 minutes (especially when we consider that a half hour EP from the same sessions has subsequently been released). The title track kicks things off in an upbeat mood, Wilson's vocals being variously distorted over a richwall of sound. The song portrays a concerning vision of the way society is heading with lyrics such as\"X-box is a god to me\"and\"Don't try engaging me?. You'll never find a person inside\". Musically, the track repeats the accessibility of more recent Porcupine Tree albums while offering a well crafted arrangement.\"My ashes\" is a soft ballad with strings orchestration by Dave Stewart and Steve Wilson. The song is uncharacteristic, even in terms of Porcupine Tree's softer tracks, with a lush melody and arguably Wilson's most sensitive singing to date.It is though \"Anesthetize\" which we anticipate, and wait for impatiently. The length of this 18 minute epic harks back to the days of Porcupine Tree's long tracks such as \"The sky moved sideways\". After a soft vocal intro, we venture into a dark, haunted instrumental passage with dramatic percussion and incisive guitar. Alex Lifeson of Rush makes a guest appearance on the track adding his distinctive guitar style to complement that of Steve Wilson. Lyrically, the track continues the theme of the title track with observations such as\"I'm watching TV. . . I'm totally bored but I can't switch off\". In reality, the piece is a suite in four or five sections; while the sections fit well together they are nonetheless disparate. The track is thus more of a \"Supper's ready\" than a \"Gates of Delirium\" if you get my drift. In all, while this is a reassuringly epic piece, it is for me not one of the band's best.\"Sentimental\" is once again built around the depressive theme of the bleak future for the youth of today, set once again to a soft melody. \"Way out of here\" offers a possible escape, but this proves to be a false hope. The song has echoes of the band's psychedelic past with dreamy Floydian effects and delicate vocals. The latter half of this, the first of two 7+ minute pieces, is more orthodox riff driven PT.\"Sleep together\" finally offers a kind of solution, proposing to\"Switch off the future right now\". Musically, the track remains depressive but powerful, offering a marked contrast to the trend of previous albums of ending with a downbeat, reflective song.In all, \"Fear of a blank planet\" is a well constructed album whose underlying concept is depressive but worryingly realistic. For me, there are no killer tracks such as \"Arriving somewhere..\" from the previous album, but when heard as a whole, the tracks add up to more than the sum of the parts."
    },
    {
      "reviewer": "tszirmay",
      "date": "Posted Sunday, January 20, 2008",
      "rating": 5,
      "text": "My turn. Let's get the clich�s out of the way: Porcupine Tree's a talented band and I have followed them from day one. Steve Wilson is a musical genius (if anyone has any doubts, they are secret \"Twavis Twitt\" country fans), a dazzling guitarist, composer, woefully underrated lyricist and stellar producer with a PROVEN pedigree. Ex-Jap Richard Barbieri always was a \"behind the scenes\" cult keyboardist, more Eno than Emerson but a master at electro-colorings and mood meister par excellence. Bassist Colin Edwin has a simple role: \"put down a groove that we can fly over\" and he does that really well, no flash but solid substance. Longtime drummer Chris Maitland was replaced 2 albums previous by the massive Gavin Harrison, a truly masterful session drummer who proved to me live that he is among the very, very best (hello, Neil Peart the Rushian and Bungalow Bill Bruford). The music has certainly evolved over the last 15 years, going from swooning psychedelia, to space-prog in the finest Floydian tradition to some of the best original prog ever recorded. The recent harder edge has made this crew progress even further into some powerfully emotive musical environments, adding a scathing critique of today's culture (or lack thereof), where the directionless youth fall prey to obesity, despair, ennui and lousy drugs, all leading to the ultimate nadir = apathy. It's about time someone gets lyrically angry in the prog world, we cannot constantly burden Fish' still resilient shoulders with all the injustice of the universe. Having seen this album in concert, I cannot aptly describe how stunning the material is in a live context, a crowning achievement in prog by the way, the presentation was simple but overpoweringly effective and just blew the entire audience away. Power, passion, emotion, feeling, art = five muses, five musicians (John Wesley is the live silent 5th guy), what a combination! The title cut (9) kicks off the proceedings emphatically with a steady beat that marshals in the \"sunlight coming through the haze\", a false hope as the lyrics spew venom at a society having lost its most basic values, diving into the deepest moral abyss and addressing a drug infused lethargy that is nothing more than cowardly suicide. Hey, this is not pretty prog by any stretch but it's also the very modern definition of blas� without a punk, two-chord vomit vocal delivery (more Syd than Sid, both misunderstood baskets). \"My Ashes\"(10+) is an outright melancholic essay that proposes a chorus melody to die for (pun intended.), the \"No Quarter\" by Led Zeppelin-like e-piano expressing all the pain of the universe, with assorted colorings courtesy of Barbieri's keys and the saddest lyrics this side of rehab. \"Anesthetize\"(10+) is the 17 minute classic that has been the subject of everyone's drool and in a live setting , it provoked a standing ovation with a few hot, long-legged Montreal babes dancing in the aisles (how's that for a rare sight at a prog venue?). Can we have some more, please! Gavin Harrison just pummeled us to smithereens during this hallucigenic musical voyage and with John Wesley providing a fine rendition of Alex Lifeson's blistering guitar solo, this piece had an ultra decadent Roxy Music-like atmosphere tied to some heady Crimsonian guitar rage and a vibrant chorus \"It's All in Me, All in You \" that had everyone screaming, fists a pumpin'! The last 5 minutes provide a dreamy outro finale that has all the typical Watersian angst (\"Water so.\"), swirling like a gentle breeze, helter-skelter, going nowhere. One of PTree's crowning pieces. \"Sentimental\" (10+), as the title aptly describes, is another extremely poignant, melancholic assessment, with a \"self-killing\" melody (\"You can't blame your parents anymore\"), more bile rising (\"Stoned in the mall, the kids play\") and despairing hopelessness (\"Sullen and bored the kids stay\") . \"Way Out of Here\"(9) is another heavier piece that starts out somewhat indifferent until the raging guitars kicks in with savage abandon and batters the listener with contrasting nightmarish scenarios, almost like the incoherence of a drug overdose. Very slow burn gruesome. \"Sleep Together\" (10) is the final musical stab, a \"Do or Drown in Torpor\" dirge that somehow sanctifies the escape from reality \"Lets leave forever, switch off the future right now\", a sweepingly incoherent plea for a warm body that may or may not care anymore but it's still better than solitude. Wilson is my friend, just like the ball with Tom Hanks' character in the movie \"Castaway\". The disc ends on a very George Martin/Beatles like orchestral goodnight. Well, on that cheery note, I need a shower to wash away the morbid sweat, singing \"And I fear tomorrow, I'll be crying\".. 5 mangled trees."
    },
    {
      "reviewer": "Moatilliatta",
      "date": "Posted Thursday, January 24, 2008",
      "rating": 4,
      "text": "Porcupine Tree has become the hottest thing in progressive rock. A great band to be sure, but do they really deserve all of the acclaim they have been getting lately, more specifically, is this album really all that everyone is making it out to be?Simply put, no.This record is definitely good, and there are moments of pure musical bliss and ingenuity, but I can list at least 5 albums from this year right off the top of my head that blow away this one. And I can't say this is remotely perfect. I think \"My Ashes\" and especially the closing track, \"Sleep Together,\" are a bit weak. The album really takes a hit for having a weak closing, and it's not even that it makes a poor closing track, the song in itself is boring and the overall tone of the song and Steven's vocals cane be bothersome. I also think the two preceeding albums are better than this one.Now, I am coming off a little strong here - all of the other tracks are excellent - but I just can't believe how so many prog fans are salivating over this thing and completely neglecting the true best album of the year: Colors by Between the Buried and Me. That is true innovation, complexity, emotion and consistancy at work.I am a big fan of Porcupine Tree, and I do like this record quite a bit, but I can not agree with the overwhelming number of people lauding this above more worthy releases."
    },
    {
      "reviewer": "Atkingani",
      "date": "Posted Sunday, March 30, 2008",
      "rating": 4,
      "text": "The name PORCUPINE TREE was more or less familiar for me when I started to visit the Prog Archives in 2005, but I recognize that except for the available streaming tracks I was totally unaware about them in musical terms - anyway, I thought they were just another new band; I wasn't prepared to witness the ecstasy the name PORCUPINE TREE achieved in the forums and, to be discovered afterwards, throughout the host of progressive fans, especially the youngest. So much ravishing made me curious and with time I ran through PT albums only to be grabbed too although in a less captivating way. Here, instead of laudatory speeches related to their entire discography, I'll jump this part going directly where the caldera stirs: \"Fear Of A Blank Planet\", PT 2007 release and noted by many as a summary of everything they've done before, presently and. in the future.FOABP is really a fair and honest work, with the band biting a cluster of musical styles, including many spots of the prog-rock genres. Some people told me that PT feel a bit uncomfortable being labeled a progressive band, but they are and this direction is shown notably here in this album - the association with aundergroundmood can be disturbing especially if one wants to make money and/or to reach a wider audience. Anyway, like it or not, FOABP can be considered a neat modern prog-rock output, incrusted inside the Eclectic/Heavy sub-genres, in spite of emo/pop touches that spoil here and there some parts of the album.Track arrangements and general production are among the best FOABP features, together with the already notorious band musical competence, being worthy to highlight the drumming and keyboards actions, while vocals and guitars run accordingly as always. Addition of guests Fripp, Lifeson and Wesley more than improved the appeal provided by FOABP.'Fear of a blank planet', the title-track and opening act, starts soft and plain, only to throw the listener into a myriad of different tunes, ranging from typical space/psych chords (PT's roots) to clear heavy sounds and hovering above these that dazzling prog atmosphere able to please the most diverse tastes; there's a feeling of unfinished things like a page to be written further - and it seems to be done with a purpose. The balladesque 'My ashes' reminds me some early 70s melodies, this time seen from a 21st Century point-of-view, not spectacular but keyboards play in a symphonic manner, a symptom of the band's and album's eclectics.The mentioned introductory songs act like a preparation for the epic-like 'Anesthetize', a lengthy track so meaningful and touching with so many variations and possibilities that's almost impossible not to be caught by its tunes that I suggest simply let the flesh and mind flow in parallel - even not picking immediately the lyrics one may visualize clearly to where this voyage goes.The 3 last songs are well fitted within the album concept (dare I say there's one, no?) and complete fairly the superb first half well above the average platform: 'Sentimental' is pungent and has a catchy piano; 'Way out of here' brings some Floydian memories mixed with other influences; and 'Sleep together' closes the ark with a golden key and I swear I could hear Beatles tunes from the Magical Mystery Tour era and the final question remains: did they try to take us into a magnificent journey with FOABP? Well, they got closer and who knows if I'll embark totally in this tour with more hearings.Truly, a fine work from Mr. Steve Wilson and companions that lands correctly into the excellent addition to any prog collection. That's it!"
    },
    {
      "reviewer": "The Pessimist",
      "date": "Posted Sunday, April 6, 2008",
      "rating": 3,
      "text": "As some think, I agree that this album is very much overated. The only interesting songs for me are Anesthetize and Sentimental, but the rest is typical PT, in very similar style to In Absentia and personally I prefer the latter. The two I mentioned, however, are masterpieces, so they save the album from a two star rating, but the rest drags it down. The best thing I can say about this album is that it is, by a stone's throw, Gavin Harrison's best performance throughout the whole time he's been with this potentially brilliant band. So, being this NOT by my standards an excellent addition to any prog music collection, 33% of it being masterpiece work, 66% of it dull and unoriginal, I'm going to give this an average rating for an average album. 3stars is the best I can dish out for the latest release from PT."
    },
    {
      "reviewer": "LiquidEternity",
      "date": "Posted Thursday, April 24, 2008",
      "rating": 5,
      "text": "On this record are not only some of Porcupine Tree's heaviest moments ever, such as a few of the instrumental breaks in the massive Anesthetize, but also some of their most delicate, such as the gentle My Ashes.Do not fear: the band is not just repeating ideas from earlier CDs and trying to improve upon them, as many bands do (and Porcupine Tree is often accused of). Rather, Porcupine Tree branches out in some other directions, such as oddly written and timed synthesizers, something akin to thrash, soundscapes reminiscent of mid 70s King Crimson, and a measure of grungy punk sound. The highlight of this album may very well be the drumming of Gavin Harrison, not a newcomer to prog or music at all, but nevertheless one who suddenly decided to let everyone know that, yes, he can drum particularly fast but also with an uncommon amount of flair. That is not to say that the rest of the band is not in top form, either. Wilson's guitar and voice are at the peak of their respective sounds, while Barbieri provides some well produced and very cleverly used synths and keyboards. The only downside to the band's performance here is the absence of a strong bass sound, which has in the past been a strength of Porcupine Tree, but here Wilson follows the metal train and blends the bass in with the crunchy guitars.Fear of a Blank Planet opens with itstitle track, a song actually somewhat reminiscent of the opening title track on the band's prior release, Deadwing. That is not to say it's at all the same, nevertheless. Some unhappy lyrics, a nice guitar solo, and a surprising drum fill that lends the music to a rather heavy riff all form the majority of the song, until it comes to the ending portion, where it fades gently into the next track.My Asheshappens to be that very song, but admittedly there is little terribly new about this song. It hearkens back to In Absentia or Lightbulb Sun. That is not to say, however, that it isn't a worthy song. While perhaps the least exciting and clever on the album, it still features a sweet melody and a refreshing background noise of a record and a needle. Of course, any loss of excitement that My Ashes might provoke in a listener goes away fairly quickly asAnesthetizesteps up to the stage. The longest track on the album (indeed, the band's longest track next to The Sky Moves Sideways), it clocks in at just under eighteen minutes. Anesthetize is divided into three sections. The first is a minimalist part building towards a guitar solo by Alex Lifeson of Rush, all the while driven by an eccentric but steady rhythm from Harrison. The second part begins in a rush of heaviness, as the double bass goes wild and Wilson's guitars crunch down hard. This is also the only section that really features any sort of a chorus. Near the end of this middle third comes what is perhaps the most shocking Porcupine Tree moment to date: the guitars lose all semblance of melodic gentleness and the drums go into full thrash-mode. While this may turn off a number of the band's listeners who are only interested in their melodic side, it certainly throws every fan for a loop--and many prog fans like being thrown for loops. The final section is gentle and pacific, layering harmonies over a oceanic soundscape, softly winding the track down and away.Following on the heels of this impressive track isSentimental, an acoustic and mellow track somewhat reminiscent of Trains. While a nice song, this is a fairly unremarkable one. Or perhaps that's simply an aftereffect of following Anesthetize. Hard to say. Either way, the tempo and energy picks back up again once more with the songWay Out of Here. Featuring a lot of distortion in the chorus and a continuation of the album's dark and depressive lyrical content, the track plays forward without really slowing for the first half. Partway through, however, the music fades away, and Robert Fripp of King Crimson guests to build up a sparkly soundscape. Once this rising force climaxes, the song dives back into the metal ideas, featuring a whole lot more intense drum work from Gavin. The final track then wanders onto the album:Sleep Together, an unconventional closer for Porcupine Tree. Quiet verses and loud, grungy power-chorded choruses make up the song. The finale of the song features some humming string synthesizers, bouncing around on a strange melody but really shaking up the conclusion of the music. The production and mastering on this portion of the album especially is impressive.In the end, this is quite probably Porcupine Tree's most varied and strongest album to date, edging out the favorite In Absentia on account of a bit more experimental and creative energy. It's also not a bad place to start with for the band overall, either."
    },
    {
      "reviewer": "ProgBagel",
      "date": "Posted Monday, April 28, 2008",
      "rating": 5,
      "text": "Porcupine Tree - Fear of a Blank Planet 5 starsThis album is Porcupine Tree's career resume.A perfect mix of everything Porcupine Tree has done, this is also their most accessible album to date. their popularity surged after this release. This was originally one song broken down into six connected pieces. Each one seems to have a unique taste, but it binded musically and spiritually to the concept at hand. The concept is a pretty relevant one, dealing with kids and their slavery to electronics, media and drugs, which is a real growing problem in my eyes as well.'Fear of a Blank Planet' is the title track and opener. Like the track 'Deadwing' it doesn't hesitate to get loud right after the short intro. This is a lyrically driven piece coupled with some of Wilson's typical drop-D guitar riffs, which has been an asset to their new sound. The song takes a dramatic change towards the end where things get melancholic and slowed down. It made a decent track turned into a great one.'My Ashes' is where the preceding track took off. This track is a classical piano piece mostly with some voice and some effects. This track has been the weak one on the album, but as I like to give albums time (for good or bad), this track became quite a cozy one. Another great song.'Anesthetize' is a massive 17+ minute track. This is one of PT's best tracks. It has a real industrial metal flavor to it. The track can be split into three parts. The first is opened up with some of Gavin's best drum work. A perfect display of dynamics and rhythm on the toms drives the beginning with some singing and a few heavy guitar moments. The guitar takes the lead in the second part where it feels like a really long jam. The third part takes a drastic change with some vocal effects and a cold ending.'Sentimental' is a breather track after 'Anesthetize'. It's a really slow acoustic song with some of Wilson's best singing. Towards the end things get more upbeat, and a return to the catchy riff from 'Trains' is brought in again.'Way out of Here' is my favorite song on the album. The chorus is among the best, mostly because of the little melody and the perfect vocals fitting it. That is the only way to really describe it, it is a must hear.'Sleep Together' is a great ending to this album. It is quite an eerie one, putting this album to a dark end. This includes a string section in the end.I found 'Deadwing' and 'Lightbulb Sun' to get leaps ahead of this one. The thing is, I cannot really find anything weak on this release. Everything seemed to be really flowing and tied together wonderfully which is usually hard with most concept albums. It really left no mistakes."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Wednesday, April 30, 2008",
      "rating": 4,
      "text": "Solemn and bored the kids stayPorcupine Tree's latest attraction (at the time of writing) has gained a lot of attention from the prog community, and for many good reasons. A concept album about how tomorrow's kids are going to be zombies to their computers, Xboxes and malls is sure to intrigue anyone who thinks the same about modern society, especially us cynical ones. The ironic part about this is that the audience targeted by the lyrics became the target audience when it was marketed over mySpace and the like. Mr. Wilson is very wise as to how to get his message across.But speaking of message, a bigger question arises - being someone so good with the progressive structure and a modern master of the instrumental, how is this lyrically thick moral aspect going to affect the music? The answer is - a lot.Fear Of A Blank Planetshows an entirely different Porcupine Tree [PT] than the blokes who traveled Sideways in the Sky or running up down staircases, this one is a heavy, rougher edged band who wants to get a point across. It's even a very different album from their previous effortDeadwing. This is, of course, not a bad thing since PT has always gotten by on being a very dynamic and shifting band, expecting them to stay the same would be ridiculous.What should we expect on this album then?Well, prepare to be bludgeoned with lyrics, but if you're ready for that then you should be fine. This is PT's most vocally heavy album to date, but it's also one of their most heavy in everything in general. Tone, mood, depth, it's all very heavy. This is clearly evident from the opening riff on the title track right though to the final chord on the final track. Though the album does tend to leapfrog itself with fast and slow there's no stopping of the heaviness, no matter what incarnation it takes.Fear of A Blank Planet(the track) is quick and jaunty whileMy Ashesis simply heavy in subject matter, and so on and so on.Likely the greatest standout on the album (and this is hardly surprising) is the 18-minute suiteAnesthetize. Starting with some chilling chimes and some catchy bass the song eventually makes it's way into motion. Going from fast and destructive to slow and calm coming into the end, this one visits it all. Featuring an excellent and veryRush-like solo from Alex Lifeson coming into the beginning of the second segment, this one is also a very good track for all the Heavy Prog fans out there.Whether it be the heavy and chugging tracks like the title track,Way out Of HereandSleep Togetheror the melodic melancholy of others such asSentimentalthis album is one that works off a couple carefully selected aspects. Being a concept album as well they tend to stick close together creating a sound that, the first couple spins, seems like a very samey album. The tracks are well placed in the timeline however, and this effect soon wears off. even if never completely.Being one of the most important prog bands of this decade (even if Wilson denies the prog label) it's to be expected that they release very well respected albums. This one isn't perfect, but it's still miles above some of the other music on the market. Voted PA's album of the year 2007 (very deservingly) this one is very unlikely to not catch your interest if you fancy yourself a prog head. It's very hard to give this one a 5, but it's very well deserving of a bright 4. Maybe even 4.5. An excellent addition to your library."
    },
    {
      "reviewer": "MovingPictures07",
      "date": "Posted Saturday, June 7, 2008",
      "rating": 5,
      "text": "If everything on the radio was THIS good, then the world would be a much better place.That's my motto to certain artists, but it fits most aptly and often to Porcupine Tree. Porcupine Tree are relatively unknown in the mainstream, but I can't figure out quite why. They started out as a complete outlet for multi-instrumentalist Steven Wilson back in the late 1980s and early 1990s, but then became more of a band effort increasingly over time.The brilliance of their records is unmatched by hardly any other artist that I know (except maybe Magma or Rush in terms of consecutive masterpieces) and this album is NO exception. Many of you probably wonder what this sounds like... it's really a unique mix of amazing vocal harmonies, alternative and metal influence, spacey interludes, and all around extremely tight production, musicianship, and compositional skills.The music is highly well-crafted and very accessible, so those of you who are worried about my bordering-on-the-obscure music tastes at times won't have to expect a Weidorje or Magma here. You could even show this to your friends and chances are they'd like it. This doesn't take away from the artistic depth of this album or ANY of Porcupine Tree's work, however.It has some of the BEST production I've ever heard (by Steven Wilson himself), the music again is absolutely outstanding and uniquely addicting, and the lyrics can be dark but always have a purpose. This particular album is a concept album built around the collective fear of the unresponsive generation, i.e. kids who grow up never feeling or intellectually stimulating themselves, only zombies who constantly play Halo to fit in or what have you. If it sounds conceptually weak to you at all, I guarantee to you that in the voice of Steven Wilson it is executed in an absolutely wonderful fashion.But who has time to even listen to the lyrics when the music is THAT good?! Did I mention Porcupine Tree has one of the greatest modern drummers, Gavin Harrison? Just listen to Anesthetize, which is the beast track of this album. It is easily one of the greatest pieces of music I've ever heard.Anyone who skips out on hearing some Porcupine Tree is missing out on possibly one of the greatest things to happen to music, especially in the modern day.Well, what are you waiting for? Stop reading my note and go order Fear of a Blank Planet today! You definitely won't regret it."
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Tuesday, July 22, 2008",
      "rating": 5,
      "text": "I don't know what to say about this album.It makes me believe,that there will be a new golden progressive rock era after the 70s.Mainly heavy prog,but it contains so much ideas here...This album is at the same time classic review of the 70s and vision to the future with that low-mooded and dark sound.It is structured consistently and is about to become a future classic.It is essential music for 21st century prog culture!"
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Friday, November 14, 2008",
      "rating": 5,
      "text": "Fear of a Blank Planet was my introduction to the band known as Porcupine Tree. This album continues the trend of heavier music and decidedly darker themes. While the lyrics are based on the novel Lunar Park by Bret Easton Ellis, the overriding subject matter deals with a topic I have often considered during my time as a college student and subsequently a high school teacher: Adolescent nihilism. Young people in these times can frequently only be stimulated by video games, music, and television, shutting themselves up from the world, as the parents drug up their children, believing their erratic and depressing behavior is natural and excusable. It's a depressing but otherwise pleasant collection of music.\"Fear of a Blank Planet\" The acoustic introduction here (not to mention the sound of someone typing on a keyboard) is a nice touch and an excellent way to start this album. The lyrics are spot on when describing the pseudo-anguish many young people go through, the fa�ade that life is a vulgar travesty not worth living through, and the self-absorption that many youth indulge in. The chorus states the problem succinctly, and is also memorable in a way that most Porcupine Tree music tends to be.\"My Ashes\" A mournfully beautiful song, this one is full of a sense of pining for a lost childhood and days long gone. The strings and the acoustic guitar are effective in conveying such a sorrowful mood, as are Steven Wilson's vocals. The music flows steadily, like a river a young man has tried to drown himself in.\"Anesthetize\" This track took me several listens to finally get into, but now that I have, it is one on the album I look forward to hearing. We get the privilege of hearing Rush guitarist Alex Lifeson also. Whereas I once thought of this track as repetitive and somewhat boring, further hearings gave me a greater understand of the composition as a whole, and I appreciate its place in the context of the album.\"Sentimental\" This is about as depressing as it gets, especially from the first lines: \"I never want to be old, and I don't want dependents.\" It is mainly piano driven, with some unsettling timings. The drums sound like a mix of samples laden with effects and the real deal. The chorus is catchy, and the music remains pensive. This chorus will be reprised in the later EP Nil Recurring, as will the title of this song.\"Way Out of Here\" Here, Porcupine Tree again juxtaposes heavy riffs with quieter passages, only to a greater extent. The track also features legend Robert Fripp. It is a bleakly hate-filled song, loaded with discontented phrases and a dismal spirit. There is an excellent bass-lead groove at the end of this song, making one want to hear it again.\"Sleep Together\" The final song is the weakest track, although by no means dispensable. It seems a bit longer than it should be, and therefore somewhat repetitive. The last three and a half minutes is a settled but disquieting instrumental section that does make this song stand out."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Friday, February 13, 2009",
      "rating": 5,
      "text": "PA's greatest album of 2007 makes its way into my library about a year behind the moment. Let's see if I can make sense out of this one.Obviously, Porcupine Tree is one of the most popular bands on this site and this is one of their most popular albums. It's was a strange album when I first listened to it because my first impression was that it was just an above-average indie rock album. It takes a couple of listens to really see where the underlying complexities lie and how much of an artistic statement this really is. This IS NOT prog in a traditional sense; there are no obvious Yes-tones or Genesis-tones, odd time signatures are there but not overwhelming, and the virtuosity is how the compositions are put together, not necessarily how technically proficient the instrumentalists are.I quite like this one very much, but I'm not going to over-elaborate every last song nor am I going to call this the greatest prog album ever. The only fart in the album to me is ''Sleep Together''; it just sounds like monotonous droning even when the song gets heavier in dynamics (of which I quite like). Other than that, I'm quite pleased with everything else; the lyrics, the segues, the structures, the instrumentation, the vocals, etc. Definitely, ''Anesthetize'' is the centrepiece of FEAR OF A BLANK PLANET due to its length, but I like this one a lot since it only focuses on a few themes throughout its 17+ minute length, but all are developed well and the transitions are nice and smooth.Most prog fans seem to take this one close to heart despite it not being a prog album in a traditional sense. I think progmetal junkies ought to get a kick out of this one since FEAR OF A BLANK PLANET kind of leans in that direction. I'm going to say it's a five star album, but be warned, there's a slight risk you might not like this one."
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Monday, March 9, 2009",
      "rating": 5,
      "text": "'Fear Of A Blank Planet' - Porcupine Tree (10/10)Although it will arguably never reach the same level of success and achievement as it did in the 1970's, progressive rock is not dead. In fact, some of the decade's best music was crafted by progressively-inclined acts. Porcupine Tree is the defacto leader of modern prog rock these days, with a string of masterpieces under their belts that more than justifies the attention they have received. Throughout the late '80s and '90s, musical mastermind Steven Wilson developed Porcupine Tree from what was originally a tongue-in-cheek psychedelic experiment into something more serious. Though a bit older than some of the other bands on this list, Porcupine Tree never really hit their stride until the 00's, opening the new millennium with such now-classic albums as 'Lightbulb Sun' and 'In Absentia'. Virtually perfecting their atmospheric blend of art rock by 2005's 'Deadwing', Porcupine Tree then set their sights on something different. Emphasizing their existing feelings of melancholy and exchanging their psychedelic tinge in favour of metal, 'Fear Of A Blank Planet' saw a much darker side of the band's music than ever before.The album is a six piece concept revolving around the tribulations of modern life, through the eyes of a teenager. Porcupine Tree expose and reflect upon the sort of ambivalence and apathy that plagues the middle-class lifestyle today, with Wilson's brooding lyrics touching upon everything from prescription drugs, hypocrisy and media to the emotional results of this environment; isolation, helplessness, and thoughts of suicide. Make no mistake; Wilson tackles these topics with a poetic soundness that keeps 'Fear Of A Blank Planet' from ever becoming a weepy mess. Most of the loose narrative here is told through the eyes of your everyday pill-popping, disillusioned youth, and Wilson manages to adopt this persona in his lyrics without getting preachy or didactic, much like a prog rock J.D Salinger. As one might guess, the music isn't too far off the lyrics in terms of its moodiness. There is plenty of dynamic here, ranging from soft electronic ambiance to moments of extreme metal aggression- possibly a reflection of our protagonist's bipolar disorder? All of the chaos within the mind of this teenage everyman is channeled through Wilson's brilliant-as-ever production.'Fear Of A Blank Planet' rests in a perfect balance between a sense of cohesive flow and distinction between songs. The title track gives us a dense blast of dark art rock and introduces the subject matter. 'My Ashes' and the spacey piano-driven 'Sentimental' are a more relaxed slice of Porcupine Tree, toning down the energy and heaviness without losing any of the feel. 'Anesthetize' is the album's seventeen-minute cornerstone, an absolute monster of a track that summarizes everything the album is about, featuring both the album's most mellow, and most aggressive moments all within one composition. 'Way Out Of Here' is possibly the most immediately appealing track, with the melancholy now amped up to 11. Finally, 'Sleep Together' ends the journey on an ambiguous note, with exotic string sections blazing and dark electronics filling up the sound. The album ends with Wilson singing about relieving the pressure, and burning his possessions. Has he found enlightenment and broken through his apathy, or killed himself? These things are left up to the mind of the listener, and makes 'Fear Of A Blank Planet' the greatest statement from one of today's most impressive rock groups."
    },
    {
      "reviewer": "lazland",
      "date": "Posted Wednesday, May 13, 2009",
      "rating": 4,
      "text": "A very difficult album to both rate and categorise, this is the last studio release by Porcupine tree, a band I have fallen for in a big way, ever since the UK publication Classic Rock put Lazarus on a free DVD with the magazine.There are so many moods in this album, it's hard to start describing them. The opener is the title track, and can be best described as dark, with heavy riffs accompanying what sounds very much like Wilson being sampled on vocals. It's not my favourite track, but, as with all I've heard from the band, I think they are incapable of making bad music. It's just that they are capable of making much better. This, to me, is somewhat rushed and not at all typical of Wilson's exceptional vocal talents at all. That said, I do enjoy the last couple of minutes when the heavy riffs die away to an almost ethereal keyboard backing Wilson in more thoughtful mode.This leads into My Ashes, which is quite fantastic. The keyboards on the start of this and the end of the title track are almost Floydian, but when Wilson launches into the chorus, backed up by wonderfully arranged strings, you know you are in the company of genius. Very much keeping with a dark, almost mournful, tone, this is a highlight of my collection.Anesthetize is the longest track on the album, clocking in at over 17 minutes. It's nice to hear Alex Lifeson, one of my favourite guitarists, guesting on this track. His solo is a highlight of the album. I love Harrison's drumming on this track, which certainly provide a fine backdrop to the, again, almost mournful Wilson vocals and other instruments at the start, before the track explodes into a rich, heavy scene, before quietening down again. The mood changes are incredible. Thoughtful in the first segment, heavy and fast in the second, and mellow and sad in the third. At first listen, the end segment seems repetitive, then after a few listens you learn to lose yourself in the utter beauty of it all. A great track.Sentimental is mellow, with a quiet and thoughtful piano accompanying Wilson's vocals and a stunning guitar lead, which are quite lovely. Special mention again to Harrison for some fine drum work. I really love the end keyboard and piano mood.Way Out of Here follows. The great Mr Fripp guests on this. It starts off very quiet and thoughtful, and again quite melancholic in its mood. Then, some two minutes in, the riffs explode, and the track evolves into one of the album's heaviest, both in terms of sound and mood. Very bleak, especially the riff about halfway through leading to a repetition of the dark chorus, before the track concludes with Fripp inspired sounds, accompanied by an incredible Colin Edwin bass piece.Sleep Together concludes the album. Again, the mood swings are very noticeable. Starting off quietly, with more Wilson vocals that verge on the introspective, again very much sampled, the track then explodes again with heavy riffs with some excellent Barbieri keyboards. These are very much to the fore as the track concludes, possibly for a couple of minutes too long, but still effective for all of that.Porcupine Tree are sometimes described as a Wilson vehicle. I think the man is exceptionally talented, but this album absolutely demonstrates that he has a magnificent bunch of musicians accompanying him.At times bleak, very moody, but always very good, with some fantastic production, this is a great piece of work. On a thread in the forum tonight, I stated that, despite my roots lying in the seventies \"classic\" era, we should celebrate and cherish the music in progressive rock we have in this decade. This album is one such reason to cherish the development of the genre. Original and inspiring, even in its darkest moments, of which there are many, this is an excellent addition to any collection.A very strong four stars - not quite enough to get to the perfect five, but not too far off either."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Thursday, May 14, 2009",
      "rating": 4,
      "text": "This album was my introduction to Steve Wilson and Porcupine Tree. After a fifteen year hiatus from \"progressive rock\" and most new music, ProgArchives reviewers led me to this gem. Revived with a new intrigue and interest in the most artistic of music forms, progressive rock, I began my adventures into post-1970s prog with this CD. From the first listening I was impressed. A little heavier than I expected at times, I quickly keyed into the drummer: very impressive. Then found myself bewitched by the beautiful and diverse sound textures (helped out by old \"friend\" from my David Sylvian years, Richard Barbieri). Even nostalgically amused by the \"guest appearances\" by prog legends Robert Fripp, Alex Lifeson and John Wesley.1. \"Fear of a Blank Planet.\" Drums catch you from the start: Tight! Confident! Who is this guy! Google search! (This was my first exposure to the work of the great Gavin Harrison). Pretty cool \"metal-ish\" feel in the guitars, the kick drum style, though mellotron/synths soften it some. Great mellotron background wash! Lyrics kind of cynical and depressing. Keyboard work is subtle but really absorbing. Good hard driving tune with excellent electric guitar and synth soli at the end. The end is the best part (and more typical of older PT, I will find out). (7/10)2. \"My Ashes.\" Very cool intro. Haven't heard that effect/sound since Zep's \"Ocean\". Chorus enters over a beautifully fluid wash of FLOYDian mellotron, followed by entrance of drums and electric guitars.The burdens of cultural transmission. I've read Steve can be a bit down, even depressing (lyrically). Love the flowing, floating strings behind the vocals and acoustic guitars. A lovely, well-constructed song. (8/10)3. \"Anaesthetize.\" The first truly priggish feeling song. (Especially due to it's 17 minute length.) The drum \"arpeggios\" underlying the first three minutes are mixed perfectly into the song so as to not overwhelm the listener. The entry of the fuzz guitar chords and snare hit and then excellent electric guitar solo precede an awesome electric piano sequence (like AMBROSIA?) and some synthscapes just before the more metal-ish drum and bass sounds take over the rhythm. Steve's treated vocals @ 8 minutes in truly usher in a more fully metal feel (so cleanly recorded!) (really a NIRVANA grunge \"Feels Like Teen Spirit\" section). Awesome Gary Newman \"Cars\" sound just before this drummer dude really gets to impress us. There's that metronomic click track again. Barbieri/Wilson's synth work is so smooth, subtle, understated but interesting and key! The FLOYDian end section brought in at 13:20 is very cool, very Wish You Were Here/Animals, complete with brief Gilmour-esque axe solo. Song never really seems to develop into what it promises at the beginning, though it does end well. (7/10)4. \"Sentimental.\" A teen anthem sung by a thirty-forty-something. Hm. Simple, SIMPLE MINDS/U2-ish song structure has a feel similar to several other \"classic\" PT songs. So-so song. (5/10)5. \"Way Out of Here.\" The first of the albums two really great songs-true classics, with really powerful lyrics and vocal deliveries (though sometimes too deep in the mix, due to the treatments). Very catchy chorus lyric and melody. Absolutely stunning guitar solo (Fripp?) is followed by an eerie, here comes the slasher lull before all metal hell breaks loose. And did I mention the drums? This drummer (Gavin Harrison) knows his craft--enhancing yet never dominating with sometimes breathtaking speeds and techniques (again, the drums are so well mixed into the music). The long fadeout of ascending string sounds over Harrison's ever-so subtle yet playful batterie is brilliant! (10/10)6. \"Sleep Together.\" A quiet little intro is suddenly amped up and made rather eerie by a strong, slow drum beat before Steve's treated voice screeches his forceful though despondent command \"Let's sleep together.\" The world's about to end, so why not? Second time through the chorus leaves us in outer/inner space with some very interesting multiple synth play. Gavin and Colin rejoin the music to help usher us through a truly unusual \"string quartet\" (a la KRONOS QUARTET) exit. Very fresh and creative. Classic prog! Awesome! (10/10)Undoubtedly outstanding musicianship and sound recording with very impressive composition and of-time-capsule-interest lyrics (computers and iPods). I think we have a modern prog classic! 47/60 = Solid 4 stars. An excellent addition to any music collection."
    },
    {
      "reviewer": "The Crow",
      "date": "Posted Friday, June 26, 2009",
      "rating": 5,
      "text": "I think that \"Deadwing\" is a masterpice, and it was really difficult to be surpased by another Porcupine Tree album... But I don't know how, Steve Wilson and his fellows managed to make the best album in the band's career!The style of \"Fear of a Blank Planet\" is not very different from \"Deadwing\"... It's maybe even more cohesionated, proggier, and it has the perfect balance between the strong guitars of the last band's period and the symphonic and classic prog elements. Anesthetize is the perfect example... And the best song they have ever made!I had the luck of seeing Porcupine Tree playing this album live in its integrity in Madrid, the last October... They played it from beginning to end, not missing a single note. And then I realised again how wonderful this album really is. It has no flaws, not a single weak moment, and it flows wonderfully from the first to the last second... My Ashes and Sentimental are great mellow prog songs, following the path of Trains from \"In Absentia\", but adding an even more melancholic and devastating feeling. The tittle track is similar to the song Deadwing in style in melody, but even better. Way out of Here is another little classic in this album, with a great vocal work and a lot of intensity... Sleep Together, with its hypnotic bass line closes the album in the right way... While Antestetize is the best Porcupine Tree song I've heard!The concept of the album is also really interesting... Here Steve Wilson give his opinion about today's young people, about the drug abuse they make every day, the personal problem they have to adapt themselves to this world, and even their way to love and feeling the others. Every song of the album develope this concept with the marvellous Wilson's lyrics, with a great sense of melancholy, desperation and world's disconnection. I think I will never be tired of hearing this incredible lyrics accompanied by even more incredible music.Best tracks: every song of the album is a classic, both lyrically and musically.Conclusion: \"Fear of a Blank Planet\" is the best Porcupine Tree album I've heard... Here we can hear the band in top form, in the highest peak. The sound is perfect, every song is a classic, the musicians are masters (Gavin Harrison is god), and the band finally reached the perfect balance between the hard guitars and the acoustic/dreamy passages, almost reached in the outstanding \"Deadwing\"... So Steve Wilson and the rest of the band will have to do a very very hard job with \"The Incident\" to surpase \"Fear of a Blank Planet\", because it's one of the best prog albums of this decade.My rating: *****"
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Friday, July 24, 2009",
      "rating": 2,
      "text": "Fear Of A Blank Planet, Porcupine Tree, 2007My problem with Fear Of A Blank Planet is that it is an absolute non-event. I can go through an entire listening without thinking of a single bit that I either particularly like or dislike... a fairly tame set of vocals (going for a representative non-voice, and since the lyrics aren't representative, it basically ends up being a complete non-representation) and the ridiculous preconceptions of the lyrics (I mean, seriously, 'X-box is a god to me'...) admittedly don't help it much. No complaints with the performance, nor really with the compositions; it just continues to make no impression, except for the occasional nail-biting lyric.Keys and a slightly Opeth-flavoured acoustic introduce a very much alt-rock number. Somehow, despite a number of individual features that seem appealing (Harrison's drumming, cool harmonies, memorable melodies, birdcall guitars, some ornamentation), the overall texture is a sort of cold soup (not mushroom, though: that tastes even better cold), which, despite nice components and a bit of forethought, has been left out on the side in the concept album kitchen too long to hit the spot.Way Out Of Here, as a cooler number, seems to work better. Menacing electronic throbbing creates an undercurrent for a slightly Quadrophenian verse (perhaps the theme, perhaps the style but that's what it reminds me of) and a great entrance by Harrison. The sort of slow-metal groove of the chorus is effective; the guitar solo and that plain dull metal bit entirely unhelpful... I mean, why do I want to hear a generic metal riff in the middle of a pop song... it just doesn't add anything? All in all, a bigger ratio of 'oh, that's nice' to 'where did the last seven and a half minutes go', but I'd still be surprised if it's a 1:1.Sentimental sees a sort of effort at a moment of brief hope in the o so real wasteland of desolate computer-screen-starers who no longer care about anything with a cheery piano, and more or less non-depressive melodies. Admittedly, the vocals seem as doom-and-gloom as ever (I'll spare the lyrics; you probably know what I think by now). All in all, it's a fairly harmless alt-rock song with a particularly decent set of background guitar solos and still a non-event.Anesthetize is like an epic poem in that it's long and has a suitable amount of repetition... it's also a bit like a stool with two legs, where the missing leg is quite important. The vocals are just about blank, but somehow not blank enough to convince me that I should forgive their content (moderately loong syllables with no colour or flavour all over). There are a few, rare, really spine-tingling moments where the whole band pulls together in a manner just about moody enough to convince you that, even if the album's message is ridiculous, if it were about something else, you'd be impressed. Lifeson's guest solo is neat, as is the burst of jamming over a speaker-switching riff. These flashes of excellence meet with the dreaded repetition as a springboard:� 'relax... I know that was a bit quick, so calm down, wait until you think you're in your comfort zone... we had a metal riff... have it again... we might develop it when we're sure you're OK with it... ready... alright, have a bit more content... it's OK...'Maybe I'm just more picky about what should be in a long song than when I first started, and as said, there are some glorious moments in Anesthetize but the repeats, the first couple of sets of vocals and the lyrics do put down what at times emerges into something of a quality, structured epic. Admittedly, the structure's just about lost on me (meaning: only the immediate contrast makes an impression). Again, it could make a bigger impression than it does, but it's on the nice side.My Ashes is a small step up for the album's more friendly material, augmented by a set of lyrics I can conveniently pretend are about something completely different, a nice vocal melody, a contrast between the piano and guitars and some synth strings which I fear criticising in case it actually turns out to be Fripp (who later on makes some suitably bizarre soundscapes). Harrison's entrance darkens and hollows out and cools the whole thing in a manner pretty typical of the album. Another not-really there track.Sleep Together features more of the throbbing synths (and a great sound on them: a nod to the producer to make up for all the nasty things I've been saying about the lyrics), as well as metallic moments that are credible and add to the song. Some sly oddball guitar licks, a constant keyboard presence and thick metallic drumming add up to a slightly more exciting ending to a generally bland album. Even if a Midsomer Murders incidental music type melody is drawn out a bit and the concept remains the just victim of a Harold-The-Barrel scene where I harangue it to just jump already and leave the rest of us to deal with more menacing and genuine types of angst. Still, musically, it's not bad.Writing all this, I've realised that my problem with this album is simply that I can't take it seriously... the lyrics seem like a parody more than an insight, and consequently all the concept album paraphernalia... picked voices, moments of contrast and triumph and so forth, fall flat. Anyway, if you don't care about lyrics, or spend more than 50% of your waking hours complaining about the sinister results of the internet via the medium of progressive rock forums, this is probably not a bad place to start with Porcupine Tree... I mean, I can see how, if I could ignore the concept and pretend it was about hobbits or tantric scriptures or how you got Christopher Lee to add voiceovers or something a bit more credible, I'd possibly really like this album. As it is; two stars for an album that really, my collection would be just fine without.Rating: Two Stars Favourite Track: Anesthetize or Sleep Together, I guess."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Thursday, September 3, 2009",
      "rating": 4,
      "text": "This is the first time PT released an album that stayed close to the preceding one, both in style and in sound. At least that's how I hear it and for once I won't complain about it. First of all PT is one of the few bands who have brought something new with every album so they have done their load. Secondly they had achieved such a strong and personal eclectic style withDeadwingthat we can be very happy indeed to have another album perfecting what was happening there.WhereDeadwinghas a few dips in the song writing, this album is very coherent and unbelievably strong throughout. At least in song writing, the execution sometimes leaves room for improvement. Especially the two closing tracks fail to engage me. They sound too flat and studied. Especially when comparing them to the live renditions that ended up on Ilosaarirok, they seem to drag and stray a bit.While I initially opted for 5 stars, I knocked one off after revisiting the entire Porcupine Tree catalogue. As on all their 21st century studio album, I miss a bit of bite and spontaneity amidst all the sonic perfection. 4.5 stars"
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Monday, November 9, 2009",
      "rating": 4,
      "text": "Fear Of A Blank Planetis the ninth full-length studio album by UK progressive rock actPorcupine Tree. I�ve been very interested in the band�s releases sinceIn Absentia (2002)when they changed their sound and began incorporating progressive metal elements.Deadwing (2005)was another excellent release IMO, so I had great expectations toFear Of A Blank Planetwhen it was released. Most releases byPorcupine Treehave a tendency to take me a long time to appreciate. Not because the band�s albums are inaccessible, but more because the melodies take time to sink in. The melody lines almost always seem simple and a bit dull on first listen, but continue to grow with every listen.Fear Of A Blank Planetcontinue the musical development that started withIn Absentiawhich means thatFear Of A Blank Planetis the third album in a row that has a somewhat similar sound. A mix of alternative pop/ rock, psychadelic rock and progressive rock/ metal. People who crave development with each release will scream that this is a generic release, but personally I�m still not bored with the style so I can�t complain. There are six songs on the album. One of them is the 17:42 minute longAnesthetizewhich is a great track that in addition to some excellent atmospheric parts also feature some of the most intense progressive metal riffing the band has done so far. The title track is also a favorite but all tracks are of high quality.The production is a bit more organic than the sound onDeadwingand I�m still undecided if that�s a good or a bad thing. No matter what it�s an excellent production that suits the music very well.Fear Of A Blank Planetis an excellent release byPorcupine Treeand now after three consecutive great releases you�re allowed to call me a fan. A 4 star rating is well deserved."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Tuesday, November 10, 2009",
      "rating": 3,
      "text": "3.5 stars would be much more accurateUntil a few days ago I had only bought two PORCUPINE TREE albums (\"The Incident\" and \"In Absentia), and the reason is that I don't like the sound of the band, but in the same way I rated both albums with two stars because I honestly believe are extremely weak, I have to give a positive opinion about \"Fear of a Blank Planet\".With this I don't say it's a great album, still I believe it's momentous and lack of versatility, but at least is not as depressive and boring as the other two releases I rated. The band at last gives signs of life and not just a gloomy robotic repetition.\"Fear of a Blank Planet\" opens the album in a frenetic way, the band attacks the listener with from start to end with a nice blend of Hard Rock and Prog (to be honest, it's the first time that I listen something really Prog by this band). Even though the song is mostly the repetition of a single passage, there are interesting and radical changes that break the monotony.Sadly in \"My Ashes\" they return to their usual long depressive and sleepy tracks, every sign of life seems to vanish, as if they performed the track by inertia. Don't expect variations, because the track is again extremely monotonous and boring, with no changes or surprises, the song flows gently but predictably to the end.\"Anesthetize\" starts soft and with Alternative tendencies, a delicate use of Mellotron rises the level of the track trough a calmed passage, but the first change comes, leading to a, more aggressive passage where the guitar takes the lead role never leaving the spacey atmosphere prevalent through all the track.From this point, and strangely for a band that loves long repetitive songs, \"Anesthetize\" presents several interesting changes and instrumental breaks until the soft and melancholic end. Very good song, 17:40 minutes of good Progressive Rock.\"Sentimental\" must be one of the most beautiful tracks by PORCUPINR TREE, even when it's soft and gloomy, the vocals are outstanding and the general mood is so dramatic that maintains the suspense and interest in the listener.The tasty use of acoustic guitar with soft distant voices creates a very delicate atmosphere, unusual in this band.\"Way out here\" is like two songs in one, soft and with a strong Indie influence until the second minutes when all the band comes alive and give another dramatic performance, very good song that prepares the listener for \"Sleep Together\", even when different and more pompous by sections keeps the attractive atmosphere created in \"Way Our Here\", a good closer.Very good album by a band I don't usually like, but the golden rule of a reviewer is to recognize the quality over the personal taste,and \"Fear of a Blank Planet\" has quality, three strong stars that could be a little higher."
    },
    {
      "reviewer": "EatThatPhonebook",
      "date": "Posted Friday, January 29, 2010",
      "rating": 5,
      "text": "10/10\"Fear Of A Blank Planet\" is so far Porcupine Tree's most accomplished and most refined effort.The must have Heavy Prog album of the last years.After eighteen years of music, after eight wonderful albums, here comes Steven Wilson's masterpiece. Released only in 2007, \"Fear Of A Blank Planet\" is so far Porcupine Tree's most accomplished and most refined effort, an unforgettable album where all the musicians reach their highest peak, technically speaking and also for songwriting.\"Fear Of A Blank Planet\" is a concept album about a kid, concerning today's problems of adolescence, which are basically isolation, the massive presence of technology in their lives, the insecurity, and the depression. The album is very well structured: six songs, with alternated moments: from tense, heavy riffs, with some violent moods, to nice, memorable ballads, spacey soundscapes, and interesting experimentation here and there. This is \"Fear Of A Blank Planet\". The first and last time excluding this that we've seen a six song PT album, was \"The Sky Moves Sideways\", a hymn to the most sincere ambient and psychedelic music. In this new album, the style is completely different. After 2002's album \"In Absentia\", the band reached a new sound, which reaches the highest point in this album. So, in a way, this album has new elements for the sound, and at the same time it comes back to the origins somehow.The album starts with the title track, where after the brief intro starts with a tense, but catchy guitar riff . When the rest of the band comes in, the sound is even more tense. Great chorus, a repetition of the verse, and then comes in the middle part. We find here some mild jazz influences in these thirty seconds or so, until the song explodes once more with a heavy hook, until the finale arrives, where the mood is more relaxed, yet with always a tense feeling, as Wilson sings the last piece of the lyrics of the song. The track overall is amazing, surely one of my favorite tracks by PT.\"My Ashes\" is a wonderful, mellow ballad, with many memorable moments. Great chorus, great keyboards, the main instrument in this track, and surprisingly good, haunting vocals by Wilson, accompanied by John Wesley. Definitely a song that you wouldn't want to miss.\"Anesthetize\" is the epic, 17 minute piece, one of PT's best song and one of their highest peaks of their long career. Basically it can be divided in three big parts. In the first, which goes for five minutes, is a little builder, with interesting keyboards, and with another great performance by Wilson on vocals. This part increases in tension, an a solo comes in, until the second part starts. Now we a one note riff by a crunchy, heavy guitar that initially lays in the background, and meanwhile we hear a keyboard/ drum jam that starts. Right after that, the second part officially starts, with a heavy and powerful riff, and right after the main riff starts. Now the atmosphere is definitely tense. There's a chorus, a repetition of the verse, the chorus again, and then a middle part, that turns into a brief solo by keyboards, the middle part is then repeated, until it get's really heavy when he some crazy drums, with a powerful double bass section, and guitar, and then the chorus repeats. After a few moments, the second part is over.The third part starts with some fascinating keyboards, followed by a very mellow mood played with guitar mainly. The vocals make an interesting but fundamental contribute. It goes on like this until the song ends. Brilliant, epic masterpiece.\"Sentimental\" is an enjoyable ballad, with a beautiful keyboard section, and played with a drum machine most of the time. The verse is nice, the chorus is very melancholic and kind of sad sounding. The middle part however is more cheerful and hopeful, thanks to the great melodies brought to you by an acoustic guitar. Overall a very nice, enjoyable song that is worth the listen.\"Way Out Of Here\" starts with some electronic soundscapes, played by a surprising Robert Fripp, accompanied shortly after by the rest of the band, playing a mellow and sad sounding tune, until the chorus explodes, a beautiful and haunting melody, and then the song gets a little more enlivened. After a while, we hear a pretty good guitar solo, and then the song becomes calm again, and only guitars and keyboards are playing a nice, delicate tune, until suddenly a heavily distorted guitar dominates the scene, a brief repetition of the chorus, and then again a masterful Harrison shows how amazing his drumming can be, since the heavy part is still playing. After this, the aftermath: a nice, relaxing mood comes, with a great Fripp part. Shortly, the song ends.\"Sleep Together\" seems to be too underrated. It's one of my very favorite songs of PT. One of the catchiest songs of the album, it starts with some electronic, wild sounding soundscapes, and Wilson comes in a little after. The chorus is very catchy, enlivened, and kind of violent, and very explosive. The song overall is fantastic, and a great closer for this album.\"Fear Of A Blank Planet\", like I said, is the best and most refined PT yet, despite the many masterpieces the band has put out in their career. A perfect start for whoever wants to give the band a try. The must have Heavy Prog album of the last years."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Wednesday, April 14, 2010",
      "rating": 4,
      "text": "I was tremendously surprised by the popularity thatFear Of A Blank Planethas achieved in the mainstream media. Although when you put all the puzzle pieces together it would have made less sense if Porcupine Tree didn't received this type of attention any time soon.Fear Of A Blank Planethad reached the Swedish top 40 album chart position in 2007 which was unheard of for any Progressive album to achieve and I know for a fact that some of my younger friends that haven't previously heard of Porcupine Tree bought the record and enjoy it immensely. But what is it that made this particular release such a huge commercial success from Steve Wilson and his band? Just like with anything else, there are numerous factors well worth considering but judging from the reaction of my surrounding and the concert I experienced at the time there is definitely a strong connection to the album's subject matter.It is as if Steve Wilson managed to tap into the 21st century's teenagers frame of mind and made a package experience that excited them while making everyone else see it as a public distress call. Personally I don't really buy the whole concept that this album has to offer and to me it comes off more as 40 year old men trying to imagine how teenagers of today must feel. This doesn't sound as something genuine to me and I'm really surprised that this message have become so widespread. At the end of the day this is not the reason why I listen toFear Of A Blank Planet.Musically the album is a very disjointed affair that reminds me a lot of the popular Rush albumMoving Pictures. Actually I just wanted to create a plausible segway into the fact that Alex Lifeson contributes one of his trademarked solos on the epic masterpiece calledAnesthetize. This 18 minute monster of a composition consists of three noteworthy sections that all are far superior than anything else that the album has to offer and it's ultimately what makes this album worth a while for me. It also definitely helps that the album's running time is only 50 minutes making it an easily digestible trip to undertake in one sitting.Fear Of A Blank Planetis a surprise hit and miss on my part that in the end still comes up on top thanks to the strong performance on the album's longest track. I definitely don't enjoy it as much as the two previous Porcupine Tree efforts but we all knew that this band had to evolve at one point or another and its great to see that their music has now become noticed by a whole new generation of fans.***** star songs: Anesthetize (17:42)**** star songs: Fear Of A Blank Planet (7:28) Sentimental (5:26) Sleep Together (7:28)*** star songs: My Ashes (5:07) Way Out Of Here (7:37)"
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Friday, May 21, 2010",
      "rating": 4,
      "text": "Fear of a Blank Planet will always occupy a special place in my biography, as I literally get the album the day before my comprehensive exams as part of doctoral study. As you may imagine, I experienced plenty of powerful emotions during that time, from frustration, regret, sadness and general confusion. As you also may imagine, this made me perhaps more susceptible to some of Fear's emotional themes. (Primarily the confusing and unbridled angst of the title track and this innocence of My Ashes...fortunately much, much less so for the suicidal ideations of Sleep Together!).I doubt I'll convince anyone who already thinks Fear is a great masterpiece or conversely a trite sellout compared to previous glory days, so I'm not going to try. I will say that only two tracks really have had any staying power for me: the title track and Anesthetize. The former is a heavy, upbeat rocker with entertaining, sarcastic, and angsty lyrics; and Anesthetize is a solid epic (probably in my top 50 all-time epics) that is admittedly imperfect (perhaps overkill on the drums and grunge riffs), but with lots of great material (Lifeson's solo, the pensive intro, and the poignant conclusion to name a few).As for the rest, I do appreciate the clever details, double entendres, cover art, guest contributions, and overall theme, but I just don't see the songs (particularly Way Out of Here) as progressive masterpiece quality.It's angsty, it's clever, it's coherent, and at times it's very good musically. Even if it doesn't live up to your particular hopes or expectations for Porcupine Tree, Fear of a Blank Planet makes a valuable contribution to the progressive rock collective conscience."
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Wednesday, September 8, 2010",
      "rating": 4,
      "text": "I can�t say I�m a fan of Porcupine Tree, to say the least. This band is quite praised on prog circles ande I must admit I did try to listen and understand its music. In different time spans I had Deadwing, The Sky Moves Sideways and In Absentia. Non of them moved enough to actually sit down and write a review, at least at the time. So I was a little skeptical about Fear Of A Blank Planet, even though it was probably their most celebrated release so far. And rightly so.I�m still a bit uncomfortable with that mix of psychelic, alternative rock and modern metal. However, I also can�t deny that this is also a very emotional, intelligent, strong and convincing work. The sheer power of the songs is amazing. It is all very well done and the musicanship here is used to great effect and economy: no more no less then what the songs asked for. Sometimes they reach near the sublime with tracks like Anesthesia (a real masterpiece in its 17 minute musical trip) and the title track, but all the tracks are inspired and worth to be heard carefully. Clever, insightful, lyrics. A top notch production and some nice guest appearances of Alex Lifeson (on Anesthesia) and Robert Fripp (on Way Out Of here) complete the picture.Was I converted to PT�s cause? I don�t know. But I�m sure I will have to listen to their other works again. For this one is really a remarkable and outstanding efford. To listen without prejudices. Rating: 4 stars."
    },
    {
      "reviewer": "Andy Webb",
      "date": "Posted Monday, October 25, 2010",
      "rating": 4,
      "text": "Damn those wretched teenagers! (harumph, says the old man)It's pretty obvious with Porcupine Tree's newer release that Steve Wilson hates teenagers. The theme is obvious throughout the entire album. Musically, the album is spectacular, and vocally, the album is good, but not spectacular. There are many fantastic and memorable parts, and some that could be easily dismissed. Let's go track by track.Fear of a Blank Planet is one of my favorite tracks by PT and by any prog metal band. That classic riff and those timely lyrics (the only track on here that I will call \"timely\") about some of the more pathetic actions of the Millenial generation. Drugs, pills, sex, music, porn, he just shoves it all in a nice 7 minute time capsule. The drumming is fantastic, but that's because, well, it's Gavin Harrison. The instrumental section is downright impressive, also. Just a great, great track.My Ashes changes the mood from angry to sad, with nice melodies and a bit of a theme change (but not really). The rotary organ sound in the intro is nice, as are the classic \"Porcupine Tree\" chords that Wilson is so deft at creating. The track is good, but is a little cowardly in comparison to that fantastic intro.Anesthetize may be the only long track that I will ever give a bad review for. Me, the lover of lengthy songs, thinks this song drags. And it's only 17 minutes! The track is alright, but that's it. The melodies are sub-par, the riffs are for the most part constant, and the instrumental sections can put you to sleep. The track has an apt name-- it'll anesthetize you alright!Sentimental speeds up the tempo a little bit with a nice piano intro and some great melodies. It's not as upbeat or exciting as the first track, but it is a nice song. It has a nice rhythm, and that overshadowing theme is obvious in the lyrics. The verses can drag, but the chorus is a beautiful melodic piece that really beckons you to sing along with all your heart, even though that may drown out the quiet melodies!Way out of Here is a more ambient track, even though all of them are really ambient at heart. It does pick up for some of the chorus and instrumental sections. The rhythms are nice, as are the melodies. The dynamics of the tracks are good, as are the mood changes within verses. That overlying theme is there again, spitting on teenagers. But I'll forgive Wilson for that nonetheless. Overall, it is a good track.Sleep Together is the ambient and \"trippy\" ending. It opens with that electro-ambient synth piece with some nice melody. Although the first 2 minutes or so a little slow, the chorus is a crushingly amazing dynamic, as the verses ever-so-slowly crescendo into the sweeping distorted first beat of it. The synth \"solo\" is a nice orchestral switch for the album. The track is a nice ending and is one of the closest of the 6 to come close to that opener.ALBUM OVERALL: Fear of a Blank Planet is a good album. It's an excellent addition to any prog rock music collection on some conditions: you don't mind long interludes that can be boring, and can wait for few amazing and epic parts that can blow you away. The first track sets you up for what you would expect to be an upbeat, rock-your-head album, but it drops with Anesthetize on the third track, which slows the album to a near halt. The album is great, with many pros, and almost but not quite as many cons."
    },
    {
      "reviewer": "obiter",
      "date": "Posted Tuesday, August 9, 2011",
      "rating": 2,
      "text": "OK more up beat happy clappy Steve. It always baffles me why he wasn't a born again revivalist preacher.Shock horror he's singing about mogadons being depressed and miserable. Pulls it off wihtout depressing us too much in the opening track. But come on Steve you know you can bring us down. My Ashes .. oh yes that's more like it .. i'm misreable before you even start singin. Classic lyrics .. wasted .. wanting ... problems ... notihin expected .. rejected ... I suppose the celebration pary is off then? I wonder if there's any more fun? What's the next track : happy go lucky? the world's your oyster? Nah ... this is porcupine tree ... it's Anesthtize. Nuff said.For those of us retaining the will to live we are treted to : ... wait for it ..SentimentalSeersly, If this wans't the band that gave me Coma Divine, Deadwing Voyage 34, Lightbulb Sun, Stupid Dreams and In Absentia I would ahve flung the Cd into the trash can (nah that's wasteful it could be a beer mat ... or i wonder how it would fare in the midrowae ???As you can gather not for me.."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Friday, October 21, 2011",
      "rating": 4,
      "text": "\"I dream of escape, but a song comes onto my i-Pod...\"This concept album has certainly made an impact in the prog community, hailed as one of Porcupine Tree's finest and for good reason. There is so much on offer on this excellent project. The actual concept of the album was heavily influenced by Bret Easton Ellis' novel \"Lunar Park\", a story told from the perspective of a father, and the difference here is the album tells the story from the perspective of the 11 year old son, Robby. The lyrics are often taken directly from the novel, focussing on the themes of two typical neurobehavioural developmental disorders that affect modern teenagers, namely bipolar disorder and attention deficit disorder. As I work with some kids with these disorders the album definitely touched a few chords with me. A member of my family has suffered in one of these mental illnesses and I know how hard it is to cope with this even from a third party perspective. The lyrics also deal with the youthful aspirations of attempting to escape by turning to drugs, or X box games, I-pods and technology that cause social alienation. The mass media gets a real serve on this album as the cause or part of the cause of this disassociation and I think the album has some potent remarks on the harm that is being done with the mass appeal of technology based infomedia.The album begins with the killer title track that pounds along at a brisk pace and has some absolutely wonderful melodies. The song is unforgettable and is the best on the album. I always liked how the lyrics mention X Box as a symbol of techno addiction.'My Ashes' sounds like 'No Quarter' by Led Zeppelin at some point, perhaps noticeably the keyboard sound encapsulates the psychedelic atmosphere. It is a song filed with pathos and pain but with dark beauty. The lyrics are quite downbeat as is most of the content of the album. There is a melancholy feel throughout, and it really punches a hole into the consciousness as one listens to the album. It seems to get darker and more intense in mood from track to track. 'My Ashes' is a homage to the last chapter of the novel where the ashes of Bret's father are scattered effectively burying the memories of his life.'Anesthetize' is the multi movement suite masterpiece that drew me to the album in the first place. A 17 minute epic with incredible guitar interplay and powerful synth lines. The melody is brilliant and the lengthy instrumental section is prog bliss. A track to be heard over and over.'Sentimental' is a very gentle sad song with sweet melody lines, similar to the chords used in 'Trains'.'Way out of here' is another of the masterpiece songs that deal with some very tough issues. The lyrics are full of mystery and intrigue; \"Out at the train tracks, I dream of escape, But a song comes onto my i-Pod, And I realize it's getting late, I can't take the staring, And the sympathy And I don't like the questions: \"How do you feel? How's it going in school? Do you wanna talk about it...\" These sentiments seem to capture the teenage angst experienced in adolescence when one does not feel understood and loses track of communication with others. Steven Wilson explained partially some of the content of the album in \"Revolver\" music magazine when he stated, that the protagonist of the tale was a \"terminally bored kid, anywhere between 10 and 15 years old, who spends all his daylight hours in his bedroom with the curtains closed, playing on his PlayStation, listening to his i- Pod, texting his friends on his cell phone, looking at hardcore pornography on the Internet, downloading music, films, news, violence.\" This is why the lyrical content mentions these technological mediums, though it does not attack them as much as one may expect, at least not as much as Wilson who has infamously smashed i-Pods and MP3s many times.'Sleep Together' is a popular live track and although I look upon it as one of the weaker tracks here it still works as a good way to close the album, putting the protagonist to rest as he searches for love in an interminably cold faceless world.My final thoughts are that this is an album that gets better over the years like a fine wine. On first listen I was impressed with about 3 tracks but the rest kind of washed over. Later on returning to the album after a long break, I began to appreciate the material as a whole concept which is hauntingly melancholy and bleak, and yet imbued with an uplifting ray of hope entrenched within. It certainly is one of the best albums of 2007, even winning Collaborator's album of the year on this humble site, and it is a thought provoking master work from a brilliant band."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Monday, April 9, 2012",
      "rating": 4,
      "text": "Porcupine Tree's Fear of a Blank Planet is their third album in a row to take the approach of In Absentia - in that whilst there are sufficient metal aspects to it to appeal to the prog metal crowd, there's also plenty of the space rock aspects which have always been an aspect of the band's sound, as well as indie-flavoured crossover moments reminiscent of Stupid Dream or Lightbulb Sun.By this point in time, Steven Wilson had well and truly become prog aristocracy - when people like Alex Lifeson and Robert Fripp are guesting on your albums you know you've become a big deal in the prog world - but far from resting on his laurels, Fear of a Blank Planet is a tighter and more carefully constructed album than Deadwing, and testament to the consistently high quality of Porcupine Tree's studio albums. I'd say it's the recommended next stop after In Absentia."
    },
    {
      "reviewer": "Second Life Syndrome",
      "date": "Posted Thursday, December 19, 2013",
      "rating": 5,
      "text": "This is, without a doubt, my favorite Porcupine Tree album. No, I'm not a huge fan of the band. In fact, I prefer The Pineapple Thief (often compared). However, I think this PT album finally has something that is missing from some of their other releases: soul. Now, mind you, it's a dark soul. It's a disturbed soul. But it's there. Steven Wilson, in my opinion, is a very mechanical, cold composer, but on \"Fear of Blank Planet\" I feel that he finally gave us some emotion.I had never heard this album until someone requested that I spotlight its lyrics for my Facebook page The PROG Mind. I agreed to do so, and ended up immersing myself in this album for some time. This is a concept album about a disturbed teen (possibly inspiration for Pendragon's \"Pure\"?). He's worthless. He's hopeless. And, most of all, he doesn't give a damn. He wallows in self- pity, TV addiction, and drug abuse. He lives for sexual release and his dimly-lit room full of distractions. Yet, PT doesn't leave us there. They explore his screwy upbringing and his exposure to a society full of fakes, artificial standards, and frauds. With all of this, would you have any hope? Would you have the motivation to make something of yourself? What have we done to the kids?But enough of my preaching. This album features the best instrumental passages that PT ever created. From the epic \"Anesthetize\" to the truly interesting title track, this album simply rocks with tight arrangements, spacey elements, and strong songwriting. Other PT albums, such as \"In Absentia\" and \"Deadwing\", were really good, but I feel they were missing a certain something for me to grasp musically. This album, however, packs a punch full of awesome guitar work (both acoustic and electric), masterful drumming, and true atmosphere. It also has soul in its topic, but also in its music, too. These guys were firing on all cylinders when they made this album.So, is this a masterpiece? This is my favorite PT album, but I won't call it a masterpiece. It is excellent in every way, but I feel that the last two tracks drop in quality and personality quite dramatically. That said, this is certainly a worthy album that offers plenty in the way of jaw- dropping moments."
    },
    {
      "reviewer": "TCat",
      "date": "Posted Saturday, February 14, 2015",
      "rating": 5,
      "text": "Wow this album has been reviewed a lot hasn't it? It does my heart good to see Porcupine Tree so popular here in the Archives and to see that a lot of people appreciate their music. Steven Wilson is no doubt a major force in progressive music and he keeps the dream alive for everyone. He has so much influence on many current progressive bands, whether if it's through re-issuing older albums by King Crimson, Jethro Tull, Yes and so on or if it's through production help as with Opeth, Anasthema, or Orphan Lands, or whether it's through inspiration as with I.Q., Archive, Pineapple Thief. Of couse, his most obvious influence is through Porcupine Tree or his own solo works.So, this album is what I consider the 3rd and last in a series of heavier albums by PT, the first being \"In Absentia\", then \"Deadwing\" and now this one. These are the bands best albums in my opinion, I love the hard edge and how it gels so well with the softer passages in the music. These albums are the most inventive and dynamic throughout their discography (even though I love everything from PT).This album is based on a concept of the fear of how electronics are influencing youth to lose individuality and social skills. It is comprised of 6 powerful songs that are loaded with progressive elements including excellent dynamic use, changing meters, non-traditional rock song structures and so on. The music isn't really challenging as you find in avant-prog music, but it doesn't have to be. If you want that, then check out Steven Wilson's work as Bass Communion or I.E.M. It is powerful music that is more advanced than your standard pop or rock music. There is plenty of beauty and harshness on every single track here, and it is also full of heavy, loud passages and in contrast plenty of soft and quiet sections, just like you have come to expect from the two previous albums from PT. 2 songs here are over 5 minutes, 3 are over 7 minutes and 1 is over 17 minutes, but they all seem to fly by quickly because there is so much to listen to here.There are beautiful and tight harmonies on the more mellow tracks \"My Ashes\" and \"Sentimental\", there are the atmospheric guitar soundscapes of Robert Fripp on \"Way Out Here\", and there is plenty of darkness bubbling under all of the songs. On \"Anesthesize\" you get an epic 17+ minute 3 part song that features a bit of everything for everyone. There is something there that would make anyone happy and it all sounds cohesive which is quite a feat considering the many moods that it travels through on it's length. It is never boring and you are always on edge to hear where the song goes next. Alex Lifeson from Rush does a guest guitar solo in the first part of this track. This came about because Alex mentioned in an interview how he was a huge fan of PT, so SW called him and asked if he would like to play on this album. Of course, he jumped on the chance and SW re-wrote the song in order to include his solo.There is no reason to write a longer review about this album because so much has been said about it already in the many reviews already written here. But since I am an avid fan of the band and of SW, I have to put in my own 2 cents worth and hopefully the few things I have said about this masterpiece of an album will entice someone else to listen to PT's music and enjoy it as much as I have. It is bands like PT that give me hope in music, that there are so many great bands still out there making the best music ever. PT inspired me to explore so much more, and though the music takes some work to find it, there are still countless bands out there that are as good as and sometimes even better than there ever has been. All I can do is hope my words and reviews of great albums like this will inspire others to search as I have and know that progressive rock is still alive and well! Oh, and this album gets masterpiece status.....5 stars."
    },
    {
      "reviewer": "Necrotica",
      "date": "Posted Tuesday, July 28, 2015",
      "rating": 5,
      "text": "Right from the beginning of its title track, it's clear that Steven Wilson was intending to return to a less straightforward sound for Fear of a Blank Planet. Fresh off the heels of the highly praised Deadwing, Porcupine Tree decided to tread back to a more immersive and atmospheric sound rather than the pop-oriented touches of their recent records. It definitely shows; the album is just dripping with despondent and cautionary imagery of alienation and hopelessness, all keeping with its theme of the issues affecting today's disaffected youth. The music that accompanies this bleak picture is just as bipolar and alienated as our main character, changing moods and styles while retaining its somber tone throughout.While the ballads on Fear of a Blank Planet still contain some of Porcupine Tree's previous alternative rock elements, it's the longer compositions that shake things up in a big way. The riffs are heavier than ever, the different sections flow together almost seamlessly, and the progressive edge is more strongly defined here than it was on Deadwing or In Absentia. Of course, most of the attention goes to the centerpiece \"Anesthetize,\" considering it's been years since any Porcupine Tree song has gotten close to this long. But beyond that, just look at all the song lengths; everything is more epic in length and the arrangements have become more elaborate as a result. However, \"Anesthetize\" truly is the highlight. It constantly weaves back and forth between moods and dynamics without ever sounding obnoxious or too obvious, and the ballad portion at the end is one of the most serene conclusions to any rock epic out there. There's even a guest solo courtesy of Rush's Alex Lifeson! But if any song comes close to this one, it's the brilliant title track. Comprised of a tense acoustic segment, too many good metal riffs to count, as well as a soft thought-provoking conclusion, it really sets the bar high for the rest of the album.Many Porcupine Tree detractors have taken issue with Steven Wilson's vocals, usually with the complaint that they sound too unemotional or detached. If that's the case, then he seems right at home with the concept of this record. Lyrics like \"Don't try engaging me; the vaguest of shrugs, the prescription drugs; you'll never find the person inside\" on the title track sound so (ironically) powerful when sung through such a brick wall of monotone, as they fit the shoes of the bored protagonist perfectly. The same thing happens with the warped synth-heavy closer \"Sleep Together,\" as it depicts sex with one giant shrug, as well as \"Way Out of Here\" with its depictions of isolation coming into the mix. Also interesting is the way that Wilson's disinterested vocals clash with the heavier riffing on the album, almost emanating a grunge-like vibe. However, when he does get emotional, it shines at just the right moments. \"My Ashes\" and \"Sentimental\" are both very touching pieces that show a more... well... sentimental approach to the main character's life. Richard Barbieri's keyboard work especially shines in these two pieces, his runs and chords creating both a bleak vibe and some glimmers of hope.Fear of a Blank Planet is a bit of a weird record in Porcupine Tree's catalogue, as it seems to go the Signify route of capturing every era of the band while remaining its own entity. Regardless, its combination of great musical variety and wonderfully-conveyed concept are what allow it to overshadow so many modern-day progressive metal peers. The simplistic lyrics and low-key delivery of said lyrics can get grating at times, but it's a minor issue in an otherwise amazing experience. It's pretty unfortunate that Porcupine Tree went on their hiatus after The Incident, as it would be great to hear them top this one day with something even stronger. As for now, we still have this near-masterpiece to cherish.(Originally published on Sputnikmusic)"
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Thursday, June 29, 2017",
      "rating": 5,
      "text": "Review N� 126\"Fear Of A Blank Planet\" is the ninth studio album of Porcupine Tree and was released in 2007. Steven Wilson has mentioned that the album's title is a direct reference to Public Enemy's album of 1990, with the same name. Public Enemy is an American hip hop group and they're better known for their politically charged lyrics and criticism of the American media, with an active interest in the frustrations and concerns of the African American community. However, while Public Enemy's album was about race issues, Porcupine Tree's album was about coming to terms with the 21st century technology, the technology which is generally used massively by all Western world civilization.The concept of the album was heavily influenced by Bret Easton Ellis' novel \"Lunar Park\". The novel is told from the perspective of a father, who bears the name of the novel's author himself, whereas the album is mostly from his son's perspective. Many of the lyrics of the album are lifted directly from the novel. The lyrics deal with two typical neurobehavioral development disorders affecting teenagers in the 21st century, such as, bipolar disorder and attention deficit disorder, and also with other common behaviour tendencies of youth like escapism by drugs, social alienation caused by technology and a feeling of vacuity, a product of information overload by the mass media.The line up on the album is Steven Wilson (vocals, guitars, piano and keyboards), Richard Barbieri (keyboards and synthesizers), Colin Edwin (bass guitars) and Gavin Harrison (drums). It has also the participation of Alex Liefson (guitar), Robert Fripp (keyboards and synthesizers), John Wesley (backing vocals) and the London Session Orchestra.\"Fear Of A Blank Planet\" has six tracks. All songs were written and composed by Steven Wilson, except \"My Ashes\" with music by Wilson and Barbieri and \"Way Out Of Here\" with music by all four band members. The first track is the title track \"Fear Of A Blank Planet\". The clacking of a computer keyboard leads the album's opener into a haze of an aggressive song writing and slightly discordant ambience that immediately characterizes Steve's concept. The lyrics clearly condemn the mesmerizing effect of video and the computers on a child. Musically, we find heavy guitars, processed voice, great keyboard working and catchy choruses. The second track \"My Ashes\" is the opposite of the first track. It's a fairly retro ballad, driven by a quiet and unassuming synthesizer riff. It does get a tiny bit epic towards the end, but it's a lower key counterpoint to the opener which immediately demonstrates to the listener the real breath of the sounds that Porcupine Tree is capable of achieving and, more immediately, how cohesive they can make them seem. The third track \"Anesthetize\" is the epic song of the album. Unlike other Porcupine Tree's epics this isn't really one piece of music with a start, an instrumental middle piece and the return to the original melody. Instead of that, this new epic has three songs joined together. All three combine perfectly. This is indeed one of the best pieces of music that the band has ever recorded. The fourth track \"Sentimental\" is a very beautiful ballad with piano and drums accompanied by acoustic guitar, voice and a grand piano. The song is a typical emotional Porcupine Tree's ballad that even contains a very beautiful Spanish guitar solo. This is the kind of songs that wouldn't have been out of place on \"Stupid Dream\" or \"Lightbuld Sun\". The fifth track \"Way Out Of Here\" is a very good track that explores many different musical ideas with seven and a half minutes. It's the only full band's composition on the album and it also features a musical section with some of the loudest metal riffs on the album. This is a very tasteful song with a very mysterious musical ambience enhanced by some characteristics Fripp's soundscapes. The sixth track \"Sleep Together\" is a strange song that starts with subdued vocals, very electronic and many synthesizer effects. After some time, the drum beat comes in and the song eventually builds to a climax with a massive use of orchestral strings. This is a very interesting and inventive way to end this magnificent album and that leaves the listener eager for much, much more.Conclusion: In many ways \"Fear Of A Blank Planet\" is one of the best Porcupine Tree's albums and is also my favourite studio album from the band. Lyrically, it's a lot more understandable and I like very much the concept used for the lyrics. Musically, the album seems like the accumulation of everything the group has done before, thereby creating a total that's greater than the sum of the individual parts, I think. I sincerely think that it's rather difficult to find any fault and any lack of cohesion on this album. It's very strong in all aspects and doesn't have a dull moment on it. Of course it has its quiet moments but none of them are dull. Steven Wilson demonstrates once again why he is considered one of the best sound engineers at the moment and one of the best producers too. So, I really can't find any reason not to give 5 stars to this album and considered it a masterpiece. It should be in every progressive rock lover's musical collection, because it shows Porcupine Tree at their best. It's due to albums like this one, that progressive rock is still alive today.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "patrickq",
      "date": "Posted Wednesday, September 4, 2019",
      "rating": 3,
      "text": "Fear of a Blank Planetis an ambitious, cohesive album. The music is expertly performed and wonderfully arranged. And the sound is every bit as good as you'd expect from the foremost mixing-desk wizard, Porcupine Tree bandleader Steven Wilson. Overall, it's a good record. What keeps it from being great, in my opinion, is the composition, both the music and in particular, the lyrics.It may seem petty to complain about the lyrics of a prog-rock record. After all, some of the most celebrated progressive artists have some of the least impressive lyrics. Besides, the cleverer the poetry, the more likely it is to get lost in the bombast, right? Anyway, I'm certainly not the only one to have excused poor lyrics on an otherwise good album. But Porcupine Tree's ninth LP is different for an important reason.Fear of a Blank Planetis a concept album whose ideas are explicated via the texts sung (and written) by Wilson. And it's no loose concept; said Wilson in asongfacts.cominterview, \"Fear of a Blank Planetwas an album about how technology affects the world we live in, particularly how it affects the younger generation, how it's created a lot more dysfunction, [a] lack of communication.\" Wilson - - who cites Andy Partridge and Joni Mitchell among the songwriters he respects the most - - considers lyrics vital to his music. In the same interview, he said, \"as you can probably tell from my music, I love the idea of using songwriting as a means to tell stories.\" So to me, the lyrics are fair game as I evaluateFear of a Blank Planet.On his home page, Wilson says that the album's protagonist is�\"this kind of terminally bored kid, anywhere between 10 and 15 years old, who spends all his daylight hours in his bedroom with the curtains closed.\" Onmusicplayers.comhe says the kid \"can barely form a sentence\" and \"treats his parents with complete disdain.\" From the opening track, we learn that this prepubescent boy's parents medicate him as a means of dealing with his problems; on \"Anesthetize\" he muses, \"I'm not really sure if the pills I've been taking are helping\" - - which seems a bit self-aware for a self-described \"stoned\" \"zombie,\" much less for a 10- to 15-year-old. His fourth-wall-breaking claim that \"X-Box is a god to me\" similarly sounds unreasonably precipient. Then there's \"Sleep Together,\" where he describes an existential choice, \"do or drown / do or drown in torpor,\" before resolving to \"burn my Prada trainers.\" Would this protagonist use the term \"torpor?\" Don't get me wrong; \"torpor\" is a great word here, but it sounds more like the diction of a prog-rock songwriter a few months short of his fortieth birthday.So instead of a necessicarily confused, first-person narration, we have a bit of a screed (perhaps not unlike this review). In effect, the 10- to 15-year-old is a puppet mouthing the words Wilson thinks the kid would say. Ironically, the protagonist would despise Wilson for it, or maybe laugh at his attempt to understand. \"I'm saying nothing,\" he might tell his creator, as he says on \"Anesthetize.\" \"Shut up, be happy / Stop whining please!\" Wilson made his perspective clear in a series of interviews leading up to the album's release. He toldRevolvermagazine that \"parents these days seem to deal with their kids' problems not by sitting down and talking to them but by sending them to the doctor and getting them prescription drugs.\" And to MTV's Chris Harris shortly before the album's release, he said that \"it's almost like everything has become so easily accessible that none of it means anything anymore. These kids will grow up without any sense of curiosity or motivation, and they'll grow up without a soul, or a real sense of who they are.\"To be fair,Fear of a Blank Planethas plenty going for it. Some of the lyrics are, in my opinion, actually pretty good, as far as progressive rock goes; they're just ridiculous in context. Since the entirety ofFear of a Blank Planetinvites comparison to Rush (and would even without the Alex Lifeson guest turn on \"Anesthetize\"), I'll remark that Wilson is every bit as poetic as Rush lyricist Neal Peart. And onFear of a Blank Planet, his singing is every bit as good as that of Rush vocalist Geddy Lee. None of my focus on Wilson is intended to detract from the other members of the group; drummer Gavin Harrison in particular is excellent throughout. The orchestral arranging, by Dave Stewart (of U.K., Bruford, and many other groups) and Wilson, is also remarkable.In short,Fear of a Blank Planetis a solid album which is a bit lacking in the composition department."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Sunday, June 26, 2022",
      "rating": 5,
      "text": "Following in the wake of the breakthrough album \"In Absentia\" and the following \"Deadwing,\" PORCUPINE TREE was riding high as the 21st century's newest top dog prog rock band having honed their unique blend of psychedelic space rock with progressive alternative rock and metal. The band took full advantage of their new found success and engaged in massive touring as well as continuing to crank out new material with incremental leaps of sophistication. The next in line was the 2007 release FEAR OF A BLANK PLANET which parodied the well known Public Enemy album title \"Fear of a Black Planet\" only instead of gangstsa woes of racial problems in the USA, this concept album tackled the desensitizing nature of having our senses bombarded with stimuli in the 21st century. The album was a huge hit and critically acclaimed across the world.PORCUPINE TREE pretty much upped its game on this release with a greater emphasis on the progressive rock aspects of their sound but the heavier metal parts were also nurtured in a similar fashion with drummer Gavin Harrison in particular displaying a much more technically infused sophistication than on his previous two albums with the band. Pretty much everything PORCUPINE TREE had achieved on \"Deadwing\" was ratcheted up a few more notches all the while without sacrificing the inner core of what the band was all about, namely instantly catchy and poignant melodies that transmogrify into myriad motifs and moods and highly complex composiitons. The album also added a string and orchestral backdrop as well as King Crimson's Robert Fripp and Rush's Alex Lifeson delivering some cameo appearances.With only six tracks that are just shy of 51 minutes, FEAR OF A BLANK PLANET excels on variations of a themes. Strong melodic songwriting is teased out into sprawling psychedelic excursions with periodic metallic heft and electronic fueled modernity. In a way Steven Wilson delivers what i call mope prog as his middle range voice perfectly narrates the moody dark subject matter and keeps the musical procession fairly even keel and rather hypnotic with the beefy Tool-esque bass grooves and Radiohead styled detachment. The title track begins the album with an energetic guitar arpeggio but quickly showcases the layering effect of various guitar parts along with the bass and drumming variations. While it begins like a PORCUPINE TREE business as usual proposition, the track unleashes the fully power of Wilson's fascination with metal music as well as the cool ethereal synthesizer sounds that also make the psychedelic space rock aspects stand out.\"My Ashes,\" one of the few tracks not exclusively written by Wilson showcases Richard Barbeiri's brilliant songwriting with a more melancholic tune that allows the piano and symphonic rock backing to provide some chill time before the monstrously long \"Anesthetize\" plays on for almost 18 minutes, making it the longest track since Wilson's early psychedelic years on \"The Sky Moves Sideways.\" This track perfectly displays Harrison's percussive overdrive with super tight drum rolls that churn out an incessant tribal rhythm while the echoed guitars and subtle sounds slowly ooze and erupt in and out of the musical procession. The track showcases an exquisite guitar presence of Robert Fripp and navigates many mood swings while it more or less nurtures a single bass groove that maintains a consistent hypnotic spell throughout the track's run with only the moments of pure metal madness breaking the nonchalant flow.\"Sentimental\" slows things down with the by then famous piano style of Richard Barbeiri that sort of takes the rhythmic swing of a polka song and adapts it to the keyboards. Accompanied by Wilson's downer vocal style, the lyrics narrate the psychologically drama of today's youth but the track shifts to a complementary musical motif that is somewhat contrary to the opening piano parts which is a trademark PORCUPINE TREE style of modulation shifts that this album has perfectly mastered as the band performs these musical gymnastics without missing a beat.The album really doesn't lose any traction as \"Way Out Of Here\" takes another turn to a completely different style of playing without derailing the overall mood of the album's conceptual theme. While most albums drag down towards the end, FEAR OF A BLANK PLANET just remains engaging until the very end as the closing \"Sleep Together\" delivers an ominous electronic sounding gurgle as the song slowly ratchets up into a heavy symphonic rocker while maintaining the psychedelic electronica throughout its entirety with a satisfying climax of psychedelic codeine rock splendor. Yeah this album is sort of a downer but in a good way. The music sort of navigates your mood level through the bleak subject matter and walks that usual PORCUPINE TREE tightrope between monotonous psychedelic hypnotism and active progressive rock technical workouts.FEAR OF A BLANK PLANET displayed a remarkable maturity over the slightly inferior \"In Absentia\" and found the band at the top of its game. It seemed though that this was the end of the road for this third phase of the band's existence and the band was unable to match the magnitude of this album's perfection on the following \"The Incident.\" This album found PORCUPINE TREE at its most calculated cleverness where the complexities were subdued in the subtleties of every cadence crafted or prosody presented. The mope rock scene had gone full fledged prog beyond anything Radiohead achieved on \"OK Computer\" or Grandaddy's indie rock classic \"The Sophtware Slump.\" PORCUPINE TREE had slowly but surely made it to the top of the world of modern progressive rock and in its wake left three exquisite masterpieces in the first decade of the 21st century. While i prefer \"Deadwing\" to this one, i have to admit that this one is not far behind. Yet another triumphant achievement from Steven Wilson and friends. Although it took a few years for this to sink in completely, in the end i have succumbed to the magnanimous monstrosity that is FEAR OF A BLANK PLANET and it has easily become one of my favorite modern prog albums of all time."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Monday, November 20, 2023",
      "rating": 5,
      "text": "Porcupine Tree's maturity reaches one of its high points with \"Fear of a Blank Planet\", their ninth album. Guided by Steven Wilson, the band's blend to produce a work that has moments of instrumental brilliance and also a vehicle to express themselves regarding youth issues in times when nothing is beyond the reach of a click, is remarkable.Inspired by Brett Easton Ellis' novel, \"You Do an Awfully Good Impression of Yourself\", the album unfolds narratively from the point of view of the hopeless teenager \"Robby\" in Wilson's voice, with a depressive and intimate vision of his life and the refuge in external agents to cope with it. From the opening \"Fear of a Blank Planet\", a dark and powerful melody that starkly describes the character's perception of reality, Wilson's distorted guitars find in Colin Edwin Edwin's bass the ideal partner to accompany him, and has in the desolation of the melancholic and orchestrated \"My Ashes\" a pause sustained in good measure by Richard Barbieri's keyboards and a distant nod to the watery sound of Led Zeppelin's \"No Quarter\", exposing once again the teenager's disenchantment with his life and family environment.And it's with the superb \"Anesthetize\", a suite divided into three segments, that Porcupine Tree shows one of the highest points of brilliance, from Gavin Harrison's incisive percussion, the full band builds step by step a dramatic and forceful scenography, with Wilson's crushing guitar riffs and Barbieri's angsty and lysergic keyboards, until its final section, sheltering in its theme once again the wandering and lost \"Robby\". Alex Lifeson chipped in with a fine guitar solo and John Wesley backed Wilson on the choruses.The mood, from there on in, maintains that reflective, aching feel, with the minimalist piano of the clinging \"Sentimental\" and the heartbreaking, escapist \"Way Out of Here\". The dark, electronic psychedelia of \"Sleep Together\" brings the album to a close, as well as the tribulations of the teenager, cornered into making a potentially fatal decision about his future.\"Fear of a Blank Planet\" is not only one of Porcupine Tree's best albums, but also one of the best of the entire genre in the 2000s.Excellent.4.5 stars"
    },
    {
      "reviewer": "A Crimson Mellotron",
      "date": "Posted Wednesday, October 23, 2024",
      "rating": 5,
      "text": "'Fear of a Blank Planet' is undoubtedly Porcupine Tree's dark masterpiece, a cult album that has garnered polarizing opinions, but one that can certainly be considered the perfect album, a majestic blend of all the strongest characteristics of the band's music. And while at the same time this might not be their most innovatively sounding release, it is a massively influential album that captures the band at the height of their creative power, in a way presenting a fascinating amalgamation of Wilson & Co.'s heavier inclinations together with the strong influence of classic acts like King Crimson and Pink Floyd, and contemporary metal acts like Tool or even Opeth. The magic of this album lies in the subtle indoctrination of muscular riffs into the layers of exquisitely well-produced sonic collages, all shrouded in a tranquilizing yet hauntingly nostalgic atmosphere.Bouncing between moments of throbbing aggression and tantalizing melancholy, the entire album becomes a mood-shifting entity that bolsters sufficiently complex compositions which are also equally memorable and provocative, yet conceptually relevant even to this day. All of this makes the album era-defining, even if some of the previous releases may be seen as creatively higher points. But 'Fear of a Blank Planet' is a finely and intelligently composed and constructed work of art, whether it be for the manic title track, the heart-wrenching 'Way Out of Here', or for the drab excursions on 'My Ashes'. The 17-minute powerhouse 'Anesthetize' is an all-time classic by the band, much like the gloomy 'Sentimental' and 'Sleep Together', as it turns out that each song on this incredibly tight album is a classic, whose sound and presentation have in a way been perfected, so as to accommodate the entire musical journey that this album is, and even quite provocatively, working perfectly as an anxiously pessimistic rock opera."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album8253.html",
  "last_parsed": "2025-05-18T00:23:40.066267"
}