{
  "album_title": "THE LAMB LIES DOWN ON BROADWAY",
  "artist_name": "Genesis",
  "artist_page_link_local": "artist681a.html?id=1",
  "year": 1974,
  "rating_value": 4.31,
  "rating_count": null,
  "review_count": null,
  "genre": "Symphonic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/1/cover_125662112008.JPG",
  "tracks": [
    {
      "number": 1,
      "title": "The Lamb Lies Down on Broadway",
      "duration": "4:50",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Fly on a Windshield",
      "duration": "4:23",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Broadway Melody of 1974",
      "duration": "0:33",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Cuckoo Cocoon",
      "duration": "2:11",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "In the Cage",
      "duration": "8:15",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "The Grand Parade of Lifeless Packaging",
      "duration": "2:45",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Back in N.Y.C.",
      "duration": "5:42",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Hairless Heart",
      "duration": "2:13",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Counting Out Time",
      "duration": "3:42",
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "The Carpet Crawlers",
      "duration": "5:15",
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "The Chamber of 32 Doors",
      "duration": "5:40",
      "is_sub_track": false
    },
    {
      "number": 1,
      "title": "Lillywhite Lilith",
      "duration": "2:42",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "The Waiting Room",
      "duration": "5:24",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Anyway",
      "duration": "3:07",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "The Supernatural Anaesthetist",
      "duration": "2:59",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "The Lamia",
      "duration": "6:57",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Silent Sorrow in Empty Boats",
      "duration": "3:07",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "The Colony of Slippermen",
      "duration": "8:13",
      "is_sub_track": false
    },
    {
      "number": "i",
      "title": "The Arrival",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "ii",
      "title": "A Visit to the Doktor",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "iii",
      "title": "Raven",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 8,
      "title": "Ravine",
      "duration": "2:04",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "The Light Dies Down on Broadway",
      "duration": "3:32",
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "Riding the Scree",
      "duration": "3:57",
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "In the Rapids",
      "duration": "2:26",
      "is_sub_track": false
    },
    {
      "number": 12,
      "title": "it",
      "duration": "4:15",
      "is_sub_track": false
    }
  ],
  "lineup": [
    {
      "musician": "Peter Gabriel",
      "instruments": "lead vocals, flute"
    },
    {
      "musician": "Steve Hackett",
      "instruments": "electric & acoustic guitars"
    },
    {
      "musician": "Tony Banks",
      "instruments": "keyboards"
    },
    {
      "musician": "Mike Rutherford",
      "instruments": "bass, 12-string guitar"
    },
    {
      "musician": "Phil Collins",
      "instruments": "drums, percussion, vibes, backing vocals"
    },
    {
      "musician": "Brian Eno",
      "instruments": "sound effects"
    },
    {
      "musician": "Graham Bell",
      "instruments": "backing vocals"
    }
  ],
  "reviews": [
    {
      "reviewer": "Peter",
      "date": "Posted Friday, January 30, 2004",
      "rating": 5,
      "text": "Let me start by saying that this album is definitely a \"desert island selection\" -- if I were limited to ten (progressive) discs, THE LAMB LIES DOWN ON BROADWAY would have to be one to load into the dugout canoe. (I might even jettison Wilson to make room!)I originally bought this album in the year of its release, in New York City(so many yellow cabs to be seen from atop the Empire State Building!), as a teen on holiday with my family. When I got home to my stereo and could finally listen to it (no CDs or Walkmans in those days kids, just the old 33 & 1/3 coal-fired, wind-up \"hi-fi\" stereo, purchased with the earnings from my first summer job), I was delighted to find that it was (initially) set in: NYC! Thus, this recording will always have a special resonance for your humble reviewer....Anyway, navel gazing aside, THE LAMB is an acknowledged prog masterwork. Largely a Peter Gabriel concept, it was also his swansong with Genesis -- and what a high note to culminate that stage of his career on! This one has an edge and \"street\" sensibility that was lacking in previous releases, and that would never so forcefully appear again in the band's history. Just listen to the (opening) title track -- it helps if you pretend it's '75, you're still virginally innocent, and this type of music is evolving before your grateful ears -- and tell me if that's not superlative, ground-breaking prog! Other faves include the infectious \"In the Cage,\" the ultra-powerful \"Back in NYC,\" and the beautiful (if lyrically somewhat bizarre -- but then, so is the entire album) \"The Carpet Crawlers,\" which has to be one of the all-time classic progressive rock songs. Listen to this album in its entirety, though, because it's all great, the songs run together, and waiting for \"The Colony of the Slippermen\" (near the close) is well worth it!I listened to this album this morning, and then again (louder, on my bigger stereo) tonight. Damn, but this is very, very good prog! Gabriel's vocals are so passionate -- he positively screams some lines! What I wouldn't give to jump in a time machine and see the original tour.... Oh well, CRANK IT!"
    },
    {
      "reviewer": "Marc Baum",
      "date": "Posted Sunday, February 8, 2004",
      "rating": 5,
      "text": "Well, I liked albums like \"Trespass\", \"Nursery Cryme\", \"Foxtrot\" or \"Selling England By The Pound\" a little bit more, because they were all in all harder and more complex, but \"The Lamb Lies Down On Broadway\" was the final masterpiece with mastermind & singer Peter Gabriel and the rest of the superb line-up. I think they reached with this unbelievable work their highest creative level and created one of the best and most important double-albums and concepts of all time! The hit \"Carpet Crawlers\" shows the forthcoming way of the band, how they will go on later with drummer Phil Collins as singer on more commercial pop/rock album like \"And Then There Were Three\", \"Duke\", \"Abacab\", \"Genesis\", \"Invisible Touch\" and \"We Can't Dance\". After \"Lamb Lies Down...\" they brang the prog rock-world with \"A Trick Of The Tail\" and \"Wind And Wuthering\" the two latest prog albums of the band history. But many old fans of the (together with Yes) best and most important artrock band of all time would found with the band Marillion a new fave in the 80's, and the mainstream-audience were the new fans of Genesis in the 80's and 90's on their commercial trip, but they would never been as brilliant as they were together with Peter Gabriel as singer on unreached milestones in prog-history like \"Nursery Cryme\", \"Foxtrot\", \"Selling England By The Pound\" or \"The Lamb Lies Down On Broadway\"!"
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Monday, March 1, 2004",
      "rating": 4,
      "text": "Although a giant of a cocept album, this would've gained being just one disc as there are some pretty vacant tracks especially on the second disc. For me the real Lamb LDOB starts with the astounding Windshield On The Freeway and is a no-fault until the end of disc one Chamber Of The 32 Doors. For those who saw the shows at the time (or The Musical Box shows recently), they will know that the tracks preceding and following The Lamia were filler for the Gabe to dress up into and out of that weird and pustulous costume.For me the Silent Sorrows, Supernatural Anaesthesit and and Waiting Rooms could've been added in concert but not in the studio record for I get fed up of these ambiance as they are way toooooooooo long . Lamia and Sipperman are great but the last four tracks bother to the point that I generally avoid playing side 4 altogether. Maybe I will just one day play that side 4 alone to see if it will go down easier on its own . Had this been a one disc affair it would've been another 5 stars."
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Friday, March 5, 2004",
      "rating": 3,
      "text": "The band lies down for Peter\"The lamb..\" is seen by many as the best Genesis album, but for me, it was and is rather disappointing. Up until this point, the band had matured together, their music gaining a growing confidence and maturity This cumulated in \"Selling England by the pound\" where both Tony Banks and Steve Hackett contributed outstanding performances on keyboards and guitar respectively.Peter Gabriel was however becoming restless, possibly in part as a result of the lengthy instrumental passages being incorporated into some of the band's tracks. It appears the band therefore decided to pander to his frustrations, and allowed him to dictate the direction of their next album. Gabriel wrote the story for this concept album, together with all the lyrics. The band maintain to this day that musically it was a collective effort, but it seems clear that they were nonetheless, under Gabriel'sleadership.\"The lamb lies down on Broadway\" was certainly an ambitious album. Originally released as a double LP, it was thus priced higher than its peers, a brave move at a time when album prices were pretty much fixed. With Gabriel having by far the biggest influence on the album, it is heavy on vocals, and light on the instrumental side. Tony Banks' keyboard work is largely suppressed, with only \"The cage\" really letting him off the leash.There are many good tracks on the album, but they are shorter songs, with little space for the band members, other than Gabriel, to exploit. The story on which the album is based is lightweight too, \"Get 'em out by Friday\" on Foxtrot says more in 7 minutes than this album says in 80.Perhaps it would have been more appropriate for this to be a Peter Gabriel solo album, with Genesis developing further the collective energy they had found on previous albums. I acknowledge I am being perhaps overcritical of this album. There is much to enjoy on it, with strong melodies, and first class performance by Gabriel. My comments really reflect my frustration that it could have been so much better, had the whole band contributed equally."
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Saturday, March 13, 2004",
      "rating": 5,
      "text": "This represents the 6th release from GENESIS and a major milestone in the field of Progressive Rock. This concept heavy prog classic delves into the dark world of metropolitan life to which GENESIS help transform the listener into. This album works well on several different levels and is quite detailed upon examination. Song writing is exceptionally high here and seems to take on the greatest significance on the entire package. Songs are well pieced together and seem to build on each other as Rael's experiences in the modern world is uncovered. \"The Lamb...\" is a dark recording in many ways and runs very much as a movie soundtrack. In fact at one point in time Peter GABRIEL had debated creating a movie to go along with the music. This was a very ambitious recording at the time and was really the highest point in my opinion for GENESIS."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Thursday, April 1, 2004",
      "rating": 5,
      "text": "Well honestly the right score should be 4 stars, as it is a bit prolix, but is absolutely essential thanks to a lot of reasons, as the first concept and theatrical work, regarding the dark \"alter ego\" character of Peter GABRIEL, Mr Rael, the main character of this theatrical piece and also as the most influential work ever!!In fact this album is very important, a great reference for the authors-unfortunately a few ones - of concepts nowadays (listen for example to the recent album by SPOCK'S BEARD \"Snow\", totally inspired by this one), even though we should appreciate a shorter version of the original \"The Lamb Lies Down on Broadway\" still today. Highly Recommended!!"
    },
    {
      "reviewer": "greenback",
      "date": "Posted Friday, April 9, 2004",
      "rating": 4,
      "text": "I listened recently this album after about 15 years. I remembered it as being not the best one. It's a decent album, but many things I do not like; here's why: Enossification: the influence and contribution of the keyboardist-composer Brian ENO on this record. Look, after the best all-time record \"Selling England By The Pound\" and before the outstanding, the unique, the marvelous, the unbelievable \"A Trick Of The Tail\", GENESIS produced an album entitled TLLDOB; well, it is expected to be rated 5 stars and belong to my top 20 all time records. NO!! Even not 4.5 stars for that!! Because of what? Because a keyboardist named Brian ENO f**ked up all the things for maybe one of the best GENESIS albums!! On this album, almost everything sounds easy prog pop or randomly experimental. We are very far from \"Foxtrot\" or \"Selling England...\". Sometimes I find some bits BEATLE-esque! There was an important loss of essence here, some kind of prog dilution. BANKS is not in his element. We notice he is not familiar with those experimental keyboard sounds. I dont know... it sounds a bit amateur! The moog is played with a slight randomness, abandonning a bit all the structure that was the strength of the group in the past. On \"The Battle Of Epping Forest\", the moog was well supported by the bass, the drums and guitars, but here, it seems all alone. We can see it in waiting room (what a bad song!!), \"The Colony Of Slipper Man\", \"The Light Lies Down On Broadway\". Fortunately, the moog is well accompanied on \"In The Cage\".\"The Grand Parade Of Lifeless Packaging\"!!?? What the hell is that garbage!! On \"Counting In Time\", what is that modified mood at the end? Totally unwanted!! Plus, the song is really in the \"I know what I like style\", but much worse. \"The Chamber Of 32 Doors\" has really a beatle-esque bits! Sounds so pop and so unsignificant in some bits! Good, but I expect more. \"Fly On A Windshield? Well, it has a bad dissonance. It's a dull song. \"Broadway Melody Of 1974\"? Well, it is so dull, but fortunately, I is not very long! \"In The Rapids\"? How can they do such ordinary song??!!??Well, TLLDOB is very unequal! And more: there are no songs on it that I consider outstanding as it is the case for other albums: one for the vine, \"Supper's Ready\", \"Get Em Out By Friday\", \"Ripples\", \"Mad Man Moon\", \"Los Endos\", \"Entangled\", \"Cinema Show\", \"Moonlit Knight\", \"Epping Forest\", \"Fountain of Salmacis\" and so on... Fortunately, there are very good bits and songs, like anyway, \"The Lamia\", \"Silent Sorrow in Empty Boats\", \"Hairless Heart\", \"Cuckoo\", \"In the Cage\", \"Carpet Crawler\", \"Ravine\" (but how bizarre!)I wonder, if \"Lamb...\" was a single album, how fans would have reacted? good question!! Maybe I would have dropped it to 3.5 stars!! There is another popular prog band who made, that time, a flop album during their top career: YES with their \"Topographic Oceans\": quite worse!! To be honest, I think I like \"And Then There Were Three\" more than \"The Lamb...\"!!"
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Monday, April 26, 2004",
      "rating": 5,
      "text": "GENESIS history is full of contradictions and \"The Lamb Lies Down on Broadway\" is one of them. Following the development of their music, after the absolutely dark and imaginative \"Foxtrot\" came the softer and friendlier \"Selling England...\" so the logical evolution would have been an even softer album closer to HACKETT/COLLINS era than to any previous release. But Mr. GABRIEL had a surprise, an aggressive conceptual (With clear references to \"The Trial\" by Franz Kafka) album designed by and for him, that became an icon of progressive rock.The songs are shorter but very complex and the concept is hard to understand (Still some fans are discussing what's the central point of Rael's story). It's hard to mention best songs because the whole album is important for the logical sequence of the story and can't be separated into parts without having the risk of loosing the main point of the album.Even when the nature of conceptual albums lead us to listen the album as a whole entity rather than to listen separate songs being that a conceptual album is like a book and the tracks are like chapters), there are songs that really impressed me, so if you ask me, the claustrophobic \"In the Cage\" and the tittle song are highlights of this masterpiece that costed me so much time to understand and love."
    },
    {
      "reviewer": "richardh",
      "date": "Posted Thursday, June 10, 2004",
      "rating": 4,
      "text": "Double concept albums are notoriously difficult to pull off but Genesis have as good a go as anyone on this.the concept is about ...um ...well.... difficult to explain.I think it is a surreal trip through the mind of an individual called Rael.Is it really happening at all? Is it a parallell universe? Will England beat France at the weekend? Who knows?! MAybe if Sol Campbell can shackle Henry and Owen has his shooting boots on, then maybe.And so what has this to do with the music.Well not a lot really. Suffice to say that this is a 'game of two halves Brian'.I was over the moon when I heard 'Carpet Crawlers' and 'Back In NYC' but sick as a parrott when Collinsy nutmegged Banksy on the 'Waiting Room' before missing an open goal before being Hacked down.Blatant penalty ref!Gabes sticks it over the bar though and with penalties and extra time looming .. 4 stars is about right."
    },
    {
      "reviewer": "Chris S",
      "date": "Posted Tuesday, July 6, 2004",
      "rating": 5,
      "text": "90 minutes of pure Genius. Although the band put contribution five ways I firmly believe that Gabriel was the main influence on The Lamb. Musically OK it has all of them giving input but between the sheets Gabriel conducts a masterpiece seldom reached by many other bands. This is psychedelic progressive music at it' s best and I'll debate that till the cows come home. Side 3 for me probably the strongest but you would have to be nuts to dismiss any songs as they all play such an important part in the overall picture.' Fly on a Windshield', ' Chamber of 32 Doors', ' Silent Sorrow in Empty Boats',' The Carpet Crawl' and the epic ' The Lamia', need I go on? I would put WYWH from Pink Floyd on a musical par with this."
    },
    {
      "reviewer": "Blacksword",
      "date": "Posted Thursday, August 19, 2004",
      "rating": 5,
      "text": "'The Lamb lies down on Broadway' was a creative triumph for Gabriels Genesis. Although not selling as well as 'Selling England by the pound' only achieving a chart position of 10, this ambitous album is now widely regarded as a classic. It should come as no surprise that Peter Gabriels writing talents were noticed by Exorcist director William Friedkin.The Lamb was an ambitious project, a four sided concept album in which a young Peurto Rican man is sucked into a alternative reality through some portal in Times Square, NYC, and has his senses pulled and stretched to their outer limits. The Sci-Fi element of the concept may not have appealed so much to those who liked the eccentric, English side of Genesis. However, musically, the lamb is a force to be reckoned with. Rich in memorable melody, mystery and a vast variey of moods and soundscapes. For Tony Banks, Steve Hackett and PG the Lamb is a masterpeice.High points on this album, for me, are 'In the cage', a masterpiece; driving and tense and riddled with Tony Banks genius, a riffing Hammond organ, and dramatic keyboard solo. 'Fly on a Windshield' and 'Broadway melody of 1974' merge an almost dreamy Egyption feel, into a classic Mellotron based tune, as PG poetically namedrops numerous American cultural icons into the mix. 'Lillywhite Lillith' has an almost Beetle-esque feel, a great song that should have been longer!! 'The Lamia' and 'Silent Sorrow in empty boats' close, what would have been the third side of the vinyl album. These two two tunes are haunting, melodic and are blessed with classic Gabriel lyrics. The only thing that arguably lets the album down is the poor production.Of course, it's by no means the worst production Genesis had in the early years.As a teenager this was my favourite Genesis release. These days I favour Foxtrot and A Trick of the Tail, but it's always going to be a close call. The Lamb is one of the best, if not the best prog concept albums ever released, in terms of feel and atmosphere alone IMO."
    },
    {
      "reviewer": "penguindf12",
      "date": "Posted Thursday, September 30, 2004",
      "rating": 5,
      "text": "Keep your fingers out of my eye!While I type I like to glance at the butterflies in glass that are all around the walls. This album is pinned to events I recall pretty clearly in my mind, as I just bought it yesterday after extensive research online. It is lacking in production, but it gave an introduction to theater rock as a prog selection. Should really be 4 stars, the extra one is for concept. It's about a fully biodegradable being slapped together and categorized as \"Rael\": he's a Puerto Rican-American punk from the N.Y.C. who acts all tough to hide his true feelings. Anyway, if you got this album and the story doesn't stand I might lend a hand, you understand? (i.e., the liner note quote was planned, dummies.)The flickering needle jumps into red. New Yourk crawls out of its bed. And the lamb lies down on Broadway.That out of the way, I'll begin the review in earnest. The title track is very nice, but unfortunately I find it hard to describe the instrumentation to you. The album mainly revolves around piano/synthesizer/mellotron tunes, with the traditional rock instruments accompanying. But this album is not bought to rock with. GENESIS has never seemed to me a true \"rock\" band. They are further removed from tradition than that of YES and PINK FLOYD and especially DREAM THEATER. But that is not necessarily bad. The album's concept is deep, complex, practically impenatrable. Read the liner notes and research online before or while you listen, otherwise it may fail to capture you.Now then, after the medium-rock song (medium-rock being \"rocking\" in relation to GENESIS standards) title track, we enter the softer, mellower \"Fly on a Windshield.\" While the title track describes Rael's current position in a realistic N.Y.C, with him spray painting graffiti and the social commentary of the times, this one is the beginning of the weirdness (Aside from the metaphorical \"lamb lies down on broadway\" which I think represents the sad sacrifice of Rael as he dies because of society's ills. Lambs represent sacrifice, in a Biblical sort of way.) Anyway, a huge wall of black descends from heaven to sweep slowly down the streets of broadway as everyone but Rael ignores it (or doesn't see it). It soon gets to Rael, encasing him in a cocoon.Broadway's past is remembered in \"Broadway Melody of 1974\" as Rael exits our world. What is happening to him? It is most likely that he dies of malnutrition or overdose or something and is sent on a journey through purgatory so he can finally learn love or be trapped in purgatory forever. That gives the album true meaning and a purpose. And now, back to the songs...\"Cuckoo Cocoon\" is Rael waking up from unconsciousness to find he is trapped in a cocoon (which could be a metaphor for his rebirth from our world into the next). He falls back asleep and wakes up in a vast cavern of constantly decaying and forming stalactites and stalagmites in the song \"In the Cage\". He tries to find a way out by using self-control, but abandons this when a rotating cage of stalactites and stalagmites forms around him, closing in on him and trapping him. This cage represents humanity tied to earthly things and the restriction it brings: yet another reality of life Rael must come to terms with before he can move on. He also sees other people's cages forming outside to make a massive network of infinite cages in the vast cavern.It is at this point that Rael sees his brother John outside the cage. He tries to talk to John (who is in reality Rael's true self: Rael just doesn't know himself well enough metaphorically to recognize this), but John ignores him and instead cries a single tear of blood to mourn the incapability of Rael to see the truth. John leaves and just as the bars of Rael's cage close in on him, and the cage dissolves finally. Rael is left spinning on the floor of what is now a large modern hallway. Overall, \"In the Cage\" is a masterpiece song. Excellent example of GENESIS' power.\"The Grand Parade of Lifeless Packaging\" is a beeping and clanking but catchy tune about the aisles of inhumane factorylike shells of people. Brother John is there as a motionless shell (which means Rael is there as well). But soon Rael tires of this and his mind drifts into memory of his life \"Back in N.Y.C.\". This gives us some background of Rael's life and ways in a rocking sort of song. Then his hairy, masculine heart is shaved in \"Hairless Heart\" and in \"Counting Out Time\" he remembers his first romantic experience. This song is also a classic rock tune with some catchy bass grooves.Rael soon returns to his current situation. He is in a long hallway in \"The Carpet Crawlers\". This hallway represents a journey. The crawlers are those searching for a way out but cannot find one. Now then, the music for this song is VERY beautiful. It is smooth, relaxing and meaningful to the story. This song and the next are closely related to the writings of C.S. Lewis where he says \"any of the rooms is better than remaining in the hall\", a metaphor of finding religion and true faith. \"The Chamber of the 32 Doors\" is a fairly good song about Rael wandering around in a massive room outside the hall where tons of people are giving him directions. Only one door will take him out.And \"Lilywhite Lilith\" supposedly shows him this way at the start of the second disc. This song sounds a bit BEATLEish, and it rocks pretty hard in comparison to the other songs... But anyway, she leads him to a pitch-black room of fear, where he sits and waits. \"The Waiting Room\" is a haunting, dissonant fusion of spooking instrumental songs which ends in a jam session. Very good stuff in this section of the disc.Anyway, \"Anyway\" fires back up in a rock piano sort of way, with Rael lamenting the strange position he is in. \"The Supernatural Anesthetist\" song is about Rael's short meeting with Death. Then we come to \"The Lamia\", where Rael is lead into a romantic encounter with snakelike woman creatures. The falls in love and unfortunately they die. Supposedly. In reality, they are temptresses which regenerate and seduce everyone who enters their lair. Rael is depressed in \"Silent Sorrow in Empty Boats,\" an ambient instrumental song in the vein of Brian ENO.\"The Colony of Slipperman\" always makes me a bit queasy. The song is good, with purposefully awkward music which bounces about. But it is the meaning of the song which bothers me. Rael is castrated because that is the only way he can leave the colony. He had fallen in love with the Lamia and the only way out was to no longer love them. The only way to do this is...to visit a castrating doctor. Ouch! This song is painful enough without the ripping sound halfway though it...ugghh... I'm sure this one is a metaphor as well, I just don't want to talk about it right now...After this, his schvinger is put in a yellow tube which is promptly stolen by a raven. Bad luck again for Rael. This guy never gets a break! He chases it to a \"Ravine\", and his brother John (who he met in the previous song) deserts him again, saying he doesn't want to help because it would put him in danger. This is the second time John deserts poor Rael!Rael stands and looks over the ravine into a rushing rapid river where his recently- dropped-a-raven yellow tube floats. He sees a portal which seems to go back to New York City open in \"The Light Lies Down on Broadway\" just as he sees John trapped in the rapids, unable to escape. Here he makes a descision to jump in and save John even though John never saved him. He makes his own choice and commits a selfless action. The music here is a more psychadelic version of the title track.\"Riding the Scree\" is a great song as well. It is Rael jumping into the sides of the slope as he makes his way down to the river. He jumps in and tries to save John in the softer \"In the Rapids.\" This song is mellow like \"Fly on a Windshield\". Rael grabs John and pull John out of the river. John is unconscious as Rael looks at his face... and realizes that it isn't John's face he is look at. It is his own!At this realization, the music cranks up into a full-blown wonderous ending in \"IT.\" Amazing here. The album never tells you what \"it\" is, but I assume it is love. Or maybe not. Anyway, Rael is finally at peace with himself. The end.The album is an amazing concept. 4-star music but it definitely deserves extra points for being so historical and literarily inspired. It is less accessible than \"The Wall\" (PINK FLOYD), but this album is much deeper. Not the best song for rocking to, not the best for a beginner to prog either. Listen if you liked \"The Wall\" or are somewhat experienced in prog. A major trouble I have with the album is the fact that the second disc lags in comparison with the first, especially \"side four\" and the three instrumentals placed on that disc. It seems like GABRIEL ran out of ideas and had to fill it in with something...but still, it's a good album nonetheless. It's over to you."
    },
    {
      "reviewer": "Guillermo",
      "date": "Posted Friday, October 8, 2004",
      "rating": 4,
      "text": "\"The number of times our names were mentioned in reviews, apart from Peter, you could count them with the fingers of one hand. The reviews only focused on Peter, the lights, the stage, the show, and Peter\" -Tony Banks (In a 1982 interview, more or less as I remember).I listened to this album for the first time in December 1980 (four days after Lennon`s death). I liked it, I recorded it on 2 cassettes, and I bought it six months later. Now, nearly 24 years later, I consider it as a good album, but I can`t understand why so many people considers it as GENESIS`best album. The story of this concept album is sometimes confusing, and the end of the story leads to nowhere. For me, the best thing in this album is the music. Gabriel`s vocals also sound more mature, more like his voice sounded in his solo career. Gabriel reached a point where the next step was to be himself and to leave the band and being a soloist. There were still conflicts in the band. In the same 1982 interview, Banks/Collins/Rutherford said that Hackett was \"left out a bit in this album, with the 3 of us mainly writing the music, and Peter wrote almost all the lyrics alone, a think we didn`t like\". Gabriel also had personal problems which forced him to chose to leave the band, apart from some frictions with the band. There are some very good songs in this album: \"The Lamb Lies Down on Broadway\", \"In the Cage\" (I prefer the live versions sung by Collins), \"Back in N.Y.C.\", \"Counting Out Time\" (an humorous song), \"The Carpet Crawl\" (again, I prefer the live versions sung by Collins), \"The Lamia\", \"Silent Sorrow in Empty Boats\", \"The Colony of Slippermen\", \"Riding the Scree\" and \"it\". It`s a shame that there are not full videos of this tour as the story could be better understood aided by images (like Pink Floyd `s \"The Wall\" with the movie of the same name).Brian Eno`s contribution for this album was only some distorted vocal effects for \"The Grand Parade of Lifeless Packaging\". There is a credit for Graham Bell for \"choral contribution\". Graham Bell was the singer of a band called \"Bell and Arc\" in which YES`s drummerAlan White also played briefly in the early 70s (but I never have listened to this band, which also recorded albums for Charisma)."
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Wednesday, November 3, 2004",
      "rating": 5,
      "text": "For me this is one of the most magical and compelling progrock albums of all times. You cannot compare it to any other early GENESIS record, mainly because it's Peter GABRIEL's 'thing'. Looking at the lyrics it seemed that Peter was lying on Sigmund Freud's sofa, telling the most famous shrink his subconscious world. If you step into the world of \"The Lamb Lies Down On Broadway\" you will discover an unusual variety in the 23 tracks. First the music: it's not just progressive rock but also rock, pop, punk and electronics. Second the lyrics: no science fiction or mythology but a blend of 'down to earth' problems and psycho-analytica. Third the factor emotion: you can experience a wide range of emotions and feelings like sex, aggression, fear, alienation, insecurity and hope. When the 2-LP was released in '74 many GENESIS fans were disappointed because it was not really music in the vein of \"Selling England By The Pound\" or \"Foxtrot\". But gradually \"The Lamb Lies Down On Broadway\" got more appreciation and nowadays many prog heads considered it as a masterpiece: from the sparkling piano intro in the title track, the menacing \"Fly On A Windshield\", the scary \"In The Cage\", the aggressive pre-punk in \"Back In NYC\", the romantic \"Carpet Crawlers\" and wonderful build up in \"Anyway\" to the funny \"The Colony Of Slippermen\" and the cheerful \"It\", GENESIS succeeds to make captivating prog rock, so unique for that era. The band was hit by many problems but often then the best music has been made in the past, the frustrations were sublimated into music would Freud have analysed! So enjoy the intense volume-pedal guitar play and the Mellotron duets, splendid runs on the ARP Pro solist synthesiser, strong and dynamic drum work by COLLINS, powerful bass play by RUTHEFORD and emotional vocals by GABRIEL. Despite the fact that some songs on 'side four' tend to sound a bit less inspired, \"The Lamb Lies Down On Broadway\" is one of the best prog rock albums ever made. I hope you can watch the world tour of the GENESIS cover band The MUSICAL BOX when they perform the original The Lamb Lies Down On Broadway show, including the more than 1000 slide projections and the Slipperman costume!"
    },
    {
      "reviewer": "soundsweird",
      "date": "Posted Tuesday, November 16, 2004",
      "rating": 5,
      "text": "Why is this my favorite progressive rock album of all time? ....... (Note: I was already a big fan of Genesis when this was released)........ Is it because of the concept, with all of its attendant metaphors and references? Is it because of the superb performances, or the wonderful contrasts between delicate and thunderous? Or perhaps the exceptional compositional skills on display? Could it be the production values, or the artwork, or something as esoteric as the very mood the album conveys? Is it the fact that, unlike so many other progressive rock albums, this one cannot be accused of being \"too sterile\", \"too academic\", or \"too wimpy\" (these are complaints I get from friends who are into metal or alternative rock)? No. It's my favorite because I like more songs on this album than on any other progressive rock album I've ever heard. The only track that I don't like is \"The Waiting Room\", which is just too static and repetitious to justify its length. It's like they laid down the rhythm tracks, then forgot to add any kind of melodic element (I know, I know...THAT was their intention). Also, \"Lilywhite Lilith\" before it seems a bit subpar compositionally. That still leaves about 80 minutes of wonderful, top-of- the-line music that can be appreciated again and again and... (about 30 years worth, so far, and I have NEVER had to set this album aside for awhile because I became sick of it)...."
    },
    {
      "reviewer": "Bj-1",
      "date": "Posted Friday, December 3, 2004",
      "rating": 4,
      "text": "The Lamb Lies Dow On Broadway - This massive adventurous concept album that was released a year after their brilliant \"Selling England By The Pound\" album received very bad reviews when it was released. Even Genesis themselves, notably Tony Banks, was disatisfied with it because it was a very hard album to make. \"The recording started out great, but turned into hell at the end\" said Banks in an interview I read a couple of months back. Still, this album is considered as their best along with \"Foxtrot\" and \"Selling England\".The concept of this album is about Rael, a puerto-rican street punk who lives in NY and experiences strange things in the underground streets of Broadway. It's a well written story by Peter Gabriel and the music that the rest of the band contributes is mostly excellent, despite a few unfocused spots as well as a couple of \"filler\" songs. It's a patience required album, and newcomers to the band should start with \"Foxtrot\" or \"Selling England\" before this one. Otherwise, it's a very good album, some flaws, but overall 4 stars."
    },
    {
      "reviewer": "slipperman",
      "date": "Posted Wednesday, January 19, 2005",
      "rating": 5,
      "text": "This album deserves a book, not a freakin' little record review. There's so much going on here, musically and conceptually, it will take a lifetime to figure out. This is one thick album. It succeeds because it's not only a massively complex listen as a whole, but you can also take each song on its own and still enjoy it as an album full of lots and lots of great songs. It doesn't lose itself in the conceptual insanity if you don't want it to. If you do want to read into the lyrics and have fun with the concept, you have an infinite number of conceptual possibilities to consider. It's weird, man, weeeeeiiiiirrrrrrd.Only the tension that was happening in Genesis at the time could've produced a work this eventful. Gabriel unfolds a most bizarre tale while the musicians-all putting in career performances--run through a dizzying variety of moods and tempos, from the epic (\"In The Cage\") and the simplistic (\"Counting Out Time\") to the fiery and innovative (\"The Waiting Room\", \"Here Comes The Supernatural Anaesthetist\"). It's like they know this is the end of a very special era, and they do everything their massive talent-pool can to go out with a bang.You hear some stuff occasionally about how the second half of this double-album isn't as eventful or memorable as the first half, but I've never heard it that way. For all its consistency, you get some of the deepest Genesis journeys in the final half, including \"Anyway\", \"In The Rapids\", \"The Lamia\", and a song that dates back to the band's beginnings, the gorgeous \"Lilywhite Lilith\". No, I don't hear the album faltering at all in the second half. Maybe it's people's attention spans failing? I don't know. All I know is if it seems sad that the Gabriel-era of Genesis didn't last a little longer, at least they left us with this mesmerizing and always-enjoyable monument, because this is as good as prog gets."
    },
    {
      "reviewer": "Eetu Pellonpaa",
      "date": "Posted Friday, April 1, 2005",
      "rating": 4,
      "text": "l liked this concept double album quite much as a teenager, and though I haven't listened it for ages, I still have warm memories about it. The possible symbolic meanings of this epic tale never got very clear to me, but as the music works so well, such inferior details do not matter. When thinking afterwards, maybe Peter is singing about himself been lost to the pretentious illusions of commercially successful progressive rock spectacles, and preparing to venture to his own musical and socially responsible solo career. My own highlights of the record are \"Fly on a Windshield\", \"Broadway Melody of 1974\", \"In the Cage\", \"The Waiting Room\" and \"Silent Sorrow in Empty Boats\", though the two LP's spin pleasantly without unnecessary moments. There are also some nice live recordings from the tour of this album, which I have liked even yet more than this fine epitaph for an era ending here."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Tuesday, June 14, 2005",
      "rating": 5,
      "text": "Warning: This is NOT a review - it's an experience sharing .Why? It's because there has been so many excellent reviews about this album. For detailed review you can read what my colleague collaborator Dex F. has put it in about this album. I also agree with what Ivan has written that the claustrophobic \"In the Cage\" and the tittle song are highlights of this masterpiece that cost me so much time to understand and love- on first listen many many years ago (my case). This masterpiece has created great memories throughout my study as well as work career.About a week ago I had a discussion with the senior executive of Indonesian Progressive Society (IPS) on the plan to release a debut album of another new prog band in my country at the end of this month. He said that the release will be celebrated with the live show of the new band. And I asked him on how come conducting a live show an album that has not been released yet? He answered me calmly: \"Gatot, don't you remember The Lamb Lies Down on Broadway by Genesis? It was released when the crowds were expecting the band to play the tunes they had had been familiar with. But the band did not play any single tune from their previous album. That represented the launch of the album\". So inspiring answer, don't you think? That suffices for me to have another spin again of this very very legendary and masterpiece album! I also listened to the entire live that he mentioned during my conversation with him: the disc 1 & 2 of Genesis Archive box set volume 1. I love both versions even though I prefer the live one. Awesome!For me this album was the pinnacle of Genesis career in prog rock where the music, the lyrics, the overall concept of this concept album are really great. The tracks that always create a stimuli for me to repeat are: Fly on a Windshield, In The Cage, Back In NYC, Hairless Heart, Anyway, and The Lamia. It does not mean the others are not excellent tracks. Fly On A Windshield is a great composition song with powerful and heavy voice of Peter Gabriel \"There's something solid forming in the air .\" oh man . this opening part stabs my heart at every spin of the track. The lyrics continuation that says: \"The wind is blowing harder now, Blowing dust into my eyes. The dust settles on my skin, Making a crust I cannot move in..\" is also memorable part. And it turns quite until Gabriel sings this beautifully: \"And I'm hovering like a fly, waiting for the windshield on the freeway.\" JRENG! Wow . man .the music that follows is killing me man ..!!! (I used to call it in my locality language as \"nggeblak\" which roughly means like: I'm stunned and my mind is paralyzed hearing this wonderful musical harmony!).The music is continued with an exploration of keyboard, howling guitars and dynamic drumming followed with continued singing: \"Echoes of the Broadway Everglades, With her mythical madonnas still walking in their shades: Lenny Bruce, declares a truce and plays his other hand. Marshall Mcluhan, casual viewin', head buried in the sand. Sirens on the rooftops wailing, but there's no ship sailing. Groucho, with his movies trailing, stands alone with his punchline failing.\" \"Klu Klux Klan serve hot soul food and the band plays 'In the Mood' ..\" I like the way Gabriel sings \"Klu Klux Klan .\" .Note: I always grab the CD sleeve and sing along with Gabriel while reading the lyrics whenever I listen to Fly On A Windshield. No wonder that I can remember on top of my head some verses of the lyrics - especially the opening part and those that mention Winston ciggarette. Actually I confuse about this track as if we look at the lyrical coverage, the part that starts with \"Echoes of the Broadway ...\" is actually already part of The Broadway Melody of 1974 - but, the CD version track still include this as Fly on A Windshield. Well, it does not matter, actually - it's a manufacturing issue, I think.How can I not repeat this killing melody music? It's so wonderful. Other songs - except the Waiting Room - are excellent as well. Hairless Heart and Fly On A Windshield have influenced many neo prog bands music - at least on the nice melody these tracks offer. Super Highly Recommended!Keep on Proggin' ..!Progressively yours,GW - Review #319.. And as the song and dance begins, the children play at home with needles; needles and pins."
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Sunday, August 7, 2005",
      "rating": 5,
      "text": "4.5 StarsAfter their absolute masterpiece, they had to decide if they will try to play it safe and release a similar album, or use the talents in another way. They used the latter, and created a compelling story and sacrificed instrumentation for singing. The album suffers one main flaw : the second disc has some poor musical moments. I am certain that if they tightened the album into one single 50 minute disc, they could have made their strongest album. The first CD is perfect for me, if only their second had the same quality ... songs like Silent Sorrow in Empty Boats, The Colony of Slippermen and The Waiting Room hurts the quality of the album. Actually, the songs are not as excellent as in their previous two albums taken separately, but when connected in the story, they are much better.The album starts with a great melodic tune full of great and accessible musicianship and classic vocal hooks. It is followed by mellotron, gorgeous vocal melodies, and perfect (and simple) playing (a high point of the album). Cockoo's Cocoon is a harmless pop tune with a nice flute solo. In The Cage is the most known track of the album mainly because of the desperate sounding keyboard riffs and the virtuosic moog runs. Side two has the same high quality beginning with the bizarre 'The Grand Parade' that builds itself into dramatic close. Then, it is followed by my favourite track of the album : Back in NY City.The song sounds very dated, but it is a very powerful song with punk-like qualities on Gabriel's vocals. Gabriel's vocals are not the only good thing of this song. Tony Banks' riffs are very entertaining. Hairless Heart is an instrumental of exceeding beauty. Counting Out Time is a lighthearted pop song with good guitar riffs and nice melodies. The Carpet Crawlers is another well-known track from the album. It is a ballad with pedal guitar improvisations in the background. The Chamber of 32 Doors is a moderately long track that does not feel long, thanks to the strong vocal melodies and playing. Perfect Disc!1. The Lamb Lies Down on Broadway (9/10) 2. Fly on a Windshield (10/10) 4. Cuckoo Cocoon (6/10) 5. In the Cage (9/10) 6. The Grand Parade of Lifeless Packaging (8/10) 7. Back in N.Y.C. (10/10) 8. Hairless Heart (9.5/10) 9. Counting Out Time (8/10) 10. The Carpet Crawlers (9/10) 11. The Chamber of 32 Doors (9/10)The Second Disc has some disappointments though and while it isn't much weaker instrumentally, its melodies are not as memorable and interesting as in the first disc. Lilywhile Lilith is a good rocker that is made better with the 'fly on a windshield' reprise. The Waiting Room is an avante garde piece that gives a very nervous mood. Anyways is a ballad with good piano melodies. The next track is another good (but not great) track. Fortunately, Lamia arrives and shows itself to be a highlight of the album. It is a very dark, myseterious, and captivating number in which all musicians shine. Silent Sorrows is a low point. It cries filler and seems only to be created so that Peter changes his custom into the mutant in the last long track of the album. Unfortunately, there is filler in the first 2 minutes where the artists just noodle around on their instrument without a sense of melody. The track itself is pretty good, but it does not achieve to be of the quality found in songs like 'In The Cage'. The next few tracks are mostly instrumental and not very interesting. Riding the Scree is worth talking about though. IT is a synth-driven piece with flying moog solos in the beginning. AFter so much filler, the album ends in a high note that leaves you satisfied. It is 'It'. A rock&roll number with fast acoustic guitars, and a powerful adn fun electric guitar melody.1. Lillywhite Lilith (8/10) 2. The Waiting Room (6.5/10) 3. Anyway (8/10) 4. The Supernatural Anaesthetist (7/10) 5. The Lamia (9/10) 6. Silent Sorrow in Empty Boats (4/10) 7. Colony of Slippermen (7/10) 8. Ravine (6/10) 9. The Light Dies Down on Broadway (8.5/10) 10. Riding the Scree (8/10) 11. In the Rapids (6/10) 12. It. (9/10)I still honor this album and give it 5 Stars (well, 4.5). It is one of the early 70s successful concept albums, and this album influenced greatly Neal Morse.My Grade : A/B"
    },
    {
      "reviewer": "Seyo",
      "date": "Posted Saturday, August 13, 2005",
      "rating": 4,
      "text": "A pretentious but worthy double album!In 1974 Gabriel was messing around with film director William Friedkin, which might explain Peter's obsession with writing an epic drama about a young Puerto Rican New Yorker wandering thru the underworld of the megapolis and presumably searching for his true identity or whatever, who cares?! I must admit I never passed the few first sentences of the album story liner notes because it was soooo boring and pseudo-intellectual text. \"The Lamb Lies Down on Broadway\" is definitely a GENESIS' \"topographic oceans\" trip trap. Musically, however it is a very good effort with almost flawless Disc 1, where \"Broadway melody 1974\", \"In the Cage\" or \"Carpet Crawlers\" rank among the band's best moments. Disc 2 is much weaker and apart from jolly \"The Colony of Slippermen\" does not offer many memorable moments. This album has very dark atmosphere stressed by some horror odd sounds and electronics courtesy of Brian Eno. Gabriel's voice is often stressed and agressive without necessity and in retrospect it is clear that he was giving his last bit of energy to the band before quitting and going solo. It may sound controversial, but I would still recommend this album not only to the fans, because there is enough musical quality and musicianship."
    },
    {
      "reviewer": "Tony Fisher",
      "date": "Posted Monday, September 5, 2005",
      "rating": 4,
      "text": "After a quintessentially English album (Selling England), this is their American album. It was also Gabriel's swansong and he wrote all the lyrics to keep the concept coherent. And, for a double album, it is remarkably free from fillers and rubbish. It's not completely consistent, some tracks being magnificent (Fly on a Windshield, Hairless Heart, Carpet Crawlers,The Lamia) whilst others don't quite make the grade (Back in NYC and Lilywhite Lilith) but there's nothing that's actually bad. Banks' keybards are majestic throughout and Hackett finds some inspired guitar work whilst the rhythm section is tight and inventive. Gabriel produces some of his best work on both flute and vocals; how they missed him! The only thing that let's it down a bit is the story. I do not empathise with Rael, the archetypal New Yorker, whose adventures the album charts. So to summarise, great music, slightly silly story. Worth buying? Definitely yes, but not quite a masterpiece - a damn close run thing though.4.5 stars."
    },
    {
      "reviewer": "Progbear",
      "date": "Posted Sunday, September 11, 2005",
      "rating": 3,
      "text": "The prog-rock era sort of toppled under its own weight when every band had to do their double album. Genesis were no exception, and it was predictably overblown and overstuffed. But they managed to keep their dignity and produce an album that was at least good, if not quite on the level of their best works.The concept, 100% Gabriel's baby, is totally incomprehensible, and it wouldn't at all surprise me if lots of drugs were involved. At least it strives for a quirky surrealism, as opposed to the cheesy sci-fi and heroic fantasy concepts most prog-rock acts go for. And Side One is some of the best Genesis music ever, the pieces flowing together masterfully, reaching a fever pitch with the intense \"In The Cage\".It's round about Side Three that things begin to unravel, with some rather less than inspired throwaway numbers (\"Lilywhite Lilith\", \"Anyway\") and obvious filler (the jam piece \"The Waiting Room\"), but they never find themselves as deep as TALES FROM TOPOGRAPHIC OCEANS. Even at its weakest, the album remains listenable, but at 90+ minutes it sometimes feels more like a marathon than an album.Still, it's good that they managed to retain their integrity on a project that was probably a mite overambitious. Definitely one of the more successful and enjoyable of these types of albums, but still not a patch on FOXTROT in the end."
    },
    {
      "reviewer": "Prognut",
      "date": "Posted Friday, October 14, 2005",
      "rating": 4,
      "text": "Many prog-heads considering this one as the pinnacle of GENESIS, and thier Masterpiece! I do not!! I like The Lamb... but to me drags to much, I have never listened to it completly on one session! and, I always found myself skipping songs! Anyway, this maks the end of an era for GENESIS-PG and should be part of your Collection from any particular point of view.. 4 1/2 stars....."
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Monday, November 7, 2005",
      "rating": 3,
      "text": "A brilliant first half cannot save a contrived second half in the Lamb Lies Down on Broadway, Genesis' concept extravaganza. The final album to have Peter Gabriel as an active member of Genesis, he leaves with the proverbial bang and captivates the listener throughout the entirety of Rael's incredible journey of the mind and the depths of New York City. Hackett, whose appearances are short and far between, is excellent. Rutherford is at his best playing cohesively and creatively with Collins, who carries the band throughout the story musically. What this album really is musically is a Tony Banks bonanza, with Banks taking the melody duties, most of the lead duties, etc. But Gabriel is what makes this album so strong. Emotive and captivating vocal performances take the listener to another level.I would rate the first half a 4/5. The Lamb Dies Down on Broadway opens with anxious synths that fade in with the rest of the band. This is where Rael, a Puerto Rican street kid, begins his journey. Instrumental breaks (not spectacular, but good)lead us to Cuckoo Cocoon, which has some awesome riffing from Hackett. Then the story progresses to In the Cage, which has some nice organ work from Banks and a strong vocal performance from Gabriel. Throughout the rest of the first half, the quality of the songs only gets better, with stand outs like Back in NYC, The Grand Parade of Lifeless Packaging, Counting Out Time, etc.The second half is nothing short of uninspired and contrived. Musical ideas are there, but aren't really expressed 100%. The story takes bizarre twists at this point, when Rael goes to the Colony of Slippermen and has to be castrated. The strongest song in this half is In The Rapids/It, which concludes the album.Overall, one half genious and one half bizarre, this album is often revered as a masterpiece. While it is quite good, there are better Genesis albums. 3.5/5"
    },
    {
      "reviewer": "Atkingani",
      "date": "Posted Tuesday, November 15, 2005",
      "rating": 4,
      "text": "Seeing only by the musical point this work is uneven since it blends good songs (some are great) with forgetable songs appearing mostly like fillers. Seeing by the theatrical point and after watching the show of cover band The Musical Box the work is correct with the 'weak' songs running well together with the 'strong' songs to describe Rael's odyssey (I hadn't the chance to see Gabriel's Genesis playing this work and never saw a VHS or DVD with the original show) .Returning to the musical view there are at least 2 prog-classics: 'In the cage' and 'The Lamia' and some other songs always remembered: 'Back in NYC', 'Anyway', 'Countig out time', 'Cockoo cocoon' and the beautiful 'The carpet crawlers', probably the most known Gabriel-era song for a non-prog fan. The title-music is also remembered by many.Unlike other people I like Disc 2 although I have to recognize that Disc 1 is better but the distance between both is not so crashing. Disc 2 contains the classic 'The Lamia' and also 2 other songs I appreciate too much: 'Silent sorrow in empty boats' and the final track 'it'.On the other hand I'll never recommend this album for a Genesis beginner or a prog beginner. This work is for people that 'ate much dust' within the prog-scene.Minus 1-star for the weak songs (since this review is musical). Total: 4."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Wednesday, December 14, 2005",
      "rating": 4,
      "text": "What goes up must come down.After pulling off their brains 4 exquisite pieces of history, Genesis finally stepped into the hall of fame with none of it's members over 25 years old. Try to beat that!Despite some incredible songs like Carpet Crawlers, Anyway, In the Cage and The Lamia, the thing has the strenght to stand up on it's own legs. The story is although suffering of severe cohesion lacking, whatever that guy Rael's going thru...we don't give a hoot. This story is written so fast and Gabriel's ego really went thru the roof, we have proof. Did he thought he was all that? Who knows. Tony Banks said in the Genesis Songbook: 'I don't know what people's got with the Lamb, I believe we could've done much better...'I guess the Lamb really could take off ON STAGE, with the lights and the crazy, goofy costumes of Gabriel. This would've made a great single record...maybe the best? Come on, when this record's good, it is pure gold.To me, this shares a lot with Pink Floyd's The Wall: outrageaous talents backstabbing eachother in studio, creating the unhealthy environnement that kills a record.It's just too sad way to say goodbye, but with they did it with a bang."
    },
    {
      "reviewer": "belz",
      "date": "Posted Friday, February 24, 2006",
      "rating": 3,
      "text": "3.4/5.0I would like to give a higher rating to this album, but sorry I can't! This is simply an overrated album, period! I just LOVE Genesis, from Genesis to Revelation, Trespass, Nursery Cryme, Foxtrot, Selling England by the Pound... But sorry The Lamb lies down on Broadway is just not as good as many of those album. Sure, it is a great addition to any collection, but the feeling is not there anymore, the show is over, this is the end of the track, Gabriel is now preparing his exit...I had a hard time deciding between giving 3 or 4 stars to this album (actually, I was hesitating between 3.4/5.0 or 3.5/5.0), but after some thinking I decided that 3 stars is not bad anyway, and it just shows that this is not as strong an album as the previous ones.Another question: is this prog anymore? I mean, there clearly are some prog songs there, but where is the feeling, the emotion? I enjoy very much the end of the second side, with lot of emotion, but very often there is some \"filling\" there and there because the album was made so it could be played theatrically and the musicians had to give some time to Gabriel for changing his costumes.This is a good album, probably essential if you want to understand how Genesis imploded, but 3.4/5.0 seems like a far rating to me."
    },
    {
      "reviewer": "Prog-jester",
      "date": "Posted Monday, March 6, 2006",
      "rating": 5,
      "text": "The greatest concept album of all time. Not for the beginners - it was hard for me to get into it, but when I got explanations of lyrics, searching through all these web-zines and Genesis-related sites, when I got photos of live perfomance of The Lamb...wow!!! Stunning work, while considereded by somebody to be the weakest from Gabriel-era... why? Because of weird ENOssifications? Or controversial lyrics, sometimes based on sexual experience? Anyway, awesome work - just listen to \"In the Cage\" or \"The Chamber of 32 Doors\". The deepest Genesis album, and the last to be clearly understood by me. I'm still getting into it. Wish me luck :-)"
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Wednesday, March 22, 2006",
      "rating": 5,
      "text": "I thought long and hard before writing this review because this album still continues to change and evolve in my mind even after over three decades of listening to it. I've come to think of it as I do a great impressionist painting. It speaks to the subconscious more than the listener is aware of. Lyrically it is existential, following a pattern that started back with Suppers Ready and then The Battle of Epping Forest. The images and wordplay that Peter invokes throughout this epic are magnificent, bringing up different scenes in my head every time I indulge in this prog opera. And the music is beyond great. For the first time the band was allowed to expand beyond the 40-45 minute limits of the single LP and the result is nothing short of genius. They move from the delicate \"Cuckoo Cocoon\" to the thrilling ride of \"In the Cage\" with amazing ease. The humor of \"Counting out Time\" keeps the mood light when it needs to be, then segues into the thought-provoking \"Carpet Crawlers.\" Just when you think you've got a handle on the story line you are confronted with the all-encompassing theology of \"It.\" The total package may be the most challenging conceptual piece in all of modern musical history. I must mention that I've always had a problem with the flat sound of the original release but I wanted to concentrate on the music and words in this review so I'll only say in passing that the live version from the excellent Archives I set resolved all of my fidelity conflicts in one fell swoop. But no matter which recording you happen to be in the presence of, there is no finer example of progressive music in existence and the visuals you take from it will last you a lifetime."
    },
    {
      "reviewer": "chessman",
      "date": "Posted Thursday, September 21, 2006",
      "rating": 5,
      "text": "This was, of course, the last album with Peter Gabriel on board, and what an album he chose to leave after! Without a doubt, this is not only my favourite album from my favourite band, it is still, after all these years, my favourite album full stop! I am not going to review each individual track as pretty much everything that could be said about it has been said about it. Rather, I would mention the unique atmosphere that pervades the record, from the dark and subtle humour of some tracks to the wonderful, eerie, almost ethereal soundscapes that run through many others. Gabriel didn't want the band to be known as Peter Gabriel and Genesis, which is what was beginning to happen. Although many people thought he was the main lyricist, this was only true on this album; he conceived it and wanted to write it all himself. Indeed, he came close to doing that, but found himself struggling in the end, and asked Mike and Tony to help him out. They did this on a couple of tracks, notably 'The Chamber Of Thirty Two Doors'. The sound on the album is tremendous, a natural progression from the previous 'Selling England' album. Banks shines here with his playing, supplying some stunning solos on tracks such as 'In The Cage', 'The Colony Of Slippermen' and 'Riding The Scree'. He also plays some wonderful mellotron and piano on the quieter tracks, and he is only matched on the album by Hackett and his wonderful un-guitar-like sounds. Collins is a rock at the back, helping to produce that definitive Genesis sound, whilst Rutherford adds some lovely 12 string sounds to the mix, along with his ever smooth bass lines. Stand out tracks? Too many to mention, but worthy of special mention are 'The Waiting Room' (a superb, slowly building jam with weird cat-like noises at the beginning, leading into a tremendous wall of sound), 'Hairless Heart' (a beautiful instrumental, with nice acoustic guitar and excellent keyboard work), the entire 'Colony Of Slippermen' (catchy, lyrically clever, with brilliant, bubbling keyboards and dazzling runs) the atmospheric 'Silent Sorrow In Empty Boats' (an almost church-like instrumental, complete with choral voices that come and go in the most haunting fashion) and, my favourite of all, the brilliant 'Fly On A Windshield' with its majestic mellotron led pomposity, overlaid with the most wonderful guitar work from Hackett. Oh yes, the final track, 'It' is no slouch either with its catchy, uptempo melody, good acoustic guitar work, lead guitar work and all round magnificence. I could go on, but I won't. Suffice to say this album has an atmosphere unlike any other I have ever heard, and I have heard many over the years. Yes, it is lyrically obscure in parts, but that is wholly intentional I am sure, as it allows the listener to populate the world created by the music with his or her own thoughts and characters. No weak tracks whatsoever, though if I had to choose my least faves (and I would need a gun at my head to make me choose) I would probably say 'Back In NYC' and 'The Chamber Of Thirty Two Doors', though both of these are very good as well. Without doubt a masterpiece, one of the very few to be honest, and it is the only album I would actually give six stars to if I could. Stunningly diverse, hauntingly beautiful, bitingly satirical in parts, and all wrapped in that unique Genesis packaging. Amazing stuff."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Friday, October 27, 2006",
      "rating": 2,
      "text": "I have several problems with this record. One is it's incredibly long length, adding unneccessary tracks on the second disc with little to them other than time. The other is the holly jollyness I feel from the record, making it a bit campy for me. Gabriel's voice experimenting makes me cringe in certain parts as well.The album starts well, with one of the better songs of the record. But through the course, you get the feeling that Peter Gabriel took over too much, making the music stale. It appears too much to me like the band is playing background to Gabriel's vision. The term rock opera would apply well here. I sense no beauty in the notes, the feeling I get is one of a forced monotony, almost like the band members are bored to be there. This seems less Genesis and more Gabriel solo effort. I'm sure that's not a bad thing for some, but for me it sounds all too dull.Perhaps you are aware that I am one of the few here who was never in awe of Genesis's works. I find many other prog bands far more interesting, in addition to being better songwriters. It seems as though other Genesis's works said more with less, and that's usually a sought after quality in music."
    },
    {
      "reviewer": "silvertree",
      "date": "Posted Saturday, November 11, 2006",
      "rating": 5,
      "text": "Well I guess I had to review this album because it is a classic, a masterpiece might I add, and because I have personal reasons. I was a 5-6 year old kid when I heard this music for the first time. My big brother would play The Lamb over and over again. I even knew some lyrics by heart ! When I was a teenager, I happened upon a tape my brother made of the album. Oddly enough, he recorded the album except for the last 4th side, obviously because the tape wasn't long enough. So I kept listening to the tape during my teenage years (together with King Crimson's In the Court). Finally, at the age of 16 I decided to buy a copy of the album for myself and what a surprise I had : I discovered that there was a fourth side completely unknown to me ! Well, I must say and agree with what has been already said : side 4 has the weakest track on the album : 'It'. \"It\" really does seem out of place. But never mind 'It' ! This is a masterpiece and every prog lover should have it in his or her collection."
    },
    {
      "reviewer": "Chus",
      "date": "Posted Monday, November 13, 2006",
      "rating": 3,
      "text": "This album receives mixed reviews... mine is a bit mixed too.This is the story of a guy named Rael (Puerto Rican?), who goes on a surreal journey through blah blah yada yada. I don't really care for the story if the music doesn't get me there. All I can say is that the magic this band recreated on previous efforts is slightly forgotten, and the band has fallen in it's own weight. Of course, the songs are not bad; but this is hardly the Genesis I like, just reworking much on \"I Know What I Like\", which, whilst is not bad, it's not essencial in understanding what Genesis was about.I guess making a song-by-song review would make a lenghty day for me, so I'll just take the parts of the album I found interesting.The title track is catchy and memorable, and the piano intro says it all; the chorus is pop oriented (and good pop at that). A staple to many post-Gabriel concerts (not post- Hackett though).Then we get to the rap called \"Broadway Melody Of 1974\", which has thumping rhythm and interesting spoken lyrics by Gabriel (in the same way he did in \"Epping Forest\"). Cuckoo Cocoon is very mellow, and contains simple yet complementaty flute notes over some keyboard arpeggios. \"In the Cage\" has one of Banks' trademark solos (also shown in \"Riding The Scree\" and \"Slippermen\") and amazing progression, all in the bridge.Then \"Hairless Heart\" is again simplistic but with the Genesis' feel of previous albums. \"Carpet Crawlers\" is an arpeggio exercise by Tony Banks, but in the whole it's a good pop song. \"The Waiting Room\" is pure King Crimson with a more organised climax. \"Anyway\" has a bombastic bridge and Hackett's showcase of minimalistic yet powerful guitar licks; but again it's a very pleasant pop song with interesting piano melody. \"Supernatural Anaesthetist\" is purely Hackett's showcasing (a well deseved one, even though not particularly as good as his solo works). \"The Lamia\" is arguably the best song here, and in the true vein of Genesis; it has simple piano arrangements but it's a song of pure bliss and it's emotionally charged; is the most underrated song on the album. The rest of the album contains the most inspiring songs, starting from \"The Colony Of Slippermen\", through the amazing Banks' showcase yet again in \"Riding The Scree\" and the melancholic \"In The Rapids\". \"It\" is a pop song, but not as good as the title track.I'm more fond of the second disc because it's more filled with that Genesis vibe that was predominant on \"Foxtrot\" and \"Selling England\". But in the wholesome, the production here appears to be rushed and some things were done for the sake of making a double album. Even so, the story appears sort of incomplete and uneven, despite the length. 3 STARS"
    },
    {
      "reviewer": "fuxi",
      "date": "Posted Friday, November 17, 2006",
      "rating": 5,
      "text": "Well, I'll be dashed! Why is this album not in the everlasting Prog Archives Top Five? Surely you cannot deny that its musicianship is superior to any of the things you'll hear on a-certain-album-with-a-fox-in-a-red-dress-on-its-cover? Perhaps some Genesis fans find THE LAMB too wordy? Or are they disappointed by the relatively large number of weak patches on its second disc?Be that as it may, I believe THE LAMB's first disc (and its original A-side in particular) contains the finest sequence of songs Genesis ever recorded. THE LAMB boasts the most exciting intro of any Genesis album and the most remarkable build-up of tension (yes, all on that same A-side).I could devote my entire review to a discussion of THE LAMB's felicities, but I'm sure they have already been pointed out by earlier reviewers. Which prog lover doesn't enjoy Tony Banks' synth solos in 'In the Cage' and 'Riding the Scree', Steve Hackett's guitar cadenza in 'The Supernatural Anaesthesist' or Peter Gabriel's ultra-dynamic vocals in 'Back in N.Y.C.'? Who has never sung along with 'Counting Out Time'? And who will deny that with pieces like 'The Chamber of 32 Doors' or 'In the Rapids' Genesis moved into completely new territory? The raw emotionality of such songs is unparallelled in the band's oeuvre; it would take several solo albums before Peter Gabriel so openly revealed his emotional insecurity again. As if all this were not enough, 'The Carpet Crawlers' is simply the most beautiful song in the Genesis canon. Nowhere else did they equal its simple beauty and grace.But since all of these things have already been discussed on Prog Archives, let me say a few words in praise of PG's lyrics. I'll be the first to admit that, conceptually speaking, THE LAMB is flawed. No matter how you twist or turn it, the storyline doesn't make much sense. Gabriel simply cannot decide if he's on the mean streets of New York City, in a British boarding school ('The Lamia' was based on a poem by John Keats; 'Slippermen' opens with a quotation from Wordsworth), in Lewis Carroll's Wonderland or even in Hollywood... But just listen to some of the lines he wrote! More than on any other album, PG let his imagination run riot here, while his diction remained impeccable. No-one else in prog has such a richly absurd sense of humour; no-one else understood so completely how lyrics ought to SOUND. For example, take the way Gabriel declaims: 'Groucho, with his movies trailing, stands alone with his punchline failing.' Or: 'There's Howard Hughes in blue suede shoes, smiling at the majorettes, smoking Winston cigarettes.' Such lines are not merely entertaining; if you happen to know of more sophisticated use of ASSONANCE in rock, let me know where you found it. As far as I can tell, only Dylan ever was able to match this. Some more examples: 'The fleas cling to the golden fleece, hoping they'll find peace.' And: 'As they nibble the fruit of my flesh, I feel no pain, only a magic that a name would stain'. These final quotations are from songs that evoke a solemn, truly mysterious atmosphere.No, 'a masterpiece of progressive rock' really doesn't seem exaggerated."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Saturday, December 30, 2006",
      "rating": 4,
      "text": "\"The Lamb Lies Down\" was the first Genesis LP I purchased when it was available in the record stores (November 1974). It is also my unique live experience with the band (12 April 75 - Forest National, Brussels).This concert was quite unique since Genesis played two encores (The Musical Box AND The Knife - Le Couteau as Peter will mention in his annoucement). The usual encore was either \"The Musical Box\" OR \"Watcher if The Skies\". We were very fortunate (maybe they wanted to apologize from their previous concert from a year before - you can read my review for \"Selling\" for more details).It is the last album of what is generally considered as the ideal \"Genesis\" line-up. It might also be considered as Peter 's first solo effort, maybe.At the time of release, since information was not as widespread as it is now (no Internet, man : can you imagine ?), I had no clue about what their new album was going to be. My first impression when I saw the number of tracks on the sleeve was a kind of disappointment : not a single long track (10 + minutes I mean). But, after all, most concept albums are in the same vein (the reference for me being \"Tommy\"). Short tracks, with even very short transition moments.Logically I spun side one then side two etc. following the story with the printed lyrics (thank god !) . What intruigued me at once was the incredible story that is outlined in the inside of the album. Grandiose.Even after more than 30 years of listening to it, it is not easy to take out songs out of their context and listen them separately (although I did compile \"my\" version of \"The Lamb\" taking out the weak moments - especially on side 3 & 4).For this review I have used some excerpts of the lyrics (I mention it or put them into brackets). I also have used the story printed on the internal sleeve as a base to describe side one.Here we go !\"The Lamb\" tells us the weird story of Rael, the hero and his brother John. Side one is really strong and consistent.Rael has a \"brother\" John. A sort of image of himself. But Rael does not like John. (maybe he is his conscience ) ? After spending a whole night in a theater, he is hanging around in the streets of Manhattan. Incidently, out of the steam, a lamb lies down. It just lies down on Broadway. \"And The Lamb ...\" tells us this intro.\"Fly On A Windshield\" describes a strange phenomenon that is taking place : a black cloud descends on Time Square and is transformed in a solid wall. It will soon starting to move slowly. Rael wants to escape the cloud and runs. There is so much dust in the air that Rael is completely covered by it. The dust slowly creates a kind of coat which confines and surrounds Rael to such an extent that he can not move any longer. \"The Melodies of Broadway\" revive Rael's memories but he seems to be in a kind of \"trip\" (needles and pins...).He feels like he is wrapped in a coccon (Cockoo !). Rael thinks, I quote the lyrics : \"I wonder if I'm a prisoner locked in some Brooklyn jail, or some sort of Jonah shut up inside the whale\".He realized suddenly that he is in a kind of cave and, resigned, he falls asleep. When he wakes up, the cocoon has gone and stalactites and stalacmites are formed so quickly around him that he will soon be prisoner in some sort of cage. He has the impression that the bars of the cage are moving towards him and begins to press against his chest.All of a sudden, he sees his brother John and cries for help. But John seems to ignore and turns away, leaving Rael alone with his fears and pains. At the same time, the cage dissolves...The last track \"The Grand Parade...\" works very well live but the studio version is not really good (but funny still).Side two opens with \"Back in N.Y.C.\" it is not really one of my favourite : too noisy, too hard (although I enjoy a lot the Purple & Led Zep), but I do not expect \"Genesis\" to produce such a number.The instrumental \"Hairless Heart\" is short, melodious & nice. \"Counting of Time\" is a funny song, and will be released as a single. This song has strong sexual content. Rael will discover his erogenous zones.I quote the lyrics : \"Touch and go with 1 to 6. Bit of trouble in zone No. 7\". Later on \"Getting crucial responses with dilation of the pupils. Honey get hip! It' s time to unzip, to unzip zip, zip-a-zip, zip-a-zip. Whippee\". This side ends up with two of the best tracks where our hero Rael is really into big s h i t.\"The Carpet Crawlers\" is a marvel of a melody and \"The Chamber of 32 Doors\" sounds quite desperate (our hero coming always back to square one while he wants to escape and always return to this damned chamber). Peter's voice is really dramatic during this number.Side three is quite contrasted : three of the poorest tracks (The Waiting Room, The Supernatural Anaestetist and Silent Sorrow...) and three of the best ones (Liliwhite Lilith, Anyway and The Lamia). It is also the darkest side of the story.Our hero meets the blind Lillywhite Lilith who will lead him out of the Chamber. I quote : \"Lilywhite Lilith, She gonna take you thru' the tunnel of night Lilywhite Lilith, She gonna lead you right.\"\"Anyway\" and \"The Lamia\" are the most melodious and emotional tracks from \"The Lamb\". \"Anyway\" starts with a beautiful keyboard intro, and on an acoustic mode. The crescendo will lead to a marvelous guitar break (in the style of \"Firth\" but shorter, alas).\"The Lamia\" is my preferred song : almost lyric and very few solo moments (only some gutar at the end). Our hero Rael, will make love with three half women / half snakes. The song enters into a true erotic novel. I quote : \"Putting fear beside him, he trusts in beauty blind He slips into the nectar, leaving his shredded clothes behind. \"With their tongues, they test, taste and judge all that is mine. They move in a series of caresses That glide up and down my spine\".Just wonderful. Very emotional while played life.The last number of side three \"Silent Sorrow\" is a very weak instrumental. It is said that it was necessary to allow Peter to transform into the Slipperman. Maybe it is true. This would mean that, at the time of writing, Peter already had a pretty good idea on how the show would look like.Side four is somewhat emotional.Our hero will learn that his act with the lamias has a price : he will be turned into an awful Slipperman. But he can't believe what he sees although another Slipperman tells him : \"We, like you, have tasted love. Don't be alarmed at what you see, You yourself are just the same as what you see in me.\"The solution is to go and see the doctor : \"Understand Rael, that's the end of your tail\". Rael: \"Don't delay, dock the dick!\"This is the track where Peter will be dressed up into an awful creature before the metamorphosis took place and he returns then back to Rael. \"Ravine\" is a weak instrumental and leads us to \"The Light Dies Down\" which is a nice variation of the opening and title song of this work.Rael will need to ride the scree and survive the rapids in which he jumped in to save his brother John (I like this one also very much although it is a very quiet tune). In this track he meets his brother John again \"Hang on John! We're out of this at last\". At this time he just figures out that who he sees is not john, but his own face: \"Something's changed, that's not your face. It's mine! Its mine!\"The closing number is a resume of the whole album and quite rocky, hence the final sentence :\"Yes it's only knock and knowall, but I like it like it...\" And yes, I damn like it !The lyrics are incredible. The story ambiguous.I wonder why they never made a movie out of this (Spielberg would have done a good job, I'm sure). Or a musical in ... Broadway ?The Lamb\" is best experienced live. There is unfortunately no live footage of this tour (which will be the last one of this legendary line-up). Since I have seen it, I cannot complain.On top of it, I have seen the show four times performed by the excellent cover band \"The Musical Box\" (including a memorable one at the Royal Albert Hall). Altough one can argue about the use of such bands, I really invite you to go and see them to get an idea of a \"Genesis\" show : they are reproducing every single details of them.Peter went to see TMB with his children, so that they could figure out how \"Genesis\" was performing on stage !The lyric parts of \"The Lamb\" deserve five stars, but musically it is not my preferred \"Genesis\" album (there are six weak numbers). So, four stars.Although it is now regarded as one of the best concept album of all time, it only reached Nr. 10 in the UK (41 in the US)."
    },
    {
      "reviewer": "1800iareyay",
      "date": "Posted Saturday, December 30, 2006",
      "rating": 3,
      "text": "The Lamb Lies Down on Broadway is the ambitious follow up to the prog standard Selling England By the Pound. Peter Gabriel was becoming increasingly restless with the band's extended instrumental passages, leaving him with nothing to do. Thus, he stopped contributing music ideas and instead wrote all of the lyrics for an ambitious concept. Peter decides to expand upon the method of singing he used for the song \"Get 'Em Out By Friday\" on the album Foxtrot, where he sang multiple roles.The concept of this album deals with a man named Rael who embarks on a journey filled with challenges, chief of which is his alter ego, John, who never helps him when Rael is in need. Peter ignores time and space; Rael seems to pop up anywhere without notice.The story loses itself many times throughout the album. I know that Peter put in filler to accomodate his costume changes throughout live shows, but the second disc is ruined by these breaks (Waiting Room, Superantural Anaesthetist, Silent Sorrow). I feel that a masterpeice could have been forged from one disc. Unlike on SEBtP, the album relies completely on the concept; on SEBtP the sngs came off as independent of the concept. Almost no song can be played out of context on this album; it makes Tommy look like an album of individual songs by comparison. Since the concept is too dense and drifts often, the album itself lacks focus.The band plays well as always, but Peter is the center on this album, and his vocal experimentations sometimes succeed but other times are cringe worthy. I'm torn on how to rate this album. I believe every fan of Genesis and even symphonic prog should have this, but the large portion of filler and Peter's hit and miss vocals. It deserves three stars, but I still recommend this album. Read up on the full concept on websites, even among reviews on this site; that will help tremendously.Grade: C"
    },
    {
      "reviewer": "Chris H",
      "date": "Posted Saturday, March 10, 2007",
      "rating": 3,
      "text": "Is this the best album in the Genesis collection? Sorry, but no it is not. The one thing that I enjoy the most about this album, however, is the fact that it is jam packed with over an hour and a half of music to enjoy, and even with all of that music there is not a single song that can be called plain, flat-out \"bad\". Of course, there are many a song that serve their purpose as filler between the main tracks.\"The Lamb Lies Down On Broadway\" is the opener to the album of the same name, and it is one of, if not my favorite track on this whole entire album. Unfortunately when you start out on a high and the next few songs don't live up to that, the listener is sometimes turned off. It's a good thing Tony Banks is out of the cage and able to pound away at his keys to produce the perfect sounds and melodies for \"In The Cage\". \"The Chamber of 32 Doors\" is really the only stand out track left on the first tape/vinyl/disc, whatever you prefer. It is hard-hitting but not over bearing, and with some nice and subtle vocals.The second part is virtually an alter universe image of the first part. Where the first part was fairly stable with some remotely related songs, the second part is mellow and ambient at times and then it springs into some driving rock n' roll. Almost no flow at all. Also, on top of that, only a limited few of the songs are worth seeking out. The first side is virtually skippable, with the only interesting number being the incredibly Beatles- esque \"Lillywhite Lilith\". The second half of part two is a big improvement, with the three-part \"Colony of Slippermen\" and \"The Light Lies Down On Broadway\" standing out as incredible songs.Other than those mentioned, the only other enlightening tracks are the quirky but musically lacking songs like \"Cuckoo Cocoon\" and \"The Supernatural Anaesthetist\" . Also, \"The Waiting Room\" has some good drumming near the end. Besides that, the rest is just filler to provide a build-up for the bigger numbers.The one big thing that I enjoyed about this album is the fact that it is absolutely packed to bursting with music. With over an hour and a half of playing time, you are guaranteed to find at least some things you like. Other than that fact, I don't see why this album is held at such high standards. I would suggest you find some of the other Genesis albums before this. If you can come across this at a fair price, by all means snatch it up. However, I wouldn't recommend breaking your neck and draining your wallet to get this."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Sunday, March 25, 2007",
      "rating": 3,
      "text": "After the magnificence of 'Selling England by the Pound', with its perfect conceptual conceit, GENESIS fell apart while making this ill-advised, sprawling effort. Not content with charting the demise of the British Empire, here the group went on to explore death, eternity, well everything. And they simply were not up to the task.Part of the problem was the way it was put together. Usually PETER GABRIEL'S worst excesses were hidden by the band, but here they are obvious. This is what you get if you let the man do what he wants, ubfettered by group control. Fortunately for us all, he realised this himself and never tried anything like this in his solo career. If this album is the triumph others claim, why did he not do something similar again?And all this after such a promising start. The first two tracks are wonderful: the mellotron moment in 'Fly on a Windshield' and the following commentary is superb. But although what follows makes an interesting collection of good and atrocious ('The Cage', 'Carpet Crawlers' good, 'Back in NYC', the whole second disc atrocious), it simply does not come together as a concept. And I so wanted it to. I still do, 30 years later. If someone could unlock the secret of this album I'd be grateful. (Send me a message from my website at www.russellkirkpatrick.com ...)And that second disc! Oh dear. It's not their best work musically; GENESIS' most die-hard fans don't claim it is. So it stands or falls on the clarity and power of its concept. And, ladies and gentlemen, it falls. Come on, what are we really learning about ourselves here? How can we empathise with the central character? Isn't this just a 'Hogweed' or 'Salamacis'-like romp through classical myth? Out of control. Needs pruning. Needs focus.Borrow this album and give it a listen. That way you'll save yourself some cash. Harsh? Yes. But this miss sits in the midst of a collection of genre-defining hits, and so its flaws stand out all the brighter."
    },
    {
      "reviewer": "Slartibartfast",
      "date": "Posted Tuesday, May 8, 2007",
      "rating": 5,
      "text": "Oh no, not another Lamb review! \"Keep your fingers out of my eye. While I write I like to glance at the butterflies in glass that are all around the walls.\"Not quite the ratings king for old Genesis in terms of stars and quantity of ratings. It's hard to believe I've been enjoying this album for nearly 30 years now. I didn't catch it when it was fresh.I'm rather amused by the reviewers that think this album is overrated or don't get what the concept. For those who go this track or that track is weak kind of miss the point. It's like looking at Dali's Hallucinogenic Toreador and saying \"I don't like the little boy at the lower right or there's just way too many venus de milos.\" The concept is never as explicit as say some of Rick Wakeman's earlier stuff. But I think it is basically a concept album about a very strange dream. It's weird and irrational. Things aren't supposed to be coherent or consistent. I have dreams like that regularly.One of the cooler facts about this album is that Eno provides \"Enossification\". Eno gets around.For whatever the Definitive Edition Remaster did improve on sound quality, the CD booklet only had a good reproduction of the front and back cover art. The inner sleeves on the vinyl version had the lyrics with some cool artwork. Now you just get unadorned lyrics. The artwork that came with the written bit that occurs in the middle of the vinyl cover is also missing. I'm afraid that takes away from it really being a \"Definitive Edition\"."
    },
    {
      "reviewer": "progaardvark",
      "date": "Posted Thursday, June 21, 2007",
      "rating": 3,
      "text": "I guess everyone was doing long-winded double-LP concept albums, so why not Genesis? As is customary with these kinds of bombastic and complicated projects, they usually fail to live up to expectations. So along comes The Lamb Lies Down on Broadway...First, I must say, the story is quite original, certainly a bit weird, and mostly confusing. That I actually do not mind so much. What bothers me the most is the format of the songs, the occasional period of incessant noodling, and the overuse of filler. It clearly seems to me that Gabriel stretched the concept too far so that two whole LPs could be properly filled. Otherwise, the best material on here would take up one LP, or at most 1 1/2 LPs. Generally most of the songs fit a more radio-friendly format, with very little musical inspiration like the 10+ minute pieces that band had done quite well with on previous albums.Highlights for me are Fly on a Windshield/Broadway Melody of 1974, In the Cage, The Carpet Crawlers and Colony of Slippermen. The rest of the album is mediocre, bordering on good. In my opinion, I think this work could have been so much better if instead of separate short pieces that seem loosely tied together only because of the storyline, they would have consolidated the story into a grouping of maybe four 12-minute mini-epics with a more ambitious musical palette. If they really must have a 2-LP set, certainly Hackett and Banks could have provided some excellent extended instrumental sections.But alas, Genesis didn't live up to its expectations and Gabriel's farewell was on a mediocre note. Still many consider this work historically important. I thought about giving it four stars simply because of that, but I can't justify it on those grounds. Thus, three stars it is. Good, but not essential. Definitely worth acquiring if you are a Genesis or Peter Gabriel fan."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Sunday, June 24, 2007",
      "rating": 5,
      "text": "When it comes to Peter Gabriel's lyrics or concepts I don't even try to figure it out, I just kick back and enjoy the music. I agree with others that there is a lot of variety on these two discs, hearing things we've never heard from this band before or afterwards. I want to touch on some of my favourite songs.The first song I will never tire of \"The Lamb Lies Down On Broadway\" it just doesn't get much better than this. What an uplifting song, and check Banks out ! \"Fly On A Windshield\" features mellotron, acoustic guitar and vocals until the sound almost explodes 1 1/2 minutes in with heavy drums from Collins leading the charge. Hackett shines as does Gabriel. Mellotron is back and it continues to flow right into the next song \"Broadway Melody Of 1974\". \"Cuckoo Cocoon\" is too beautiful, just a gorgeous song. \"In the Cage\" opens with vocals as drums and keys build. Passionate vocals are followed by a keyboard solo. What an intense song. Pulsating keys before 6 minutes. \"The Grand Parade Of Lifeless Packaging\" has mellotron and builds to a climax. \"Back In NYC\" has these theatrical vocals from Gabriel and the drumming is fantastic. Pulsating keys from Banks, but it's Gabriel who steals the show. \"Hairless Heart\" just melts me into a puddle, I can't explain why although the mellotron probably helps. \"Counting Out Time\" is another incredible song and they are a having a lot of fun 2 1/2 minutes in. \"Carpet Crawlers\" continues to hit me like \"Hairless Heart\" did, an emotional beauty.\"The Chamber Of 32 Doors\" has plenty of tempo changes and mood shifts with meaningful lyrics. What an amazing song ! I said i would touch on my favourite songs, well that includes all the songs from the first disc as there's not even one average song in my opinion.Disc two starts off great with \"Lilywhite Lilith\" an uplifting song, especially the chorus and the mellotron doesn't hurt either. \"The Lamia\" has fragile vocals and piano for a minute before we get a full sound and normal vocals, this contrast continues. Nice. \"Riding the Scree\" is really the Gabriel and Banks show.The first disc to me is almost on a par with \"Selling England By The Pound\" there is something very magical and special about it making it my second favourite GENESIS disc. And while disc two may not be as strong, this double album is one of the best double's i've ever heard."
    },
    {
      "reviewer": "laplace",
      "date": "Posted Tuesday, July 3, 2007",
      "rating": 1,
      "text": "Presenting Peter Gabriel's amazing backing band, here is \"The Lamb Lies Down on Broadway.\" This reviewer is sensitive to the approach of tragedy and can identify the first warnings of the '80s Genesis on this record, interestingly not perpetrated by everyone's favourite scapegoat...The simple fact is that the music is much reduced from previous, more democratic Genesis albums, and dominated by Peter Gabriel's singular vision. If only it was a good one, eh? Here we have a muddled concept mired in lyrics which can be painfully vacant. I don't appreciate the way Hackett and company are kept on a leash, only allowed to really PLAY on the instrumentals \"The Waiting Room\" and \"Riding the Scree\" - Gabriel still interjects in the latter song but not enough to take the focus away from what Genesis were always so good at doing.Some of the tracks are enjoyable and catchy - \"The Lamia\" is fairly luscious and enveloping, and progresses pleasantly with a melody that makes sense and a little playspace for Gabriel's bandmates. The main theme, repeated in a few ways, is of course quite showstopping. From here there is a precipitous drop in quality, as many songs seemingly exist only to further the convoluted Lamb plot. Frequently melodic but unfortunately predictable, Gabriel gets to sing his pick of the lead lines in a voice that gets gradually more irritating as the album unfolds, leaving solo spots few and far between. Sadly, some of these are not really capitalised on all that well - this, at least, is not Gabriel's fault - and meander, or worse, fail to sound new.I understand that my fellow reviewers see fit to forgive these various tresspasses as the concept's the thing on \"The Lamb\", but I can't agree - to me, the music is always the most important element on a prog disc. I reward Genesis with the lowest mark possible, not because of the pretentiousness and uncalled-for expansiveness evident on the album, but because the music is unfulfilling and, following the exceptional \"Selling England by the Pound\", almost criminally disappointing."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Monday, July 30, 2007",
      "rating": 2,
      "text": "An overly-long, over-rated, unexciting, directionless mess of everything that is bad about Genesis; I cannot express how much \"Lamb Lies Down\" was a dissapointment for me. I admit that the opener has some dynamic energy, but the album as a whole lacks any memorable moments, and spends most of its time fiddling around with theatric psychedelics and a mediocre \"story\" which fail to impress. There are lots of empty spaces, and the spaces which are filled don't seem to accomplish much other than indulge the group's pretention. This is harder to get through than a 10-minute ELP organ solo. For those who are not currently listeners of Genesis, I highly recommend NOT to start here, regardless of how high this pretentious disaster of concept album rates.Songwriting: 2 Instrumental Performances: 2 Lyrics/Vocals: 2 Style/Emotion/Replay: 2"
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Tuesday, September 18, 2007",
      "rating": 3,
      "text": "This is an extremely difficult album to review. As an old Genesis fanatic I much rather hear Foxtrot or Selling England By The Pound. This is not to say I don�t like this CD. I do. I think the story is fantastic, even though I�m not sure if I did really understand the complete concept (does anyone?). The music is what annoys me. Sometimes it sounds like a movie soundtrack: when you�re looking at the pictures (lyrics) it all makes sense. Without them it does not always work. There are some brilliant tunes here and there, and again I still think that if you�re not following the storyline - no matter how hard and confusing it may be - they seem awkward.So, in the end, if you�re not in the mood to hear the whole story and picture the scenes, there are few songs here that pleases the listener (The Carpet Crawlers and In The Cage are great tunes on their own). Like some reviewers pointed out, it would be a masterpiece if it was a Peter Gabriel solo project. As a Genesis album it really disappoints in many aspects. I was expecting more instrumental parts, and more fine melodies too, from such a fantastic and talented line up.As a visual show I�d Land Lies On Broadway a 5 star rating (like I saw The Musical Box staging of this piece). As an album, specially as a classic Genesis album, it lacks in melody and more dynamic playing. 3,5 stars."
    },
    {
      "reviewer": "progrules",
      "date": "Posted Friday, October 26, 2007",
      "rating": 3,
      "text": "Like almost every real prog fan I am, too, a big Genesis fan and it goes without saying we are talking about the period until 1977. Within this period there will always be albums you like better than others and there will also be a number last in that range. And I'm afraid for me that's this album, maybe equal with Trick of the Tail. But what's lacking in this album is a real highlight, at least one song because of which you can say: this is a real great one. Another option could be: a great album overall without a special highlight but that's not the case here either, at least not for me. There are too may insignificant songs on this album. Maybe it's strange because it's a double album, so you would think: a real treat. But alas, not for me I'm afraid. Better songs are: The Lamb lies down on broadway, Carpet Crawlers and In the Cage, but like I said: no real highlights. 3 stars."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Wednesday, November 14, 2007",
      "rating": 4,
      "text": "Review 13, The Lamb Lies Down On Broadway, Genesis, 1974StarStarStarStarBecause four great albums weren't enough for Genesis. A very interesting change in format took place between Selling England By The Pound and The Lamb. There are no really extended songs, although The Colony Of Slippermen and In The Cage are reasonably long, some of the songs move into psychedelic and ambient territory and the album has a much more American feel than anything Genesis had previously done; lastly, the excellent lyrics are always related to the concept, and are often narrative. On the minus side of these developments, I feel that fades are overused, when they aren't generally needed or feel out of place. Overall, an album that is on a par with other Gabriel-era efforts, and certainly not to be missed.Beginning with a supple piano solo, The Lamb Lies Down On Broadway is very much representative of the album as a whole. Brief, with compelling drums and a great lead bass part, Hackett sounding suspiciously like a piano (!), clever, small background additions to give it more depth, diverse sections, musical foreshadowing of the later Carpet Crawlers. Great, biting lyrics and vocals from Gabriel, and an acceptable fade.'There's something solid forming in the air'. Soulful guitar and vocals leads into the powerful, gripping Fly On A Windshield, with Hackett, Banks' and Collins driving right past the ears and into the brain. Intelligent, constructed, and brilliantly-delivered lyrics from Gabriel here. An absolutely stunning track. The highlight for disc 1, and one of Collins' best drum performances. The beautiful Broadway Melody of 1974 is tacked onto the end of this.Cuckoo Cocoon is decent, but doesn't really stand out. Does what it was intended to do, lyrically and psychologically, and prepares neatly for the driving In The Cage, but doesn't really go beyond it. Also has a weird slightly delayed guitar sound that doesn't work that greatly here. Not bad, but unexceptional.In The Cage. What to say? No doubt the most widely-favoured track of the album, with a moving bass-and-vocals opening, leading to a driving, powerful keyboard riff, with good lyrics, occasional changes in mood to heavier or more serious-sounding sections, and then to lighter, more frivolous sections and back again. A very strong song, and vital for those who consider Banks' solos and Gabriel's voice the highlights of Genesis.The Grand Parade of Lifeless packaging is brief, enjoyable, random, mostly mindless music, with a heavy focus on the chaotic distortion by Brian Eno. Acceptable, but not my thing.Back In New York City is essentially a relatively normal song. Fairly weak, but probably concept-crucial lyrics, near-punk vocals from Gabriel, and a generally amusing main theme, though it gets a bit repetitive after a while. The chorus is great, catchy and quirky, much like Jethro Tull's Locomotive Breath: embarrassing to sing along to, but I can't help it.Hairless Heart is a beautiful quiet instrumental, led by Hackett (acoustic + electric guitar) and Banks (mainly synths), with Collins providing an appropriate drum beat.Counting Out Time is, in my opinion, the funniest (though not the best) of the Genesis humourous songs, with a pretty amusing concept and lyrics, whimsical music (held up by a guitar riff and bass) and a hilarious guitar solo. Gabriel's tentative, questioning vocal fits the song perfectly, and the harmonies/fade on 'Without you mankind handkinds through the bluuues...' are delightful every time.Carpet Crawlers simply doesn't interest me at all. I like the piano tune, I like the music, I like the vocals, but I don't like the song. I don't know why, but it leaves me absolutely cold every time, and occasionally even annoys me. Still, one of the widely liked songs on the album, and perhaps would be the highlight for any ATOTT fan.The Chamber Of 32 Doors begins with a great solo from Hackett, and superb drumming from Collins, though most of the song is dominated by Gabriel's vocals, Banks' piano and the bass. There are some beautiful lyrics here, 'I'd give you all of my dream...if you'd help me find the door...that doesn't lead me back again...take me away.'. A superb conclusion to the first CD.The second disc opens with a nice, somewhat explosive pop-rock tune, Lily-white Lillith. Great harmonies, powerful music, a bit of Hackettry, good lush keyboards from Banks, great vocals, and a good echo of the Broadway Melody of 1974 on the end.The Waiting Room is certainly psych rock, though other tracks on the album and the way the album's constructed as a whole have a psych-y feel to them. A gradual progression with tingling, orderless percussion, screeches on the guitar and synths, with several themes being dabbled with and developed or dropped, explosions and an emergence into a full band piece, which continues to develop and shine. Complete and utter chaos, and something that took me a while to acquire in context, but completely my thing.Anyway is my highlight for the second CD, with a gorgeous piano part courtesy of Banks, Gabriel's searing, echoey vocals, strong, original lyrics, relating to delirium and death. The sprawling piano on the instrumental break in the middle leads to a truly stellar guitar solo from Hackett and then returns to the main theme with added synths (or possibly guitar that sounds like synths), more vocals, percussion and some organ.The Supernatural Anaesthetist is essentially Hackett on the loose, with Banks and Rutherford shadowing him. There are a few vocals on the start. An interesting combination of ways to play guitar, and the narrative (see the CD booklet) comment on the events taking place is absolutely priceless.The Lamia is a soft multi-part song, showcasing Gabriel's vocals and lyrics (beautiful and at the same time advancing the story) and Banks' piano and keys, though Collins and Hackett are both very important in places, and the drumming stands out. A real grower, and a standout track on an excellent album.Silent Sorrow in Empty Boats is interesting, with some more of that tingly percussion, a single repeated slow riff at various volumes, choral additions (probably done with some sort of synth, I guess) and interesting overlaid music.The Slippermen begins with a minute and a half of seemingly random psychedelic noodling, and then dims to prepare for the most surprisingly explosive 'bubbity-bub' in the history of rock, followed by an extensive, silly song with great solos on keyboards, some well-concealed additions on guitar, great, eclectic drumming and addictive riffs. Superb vocals from Gabriel, with lots of small harmonies, and whimsical lyrics. A great fade here, and absolutely seamless music. Really good fun to listen to, and the weirdness hasn't grown old on me yet.Ravine is a somewhat darker continuation of the Silent Sorrow... idea, with the same riff, but very different in its sound.The Light Dies Down On Broadway is an echo of the album's opener, and absolutely great, with a compelling drum performance. More great vocals, and very strong lyrics (IIRC, from Collins, here). Good organ from Banks, and an enjoyable bass part.The somewhat dancy Riding the Scree is an oddity, with a great rhythm section (Collins sounds like he's crossed himself with Mike Giles), blaring soloist keyboards, and a nice vocal. Great stuff.In The Rapids is opened by Hackett, who's a strong presence throughout, together with Gabriel. Rutherford twangs on the bass once or twice, while Collins adds his own style. Essentially an atmospheric lead-up to It.'It' has very catchy music, and great vocals, with lyrics that only really make any sense in context, but are still enjoyable. Fairly memorable performances from everyone involved, and the synth screech moving to the guitar riff is great. A good closer to the album.All in all, a very strong four star effort, though it may take more time to get the same position of pride as other Genesis albums. Completely atypical of Genesis at the time, but nonetheless highly enjoyable, with a great mixture of styles. Perhaps too great a mixture of styles for the band's own good, since it seems unlikely that everything on the album will appeal to the average listener. Two discs of great material, and worth getting even at the price.Favourite Tracks: Fly On A Windshield (disc one), Anyway (disc two)Rating: Four starsEdit: Old review replaced with shiny one that I wrote after shaping up a little. Truly Lucassed."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Monday, November 19, 2007",
      "rating": 4,
      "text": "The last Genesis album with Peter Gabriel is a concept album. Allthough I love this album I still think that it is the weakest of the Gabriel albums with Genesis. There are actually some pretty superfluous songs on the album ( The Waiting Room, Silent Sorrow in Empty Boats, Ravine), and personally I don�t like Back in N.Y.C. City at all. With this said, some of my favorite Genesis songs are on The Lamb Lies Down on Broadway.The Lamb Lies Down on Broadway is not as progressive as the previous albums, and there are no real Epics on the album. What you get instead is a lot of beautiful and unusual songs from Genesis. Luckily not in standard rock radio structure yet.I�m not going to comment on every song, but pick my favorites from this great album.The Lamb Lies Down on Broadway is centered around a Tony Banks Piano piece played at great speed. This is the perfect beginning to this beautiful album. This is a great rock song.Fly on a Windshield is one of my favorite Genesis songs. Peter Gabriel is really emotive on this one and he delivers one of his best vocal performances. The underlying repetitive rythm is really cool too.Cuckoo Cocoon is just a lovely light and beautiful song. The flute is so beautiful, and the guitar and the piano plays nice below the great vocal melody.In the Cage was a song I had to get used to. But it really is very nice and one of the few almost epic songs on the album.Counting Out Time is one of my favorite Genesis songs. It�s a bit more pop than I usually like, but it always makes me smile. The lyrics are so funny, and evolves around the subject of erogenous zones and the dissapointment sex sometimes can be. It seems totally out of context with the rest of the album, but what a blessing it is. Listen to the bizarre sound on the solo, it�s a real treat too.Lillywhite Lilith is another favorite of mine. The vocal delivery is again beautiful and the melody just clings to my mind. The rythm in this song is very cool and defining for the track. Note the beautiful backing vocals in Lillywhite Lilith by Phil Collins, they are really something special.Well what can I say another favorite of mine is Anyway. Another song which is based on a Tony Banks piano piece. This is one of the best melodies Genesis have ever made in my opinion. The song has some great guitar from Hackett too, which I have to mention.The Supernatural Anaesthetist is a great almost instrumental song. Peter sings a little in the beginning of the song, but the rest of the song is an unusual instrumental track. A really progressive one.The Lamia is a really emotive song and a beautiful one I must say. It�s subtly symphonic and arranged very well.Colony of Slippermen is one of the songs I had to get used to. It might be the most progressive song on The Lamb Lies Down of Broadway. Peter sings voices for a couple of characters in this song and it�s really cool. Some great instrumental passages are worth mentioning too.It. has to be mentioned too as it is a high energy Pop/ rock song. Really a very positive song with the ultimate message that: \" it�s only rock�n�roll but I like it\" What could be more true ?I am undecided if this should be ranked as a masterpiece, because as I stated in the beginning of this review there are some pretty superfluous songs on the album and one really bad. On the other hand there are lots of good and beautiful songs on the album as well, so I guess this is a 4 star album after all. It is very essential in the history of prog though."
    },
    {
      "reviewer": "Garion81",
      "date": "Posted Wednesday, May 14, 2008",
      "rating": 5,
      "text": "The End of an EraSo many different takes in these reviews before this that it is hard to believe that in mine I am going to offer broad insight to this semi-controversial album. I say semi because it remains over 4+ stars after 400+ reviews so I think the consciouses it is a relevently good progressive rock record.I listened to the album in its entirety again before writing this (OK one bio break and two minutes to heat up some chicken for lunch) to add to the hundreds of times I have listened to it over the years. I am struck how much this album flows together when you eliminate sides and albums. I don't agree songs are filler when they are as well played as some of these like Anyway or even Silent Sorrow in Empty Boats since they move the story along. Even if you do consider them filler they only take up 6 minutes of a 94 minute album. Of course if anyone says Riding the Scree is filler or doesn't have one of the best Tony Banks solos is not listening hard enough or The Waiting Room, initially titled Evil Jam which has the most abstract and experimental sound Genesis ever did. The album contains some standout moments to be sure but the whole thing needs to be taken into context not the sum of its part. This is a narrative of sorts and even narratives have slow moments to set the stage for more momentous. That doesn't make those moments bad in fact they are necessary. A deep breath before the plunge.To me this album is darker than SEBTP as is the story that it tells. The grit of NYC is felt in the opening track and Back in NYC. The horror of being trapped in the cage is felt. The crush of choice in the Chamber The beauty of the Lamia and the struggle of choice In The Rapids. The redemption of sorts with IT. When I hear it it makes me want more that, no, the story doesn't stop here but in the end it does and so did Peter Gabriel's time with Genesis. The Light Dies Down on Broadway and on Gabriel.I think this album is beautifully written, played and produced. A lasting tribute to Peter Gabriel and the initial road for all members of Genesis. I have rated the three before it 5 stars and this will be the 4th. and there is still one more to go..."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Wednesday, June 18, 2008",
      "rating": 5,
      "text": "Fascinating how different and diverse the tastes of human beings can be---even within a group of people with passionate interests in a certain category of music/art. I say this after reading many of the ProgArchives Collaborators' reviews of Genesis' The Lamb Lie Down on Broadway. How I can absolutely adore groups like Focus, Harmonium, Renaissance, Nektar, Supertramp, Genesis, Cocteau Twins, Kate Bush or singular albums by the likes of Uriah Heep, Tears for Fears, Peter Gabriel, Bill Nelson, David Sylvian, doves, U2---all of whom I consider 'progressive' for their sonic and structural innovations, experimentations, and uniquities---how I can like and appreciate King Crimson, Pink Floyd, The Alan Parsons Project and yet detest other revered groups such as ELP, Jethro Tull, and Rush is such a perplexing mystery to me, but, there it is. There we are. We can agree to disagree. I guess the bottom line about these reviews is that we all like to hear our own voices, we all like the opportunity to be able to freely express our opinions, so ProgArchives, thank you for that. Before I go deeper into my personal review, I will put out there that The Lamb is, for me, the single greatest prog album of all-time. Nothing else comes close in terms of seemless quality, story, engaging mood, musicianship, experimentalism, and sheer consistency. Lyrically, Gabe achieves some of the most poetic phrasings and vocal deliveries ever on record. In my years as an audiophile, I have been in constant search for 'the perfect album' or, what used to be 'the perfect side' of an album (33 1/3 LP). In my experience, it is truly a rare thing. The Lamb, IMHO, has not one but two \"perfect\" sides (Sides 3 & 4). Though I never got to see The Lamb tour, I did get to see Gabe do \"The Lamb\" as his only encore in a concert in November of 1978 in Nancy, France (with a perky little Kate Bush as his warm-up and Robert \"Dusty Roads\" Fripp playing from behind the stage equipment and a very able Sid MacGinnis [with David Letterman & Paul Schaffer's Late Nite Band since c. 1980])---makeup, leather jacket and all.Side 1, song 1: \"The Lamb Lies Down on Broadway.\" The distinctive signature of the album, Tony's piano, the bass pedals, Phil finessing the toms and snare, crashing the cymbols, such a great mix/balance of all band members. (Remember: the band recorded the music without Gabe's presence. Let's face it, with 90 mins. of music sans lyrics, they had to be pretty contented and excited with themselves.) Wonderful key, tempo and instrumentation shifts. (9/10)1.2: \"A Fly on a Windshield.\" A sublime song with beautifully eerie keys, 12-strings, and truly masterful diction/pronunciation with Gabe's singing setting Hackett and Collins up for an unusually relaxed though emotional climax, (10/10) all blending into: 1.3: \"Broadway Melody of 1974.\" A song meant to be carried by the lyrics, I suppose. (8/10)1.4: \"Cuckoo Cocoon.\" Great Trespass-like music with Gabe's oddly treated voice. Great to here the flute again. (9/10)1.5: \"In the Cage.\" A later concert fave with odd lyrics you find yourself wanting to learn � la Jon Anderson's Yes lyrics. The confidence to start a song with voice and single bass note! Once it picks up, Phil and Tony must have had fun with this one! (8/10)1.6: \"The Grand Parade of Lifeless Packaging.\" Takes you for a carnival rollercoaster ride! More fun for Phil and Tony, though the song uses the usual formula of slow soft start as it builds to a crescendo of cacophony (including Steve's \"note\"). Still, I imagine the last two songs were adrenaline highs for the musicians. (9/10) Side 2, song 1: \"Back in N.Y.C.\" Vocal and musical melodies a little drawn out and repetitive but a great song that builds and builds to the gooseflesh-producing moments of Gabe's scream and the clanging piano chords at the beginning of the second verse and, of course, the bass synth slide accompanying \"till I burn it to ash.\" Yes, the \"As I cuddled the porcupine,\" and \"fluffy heart\" sections subtract a little from the power and momentum, but, overall a great song. (8/10)2.2: \"Hairless Heart.\" (9/10) A brief instrumental/interlude with an interesting title, which gives Hackett a small outlet before he has to pick up the banjo for:2.3: \"Counting Out Time.\" One of Gabe's most amazing lyrics; such a change from the metaphors hidden under cloaks of mythical stories. Love the banjo and Tony's perfectly silly synth sound used for the sound after \"Whoopee!\" (10/10)2.4: \"Carpet Crawl.\" What a mood shift! One of those songs whose vocal presentation of aural poetry serves as a balm to the ears and the soul. Brilliant song, brilliantly mixed! God that guy can write and deliver lyrics! Thank god for the musicians' restraint in setting this one up for Gabe. (10/10)2.5: \"The Chamber of 32 Doors.\" Hackett! Seems like he's been in the background since \"Fly on W.\" Another lyrical gem, this time in true prog showcase, with the musicians contributing equally, with quite complex time and mood changes. Another reminder that thus far this album is void of a lot of instrumental showcasing (solos). (10/10)Now to the meat of the album. (Who cares what Rael's up to, it's the music ahead which blows me away.)Side 3, song 1: \"Lilywhite Lilith.\" Boldly opening side 3, Gabe's confidence soaring, Mike's bass and Tony's keys pounding, (9/10) \"A blaze of white light fills the air\" prepares us as we fall into the eerie emotions conjured up by: 3.2: \"The Waiting Room.\" Very cool experience---especially under the influence. Love the exit---especially Collins mashing away! Awesome! (10/10)3.3: \"Anyway.\" Exactly! Beautiful key melody setting up another Gabe foray into the realm of Salvador Dali, and then, for a brief, hair-raising instant: HACKETT! (10/10) 3.4: \"Here Comes the Supernatural Anaesthetist.\" One of my favorite Genesis songs: \"He's such a fine dancer!\" Thank you, Peter, for resigning yourself to sitting back and watching the amazing talents of your band-mates, especially Phil and Steve. Alas, all too brief. (9/10) 3.5: \"The Lamia.\" IMHO Gabe's most amazing performance as a Genesis vocalist. The timbres and pronunciations of his poetry are inimitable; the imagery and mood heart-wrenching. Rael's story becomes, for me, fully engaged, internally sympathetic. An amazing song instrumentally, as well, with subtle but strong and tight performances from every single band member, the end, where Hackett also gives perhaps my favorite solo of his, is a special treat. There's even Gabe's flute joining in at the end! As polished a song as Genesis ever did in the \"five\" format. (10/10)3.6: \"Silent Sorrow in Empty Boats.\" I LOVE the \"enossifications\" on this album (as I love Brian Eno's work everywhere). Subtlety, mood; the silence of floating put to music (kind of like his \"Julie with\"). (10/10) A peaceful, meditative end to one of the most awesome album sides ever put together.Side 4, song 1: \"The Colony of Superman.\" \"The Arrival\" provides a mood prep for the transition from \"The Lamia/Silent Sorrow\" to \"A Visit to Doktor Raven.\" The story is in full gear, we are truly on board with Rael and John, we can't help but \"Show some concern\" as Gabe takes us through a harrowing ride to self-discovery and rebirth. (9/10)4.2: \"Ravine.\" Another awesome little instrumental interlude. Wish it would go on forever. (10/10)4.3: \"The Light Lies Down on Broadway.\" Very cool recapitulation of the opening score in a slowed down, instrumentally varied quilt. Love all the instrumental restraint and electrically treated instruments of this song. Actually like it better than the opener. (10/10)4.4: \"Riding the Scree.\" Take a ride with Tony! He'll show you what makes a prog keys-man stand out � la RWakeman. Too bad Gabe had to come in so soon, tho' love his \"Here I go!\" (10/10) 4.5: \"In the Rapids.\" Give me those treated 12-string guitar chords that begin this song over and over: Heavenly. Another AMAZING Gabe lyric and virtuosic delivery. Special thanks to Phil's stellar work on the kit. Progwork at its most emotionally potent. (10/10)4.6: \"It.\" Lyrically, such an intriguing song, (love all the references to other classic songs). Musically, an amazing finale to an amazing album. Everybody riding on high energy, Steve, of course, loving the tempo and showcase. Brilliant. Like an anthem. (9/10) Every time I leave this album, with this song, I am energized, ready to jett� through my day. Thank you, Genesis Five, for this: The Pinnacle of progressive album rock. (5 stars)"
    },
    {
      "reviewer": "The T",
      "date": "Posted Friday, July 4, 2008",
      "rating": 4,
      "text": "This album has so many reviews that, for once, I'll try to just give a quick opinion in only two paragraphs. We all know what an excellent band GENESIS was, we all know how fantastic the albums they released were, and \"The Lamb Lies Down on Broadway\" is one of them.In my view, the album is slightly long, at more than 90 minutes, and its complexity (especially in concept, but also musically, as the songs are shorter but the tunes less friendly) makes that duration become a burden. With easier concepts like in \"Selling England By The Pound\" or with friendlier, more accessible melodies as in \"Foxtrot\" this 90-minute monster would've been a breeze to walk through. But Mr. Peter Gabriel's weird ideas about a Puerto Rican youngster in New York's brightest street are matched with obscure music, simpler in form but darker in mood and catchiness. There are moments that capture our attention (\"The Cage\", \"Back in N.Y.C\", among others), but some are rather forgettable and force me to give this album \"only\" 4 stars.There you go. My opinion in just two paragraphs. I wished Mr. Gabriel would have been able to do the same and make it shorter when he wrote this flawed masterpiece."
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Saturday, July 19, 2008",
      "rating": 3,
      "text": "The grand parade of lifeless packagingIn my view, the Peter Gabriel-era Genesis peaked with the masterpiece Selling England By The Pound in 1973. The following year they released this conceptual double album with a running time of close to 95 minutes! I think it is fair to say that this album is very different in comparison with earlier (and later) albums by the band. While a few songs, like The Cage, Carpet Crawlers and The Colony Of Slippermen, are in the style of earlier albums, many songs are in a different and more direct and concise style - a precursor to the more commercial direction both Gabriel and the band would take in the 80's? Or maybe a return to the 60's Pop of From Genesis To Revelation?Double albums are always a tricky business and I'm sorry to say that, despite several very good moments, this album suffers from some incoherence and inconsistencies. It could have been reduced to a single album, possibly making it more unified. But even the best moments here are behind the greatness of earlier (and some later) albums. The story behind the album is very hard to follow and as such it fails to hold the rather disparate music together. As I said, there are some very good moments here, but also some rather weak ones that bring the album down a bit.There are some very nice guitar dominated instrumental tracks like Hairless Heart and Fly On The Windscreen (the latter is only mostly instrumental), both of which have been played live by Steve Hackett and his solo band in recent years. Other instrumentals like The Waiting Room are ambient noise-experiments that I find totally useless for the most part. I guess that Brian Eno, who contributed to this album, had more than a hand in that one?Peter Gabriel would leave the band after this album, and they would continue without him, going on to make, in my view, far better albums like Trick Of The Tail and Wind And Wuthering (two of my all time favourites).The Lamb Lies Down On Broadway is, in my opinion, theleastgood Genesis album out of the nine they did from 1970 to 1980 (i.e. from Trespass to Duke). Still good though, but not more than that."
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Friday, August 1, 2008",
      "rating": 5,
      "text": "Genius!My review on this album will be simply concrete!This is the best Genesis' album.It is one of the best albums of all time in music history.In terms of progressive music,it is a candidate for the best progressive album of all time.It is one of my bests.This album is quite different from the other releases by Genesis.The quality of the albums between Nursery Crime and Wind & Wuthering are perfect,but this is one level over the perfection.The sound is crystal and completely accomplished, the musicianship is great, the songs are memorable and complicated.This is concept album and rock opera (probably the best one),too.Although,the album is double and long,there isn't weak moment anywhere.The Lamb Lies Down On Broadway contains most of the greatest Genesis' song like The Lamb Lies Down On Broadway,In The Cage,Back In N.Y.C.,The Carpet Crawlers,The Chamber of 32 Doors,Lilywhite Lilith,Anyway,The Lamia,The Colony of Slipperymen and It.I don't mention the other,because thay are short intro and overture-like songs,that make the connection between the truly songs and they make it more than well.The album marks the end of Peter Gabriel's period at the band and it marks it in remarkable way.A magnum opus of everything we have to do on this planet."
    },
    {
      "reviewer": "Thul�atan",
      "date": "Posted Friday, December 12, 2008",
      "rating": 5,
      "text": "'The Lamb' - without a doubt, the ultimate Genesis album, and simply one of the best albums of all time. Equally without doubt, an album that demands serious commitment from the listener if it is to be fully appreciated. With previous albums, though they are excellent of course, Genesis still stood with one foot in the realm of accessibility - they were fairly short, with distinct standalone tracks to get to grips with individually, offering a relatively easy way into their world of complex symphonies and twisted imagery. But 'The Lamb', seeing their one previous extended piece 'Supper's Ready' as a green light, presents a double concept album of near-continuous music - a complete story told through ninety-five minutes of rich progressive rock by five outstanding musicians at their most energetic and experimental. Just like Yes with 'Tales From Topographic Oceans', you have to accept that the band mean business.The story that sews the album together, written by Peter Gabriel, appears in prose form in the album's sleeve as a more literal guide for audients, and then of course as the lyrics themselves. Along with most Genesis material of the Gabriel era, the complicated and often fiendishly humorous lyrics have been much maligned over the years, by the journalists determined to label anything prog 'pretentious nonsense' and even by actual fans of the band who nevertheless consider them silly and incomprehensible. While I sympathise with both views, I agree with neither of them and would say it only takes a fundamental grasp of metaphor and the epic allegory to start appreciating just what Gabriel was doing. Much more difficult is the dense catalogue of references to American history and popular culture early in the album, which Gabriel uses masterfully to paint a rich backdrop and help him invest his unsettling, abstract notions with the familiarity of iconic figures and events. Daunting as they may seem at first, understanding the subtle meaning in each of the references proves to be less important than the overall effect of their busy procession, symbols of an era. My one slight niggle here is that the liner notes really are essential in providing a full context for the story, since the presence of instrumental sections and the lyrics (being completely entrenched in Rael's own perspective) leave gaps in the continuity when standing alone. Nevertheless, Genesis do offer this as a complete package after all, and I for one am prepared to take it as such.One typical bustling night on Broadway, New York City, Puerto-Rican punk Rael (representing the everyman, if a little rough around the edges) is roaming the streets when he suddenly observes a lamb emerging from the steam by the side of the road. Right there on the pavement, amidst the clamour of modern city life, the animal just lies down. The image has an undertone of the loss of innocence, even death - but more importantly it's a creepy, out-of-place herald that something's about to begin... In moments, a vast solid wall materialises in Times Square and starts to sweep across the city, freezing in place and absorbing everyone and everything in its path - Rael watches in horror, but nobody else around him seems to notice or care about the danger (ever feel this way?) As Rael himself is caught in the wall, he is thrust into a surreal journey of self-discovery, through a nightmare world composed of bizarre landscapes, hideous caricatured personifications of common human attachments and dispositions, and memories of his own past. It's a 20th century purgatory where he must come to terms with himself while also seeking escape from the pitfalls of modernity: the growing artificiality and commercialisation of human lifestyle in 'The Grand Parade Of Lifeless Packaging'; absent-minded social inertia in 'Carpet Crawlers'; the tendency to take up a stereotypical role in order to give life some direction in 'The Chamber Of 32 Doors'; seduction and insincerity in 'The Lamia', followed by slavery to one's own sexual desires in 'The Colony Of Slippermen'. How many other manifestations can you interpret?Musically, 'The Lamb' is as broad and complex as the band would ever go, with each musician really pushing the expressive capabilities of their respective instruments - Gabriel's voice included - to create a restless fusion of complementary forces. It is often said that ideas are spread too thin on this album, but nothing could be further from the truth - 'The Lamb' is brimming with ideas, painstaking composition, and polish. Rock band format it may be, but the tradition of combining styles and aiming for a grander, timeless sound is very much present, and as with all the greats it's impossible to tag this as any genre other than progressive - this is deeply emotional, fiercely cerebral, and truly cinematic music. Totally four-dimensional, there is plenty of dynamic variety along the way, from the full band blowouts of the title track and 'In The Cage', to gentle contemplations like 'Hairless Heart' and 'In The Rapids', to open ambiences such as 'The Waiting Room' and 'Ravine'. It can generally be seen as a much more electric album than before: the 12-string acoustic guitar passages prevalent in the band's earlier works feature only rarely, as effects-laden electric guitars and newer synthesiser tones come to the fore (there are still hefty doses of acoustic piano, though, forming the foundations of 'Anyway' and 'The Lamia'). However, not an ounce of Genesis' classic delicacy is lost in the shift - no walls of sound can stop the searching melodies and powerful chord sequences from shining through, and every part that every instrument plays is tailored for maximum effect.To match the warped, introspective nature of the story, the music evokes a range of atmospheres from the eerily inviting to the downright unsettling, some of my favourites being the ghostly intro to 'Fly On A Windshield' and the captivating grief of 'Silent Sorrow In Empty Boats'. There are also rare flashes of more accessible hooks, as in 'Counting Out Time', 'Carpet Crawlers' and 'it'. Most difficult to explain in a review is the album's overarching mood... a cloying blend of recognition, layered meanings and close-to-the-edge madness unique to this kind of immersion into a persistent, self-contained, Alice In Wonderland-type world... in many ways it is this which makes 'The Lamb' so special. Some examples of the disturbing images captured would be: imaginary creatures trapped on film at the moment of their birth; Rael's desperate consumption of the Lamia when they appear to die before his eyes; and the eleventh hour where he is finally able to look at the face of the brother he has followed at great cost, only to find that it's his own face staring back at him.To attempt to counter a few common criticisms of the album:'The first disc is great on its own, but the second is weaker and has lots of filler': Well, bearing in mind that there is consistently challenging music across both discs, I wonder if most listeners are just more used to the single album format and start struggling to pay attention after the first 45 minutes. Personally I'd find it hard to choose a favourite disc out of the two, and if the length is a problem I think the next fairest way to experience 'The Lamb' is to treat it as two separate albums and make sure each one gets equal, listen-from-fresh airtime.'The band was breaking up at this point, so the album is rushed and uneven': As has now become well documented, the composition and recording of 'The Lamb' proved quite difficult for Genesis, with most of the band putting the music together in isolation from Gabriel, who insisted on writing all the lyrics whilst also coping with the ill-health of his first child. However, as Gabriel has said himself, sometimes your best creative work can be born in times of unusual circumstances and stress, and I'd say this is definitely true of this album - it sounds confident and exciting throughout, and the lyrics marry so perfectly with the music that it's hard to imagine the two elements were ever dreamed up separately. It is possible for the quality of music to surpass the intention and understanding of its creators, it seems... especially in prog!'There is no proper ending to the story': Read up on existentialism, then come back.While by no means the easiest album to get into, being too large-scale to work without significant open-eared investment from the listener, have no doubt that this is a masterpiece of narrative-driven progressive rock music, and a triumphant farewell from the band's first, best and most charismatic frontman."
    },
    {
      "reviewer": "J-Man",
      "date": "Posted Saturday, December 13, 2008",
      "rating": 5,
      "text": "This is incredible. In case you don't know much about prog history, this is the last album with Peter Gabriel in Genesis, and let me tell you, he left this ultimate prog lineup with a great last album. The Lamb is a 90- minute concept album, and is arguably the best concept album ever. The lyrics (almost all written by Gabriel) are superb, and tell one of the best stories in all of prog. The story is about a guy named Rael who loses his brother John, goes through many obstacles, then once he finds John he discovers that John is actually himself. It's a long story (90 minutes to be exact), and it really seems weird as a retelling, but on the real album it's great. Now, the lyrics aside, the music's great too with great amounts of skill shown.DISC 1:The opening to this disc is the title track, which is a great opener to the concept and the great music ahead. FLY ON A WINDSHIELD is a great section to the album, and is one of the best of them all. Skip a couple of sections, and you'll get one of the highlights of the album IN THE CAGE. It has a very dark and superb theme, and has one of Banks's best solos in Genesis. It is also a critical part in the story of The Lamb. Skip some more sections, and you'll get BACK IN NYC. That section to the end of the disc some of the best from the whole Lamb.DISC 2:The opening to disc 2, LILYWHITE LILITH, is another upbeat section in The Lamb. This is followed by THE WAITING ROOM, which took time to grow on me, but now I like it. ANYWAY is a great darker song, similar to THE LAMIA that appears later in the album. Later in the abum THE COLONY OF SLIPPERMAN appears, and is one of the most incredible parts in the album. However, thebest part is really the ending songs. The keyboard solo is inredible, and the last section, IT, is a great ending.Really, this is a must own. Everything's great, and it's one of the best concept albums, and one of the best overall albums. A MUST OWN for every prog fan."
    },
    {
      "reviewer": "crimson87",
      "date": "Posted Wednesday, January 28, 2009",
      "rating": 4,
      "text": "I still don't get a clue what is it about. And You?I remember when I first heard The Lamb I was really pissed off. Just by seeing the song duration I realized something had changed in comparaison to SEBTP or Foxtrot. And after an hour and a half of appreciation my thoughts had became true.There are no epic songs on this record , the longest one of them is The Cage clocking at 8 minutes. Moreover , there are no incredible instrumental passages here for musicians to show his talent ( Steve Hackett didn't like this fact of the record) and finally , the concept is a mess. So , If I were to appreciate The Lamb , I knew I was going to have a really hard time dealing with it. And 40 listens after , I can say that this record ain't half bad.Actually when you get used to the Gabriel's overdose that is all around LLDOB ; you can say that 70 % of the record is a masterpiece. Yes , probably the first LP may be a total hit featuring some of the finest Genesis compositons like The Chamber of... or Carpet Crawlers. Musically I have to say this record features great use of the synthetizers by Tony Banks , specially on that solo on In the Cage or the instrumental part of Fly on a Windshield. The Lamb features some of the best drumming Phil had ever done up to that point ( In my opinion his work on A Trick of the Tail surpasses this)The second record is not as strong as the first one musically but in turn , features the most interesting and weird part of the story: Rael's meeting with Lillywhite Lillith to then fall in a pool and be seduced by three Lamia... well , and I can go on but that's not the point here. For a more detailed explanation of The Lamb you should check on the net: The Annotated Lamb liesdown on Broadway , there you will find lots of paragraphs about the interpretation of this lyrics to make your Lamb experience much more enjoyable. Back to the music featured on the second LP , there are some weak tunes on here like Riding the scree , Ravine or The waiting room. But there are some really good tunes like the Lamia , The Colony of Slippermen or the closer It.This record , I consider it essential although I don't find myself giving too much listens like other favourites. But everytime I do it's a marvellous experience. If there was a record that needed to have attached the word GROWER on it's sleeve , that is the Lamb."
    },
    {
      "reviewer": "lazland",
      "date": "Posted Thursday, February 5, 2009",
      "rating": 4,
      "text": "Okay, it's probably heresy, but this classic gets only four stars, in spite of the fact that it contains some of the best music (let alone prog) ever written. Why? Well, as I said in a recent poll on this site, I still, after owning the LP for some 31 years, cannot figure out just what on earth it is all about. I will also probably upset a few visitors to the site by stating unequivocally that it is too long. I seem to recall some years ago Rutherford saying that it would have made a perfect two side LP, but they got carried away - I agree.If I were just reviewing the first two sides, this would be a no brainer five star work. The Lamb... itself is a fantastic opener, In The Cage a genuine classic with such strong keyboards, backings, and vocals, the ultimate keyboard solo to weep to in Hairless Heart, a fine example of catchy and essential pop/prog in Carpet Crawlers, and Gabriel at his most emotional and heart rending in Chamber of 32 Doors, up there with my all time Genesis favourites. The rest of the first two sides blend together perfectly and there is never a dull moment, with the band itself proving themselves to be consummate professionals and musicians backing Gabriel's story about Rael (whatever it means).For me, the last two sides are overlong. Lilywhite Lilith, and It are amongst the best works ever recorded by the band, and I especially enjoyed the remix of It on the Archives Boxset. The Light....would, to me, have been a perfect bookend to The Lamb...in much the same way as Aisle of Plenty was to Dancing.....on Selling England.... Here, it just seems somewhat out of place (pardon the pun). A lot of it is disjointed - excellent playing, but not quite right. Colony of Slippermen is a good example of this as parts of it rock with a classic keyboard solo, but others just don't seem to fit into place and noodle for the sake of it.Don't get me wrong - this is a masterpiece, but it is by no way the finest of the Gabriel era LPs and it is easy to see in hindsight why it was his last. There were interesting times ahead."
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Wednesday, May 20, 2009",
      "rating": 5,
      "text": "The Dramatic Climax of the Classic Prog EraThe Lamb Lays Down on Broadway is the most ambitious, lyrically cryptic, grandest project by one of the titans of the genre at their peak in their classic lineup. It is extremely demanding to wrap one?s brain around, and it takes many listens to really sink into your soul. But once it has, it is difficult not to declare this the peak of the genre. Of course, this is the swan song of Peter Gabriel with Genesis, mainly because by this time, the band was being promoted almost exactly in that manner. Over 4 sides of music, there are certainly some peaks and valleys in the power of the music. But to doubt this is one of the masterpieces of prog rock is to say Beethoven's 9th is not a classic. (I happen to dislike the 9th but I am not silly enough to deny its profound importance.) The Lamb holds a similar place in this genre.The album is a rock opera which really is meant to be heard as a complete work. There are no hit singles, though there are classic moments including \"In the Cage\" and the ethereal \"Carpet Crawlers.\" The latter contains the best vocal interplay Gabriel and Phil Collins were to ever have, an oddity considering their later careers. Gabriel's lyrics span vast territory mainly involving themes of spirituality, personal transformation, and sexuality. There are some great instrumental passages, but the band is more restrained here than on any other release up to the days of the threesome. As such, this album is much different from albums before or for several after, lacking the extended intricate instrumental passages that were a Genesis trademark. (Probably a reason some like this album less than Foxtrot or Selling England by the Pound).In general, I like the music better in the first half of the album. However, the characters, storyline, and sheer weirdness are more interesting in the second half. Live, this corresponded to Gabriel's leather clad outfit during the opening songs, and then elaborate costumes in the second half. One exception is the reprise of the title song which is much more satisfying in its darker, more minor version toward the end of the work. Fittingly, the album has a big stage style closer, \"It,\" which releases the long developed tension in an upbeat major crescendo, though the lyrics remain challenging.The Lamb was not the natural evolution of Genesis' sound at all. Rather it is almost a stand alone work, as the continuity between Selling England through Trick of the Tail and Wind and Wuthering actually makes more sense. But the Lamb was a mighty note to end one of the greatest acts to make rock music. Gabriel was to exit for solo work, and Genesis was to transform time and time again to varied effect. But this exclamation mark remains one of the most important albums in all of rock, let alone prog rock, for which it is perhaps the summit of the vision of what the genre could be."
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Monday, May 25, 2009",
      "rating": 4,
      "text": "Again I can't give 5 starsThe lamb lies down on broadway is a mighty Genesis album and one of the best concept albums ever written, relesed in 1974 and the final one with Gabriel behind the microphone. Again not a masterpiece to my ears, and I can't really give 5 stars only because of historical importance or other such criteria. I'm judging this album from musical aproach and I reached to concusion that this album is the most complex Genesis album so far, and one of the most complex albums ever in progressive music. While is a solid album all the way has some fillers on both albums, the shorter tracks, some of them are totaly unintristing to me. Filled with astonishing musichianship and very intresting ideas The lamb is a very solid and entertaining album, who gives some classic progressive tunes like In the cage (brilliant pieces), Counting Out Time , Carpet crawlers from the first album and Lillywhite Lilith,Anyway and Colony of Slippermen from second album, aswell my fav tracks from here. So a big album both in Genesis career and in prog music, desearves a big 4 for sure."
    },
    {
      "reviewer": "The Sleepwalker",
      "date": "Posted Monday, June 22, 2009",
      "rating": 3,
      "text": "The Lamb Lies Down On Broadway is the last Genesis album with Peter Gabriel. People seem to have lots of different opinions about this album, one finds it too long with too much filler, and the other thinks the album is perfect because of the emotion and dramatics. I do partially agree with those opinions. Yes, the album is very long and lots of the songs seem to be on the album only to tell the progress of the story, instead of being there for the music. On the other hand, I think the story is pretty good, and the way Peter Gabriel expresses himself as main character Rael, and how he shows us the progress in the story is outstanding. This makes The Lamb a very hard album to rate. I won't be discussing the album song by song, cause quite a lot of the songs don't need to be discussed, as they are only on the album to tell the story's progress.The album has only a few Genesis classics, those are songs like \"In The Cage\", \"Back In N.Y.C.\", \"Colony Of Slipperman\" and \"The Lamia\", the latter being a really amazing song. This is only a small part of the songs on the album, while previous albums, like Foxtrot and Selling England, had a much higher percent of those truly memorable Genesis songs. So, that's kind of dissapointing, but luckily the album has a lot more to offer. The biggest part of the album is made up of good songs, no excellent songs, but just good songs. Some of those songs are \"The Lamb Lies Down On Broadway\", \"Fly On A Windshield\", \"The Carpet Crawlers\", \"Anyway\" and \"The Light Dies Down On Broadway\".Unfortunately, The Lamb seems not to be able to carry the weight of the concept it has, so there is a lot of filler. Songs like \"Cuckoo Cocoon\", \"The Grand Parade Of Lifeless Packaging\", \"Counting Out The Time\" and \"Riding The Scree\" just don't do it for me, they are not all bad, but they should be much better as this is supposed to be a very epic album, and Foxtrot and Selling England showed what the band was able to.The cocept of The Lamb also plays a big role at live performances, of course. Every Genesis fan knows that Peter Gabriel would quite often wear strange costumes on stage, and The Lamb is no exception. The costumes are more extreme than ever before, Gabriel having a rotating cone around him on \"The Lamia\", and crawling out of an inflatable while wearing the costume of a slipperman while singing \"Colony Of Slippermen\". On the other song gabriel was dressed up as Rael. Changing these Radical costumes takes a while, of course, so the album knows songs that give Peter Gabriel time to do that (\"Silent Sorrow In Empty Boats\", \"The Supernatural Anaestethist\"). I understand those songs have to be played live to give Peter time to change costumes, but why do they have to be on the album? They are the ultimate filler.It's very hard do choose what rating I will give The Lamb... Should I rate it low because of the huge amount of filler and songs underneath the level of Genesis, or should I rate it high because of the great storyline and the several Genesis classics?Because I am doubting too much between a very low and a very high rating, I'm going to take the middle path. Three stars for this extraordinary album."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Monday, July 27, 2009",
      "rating": 5,
      "text": "This is the first Gabriel-era Genesis album I ever heard, although for quite a long time I contented myself to listening to the first five tracks only, practically savoring this work. Gradually, I began to listen to more and more, exploring as it were the lurid world with Rael very cautiously. As a result, the melodies and rhythms and lyrics are all etched upon my mind- I doubt I could ever forget any of them, and yet every time I listen to this album I seem to hear something I hadn't before, almost as if it's growing on it's own?\"The Lamb Lies Down on Broadway\" The fading in of the piano underscores the dream-like quality of the album as a whole, and then leaps head first into a grand refrain. The narrative lyrics operate over the same melody with the exception being a gentle bridge, the tune of which will be revisited on the listener later.\"Fly on a Windshield\" This is an amazing and almost overlooked Genesis masterpiece. Gabriel's eerie voice hovers over a stark and chilling guitar. A haunting Mellotron moves in suddenly, as Steve Hackett graces over it. One of several music motifs is introduced here as Gabriel describes a ghostlike scene, something of a who's who of America.\"Broadway Melody of 1974\" The scene described previously was originally meant to be this track, but the CD relegates \"Broadway Melody of 1974\" to a mere thirty-three second segment. As it is, it's a lovely segue.\"Cuckoo Cocoon\" A light, terse song with noteworthy vocals, lyrics, and flute give the listener a rare clear glimpse into the mindset of Rael.\"In the Cage\" I count this extended song among my favorite Genesis works. From that creepy opening line over pulsating bass: \"I've got sunshine in my stomach, like I just rocked my baby to sleep\" to the urgent, almost panicked vocals, from Mike Rutherford's bouncy contribution throughout the song and especially in the instrumental break to the dazzling synthesizer solo from Tony Banks (perhaps among his most brilliant moments), this is one song that is loaded with desperation all the way through, and is a work of art in and of itself. A barely audible yet graceful segment rises up after the song proper concludes.\"The Grand Parade of Lifeless Packaging\" Co-written by Brian Eno, this happens to be one of my less favored tracks from this masterful work, especially at the end with the belch-like vocals.\"Back in N.Y.C.\" Rael asserts his machismo despite (or perhaps because of) everything he has gone through- he presents himself as the ultimate badass, but his audience knows just how fragile he really is. Gabriel's dramatic vocals and the quirky music are not exactly an oddity on this brilliant menagerie of music, and this stands as a highly enjoyable number in this bizarre rock opera.\"Hairless Heart\" For such a gorgeous instrumental, the title (and the narrative concept it entails) is just plain weird, but with swirling keyboard, dashes of powerful Mellotron and Hackett's pleasing electric guitar, this is about as good as it gets in under three minutes, and I'm left shrugging my shoulders and asking \"What's in a name anyway?\"\"Counting Out Time\" I personally don't like how the lovely \"Hairless Heart\" jumps right into this giddy jingle that sounds like a David Bowie single. The amusing lyrics give way to eccentric instrumentation, and while not a bad ditty at all, it adds to the queerness of the album, which inexplicably adds to the appeal.\"The Carpet Crawlers\" This is one of the most repetitive and simplistic songs Gabriel-era Genesis ever recorded, and yet it remains one of the finest pieces in their repertoire even to this day. While the lyrics are at their most unfathomable, they are sung with a stalwart conviction. The inscrutable key is repeated throughout: \"We've got to get in to get out.\"\"The Chamber of 32 Doors\" The whole band delivers one of their most poignant and dramatic performances ever. The tempo shifts, the Mellotron, and the fantastic guitar cooperate to produce a breathtaking piece of music. Gabriel's vocals as Rael are full of pleading and desperateness.\"Lilywhite Lilith\" The second half kicks off with loads of energy and the very atypical feeling of optimistic hope.\"The Waiting Room\" By far my least favorite track on the entire album (and in all of 1970s Genesis), \"The Waiting Room\" is something of an enigma to me, a time to ask myself, \"This album is quite obscure and strange enough, so what were they thinking?\" Essentially, this instrumental is Genesis's foray into spooky avant-garde territory. As I recall, the band largely improvised this in the dark, essentially only composing the uplifting section at the end. In fact, it's working title was \"The Evil Jam.\" Oddly enough, this peculiar piece seems to fit the nightmarish atmosphere of Rael's surroundings quite perfectly.\"Anyway\" That dark piano run gives way to a sudden vocal, singing some of Genesis's most obscure yet somehow viscerally understandable lyrics. The melody is simply one of their best, not only in accommodating the words, but in garnering awe as music in and of itself. A musical theme is snuck in the middle just before a brilliantly simple guitar solo, but it's that last verse- \"And it's good morning Rael-\" that echoes inside me in an unexplainable way.\"The Supernatural Anaesthetist\" With a short and masterfully quirky vocal bit, the band is off, largely allowing Hackett to have some fun. There is one distinct section, however, that almost sounds like it was lifted off a piece of \"The Ancient\" by fellow Englanders Yes. Still, it's fabulous either way.\"The Lambia\" This hauntingly beautiful piece is one of my favorites from this album. The lonely piano allows for the timid Rael to describe what is going on, to describe the lamia in seductive detail. An abrupt synthesizer introduces the more intense chorus. A gorgeous guitar solo graces the ears of the listener in the end.\"Silent Sorrow in Empty Boats\" The title of this piece, which is shamefully dismissed by so many, is taken from a line in the previous song. Sure this instrumental is short and rather uneventful, but it almost serves as an evocative breathing space.\"The Colony of Slippermen\" The weirdness continues here, with strange jungle or tribal noises that carry on for about two minutes. Then suddenly the music dives right into traditional symphonic territory, beginning with a great keyboard run and a quote from poet William Wordsworth. Gabriel uses a monstrous voice to growl as the slippermen. Banks uses what might best be described as a slippery tone for his work in the middle just before his solo proper.\"Ravine\" This airy track has less going on in it than \"Silent Sorrow in Empty Boats,\" but it lends to the atmosphere and sets up the listener for the intense finale the remaining songs contain.\"The Light Dies Down on Broadway\" Using the bridge from the title song, this semi-reprise builds in intensity, and while it carries much of the melodies of it, it is a different creature from the first track, and maintains a foreboding atmosphere with quirky synthesizer.\"Riding the Scree\" Banks speeds through a solo before playing the main theme of the piece, a piece which is ultimately his show. Somewhat eccentric vocals and outstanding drumming from Phil Collins create\"In the Rapids\" This amazing song not only is home to one of the best melodies of the album, but it is also the vehicle by which the climax of album (wherein Rael makes the all-important self-discovery).\"it\" A ripping synthesizer leads into the final track, which is like a festival after a long, dark, dank journey. The Rolling Stones had just finished up their album It's only Rock and Roll a few months before this album was released, so it's funny that Gabriel should conclude the album with the line, \"Yes it's only knock and know all, but I like it.\" Lots of speculation has gone into what it could mean, but I kind of think that's just Gabriel's sense of humor. Either way, the glib line does nothing to sum up the fantastical tale spun throughout the course of about ninety minutes, and yet it seems to sum up everything."
    },
    {
      "reviewer": "kenethlevine",
      "date": "Posted Monday, October 12, 2009",
      "rating": 3,
      "text": "\"The Lamb\" is in many ways the ultimate progressive rock concept album, for both good and bad. To the good, it is 94 minutes of sheer escapism from the hurly-burly of 1974 life, helped along by a few landmark tracks. On the downside, it begets a tumultuous disarray all its own, and features more than a typical double album's share of filler. More problematically still, on the one hand I can think of no earlier \"neo prog\" album, with its emphasis on wordiness at the expense of group dynamics, while on the other hand some of the songs sound like blueprints for some of Genesis' most monumental transgressions that were to reappear many albums later.The main melodic themes are introduced in the surprisingly conventional title cut, which succeeds because of their sheer strength. Other classics are the mellotronic \"Fly on a Windshield\", the suspenseful \"In the Cage\", and two of Genesis' most beautiful ballads - \"Carpet Crawlers\" and \"Lamia\", the latter including one of Hackett's best outros. Vocally, these flatter Peter Gabriel, but elsewhere, his pipes and effects flood the proceedings, such as in the lame pop of \"Counting Out Time\", the developmentally challenged \"Back in N.Y.C.\" and \"Colony of Slippermen\", all of which bring back the screeching styles and ropey wordplay of \"Battle of Epping Forest\". Cuts like these seem to rely on one or two impressive organ pumps to carry the day, but they just aren't enough for me. Elliptical references aside, \"Grand Parade of Lifeless Packaging\" and \"Lylywhite Lilith\" could easily pass for mid 1980s Genesis, nuff said.Of the instrumentals, the best are \"Hairless Heart\" and \"Silent Sorrow in Empty Boats\", which actually sound good on their own as well as providing an atmospheric bridge between cuts, or an opportunity to change costumes as the case may be. A generally ambitious yet wildly uneven album, the Lamb was PG run amok over Genesis, which helps explain why the group was able to find its bearings shortly thereafter and why Gabriel's early solo career was so inconsistent. A delectable repast for prog purists, \"The lamb\" is a trifle woolly for my tastes. 2.5 stars rounded up."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Wednesday, October 14, 2009",
      "rating": 4,
      "text": "Deciding how good this album is probably depends heavily on what you are expecting to get from it. If you are interested in taking a long, strange journey (and I must emphasize \"long\") that ends up leaving you cold and lifeless (except with a brief positive closing), the Lamb would be a good choice.If you're primarily seeking interesting, powerful, and integrated music--as I typically am--then the Lamb, at least in its entirety, will leave you unsatisfied every time.This may be the album I have struggled to rate the most of any I have yet encountered. Here's my basic take: the Lamb starts out (through the end of In the Cage) intense, powerful, and with each of the members of Genesis complimenting each other as only they could. Collins does a wonderful job with keeping the mood intense yet varied, with Banks essentially joining him on the rhythm section. Gabriel's lyrics and delivery also are quite strong here. I usually find his contributions to be uneven, but certainly has a creative turn of mind and an innovative syncopated delivery that can really be powerful when added on top of great music. To me, this is truly a group effort.After this point, there's much more relatively boring ambiance (i.e., Silent Sorrow), flat-out weirdness (Slippermen) or straightforward pop (Back in NYC). Of course there are moments of musical bliss, such as the majestic closing to the Lamia, but Genesis sure use up most of my patience to get there. I find most of the story fairly ridiculous, though I admit it's largely a personal, subjective opinion. Unfortunately, the music increasingly exists to support the story, and largely does not remain interesting if one is not buying into the storyline.Of course, there are numerous highlights, such as the dramatic Anyway, the catchy Supernatural Anesthetist, the thankfully energetic closer It, and Lilywhite Lilith, which nicely revisits the catchy Fly on a Windshield closing rhythm/melody. Pair these with In the Cage and the title track, and I've got half an hour of great music, which is more than enough for me.No offense meant to those who adore this album in its entirety--we're just speaking a different language and will have to leave things at that. In my opinion, this is just another in a long line of double albums that should have been one (i.e., the Wall, Topographic Oceans, etc.). Some truly unique and memorable music, lyrics, performances, and melodies, but no masterpiece here."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Friday, December 11, 2009",
      "rating": 4,
      "text": "This is probably the essential Genesis album to own, if you are only going to own one Genesis album. The band must have known about Peter Gabriel's impending departure after this album, as they appear to be playing with a fire that they never showed on their previous recordings. The songwriting is mostly sharp, and even Tony Banks plays some actually interesting solos.Standout tracks are the title song,The Lamb Lies Down On Broadway,In The Cage, andLillywhite Lilith. All three of these songs are among my favorites from this band. Unfortunately, the album starts to drag shortly into the second disk (or third LP side, if you have the vinyl version). The airy sound effects, and lighter songs are something of a letdown after the spectacular first half.3.5 stars, rounded up."
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Tuesday, February 16, 2010",
      "rating": 4,
      "text": "The first Gabriel solo albumAnd in that context, the best Gabriel solo album as it avoids excessive dance tendencies and world music nonsense. Plus it was his best backing band. Obviously I'm joking a bit but you really can hear for the first time on this Genesis album the future artist Peter Gabriel breaking free from the boys he grew up with. You can hear moments that sound like his early solo albums, though the results are much better here, as early Gabriel solo records were pretty iffy affairs. Reading the words of the band members themselves it is pretty clear that the wheels were coming off the wagon.\"Something changed in the mood between Selling England and Lamb\"(Hackett)\"The Lamb was at times a particularly miserable experience.\"(Collins)\"Of all my time in Genesis, my least favorite period was the writing of The Lamb.\"(Banks)Gabriel's wife was having a difficult pregnancy, he was entertaining side projects which was angering the others, members were getting married and divorced, and the pressures of the group were escalating. In a tacky hotel room in Cleveland Ohio, Peter announced he was leaving the band after the completion of the current dates. So given the turbulence running through every layer of the band and creative process it is not surprising the final Gabriel era album is controversial, their own \"Topographic Oceans\" in some ways. It's a great album but falls just short of masterpiece status in my view.I'll be brief. It is one of those grandiose epic progressive rock feasts that takes many plays over time to truly appreciate, and while far from my favorite Genesis album I have come to appreciate many parts of it. But to be a masterpiece an album of this length really needs to inspire me on the basis of the music because frankly the overblown lyrical themes are not enough. Topographic blew me away because the music was so phenomenally deep and mysterious but The Lamb can struggle with inconsistency. Had they opted to condense the best material to a single disc I believe it would be another masterpiece but here the killer quotient is just too diluted. Nice melodies emerge from tracks like \"Carpet Crawlers\", \"Lilywhite Lilith,\" and \"The Lamia\" and occasionally Banks and Hackett deliver scrumptious lead work.I love a good long, meandering double album for the secrets that they bear out over time. Despite my mixed feelings of some tracks The Lamb is easily a must album for fans of Genesis and also of Gabriel solo. In fact Gabriel fans sampling Genesis for the first time should probably start here. As cool as it is, I believe the execution dropped a bit from the previous album, the masterpiece Selling England, and thus can only go 4 stars. Sometimes band conflict births absolute brilliance but not always. It almost worked here but there is some piece of the puzzle missing and I've not quite put my finger on it yet. Someday.The version from the remastered box set sounds a bit flat to my ears, and the dreadful packaging of this version is just unforgivable. The discs slide in and out of stiff paper slots that virtually guarantee eventual scratching. When will they learn to stick with jewel cases in boxed sets and leave the paper sleeves to the professionals?"
    },
    {
      "reviewer": "friso",
      "date": "Posted Tuesday, March 16, 2010",
      "rating": 3,
      "text": "Genesis - The Lamb Lies Down on Broadway (1974)The struggle between artistic freedom and music that makes sense...There has been a lot of discussion about this album, some claim it to be one of the masterpieces of progressive rock, others say it's the freefall of one of their beloved bands. I would like to add my own on this debatable album.The lamb lies down on Broadway is a double lp concept album based on a fictional story, which is based on a surrealistic world. The story has no logic, little emotional development and a real clue seems to be missing, though others might argue otherwise.Genesis had reached a point of compositional quality on the Nursery Cryme album that would last for some years. The music was sophisticated, the instrumental passages important and the keyboard's used were a good representation of the classic prog sound with nice mellotrons and organs. This would change during the recording of this release. The image of Peter Gabriel had grown to be one of an all-important front man, this would eventually lead to him being the most important member on this album. The concept and lyrics were written by Gabriel and music seems to be the second on this album. Like the songs were loosely put together to strengthen the lyrical content, whilst loosing the strong compositional qualities of other members of the band. There's only functional songwriting on this album. This is the reason the album was seen as an artistic letdown at it's time of release.Genesis used some new equipment on this album, resulting in the use of now dated electronic synthesizers with automatic loops (so it seems). The overuse of electronic equipment and the simplification of the compositions changed the sound of Genesis from a symphonic prog band to a modern pop group. Most songs have a pop vibe, albeit good pop. Some songs stand out as reasonable prog tracks. The cage is a motivated up-tempo progressive track with strong vocals and The Chamber of 32 Doors is a song that has some serious emotional value in it. The latter is my favorite album, it is also the most symphonic track.The recording of the album is again horrible. Most tracks loose their value because of the blurred sound and the dull vocals and instruments. The guitar has lost it natural sound and the drums are as bad as only Phil Collins could record them (yes, I said Phil Collins is a horrible drummer!). Though Genesis had four years of experience since 1970, Trespass still remains their best sounding recording.Conclusion. This will never be one of my favorite albums. It's an album with a concept, some great tracks, but to me it sounds like a failed idea. The qualities of the band aren't used, it's too long, it's recorded ugly and it's sounds like it was recorded in tremendous haste. A single album with all of the best ideas of this record would have got a four star rating, but this only get's a small three stars. The departure of Peter Gabriel seems to be a logical step, but it leaves us with a disjointed Genesis that would never reach the quality it had anymore. Those who can join into the artistic freedom thinking of Peter Gabriel could enjoy this album tremendously, those who expect a great symphonic prog album will be left with a big disillusion. Thee stars for me."
    },
    {
      "reviewer": "Marty McFly",
      "date": "Posted Sunday, April 25, 2010",
      "rating": 4,
      "text": "Weird child loved by some, hated by others, of certain quality, but not shouting appeal. Not as famous as Selling England By the Pound, but for sure better than what will be coming after this album. Last legendary album with Peter Gabriel, however, dull experience for other members. Album page full of tongue-in-cheek & pun titles in collaborators reviews and quite best seller here on PA.That's ToLLaDeOB.Except first, title track, this record is rather strange, because there's no other strong track that would attract me. But there's worse thing that bugs me - I don't sense much emotions from these tracks, like life itself was drain from it leaving just cold, emotionless corpse. Perfect, nice and maybe beautiful for some, but fading quickly. However, I understand that there is some kind of concept (and I like concepts), there is also strong Prog element, tracks here are far from being simple and weak, they are strong and complex, but not strong in power impact they are making.I'm sure it will appeal to many people and that there are and will be fans of this album. Maybe it will be masterpiece for some, Genesis best work, but I'm rather hesitating here, because of mentioned reasons.However, towards the CD2, situation is getting better, songs are more positive and interesting. I wonder if this is intention. If so, it's good, but anyway, it could have been done differently.If there is something this album may present as big advantage, it's how rich in themes it is. In these songs, you'll find everything.4(-), both disappointed and surprised. Weird combination this album creates."
    },
    {
      "reviewer": "Dobermensch",
      "date": "Posted Sunday, June 20, 2010",
      "rating": 2,
      "text": "A vastly overlong monotonous Peter Gabriel monologue. I'm not surprised Gabriel left after this. The rest of the band must have been sick to the back teeth of him dominating proceedings for the 94 minute duration of this double album.Gone is the playfulness and Englishness of 'Selling England...' - this is 'vocal heavy' from the outset and really doesn't let up until the end.I'm afraid I find 'The Lamb' extremely tedious and the cryptic lyrics don't really improve matters either. There's no frame of reference, no story, so it's hard to remain involved, especially over such a lengthy recording. Some bloke named \"Rael' descending into the New York subway in an attempt to rescue his brother John and subsequently meeting strange creatures just ain't good enough. All future talk of 'Split personalities' as a way of explaining this album simply don't wash. It's pants. Pure and simple.Now, if I was Peter Gabriel I'd be trying to sue Fish of Marillion into a black hole in space! I've never heard such blatant faced plagiarism in my life! At many points you could be excused for mistaking this for 'Script for a Jesters Tear' from '83.On the plus side, the double tracking of Gabriel's vocals are occasionally interesting and there's one or two good instrumental keyboard parts around the three quarters mark (by which point I was too weary to take note of the track in question).Anyone who thought Roger Waters had an all encompassing domination of Floyd ought to listen to this to truly discover the horrifying consequences of what dictatorial power in a band can wrought."
    },
    {
      "reviewer": "VanVanVan",
      "date": "Posted Wednesday, July 14, 2010",
      "rating": 4,
      "text": "In my opinion not Genesis' strongest effort. Nursery Cryme, Foxtrot and Selling England by the Pound are all 5 star albums in my book, but I do not think this one measures up. I've always felt that Genesis' strongest attribute was their ability to write extremely strong individual songs- The Musical Box, The Cinema Show, Dancing with the Moonlit Knight and of course Supper's Ready; even shorter songs like Harold the Barrel were incredibly powerful and musically dense.Sadly, nothing here is quite as good. While the album as a whole is more musically ambitious than anything Genesis had done up until this point, the sum of the parts just do not add up to create anything as powerful as their previous three albums. I won't do a track by track, because the album is best listened to as a whole, but I will point out some standout tracks:The Carpet Crawlers: Very beautiful, surreal, sedate track. The melodies and overall atmosphere are just incredibly powerful.The Chamber of 32 Doors: Great closer for the first disk. Fantastic lyrics and a great chorus.The Lamia: Easily my favorite track on the album. Changing motif many times, this song contains some of the most gorgeous melodies and harmonies on the entire album. Wonderfully atmospheric, hugely dramatic and containing some of the best lyrical imagery in any song ever.The Light Dies Down on Broadway: A fairly simple song, but a very good one. A pseudo-reprise of the opening track as well as some themes from the Lamia, this song provides a lot of emotion and some really top-notch singing by Gabriel.Recommended, but know that this is a very different sounding album from Genesis' previous three. Lots of shorter songs; there are a lot of really good ideas but not a lot of elaboration. A more difficult listen than Genesis' other work but definitely worth hearing."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Friday, October 22, 2010",
      "rating": 4,
      "text": "Review #536The Lamb Lies Down on Broadway and Gabriel takes a final bowGenesis was in turmoil during the making of this album. It took me a long time to really appreciate this huge concept album from Gabriel era Genesis. It was to be the last time Gabriel would front the band as he was off to greener pastures on a solo career that was not surprisingly successful. He quit Genesis as he was disheartened by the band members, attitudes were at bay and tempers did fray, so this is an emotional album with turmoil driving it at the centre of its black heart. The music pumped life into the band and the concept was inspirational. However the patient on the table was about to draw his last breath. The operation was a success but the patient died.At first listen I was confused as to what the band were trying to achieve on this. The songs often run together and it runs out of steam towards the end. The vocals are abrasive and aggressive, especially towards the middle of the album. The band seem lost in the overblown concept and it is indeed the most ambitious overbearing album of the Genesis catalogue. Aside from all this the album tends to grow on you like fungus on the lemon tree.I am not as big a fan of this as others here and part of the album is deliriously tedious for me, marring a masterpiece status. A studio double album is ambitious and Genesis perhaps bit off more than they could chew here. It was akin to Yes' \"Tales of Topographic Oceans\" in scale. Overlong, bombastic and conceptually heavy. However, somehow this has become an icon of the band and indeed prog in general.The bildungsroman of self discovery and personal growth of Rael is as much a part of Gabriel's history as anything he put his hand to post Genesis. Peter Gabriel relinquished the fox head in red dress, and concentrated on the slipperman and the forlorn character of Rael on this double album treat. The rock opera is unforgettable, many critics hailing it as the masterpiece of 1974. The double vinyl album is now a double CD and sounds glorious by any standards. The plot is a conglomeration of Gabriel's fantasies and the life story that is laced by hallucinogenics of a Puerto Rican tramp known as Rael and we hear slices of experiences that may be real or simply figments of Rael's stoned mind. Nevertheless the music is the last great prog opera for Genesis.The lyrics are concentrically focussed on Rael's delusional state of mind that is warped with apparitions of stumbling tramps, cocoons, cages and caverns. There are a myriad of characters caught up in the lunacy including anaesthesists, colonies of slippermen, Greek mythological figures and a plethora of quotes from poets, authors and musical composers. At first listen it may seem all too much and perhaps a tad pretentious, but it soon grows on you and you may grow to love this album. I could never love it as it is simply too sporadically weird and does not gel with my musical tastes, however I can see the appeal. In its day the album must have knocked every artist off their perch as there was nothing like it. And oh, how influential this album has become over the years.The album cover with subjects jumping out of their paintings and escaping the canvas entrapment is iconic. There are songs from this that have become part of Genesis and prog folklore; they are easy to locate amidst the massive running time: The highlight of the entire album is undoubtedlyIn The Cage, and it has been surpassed in greatness on the live DVD \"Genesis In Rome\" complete with animated running man in a cage. The music is incredible here, especially Banks on stunning synth staccatos, with powerful melodies that rise to the heavens.Carpet Crawlersis a definitive track that mauled the charts for some time till it faded as a memory. The song is sheer beauty and an emotionally charged treasure.The Colony of Slippermanis simply quintessential to Genesis and masterful. One can never forget the power of grandeur ofIn The Cagebut there also shining moments such asThe Lamb Lies Down On Broadwaywith its great melody that is easy to listen to.These are individual gems, however when taken as a whole concept the album presents some concerns, the main one being, what the blazes is this album trying to say? Is it trying to convey the dangers of losing one's mind, or is it one huge analogy of how to cope in a cruel world? Rael seems to wake up in a cage where he soon comes face to face with the carpet crawlers, supernatural anaesthetists and the Slippermen. The events that happen to Rael are superseded by anxiety and confusion, enhanced by confusing alienating lyrics, but it is safe to assume that Rael the protagonist goes through a living torturous hell, getting castrated, and later encountering his brother John who topples over imaginary rapids but he is chased by Rael and ultimately saved from certain death. If all that confuses you the final twist is found in the last trackIt. You need not speculate what 'It' is, because it is left open for interpretation, and may be anything from sex to beliefs.I think the real power of the album lies in its compelling structure and storyline. Gabriel is on fire and at his sardonic best on this as the character of Rael, a cyber punk anarchist with a cause. Collins, Banks, Hackett and Rutherford are there somewhere in the distance behind this megolomaniac protagonist in his plastic cinematographic landscape. The domination of Gabriel is almost astonishingly criminal but there is no getting away from the scintillating keyboards of Banks, brilliant at times, and the rhythm machine of bass and drums extraordinaire, Rutherford and Collins. Hackett is a phenomenon on lead guitars as always, and he absolutely sparkles on this album. Time sig changes onIn The Cageare innovative and one of the great examples of how to do it right as part of an overall theme rather than just switching tempos for the sake of it.There are segues and transitions to songs by short pieces such asBroadway Melody of 1974, to prepare us for the majesty ofCuckoo Cocoon. Hackett features on arpeggios and scales making his guitar soar and the return of Gabriel's flute is a sheer delight. It was almost a farewell to the past, as the flute rarely troubled his solo albums.The Grand Parade of Lifeless Packagingis one of the avante garde Genesis romps and it will not appeal to everyone for this reason. It is as far removed from the commercialism of the \"Invisible Touch\" period of the band, that would plague their creativity, as an alien is from the planet earth.The esoteric soundscape is surreal and it even features vocals that belch; perhaps in a cynical fashion Eno wrote this to create an experimental atypical track that would stand out among the rest. He succeeded.There is a nihilistic foreboding cynicism in Gabriel onBack In NYC. Bank's keyboards have a massive sound that manages to dominate even over Gabriel's egotism. The character of Rael screeches with utter contempt: \"This is your mess I'm stuck in, I really don't belong\" and we tend to believe him here. He is a fearsome street punk who takes no prisoners; nobody would dare to step in his way. That would all change. The mellotron swirls and sparkles onHairless Heart, a sumptuous instrumental where Hackett shows his chops on axe. He drives his guitar headlong with spacey flourishes, a tablature to die for, perhaps an underrated classic for Hackett's virtuoso prowess.Gabriel becomes even more desperate as the album progresses and by the time we get past the prog balladCarpet CrawlerstoThe Chamber of 32 Doors, Rael has become a figure of desolation and despair. The Mellotron cries out as Gabriel's Rael pleads for redemption.So endeth Act 1 and we then move to the second Act on CD2. This CD is where it begins to drag for me, though there are still moments of glory.Lilywhite Lilithbegins it well with beautiful melodies and energetic flow. The optimist declares the best of all possible worlds, and while the pessimist fears this is so, Rael shines with hope for a future at this stage in the game.The Waiting Roombrings things down considerably, with its surreal structure it is as difficult to grasp as Godspeed You! Black Emperor. The mystique of the track renders it some power like The Beatles Revolution 9, but the hyper strangeness makes it inaccessible and one to skip. At first it is chilling and then after subsequent listens it is downright annoying. In context the piece works as a nightmare for Rael's decline into damnation. It was recorded in pitch dark and sounds it. Perhaps the band could not find inspiration with the lights on but I believe the band really lost their way on this without a torch to guide them, and it can never be justified. One listen is certainly enough.Anywayis next, and is an accessible piece after the last experimental mental collapse of the last track. It is subdued and peaceful with gentle calm guitars and arpeggiated piano. The lyrics are cryptic but generate visual dioramas of the protagonist's plight. There is a wonderful melodic line and simplicity behind the stark arrangement. \"And it's good morning Rael\".The Supernatural Anaesthetisthas a brief bizarre diatribe of unintelligible lyrics by Collins and Gabriel and then Hackett launches into space and just plays. The piece is supposed to denote the impact of death or it could be the impact of drugs, who knows?The Lamiais one of the more memorable tunes with anguished sexualised lyrics and symbolism that are open to interpretation. There are portamento synth lines from Banks permeating the atmosphere. The story line goes into dark territory here are as Rael devours his lovers after an orgy.Silent Sorrow in Empty Boatsis really a transition piece to the next big track, which is the hyper weird surrealism ofThe Colony of Slippermen. There are estranged jungle noises until the sudden detour into symphonic prog heralded by Banks keyboards and a quote from William Wordsworth; classic poet of the century. The sitar makes an appearance generating an Eastern flavour. The slipperman appears on stage as a distorted fiendish globular creature and Gabriel's monstrous growl gives it chilling substance.The story line becomes a dream tale of no logic whatsoever at this point and you have to give up and allow it to wash over you as nothing congeals: Rael and his brother John, who is disfigured by VD, give themselves over to a ritual castration performed by a surgeon. Somehow the eventual destination of their genitalia winds up in the beak of a 'Phallus hoarding Magpie' who proceeds to carry away their genitalia in its beak. The pursuit is on for the Thieving Magpie and we wind up in the ravine.Ravineis another throwaway short track that blows the dust out of an oscillator.The Light Dies Down on Broadwaybrings us back to the original theme and it's a relief to hear it after all the strange going-ons. The album has lost its way here but the reprise of the familiar is so needed at this point.Riding the Screeis a Banks blaster, where he is allowed to hook into a groove that cruises along at a quick pace. The vocals are as unconventional as ever at the end of this but after a lengthy keyboard solo they feel forced and pasted on in order to continue the main storyline. No doubt this was an instrumental that Gabriel decided to utilise as part of the concept at the last minute.In the Rapidsbrings the album to its eventual conclusion and as such should have been a showstopper. Alas, it is anything but. Rael eventually leaps to his death to save his disloyal brother. Is he a hero for doing this? It is such a hackneyed method to end this story that it almost feels like a hurried afterthought. What will we do with this Rael? Oh, let's have him jump to his death to save his brother. Oh yeah, that'll do. His brother is not even loyal having forsaken Rael on at least two occasions. At least the music is brilliant enough to carry this to a satisfying conclusion. So in terms of music it is satisfying, in terms of story it is a disappointment.Next we have the oft discussed oddity enigmatically calledIt. Gabriel here is cynical and swipes at sexual gratification, and music journalists. \"its only knock and know-all but I like it\" is a direct swipe at The Rolling Stones. This is just Gabriel trying to be funny having recorded in the same studio as the Stones. Whether it works or not is open to conjecture but it is certainly a memorable ending to this magnum opus.The allegory of a declining social structure with metaphorical allusions has been widely discussed by critics over the years and I can add to this speculation as to the meaning of the lyrics here in some form. The story is compelling and is replete with pop culture references and a saturation of symbolism. But what does it all mean? Here's my take on it. It was yet another busy night on Broadway in the big apple, New York City, where a lone figure made his way through the throng of faceless pedestrians and honking traffic. The street wise Puerto-Rican is a punk named Rael who is stopped dead in his tracks when he notices the disturbing image of a lamb slowly making its way towards him through the steamy city streets. As the bustling traffic roars headlong, incessantly moving in eternal perpetual motion, the lamb lies down. It is a surreal image that buries itself into Rael's subconscious. Why does it lie down? Is it dead? Is it tired of citylife? Is it escaping the chop? Where did it come from? Is it lost wagging its tail behind him? The lamb represents all the innocence of Rael that has somehow been purged by a hard life. It wanders lonely as a cloud and finds a place to finally rest amidst the mad rushing world. Rael too has been sheared of his innocence by the hard knocks of betrayal and survival instincts in an antagonistic society. While he is contemplating this a massive wall rises out of the ground and ascends upwards. It then blasts across Times Square and crushes and annihilates anything that gets in its way. The spectacle seems to occur unnoticed by the pedestrians but Rael is aghast as he witnesses this calamity with its devestating holocaustic cataclysm. Rael is swept up by the Wall and embarks on a cathartic journey of self- discovery. On this journey he encounters the fiends of his darker psyche, the slipperman, the Lamia and carpet crawlers, who devour his life that is ebbing towards self destruction. His past haunts him and transforms into personifications of a world where dreams and nightmares merge into a hyper reality. The sense of entrapment is strong and there seems to be no escape from this plagued society. The social structure becomes plastic and fake and reeking of commercial infestation. The putrefaction of modern living is seen as a Grand Parade Of Lifeless Packaging. The Waiting Room is the precursor to the dark past which will lead to the Supernatural Anaesthetist and The Colony Of Slippermen. Finally in an effort to save his brother who has been disloyal to Rael despite his undying love, Rael makes the ultimate sacrifice and jumps to his death in the ravine. His brother is redeemed from death and Rael is redeemed from a purposeless life. The moral? In order to find yourself you first must lose yourself, and then you are able to discover freedom from your cocoon. Rael was in a cage, a cuckoo cocoon of lost dreams, echoes of the past and wild imaginings of a dystopian world; a prisoner of his own imagination. To escape this diseased planet the beauty of his soul shone through when he saw his brother at the point of death. Jumping to certain death was his only means of salvation.Well at least that's my take on this.So in conclusion the flawed opus of Genesis works well on a number of levels. Philosophically; there is much to gain from a close inspection of the lyrics. Musically; there are masterful performances. Gabrielly; it may be among Peter's best work. Gabriel was like Rael on this album. He felt trapped by rock and roll excess and the drug culture. Like Macbeth, Gabriel felt cabined, cribbed, confined, bound by saucy doubts and fears, and he needed to escape. He did escape his cage and Genesis was never the same again. Genesis was set free from conceptual diatribes on modern society, and were able to rejuvenate into a money making machine. Some say they were better but that is open to argument. Nothing like this album was attempted again. Genesis were in the next phase of their evolution. Collins was about to make his presence felt in a way he could never have dreamed. The dawn of a new Genesis was about to take residence."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Monday, November 15, 2010",
      "rating": 4,
      "text": "Generally I am not a big fan of Genesis music, but this album is good, possibly even the best in my list. Yes, it's very ambitious, long and quite complex (as for them). But I see it as strong side of that release.Two album's LPs are obviously very different between each other. First one contains shorter, more energetic, melodic songs,recorded under Peter Gabriel influence. Many name it first Gabriel's solo album. I think it still isn't, but for sure the band there does what they play best - melodic,intelligent art-pop and art-rock well structured composition. Peter Gabriel will leave the band after this release and will continue successfully that direction.Second album's disc is much more experimental, mixing some very average instrumentals with great compositions. Even Brian Eno has put his fingers in that sound. Possibly, second part is more controversial, but it is quite good as well.In all, album is too long, and I believe there were really enough excellent material for one disc. And I think such one disc instead of double album could be almost masterpiece one. But even double album is enough good and really is much more attractive for me comparing with their earlier classic a bit sleepy works. Yes, this album turned Genesis to their pop-career, but in my opinion they always were kind of art-pop/art-rock band, so they just corrected their course according to the time requirements.My rating is 4, highest possible I can give to any Genesis album at all."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Tuesday, December 7, 2010",
      "rating": 5,
      "text": "This is one of those albums that requires a lot of time getting into, at least that's how it was for me!Being a huge fan of all the Genesis albums up to this point, I guess that a fan tag is in order here, this time investment wasn't really a problem for me. Although I vividly remember one of my initial encounters where I felt completely exhausted somewhere around the end of side three and actually turned it off all together. What was it that fans saw in this album, I though for myself? The music was far from as good as any of the band's previous releases. Still I pushed on and once I started to explore the lyrical content, it all began to make sense!So what was it that drew me into the underlying lyrical context of this work? After all, isn't it all just a drawn-out version of any other tunes sang Peter Gabriel? Yes, that's exactly what it is and the mere fact of it mesmerizes me completely! I remember being so influenced by this Gabriel lyrical masterpiece that I actually had somewhat of a midlife crisis, right around my 23rd birthday, when I realized that I would never be able to achieve anything as magnificent as the story ofThe Lamb Lies Down On Broadwaybefore I reach 24. That thought made me feel like I was under a lot of pressure all throughout 2009 and might actually have been the biggest contributing factor to me starting this review streak of a sort. If that's not enough of a motivation behind this album's excellence, then I really have no clue how to please you!The instrumental arrangements work almost seamlessly with the story arc, which is both a good and bad thing. You see, I can never really listen to any of these passages outside of this album's conceptual content.In The CageandThe Carpet Crawlersmight have been an essential part of Genesis live performances through the years and although I do love those compositions, I really don't see them as stand-alone tracks. This is definitely a weakness of a sort, but this also says a lot about the solidity of the concept album.So isThe Lamb Lies Down On Broadwaythe best concept album of all time? Some people complain that the second part of the album is not as good as the first, which is true considering that the first part has all the hits. Yes, I will go out and claim it to be the best concept album of all time! It might not be one of my top 3 favorite Genesis albums, but that says more about this band, in general, than it does of the album.***** star songs: The Lamb Lies Down On Broadway (4:51) Fly On A Windshield (4:23) Broadway Melody Of 1974 (0:33) In The Cage (8:16) Hairless Heart (2:13) Counting Out Time (3:42) The Carpet Crawlers (5:16) The Chamber Of 32 Doors (5:41) Anyway (3:08) The Lamia (6:57) The Light Dies Down On Broadway (3:33) Riding The Scree (3:56)**** star songs: Cuckoo Cocoon (2:12) The Grand Parade Of Lifeless Packaging (2:46) Back In N.Y.C. (5:43) Lilywhite Lilith (2:42) Here Comes The Supernatural Anaesthetist (3:00) Silent Sorrow In Empty Boats (3:07) The Colony of Slippermen (8:14) Ravine (2:04) In The Rapids (2:24) It (4:17)*** star songs: The Waiting Room (5:25)"
    },
    {
      "reviewer": "m2thek",
      "date": "Posted Wednesday, December 29, 2010",
      "rating": 2,
      "text": "When I first heard The Lamb Lies Down on Broadway, I was like a kid on Christmas. I was at the height of my love for Genesis, with their previous three albums nearly defining progressive rock for me. The first day I got the double album from my library, I must have listened to it at least four times and spent half the day reading its story and lyrics. Unlike my beloved Nursery Cryme, Foxtrot, and Selling England By the Pound, however, those first few listens were the most enjoyable I would ever have with The Lamb.Considering how little had changed in the band since their last offering, it's incredible how different The Lamb sounds from anything Genesis had ever done before. Although the guitar is just as powerful and melodic as ever here, Steve Hackett rarely brings it out, with only a handful of songs having memorable guitar passages. This leaves a gap in the music that the keyboards fill, and become the dominant instrument on this album. Continuing the trend from the last album, Tony Banks is striving for more modern equipment, with synthesizers being his keyboard of choice here. The synth sounds he uses are just a little too bubbly, and end up nagging at me too many times to say that they work well. The piano and Mellotron are brought along for the ride, but the organ that helped craft so much of Foxtrot's sound is nowhere to be found. Mike Rutherford and Phil Collins offer comparable efforts to years past, if possibly less impactful.Now that we've come to the most prevalent sound found on The Lamb, the vocals, we also come to my first complaint. While Peter Gabriel is still Peter Gabriel here, something has changed in him. His voice has taken on a more raw quality that he hadn't shown before. Maybe it has to do with the characters he's playing, or the nature of the concept of The Lamb, but it's not nearly as enjoyable, and at times reaches levels of annoyance. There are moments of beauty in the vocals, but when I look back on what I've listened to, it's the former that fills my head. The story that Gabriel has crafted is what moves the music along, as we follow its main character Rael from the streets of NYC to a mysterious underground world. The concept is fairly interesting, but ends up being stranger than it is good and compelling.The second complaint I have with The Lamb applies to the album as a whole: there's simply too much here. I understand that making a double album back in the days of vinyl was an all or nothing deal, but that shouldn't be an excuse for mediocre, and even bad songs. There are some really wonderful songs and passages here, but they are too few, and too interspersed with tracks that just don't cut it. Since getting over the giddiness of my first listens, the music hasn't compelled me enough to make it through in a single listening, which clocks in at just over an hour and a half. This is also a pretty wordy album, and with Gabriel's voice not doing much for me, the fact that there's a lot of it doesn't help.The bright side of this ordeal is that if Genesis' past work hasn't been your favorite, or you're just looking for a different sound from them, The Lamb Lies Down on Broadway offers a very different experience, and could be something fresh and exciting. If you're already a diehard fan, however, you shouldn't expect to love this album like you love their others. It's worth checking out for the good songs, but they're not enough to hold the whole thing together and make this a great, or even a good album from Genesis."
    },
    {
      "reviewer": "baz91",
      "date": "Posted Sunday, April 3, 2011",
      "rating": 2,
      "text": "This has to be one of the most over-rated prog rock albums in my opinion. This may be heresy to a lot of proggers, but I cannot say that I really enjoy this album enough to give it any higher than 2 stars! I've gone up and down the reviews list, and there are other reviewers on this site who agree with me, so I know it's not just me that believes there are some serious flaws with this album that is rated so highly.Lets start with the obvious. The story, it's a bit silly isn't it. I wouldn't say that this alone is a bad thing, since Gong proved outright that silly can be great with their Radio Gnome Invisible trilogy. This story though is presented far too seriously. Genesis were always known to be good story tellers, but somehow they get it all wrong here. With '...Hogweed' and '...Friday' you felt they were telling faux-fables, which had a slightly comic air about it. WithThe Lamb Lies Down On Broadwayhowever, after a few songs your going to be utterly confused as to what's going on here. A man named Rael is transported to a dream world and tries to save his brother John is the simplest way to explain it, but the story is so convoluted with redundant parts and nonsensical parts that it's difficult to keep interested. The Hipgnosis designed cover, while looking very cool, just doesn't fit Genesis music either, making the album look extremely cold and serious. The Paul Whitehead album covers made the albums seem somehow warmer and more inviting. Between the bizarre lyrics and Gabriel's cryptic story in the liner notes, the listener is left to piece together the story for themselves.Second, there are too many songs! Granted this is a double LP, but there are 11 songs on the first disc, and 12 songs on the second: too many for a band as symphonic as Genesis. This works out at an average of 4:06 per song! I can't help myself, I like longer songs! Dissappointingly, there are no songs over 10 minutes in length; the longest songs areIn the CageandThe Colony of Slippermenboth being 8:12 in length. But in fact they don't even last this long: 'In the Cage' has a bizarre minute long coda, and 'The Colony of Slippermen' has an awkward 1:48 intro. The short song structure gives the album a rather convoluted feel, which goes well with the convoluted feel of the story.Most importantly though, the music itself is very inconsistent. I can safely say that no individual song on here is a stunner. There is certainly nothing of the standard of 'The Musical Box' or 'Firth of Fifth'. Thankfully though, there are a few good highlights in this album. The frenetic keyboard solo from 'In The Cage' is the main reason I listen to that otherwise OK song. The lyricI see no sign of free will, so I guess I have to pay!is really clever.Counting Out Timeis a great tune, tricking you into thinking it's a bouncy pop tune, but upon close listening revealing itself as quite a twisted dark track. The melody for the songAnywaywas actually written as far back as 1969, five years before the album itself, but fits beautifully here. The lyrics and sound of the song are just brilliant and leave you wanting more. This leads intoHere Comes The Supernatural Anaesthetistwhich has a fantastic yet brief vocal section right at the beginning, before going into a very awkward groove. These are all the really good highlights I can think of.Parts of the rest of the album sound atrocious. One major point I dislike is the frequent use of effects to change Gabriels voice. Listen to the beginning of 'Dancing with the Moonlit Knight', and you'll hear pure, unadulterated beauty in that man's voice. Listen to the title track of this album and you'll hear something very nasty indeed. The effects make some of the lyrics uncomprehensible, but mostly distort his voice into a very annoying sound. The point where he screamsI'M RAEL!is such a case. Probably the best example of where his voice isn't distorted is on the acoustic soundingThe Lamia.Some of the other effects are annoying too. That keyboard sound inBack in N.Y.C.carries on for the whole track and annoys the hell out of me. The only saving grace of the song is that it is in 7/8. The closing trackit.is also one of the worst closing tracks I have heard on an album. The dreadful riff used throughout the song really grates my ears. Also the song itself is a bit of a cop-out when you are trying to follow the twisting story. Rael looks down at John, and sees himself, and then Peter Gabriel starts spouting gobbledigook aboutitwhateveritis, leaving me very dissatisfied. The least I wanted from the story was resolution, and since there is none, it's hard to enjoy it that much. The lineIt's only knock and knowall, but I like it.is NOT GOOD ENOUGH to finish a double LP concept album!Other parts that annoy me is how there seems to be more filler towards the end of the album. There are several long dull instrumental tracks on the album, most of which are on the second LP, includingSilent Sorrow In Empty BoatsandRavine. Most people would say that their least favourite track is the very avant-gardeThe Waiting Roombut in fact this is one of the more enjoyable parts. It's genuinely very creepy, but after about 3 minutes, the band come in with a very strong riff. I can't help comparing instrumentals likeHairless Heartto Pink Floyd'sThe Great Gig in the Sky, which perform the same function as an intermission between lyrics, but how Pink Floyd pull it off so much better.With all these negative points about the album, you might be wondering why I give this 2 stars and not 1. The answer is that I don't genuinely dislike this record, but I think listening for the first time under the impression that this is a masterpiece is very wrong. Since there has been an overwhelming amount of praise, I felt that I should make clear the flaws on the album. Out of the seven \"progressive\" Genesis albums betweenTrespassandWind & Wuthering, I regret to say that this is my least favourite. However, if you consider yourself a true progressive rock fan, you should hear this album at least once, as it has become a very important album, much like Yes'sTales From Topographic Oceans. Just don't expect too much, OK?"
    },
    {
      "reviewer": "Tom Ozric",
      "date": "Posted Friday, April 8, 2011",
      "rating": 4,
      "text": "This album has been reviewed hundreds of times and its excellence has been justified - this grand concept album is one of the finest from the classic early 70's Prog boom. The production is rather 'thick' and each band member performs to the maximum of their abilities. So many songs on this release, nary a weak moment throughout. Plenty of inspired weirdness from Peter Gabriel here - the lyrics, the bizarre story within the LP's gatefold, he also contributes a lot more flute than usual. Another facet worth mentioning is Tony Banks' keyboarding ; when you hear him play it's almost like discovering another Wakeman or Emerson (or whichever order you have discovered the 'mainstream' giants...). Even a certain ENO has guested here - my guess is that he contributed strange electronics you can hear on 'The Waiting Room' and 'In The Colony Of Slippermen'. Either way, a superb Progressive journey which lasts over 90 minutes that's worth taking. Not quite the masterpiece after 'Selling England...', but close."
    },
    {
      "reviewer": "colorofmoney91",
      "date": "Posted Friday, April 8, 2011",
      "rating": 2,
      "text": "The Lamb Lies Down On Broadway is considered another masterwork in the Genesis catalog, but I honestly found this to be one of the least enjoyable albums that they've crafted. I always get a dry-pop feeling from it and not much material is memorable here. I've always wanted to truly enjoy this album, but I always get bored with the material and aggravated and the unreasonable length.I won't bother going into each of the tracks considering that there are 23 of them running just over 94 minutes in length. This album consists mostly of short songs that seem like the passages from earlier albums that I never found to be gripping in any way.There are a couple of short songs that I do enjoy. \"Fly On a Windshield\" is a heavy and symphonic with mellotron and has a short melody that repeats that I find to be really strong. \"Cuckoo Cocoon\" is a short tune with a nice melody and underwater-sounding vocals followed by a nice flute solo. Similarly enjoyable songs are scattered throughout this very long album, but there is only about 20 of the 94 minutes that I think truly sticks out.Though I don't really find this album to be enjoyable for most of its duration, this is highly regarded as one of Genesis' best albums, so I'd have to say that I recommend it to anyone interested in hearing a progressive rock classic. Also, this is the last album with Peter Gabriel, which is something that I don't consider to be too significant in the vocal realm as Collins' voice is very similar in my opinion."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Thursday, September 22, 2011",
      "rating": 5,
      "text": "Although The Lamb Lies Down In Broadway is undeniably a significant Genesis album - their sole double studio album, and their final effort with Peter Gabriel - I used to consider it rather overrated. A consequence of its length is that it's much harder to digest than their single albums of this period - but time taken to do so will be amply rewarded.The band seem to have taken the album as an opportunity to reposition their music and edge very slightly away from the pastoral style of their previous works to appeal to a broader rock audience, and in particular to break into the States. This is most evident in the concept, which asks the listener to accept the rather baffling casting of Peter Gabriel as a New York street thug who undergoes a spiritual crisis (and might possibly have raped someone prior to the commencement of the story if you read between the lines of some of the songs), but it also crops up here and there in the music - which regularly backs away from the complexity of earlier works to embrace more mainstream material and even novelty songs (such as Counting Out Time - a hilarious spoof of sex manuals and dating advice books of the 1970s which could almost be a decades-early satire of the \"Pickup Artist\" movement).Brian Eno helped out in the producer's seat this time around, with the consequence that the sound of many tracks - particularly instrumentals such as Silent Sorrow In Empty Boats - doesn't quite sound like the Genesis of old. That's fine, but I'm not sure the collaboration is completely successful either - at points there seems to be an irreconcilable clash between the prog majesty of Genesis and the increasingly ambient leanings of Eno, though I would stress that a lot depends on what mix you listen to here. (Both the original vinyl and the 2007 remaster and remix on CD strike me as being a bit more successful than the 1994 \"Definitive Edition\" remasters - which, given that they were replaced just over a decade later, clearly weren't as definitive as they thought they were.)In addition, the album finds is very self-indulgent, and some may find that difficult to get beyond unless you find Genesis' particular quirks endearing. Gabriel allows his whimsy and theatricality to run free, but in truth the imagery he uses is barely coherent - are we dealing with a nightmarish allegory or a fairytale, Alice In Wonderland journey? Is Rael a naive and sensitive spiritual searcher or an abusive individual who's coming to recognise the danger his lack of control of his sexual impulses poses to those around him?In the context of a novel ambiguities such as this might well be explored in a meaningful manner, but as far as concept albums go Gabriel doesn't really have time to explore all the different dimensions he tries to include in the story - especially since there are plenty of instrumental stretches where he doesn't sing at all - and therefore none of the alternatives quite manages to fit together. This has an impact on his vocal performance, where at one point he's expressing the agony of Rael's tortured soul and the next he's off on some twee little tangent, and he doesn't really sound wholly sincere in either mode.On top of this, Gabriel's penchant for goofy, twee, whimsical songs is indulged mightily on this album, with The Grand Parade of Lifeless Packaging, Here Comes the Supernatural Anaesthetist and (especially) the Colony of Slippermen being particularly irritating unless you are in just the right mood for his flights of fancy: imagine Supper's Ready if Willow Farm dragged on for five minutes (though at least all those parts have enough musical ideas going on that it isn't quite as repetitive as I've made it sounds). On top of that, the story and album seem to lose their direction entirely on side four and there's a certain amount of instrumental work needed to actually pad out the double album running time. (Seriously, here's the end: Rael and John walk along by a ravine and they both end up in a river, Rael comes to a dramatic realisation. That doesn't need 16 minutes and five songs to relate.)I'd previously felt that The Lamb Lies Down On Broadway was one of those double albums which would be an absolutely top-notch single album if the musicians involved had just trimmed down the fat and crammed as many of their musical ideas as they could into the more limited running time, though I've warmed more to its later sections over the years. Still, even if some of its sections are a bit inaccessible, others will grip you immediately. The title track is great, In the Cage is an incredible trip, Back In New York City is one of the Gabriel-era's bands most successful attempts to grow beyond their pastoral prog base, and The Lamia is a beautiful track with imagery which is in equal parts charming, sensual, haunting and disturbing - it's the point on the album where I would say Gabriel's lyrics are at their best, establishing the strange \"Lewis Carroll meets Sigmund Freud\" atmosphere of the concept's supernatural/subterranean elements better than any other track.Undeniably a significant experiment on the part of the band, as well as providing a host of great sounds and moments. If you're in just the right mood, it's great listening - but I find that that mood doesn't involve wanting to follow the story of a street tough from New York called Rael so much as it is wanting to have some pastoral prog prettiness turned spooky by Brian Eno's production affectations. As an actual rock opera or concept album, I feel that it's more interesting for the weird imagery Gabriel plays with than for any attempt at an actual narrative, but as a collection of songs and the capstone to the Gabriel era it's phenomenal. I'd recommend coming to it last out of the Gabriel-era albums, for all of them from Trespass to Selling England are more immediately gripping, but tackle it sooner or later."
    },
    {
      "reviewer": "rogerthat",
      "date": "Posted Friday, April 6, 2012",
      "rating": 5,
      "text": "The Gabriel era of Genesis bows out here and saves its best for the last salvo. It is also, in a way, a culmination, a logical conclusion for that lineup. At this point, singer and lyricist Peter Gabriel's vision had begun to overpower the band (if you listen to their side) or at any rate was not something they agreed with a whole lot.Much like the hard hitting The Wall stretched Pink Floyd to a point where the rest of the band wanted out, The Lamb Lies Down on Broadway just wasn't Genesis enough for the liking of most of Genesis. But as a musical odyssey that narrates the travails of protagonist Rael, it is just fabulous. It may not have been Genesis enough but it was so in ways that arguably added new dimensions and interesting shades of emotion to their sound.While this website showers much love and affection on Genesis, in prog circles, they are typically seen as the 'least' of the big four or five of prog. One of the reasons for this is they were only fleetingly cutting edge up to this point. Their music is hugely interesting, especially their knack for managing shifts and transitions almost seamlessly. But they are not strongly linked to rock/blues influences and can sound distant to those newly initiated to prog. And while they are fortunately not cold and clinical, they also prefer to sound funny and clever rather than truly stirring your soul (these are just tendencies by the way). They also tend to be on the lighter side, rarely being particularly scary or menacing.Genesis continue to be theatrically oriented on this album. But they have now added some serious edge to their sound. As a result, it is unlike any Genesis album before or after. There are moments when the music on this album is positively creepy. It is often spine chilling and yet so beautiful you cannot help feeling hypnotized and being drawn into the music. For that reason, it is perhaps the only Gabriel era album as a whole (and not speaking of specific tracks) that doesn't have to be looked at from a more analytical perspective to appreciate.No, from the moment Tony Banks makes his splendid entrance in the title track, you are set for a Genesis experience like no other. Banks' piano on, say, Firth of the Fifth is beautiful. On Lamb Lies Down on Broadway, it is both beautiful and suspenseful. It builds your expectations and makes you want to hang onto every note just to discover what's next. And Genesis achieve this effect repeatedly on this album.In terms of structure, it is far less epic than Foxtrot or Selling England By The Pound and yet, in many ways, more unorthodox and more daring. The title track is followed by Fly On A Windshield and instead of rapidly developing passages, you get imposing guitar being re-iterated for effect until you can, quite literally, feel the presence of a monumental wall of sound. In The Cage begins with heartbeats....Floyd-esque, ha!This willingness to explore more nuanced ways of building a song is also evident on The Lamia. The Lamia belies the popular notion that a track must be heavy and abrasive to convey darkness and evil. It employs utterly beautiful textures but the notes warn you (and Rael) of what is to come. Gabriel''s singing too is largely soft and controlled and it only goes to make the experience more tantalizing. And when Hackett plays the coda, you are left completely at their mercy, hopelessly enchanted.Brian Eno's 'enossification' also makes a telling impact on their sound, as Banks' tones now communicate and express like never before. The band as such is in top form, Collins being particularly impressive on tracks like In The Cage and It. Gabriel as the narrator of the rather ambitious concept is omnipresent. And even though Hackett doesn't get much time for himself, some of his most memorable contributions to Genesis are on this album.That could actually be said of the band in general. This album gets flak for the presence of a fair few songs that are not too essential but it also has some utterly hot cuts. The number of tracks on this album alone that could be mentioned amongst the best Genesis tracks is crazy - the title track, Lamia, In The Cage, Chamber of 32 Doors, etc. As I have tried to convey above, Genesis have never before been so purposeful and probably never after either so the better parts of this album absolutely rule.With this album, Gabriel had clearly crossed over to the other side. A side that has some likeness to his solo album Melt in a very loose sense (so don't go looking for any specific similarities) and a side that the rest of the band may not have been too comfortable with. I would not like to comment on the circumstances of Gabriel's departure from the band but if he had continued, the band would have been saddled with the unenviable task of outdoing this magnum opus. As it stands, it represents a high point in Genesis's career and also a point of departure from which the band necessarily had to change. One of the essentials of not only Genesis's discography but prog in general. 5 stars."
    },
    {
      "reviewer": "Roland113",
      "date": "Posted Friday, January 25, 2013",
      "rating": 5,
      "text": "Ok, so I'm taxiing down a runway, can't use anything that goes beep or has a back light, what to do? What to do? 'A-Ha!' I said, much to the chagrin of the stranger on my right and my manager on the left. After that, I tried to keep the conversation in my head and quickly decided to listen to something I know inside and out.'The Lamb Lies Down on Broadway' is one of the seminal classic prog albums containing just about everything a fan of progressive rock could want. It is a double CD concept album that details the journey of our hero, Rael from Earth to the afterlife. Or at least that's how many people, myself included, interpret the album. Each song flows seamlessly into the next including the pause to skip CD's (more about that later). Oddly enough, this one took me longer to get into than the remainder of the Genesis catalog, even albums that get only 2-3 stars.Peter Gabriel has truly matured as a singer by this point and has learned to control an audience's emotions through his voice. We are taken on an emotional roller coaster throughout, starting with the rage and anger in 'Fly on a Windshield' and 'Broadway Medley of 1974' all the way through the final jubilation that comes with reaching the end of a long journey in 'It.'My favorite song on the album is easily 'The Chamber of 32 Doors'. This is another stop on the emotional 'wheel of fish' showing the pain and anguish of Rael's heartbreaking hopelessness and loneliness. Mr. Gabriel's aria towards the end of the song, illustrated exactly what he's learned as a vocalist, the quiver in his voice is perfect.As I mentioned, every song flows perfectly into the next, including 'The Chamber', the flipping of the CD after the emotional 'Chamber' gives the listener just to slightest moment to regroup before 'Lillywhite Lillith' recues both the listener and 'Rael', slamming us with a killer Steve Hackett riff.Speaking of the musicians, everyone is spot on as you'd expect. Two of Mr. Banks more notable synth solos can be found in 'In the Cage' and in 'The Colony of the Slippermen.' Both solos show his focus on both speed and melody.I want to mention one last song here, 'The Waiting Room' has become one of my favorite songs from the album. For years, I would simply skip it as I didn't care much for the chaotic 'angry cat ghosts in regalia' section. I happened to let it go one day, I was painting, and was able to listen closely to the exit from the chaotic section. Wow, suddenly the song made a lot more sense and became a favorite of mine.In summary, this is the second in a series of four, five star albums by Genesis (possibly the third, some days Foxtrot is a four star CD, some days it's a five star one). It's a highly emotional album full of fantastic music and wonderfully executed musicianship."
    },
    {
      "reviewer": "Magnum Vaeltaja",
      "date": "Posted Monday, March 14, 2016",
      "rating": 3,
      "text": "For me, Genesis has always been about two things, atmosphere and storytelling. On this final Gabriel-era release, they knock one of those out of the park but the other really lacks. What we have hear is a megalith of an album encompassing over 90 minutes of songs telling of the grand spiritual journey of its protagonist, and the reason why I say \"songs\" specifically as opposed to \"music\" is because of their content. What we have hear is not 90 minutes of Firth of Fifths or Musical Boxes but a whole lot of Peter Gabriel singing. The lyrics are brilliant and the story is cohesive, no doubt, but ultimately there just isn't enough substance from the rest of the band that I can enjoy this album. For that reason I'll give it 3 stars; there's no doubt that the artistry present here is good but it isn't really essential unless you're a Peter Gabriel fanatic."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Thursday, July 21, 2016",
      "rating": 5,
      "text": "Review n� 79As all we know, Genesis is a British progressive rock group formed in 1967 when Peter Gabriel, Tony Banks and Mike Rutherford were students at Charterhouse School at Godalming, in Surrey. The band reached their highest point when they saw joined to them Steve Hackett and Phil Collins. After the recording of three studio albums \"Nursery Crime\" in 1971, \"Foxtrot\" in 1972 and \"Selling England By The Pound\" in 1973, which are, in general, considered their best studio works, Genesis decided to make a new studio album, \"The Lamb Lies Down On Broadway\".\"The Lamb Lies Down On Broadway\" is their sixth studio album. It's a very ambitious album, a double conceptual album, which was recorded and released in 1974, and it marked the culmination of the group's early history, and which became a landmark in the progressive rock music. It's a conceptual album with a very involved story and a large cast of characters. The album tells a surrealistic story of a young Puerto Rican delinquent named Rael who lives in New York swept to an alternate dimension with bizarre creatures and other hazards to rescue his brother John. The story describes his spiritual journey and his quest to establish his freedom and identity. Several events and places described are derived from Gabriel's dreams, and the protagonist's name is also a pun of his own surname.Although, despite all the songs have been signed by all band's members, the music of most of them were only written by Banks, Collins, Hackett and Rutherford, without the participation of Gabriel, who wrote the story and all the lyrics alone. This fact created a very strange situation with Gabriel writing apart from the others. On their previous albums writing music has always been a group's effort and the lyrics always were written by various members of the band. That fact caused great tension in the group, especially and particularly because Rutherford had suggested originally a conceptual album based on \"The Little Prince\", a famous novel by the French writer Antoine de Saint-Exupery.\"The Lamb Lies Down On Broadway\" marks also the strained relations between the band's members, particularly between Banks and Gabriel. So, it wasn't a completely strange thing that during \"The Lamb Lies Down On Broadway\" live tour, Gabriel have announced to his band colleagues that he had decided to leave the group. However, he fully fulfilled his commitments with the band to the conclusion of the entire live tour.In contrast to the other albums made by Genesis, \"The Lamb Lies Down On Broadway\" is a collection of short tracks. Originally, the album was released as a double vinyl disc with four sides and twenty three tracks. The album is set up in a remarkable fashion, with the first LP being devoted to more oriented rock songs and the second being largely devoted to more instrumental tracks. So, the first LP is without any question, far more direct than the second. It contains a number of masterpieces, such as the eponymous first track \"The Lamb Lies Down On Broadway\", the fifth track \"In The Cage\" and the tenth track \"The Carpet Crawlers\". These three tracks of the album are some of the most favourite's songs for the band and were frequently performed by them, on their live shows even as solo artists.\"The Lamb Lies Down On Broadway\" is a massive monolith among the works of Genesis. It's their only double studio album, it's their only true conceptual album, it's their last release with Gabriel and it's their only album that was played in full on the accompanying live tour. So, many things about this album are remarkable. The music is ethereal at times and groovy at others and the lyrics on the album are very polished. It also has already been mentioned by some that describes this album as the Genesis's most American work. This is a very special album in their entire musical career.Conclusion: \"The Lamb Lies Down On Broadway\" is a colossal and a fantastic studio work. It's largely a Gabriel's conceptual album, and it's also unfortunately, his swansong with Genesis. Despite the conceptual and musical differences, \"The Lamb Lies Down On Broadway\" is for Genesis at the same level as \"Tales From Topographic Oceans\" is for Yes. Who've read my review about \"Tales From Topographic Oceans\", knows that I love that album too. However, the mainly difference between these two pieces of music is that \"Tales From Topographic Oceans\" is a very controversial album and very few consensual for fans, prog heads and even for the band's members themselves. While with \"The Lamb Lies Down On Broadway\", it isn't the same thing. But above all, it's a pity that after this extraordinary album Gabriel had to leave the band. However, in every way, this is a considerable and lasting achievement work and it will be always a milestone in the entire band's work. They had gone as far as they could together, and the simple question is this. What would have been Genesis, if Gabriel remained in the group? We will never know, really. The true is that with his last participation on \"The Lamb Lies Down On Broadway\", Gabriel left the band through the front door.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "Progfan97402",
      "date": "Posted Thursday, October 13, 2016",
      "rating": 5,
      "text": "It's 1993, I was 20 years old, and I was very familiar with 1980s Genesis, from Duke up to their latest studio offering, We Can't Dance, and to be honest I was frankly sick of it. So I turned to The Lamb Lies Down on Broadway, their final album with Peter Gabriel. I was already familiar with the title track, as FM rock station still played that song on occasions even into the 1990s. Other than that, the earliest Genesis song likely heard on the radio would be \"Follow You, Follow Me\" from 1978's ...And Then There Were Three... which is basically the first '80s Genesis song. What a huge breath of fresh air the Lamb was. No cheesy love songs like \"In Too Deep\", none of that nasty '80s production values that horribly dated music of all kinds in that decade. No Yamaha DX-7 or drum machines, but instead Hammond organ, Mellotron, RMI electric piano, piano and ARP Pro-Soloist. I have never really followed the story, and it looks like it's next to impossible to follow anyways. The LP comes with a lengthy story that's equally hard to follow along. The title track is the first, it has that same piano introduction I heard from New Trolls on \"Studio\" from their late 1972 album UT. Was this supposed to be a classical riff I don't recognize, or did Genesis actually steal from New Trolls? Unlike ELP, I don't believe I noticed Tony Banks ever directly stealing from classical songs, so I don't know. What I do know is Genesis were very popular in Italy before the rest of the world really took notice (with the exception of Belgium, who also took notice perhaps even earlier than the Italians). \"Fly on a Windshield\" is a stark contrast, gentle acoustic, atmospheric song with eerie Mellotron choirs, while the music gets more rocking on \"Broadway Melody of 1974\", with some great Mellotron playing. \"Cuckoo Cocoon\" is a mellower piece, with flute from Peter Gabriel (before I heard this album, I never realized he could play flute as his solo albums certainly never featured any, not even \"Sledgehammer\" which is a sampled Japanese shakuhachi bamboo flute courtesy of a Fairlight). \"The Grand Parade of Lifeless Packaging\" shows the less serious side of the band, while \"Carpet Crawlers\" sounds similar to the title track, complete with that same RMI electronic piano riff, but slower pace and more moody. \"Chamber of a 1000 Doors\" is a generally slower piece with some mid tempo parts. \"Lilywhite Lillith\" is rather upbeat, sounding undeniably Genesis, one of the rare radio friendly moments on the album like the title track. \"The Waiting Room\" is an instrumental, rather experimental piece, there are some synth effects, before it turns into your typical 1970s Genesis instrumental. \"Lamia\" is largely piano-dominated, while \"Silent Sorrow in Empty Boats\" is an instrumental piece complete with Mellotron choir. Back in 1993, it was then I dawned on me that weird choir sound emanated from the Mellotron, as I heard that same choir sound off Jean Michel Jarre's Oxygene (in between Part II and Part III). \"The Colony of Slippermen\" starts off strange with strange percussion and strange synth sounds, before the song kicks in, I really dig the organ riff and those synth solos. I especially like how the song ends, before going into some strange ambient territory on \"Ravine\". \"The Light Dies Down on Broadway\" is, as expected, a variant of the title track, which makes sense given this is a concept album. \"Riding the Scree\" features some strange bass riffs and synth solos, before the vocals kick in. \"It\" is the closing song, and it sounds like a closer too.OK, I know there are many out there who would like to decipher the concept behind this album. I do know it has something to do with a Puetro Rican kid in New York City named Rael who spraypaints walls, and then gets a strange visitation from various characters, but then that's where it loses me.It's been said plenty of times that Peter Gabriel left after some 1975 tours. The reason was family life, his wife Jill was to give birth to a child (and perhaps raising a child was the big reason it took until 1977 before Peter Gabriel released his first solo album, and he did a version of Strawberry Fields Forever off the All This and World War II album of 1976). It was a big Genesis landmark, but of course not everyone will agree this was their crowning achievement, given all their previous albums have been single albums and easier to take in. Regardless, for some reason, as much as I enjoyed it in 1993, I seem to enjoy it even more now in 2016. It's not an easy listen. Listening to this album, I can easily understand why radio stations would be scared off playing anything off this album aside from the title track. To me, it's a total classic that really gave me a different attitude of Genesis."
    },
    {
      "reviewer": "The Crow",
      "date": "Posted Thursday, November 10, 2022",
      "rating": 4,
      "text": "Peter Gabriel's latest album with Genesis!Like almost all the double albums I know, \"The Lamb Lies Down on Broadway\" makes the mistake of containing a few songs that are below the rest (The Waiting Room, The Lamia, Cuckoo Cocoon...), detracting from the value of the whole.Another fault, in my opinion, is that it is an album too focused on the figure of Peter Gabriel, who is the absolute protagonist of the show. It is true that all the instruments have the opportunity to shine throughout the work, but it is Peter's voice and his acid lyrics who finally ends up monopolizing much of the album.In any case, it is another excellent record by the British, somewhat darker and heavier, which despite being more irregular than their two previous albums, contains enough brilliant moments to be highly recommended and earn an excellent rating.After this, Genesis would never be the same again!Best Tacks: In the Cage (my absolute favorite on the album, amazing keyboard work), Back in NYC (a clear inspiration for Spock's Beard \"Snow\". One of the heaviest Genesis songs), Carpet Crawlers (great vocal melodies, of the most memorable thing Gabriel has ever sung) and Riding the Scree (another outstanding work by Banks)My Rating: ****"
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Saturday, June 3, 2023",
      "rating": 4,
      "text": "After the successful \"Foxtrot\" and \"Selling England by the Pound\", Peter Gabriel found it difficult to agree with the band members on the musical direction they should follow, given that his leadership was increasing, and that Genesis was holding his shoe tighter than he was willing to accept. The result of that definitive moment, with creative control ceded to Gabriel to structure the work as he defined, was \"The Lamb Lies Down on Broadway\"There is no doubt that the quality and value of many of its passages are part of the band's legendary history, such as the opening \"The Lamb Lies Down on Broadway\" and its consistent keyboard, the hypnotic \"Broadway Melody of 1974\", the intricate and very progressive \"In the Cage\", \"The Grand Parade of Lifeless Packaging\" and its airs reminiscent of \"Supers Ready\", and the superlative and serene luminosity of \"The Carpet Crawlers\". That handful of songs is enough to consider it as a excellent album.However, a few songs from the second part, such as the disconcerting instrumentals \"The Waiting Room\", \"Silent Sorrow in Empty Boats\" and \"Ravine\", or the insipid \"It\", do not add much to the final result. In the realm of unverifiable speculation, perhaps a single more condensed album instead of two would have given \"The Lamb Lies Down on Broadway\" more robustness.With Steve Hackett's guitars being very timid (except in a few episodes like the spacey \"Cuckoo Cocoon\"), and Tony Banks, on the contrary, very active and experimental with his keyboards throughout the album, \"The Lamb Lies Down on Broadway\" , the story of the innocent and helpless young Puerto Rican Rael in the New York jungle, became the final chapter of Peter Gabriel's remarkable adventure in front of one of the greatest exponents of progressive rock of all time.4 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album4963.html",
  "last_parsed": "2025-05-18T12:56:03.287687"
}