{
  "album_title": "HOT RATS",
  "artist_name": "Frank Zappa",
  "artist_page_link_local": "artiste2ef.html?id=1023",
  "year": 1969,
  "rating_value": 4.36,
  "rating_count": null,
  "review_count": null,
  "genre": "RIO/Avant-Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/1023/cover_165531362016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Peaches en Regalia",
      "duration": "3:39",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Willie the Pimp",
      "duration": "9:23",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Son of Mr. Green Genes",
      "duration": "8:57",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Little Umbrellas",
      "duration": "3:09",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "The Gumbo Variations",
      "duration": "12:54",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "It Must Be a Camel",
      "duration": "5:17",
      "is_sub_track": false
    }
  ],
  "lineup": [
    {
      "musician": "Frank Zappa",
      "instruments": "guitar, octave bass, percussion, arranger & producer"
    },
    {
      "musician": "Captain Beefheart",
      "instruments": "vocals (2)"
    },
    {
      "musician": "Lowell George (uncredited)",
      "instruments": "rhythm guitar"
    },
    {
      "musician": "Ian Underwood",
      "instruments": "piano, organ, flutes, clarinets, saxes"
    },
    {
      "musician": "Don 'Sugarcane' Harris",
      "instruments": "electric violin (2,5)"
    },
    {
      "musician": "Jean-Luc Ponty",
      "instruments": "electric violin (6)"
    },
    {
      "musician": "Max Bennett",
      "instruments": "bass"
    },
    {
      "musician": "Shuggy Otis",
      "instruments": "bass (1)"
    },
    {
      "musician": "Ron Selico",
      "instruments": "drums (1)"
    },
    {
      "musician": "John Guerin",
      "instruments": "drums (2,4,6)"
    },
    {
      "musician": "Paul Humphrey",
      "instruments": "drums (3,5)"
    }
  ],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Wednesday, April 14, 2004",
      "rating": 5,
      "text": "Boiling RatsPresented as Frank's first solo album, this is Chapter one of his explorations of jazz-rock (this is relative, because he had dabbled into the future genre in his previous albums, including King Kong on Uncle Meat) but also the pinnacle of his career. This is a solo album, not a Mothers album, although you'd have a hard time telling it apart, only that it is less goofy and parodic and more instrumental and musically focused. Playing on the album are Ponty, Underwood, and Guerin (among others), while Van \"Beefheart\" Vliet is singing on a track.Opening on the amazing Peaches In Regalia, but it is the amazing Willie The Pimp, THE classic of the album, with Don Van Vliet singing raunchily and a wild Zappa guitar solo. Green Genes features Underwood's wind instruments (multi-tracked) and Zappa's guitars again, but also that same Underwood on keyboards as well. An outstanding side of vinyl.The flipside opens with the shorter jazzy Little Umbrellas instrumental, perhaps the \"parent pauvre\" of Hot Rats, but the 17-mins Gumbo Variations of pure bliss, especially if you're a fan of solos. Flabbergastingly awesome stuff. The closing Camel piece is the most difficult track of the album, the one closest to dissonant avant-garde music; but this is so very light. Another excellent track.Every one of these numbers here are a classic but Peaches and Gumbo come out, and Don Beefheart Van Vliet's contributions to Pimp makes this album a gem. Coming with that pink pool shot artwork, this is THE Zappa reference, beit from progheads or the average John Doe and Willie Pimp. One of the main reasons for this album's high tenure is that it is mainly instrumental, thus putting the emphasis on the music and it isn't ruined by Francesco's whacked-out humoristic sketches, although there is still a lot of humour left in the music."
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Saturday, April 17, 2004",
      "rating": 4,
      "text": "I am sure most of you are all too well familiar with the late great ZAPPA's work, but for those who have not heard \"Hot Rats\" you are missing one of the best gems left behind from Frank ZAPPA. Here Frank is joined by a few friends including Jean Luc Ponty, Ian Underwood and vocalist Captain Beefheart. \"Hot Rats\" is full of surprises and offers many incredible progressive rock moments. This album offers nice long tracks with extended heavy guitar solos and lots of sax and keyboard activity to keep you on the edge of your seat. This album seems to grow on the listener and then is almost one of your collections high points. This is a real gem and should be listened to by all prog fans. It may take a while to hit the first time ZAPPA heads as it moves into the bizarre and strange aspects of music and ZAPPA pushes the boundaries of modern sound and image. This is an essential masterpiece and must be in your collection."
    },
    {
      "reviewer": "greenback",
      "date": "Posted Tuesday, April 20, 2004",
      "rating": 4,
      "text": "This almost instrumental Zappa's album is very appreciated from miscellaneous kinds of people. It definitely has a jazz tendency, plus obvious rock elements as reveal the numerous guitar & violin solos and pleasant rhythms. There are some excellent piano parts, and I like very much the refined acoustic bass on \"Little Umbrellas\". \"Peaches en regalia\", \"Son of Mr. Green Genes\", \"Little umbrellas\" and \"It must be a Camel\" are the best tracks: very structured and complex, they have catchy & colorful horns sounds (sax-oriented). \"Willie the pimp\", very funny with Beefheart on lead vocals, contains, as usual, an eternal wah-wah guitar solo. \"The Gumbo variations\" has a free style, fast, definitely too gross and too long (16 minutes), with endless electric violin & guitar solos, and tons of drums; it is definitely not addictive. I find this record very good but slightly overrated."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Friday, April 23, 2004",
      "rating": 4,
      "text": "If you regard of the early sixties in the USA, this rock and roll/blues rock album was already quite progressive, even though in some circumstances only... that is you can get an inkling of his talent, which will be better developped in the future.It's not the most \"progressive album\" by Frank and -probably it should deserve an inferior score;neverthless some tracks such s \"Don 'Sugarcane'\", \"Harris\" or \"Willie the Pimp\", are a tasteful example of things to come later (listen to the experimental album \"Weasels Ripped My Flesh\"), representing his true mood... well these songs actually are almost equal to the most disappointing version of \"Gumbo Variations\", which is more similar; but there are some stunning spare classic breaks through (of course I remark these latter as \"classic\", regarding of his usual high standard). Moreover some of the themes will appear on other albums such as the \"Grand Wazoo\" and \"Waka Jawaka\"; while perhaps the song \"Son of Mr. Green Genes\" is the only one which is not much inspiring... it never minds, this work, not completely mature, is anyway worth checking out at least!!"
    },
    {
      "reviewer": "daveconn",
      "date": "Posted Tuesday, May 4, 2004",
      "rating": 5,
      "text": "When the croci in my mind are blooming, then FRANK ZAPPA's whimsical and colorful genius must be in full flower. I see you in the back of the class, looking out the window while all this wondrous music plays on. Well, wake up! Thirty years on, your grandchildren may quiz you on FRANK ZAPPA and Where were you when it all happened. Do you want to be the doddering old fool who pulls out a picture of the sofa bathed in the blue light of the television and point saying \"There?\" No you don't. You want to tune into \"Hot Rats\". The wonderful thing is, there's still time. Oh, the good seats on the ground floor are already taken, but there's plenty left in the mezzanine, as good a place as any to witness the miracle of \"Peaches En Regalia\" or \"Son of Mr. Green Genes\", where the composer turns our concept of classical music on its head and gives it a much-needed spanking. Or, if that doesn't push your button, than surely the sweaty and buck nakedly brilliant blues rock of \"Willie The Pimp\" and \"The Gumbo Variations\" must. I've spent some two-cent words and a coupla ten-dollar ones trying to sell folks on FRANK ZAPPA's music, but \"Hot Rats\" sells itself. If no other work from ZAPPA should survive (and somewhere in a conservative cabal sick with the smell of cigars, the possibility is probably being discussed right now), \"Hot Rats\" alone would keep the flame alive through the ages. The composition, the arrangements, the musicianship, the sheer entertainment of it all is initially too much to comprehend, but in time it sinks in, and gestates, and first it's a little blue crocus, and then a white one, and a pink one, and before you know it you're trading bootlegs with some guy in Holland who says you have to hear this killer version of \"Valarie\" with an alternate ending (or something like that). Stepping back from myself a bit, I'm sure that jazz/classical hybrids like \"Little Umbrellas\" could trace themselves back to Duke Ellington or some other modern composer without a trail of bread crumbs, but I don't listen to a lot of that stuff, so for me ZAPPA's the gateway to this new musical world. And, honestly, your grandchildren will probably be asking you stuff like \"Ew, how could you have had a cRUSH on Eminem (or Britney Spears)?\", so I wouldn't worry too much about the ZAPPA shakedown from future generations. But if they do ask you about ZAPPA, start putting money away in a trust fund so they can go to Yale and eventually become president. I'd like to hear \"Brown Shoes Don't Make It\" played at least once at an inaugural ball in my lifetime, and I don't see any other way to do it."
    },
    {
      "reviewer": "Seyo",
      "date": "Posted Thursday, May 20, 2004",
      "rating": 3,
      "text": "Since I ever heard only a couple of countless Zappa albums I cannot consider myself an expert, but this one is really good, in particular for those who like jazz fusion. My favourites are \"Peaches en Regalia\" and \"Willie the Pimp\", the latter being the only vocal track on the album, sung by Captain Beefheart and with an unimaginably long guitar solo. However the remainder may sound a bit monotonous for uninitiated listeners, with lenghty instrumental sections, albeit perfectly played by Zappa, Underwood, Ponty and others. I am no fan of jazz-rock fusion, hence I am not giving more than this mark."
    },
    {
      "reviewer": "frenchie",
      "date": "Posted Sunday, March 13, 2005",
      "rating": 4,
      "text": "This is a classic album! Frank Zappa is the king of bluesy extended guitar solos. On this album there is a great cast of musicians that get a great sound from the instruments they have. This album is composed, completely using bass, drums, guitar, keyboard and violins, with some great sax in it too i think. They get such a good sound on this album with the instruments they have. It has a really jazzy, blues sound with some immense guitar work. Sometimes it seems like they are jamming out a lot but it actually follows some noticeable prog movement.\"Peaches en Regalia\" is a classic introduction. It has amazing production and sounds so lively and upbeat. This is really interesting and always manages to keep listener appealed with its constant flow. It has some really strong guitar work and bass throughout this track. This kind of sound has influenced many artists to follow, even the new Mars Volta album has a lot of Zappa influence, mainly on \"L'via L'viaquez\". This album instantly starts with a classic 60s sound and can appeal to fans of RIO, fusion, blues, jazz, classic guitar rock as well as psychadelia and space rock. I often find this album pretty trippy!\"Willie the Pimp\" is the only track with vocals on this album, sung by the amazing Captain Beefheart. I really like his music and thats what made me want to check out Frank Zappa as they have similar sounds and concepts. They even collaborate together quite often and this is one of the best moments as a team! This track has some amazing extended blues soloing, all members have a great input. I really love the violin intro and the captain's vocals add to it well by making this piece enjoyable and interesting with the humorous lyrics.the rest of the tracks follow a similar pattern but this does not make them seem like filler, nor does the album get boring or dragged down. They find many ways of making the second half of the album sound interesting, with some great basslines and keyboard work sneaking in. This album is highly recommended for fans of Captain Beefheart and it has so many great influences that lots of people can enjoy music like this. Frank is one of the best musicians in this kind of field and this album really is a great jewel that he left us."
    },
    {
      "reviewer": "Man With Hat",
      "date": "Posted Friday, June 17, 2005",
      "rating": 5,
      "text": "Awesome and historical!! One of Zappa's best records. I think all the historical stuff has been said here, so i'll skip that and get to the music itself. This contains some of the finest instramentals ever made. Peaches En Regalia, Son Of Mr. Green Genes, and Little Umbrellas are all fantastic. The Gumbo Variations is very good too, letting multiple members of the band show off (including sax, drums, bass, guitar, violin. So you was left out??) It Must Be A Camel is, IMO, the weakest song here. It is good, but not that good. It has some fine moments, but overall it is weak. I am not saying it is bad, just not as good as the rest. Then we have the only song here to have vocal, Willie The Pimp. A great song with a great melody, and wonderful guitar work. All in all this is a great album, and a must in any collection. Recommended till the cows come home."
    },
    {
      "reviewer": "Philrod",
      "date": "Posted Tuesday, June 21, 2005",
      "rating": 4,
      "text": "This is Zappa's try at fusion. An album full of his usual fun and joy side, Zappa tries to incorporate jazz into his music, with great results. Songs like ''peaches in regalia'' and ''willie the pimp'' remains classics, and the guitar solo on the ladder is seen as one of his greatest ever. As usual, the musicianship is exceptional, and really there is no bad song on this album. For legions of fan, this was theirentry into the crazy world of Zappa, because it is still accessible, and even if it takes a while to grow on you, it is all worth the wait. A classic, historical album. 4.5/5"
    },
    {
      "reviewer": "memowakeman",
      "date": "Posted Monday, July 25, 2005",
      "rating": 5,
      "text": "Yes, yes, ... im in love with this album, i want it for a long time and i finally buy it yesterday , ( im really happy , im like a boy with a new toy), why ?, because this album is really great , precious , beautiful , sorry, this album has the particular sound of Zappa, but i like it so much more because is almost instrumental , willie the pimp has the curious voice of captain beefheart, and the exquisite sound of the violins of God Ponty , also the only Zappa style, his entire music makes one progressive sub genre, but well, im in love with his album because to me it has an amazing sound, a very complex songs and a collage of great musicians, the opening song, peaches en regalia, it announce us what is going to be the album, is a short song, but instrumentally and great, willie the pimp everybody knows that classic, is a funny song but really a great song, my favourite one is son of Mr Green genes, i love that song, the lead guitar , the bass, the harmony and happiness makes me enjoying, and the skin of chicken puts me each time that I listen it, i love the solo of that song, little umbrellas for me is the worst song of the album , but the word \"worst\" doesnt exist here, the gumbo variations is also an spectacular song, is an epic, the long song of the album, really great, and finally, ha! it must be a camel, the only way to finishing a Zappa album, is with a song like this, i hope all of you has this album, because is really really good."
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Friday, August 26, 2005",
      "rating": 4,
      "text": "As we all know, Frank Zappa was an innovator in his sound and craft. Beginning his career in a very arty abstract kind of fashion, this is the first album to really get him the title of virtuoso musician. The album is mostly instrumental, the only song with actual vocal is Willie the Pimp (sung brilliantly by Captain Beefheart). The musicianship overall is top quality (as is the production). Frank Zappa plays precision guitar riffs and combines them with classy and over-the-top solos to create a very jazzy-blues atmosphere. The violin work on this album is magnificent (especially on the Gumbo Variations).I will name the stand out tracks rather than describe them all. The album opens up with instrumental favorite Peaches en Regalia, which has a great riff and some great woodwind work from Ian Underwood. An instrumental with a virtuoso punch packed within a 3 minute time frame. My favorite song on the album, Willie the Pimp, is a 9 minute epic of sorts. With a catchy riff, and a convincing vocal from Captain Beefheart (I'm not very big on his voice, though), singing about a \"Twenty dollah bill\". Combine that with a great Zappa solo and some precision bass and drum interplay, and you get 9 minutes of heaven. The Gumbo Variations is a 16 minute instrumental epic that takes many different shapes and has many different moods. Only one word can describe it, breathtaking. Magnificent violin work from Sugar Cane Harris, great guitar work from Zappa, great bass and drum interplay, and some outstanding keyboard from Ian Underwood make this track a 16 minute utopia of music.Overall, this is an album I think all Frank Zappa fans should have. I do not think it is as good as one of its counterparts, The Grand Wazoo, because it lacks flow and sometimes Son of Mr. Green Genes gets a bit boring. None the less, a great effort from this prolific artist. 4.5/5."
    },
    {
      "reviewer": "Bob Greece",
      "date": "Posted Friday, October 21, 2005",
      "rating": 5,
      "text": "This 95% instrumental jazz-fusion album contains so much variety, it's definitely a progressive masterpiece. There's not a note wasted on this album and it must be hard to get tired of listening to it. If you consider that is was done in 1969 and in America, it really is a seminal recording.It starts off with Peaches En Regalia, which contains such a variety of sounds that don't sound dated even now. The second track Willie the Pimp contains the only vocals from Captain Beefheart and these vocals fit in so well with the track and the album that I'm really glad they put them in. The track continues with a long guitar solo from Zappa that keeps your interest even though it's goes on for about 7 minutes. The other stand-out track on the album is the 17 minute Gumbo Variations, which starts with a sax solo (it grates a little but is still excellent), continues with a violin solo (sounding a bit like a guitar) and finishes with a guitar solo and a drum flurish at the end.It feels great listening to this album. It's kind of psychedelic. I think that this should be part of any prog collection and is particularly recommended to those who like instrumental music."
    },
    {
      "reviewer": "Philo",
      "date": "Posted Monday, October 31, 2005",
      "rating": 5,
      "text": "The quintessential Frank Zappa album? I'm not sure about that as I have only heard a couple of his albums, yet at the moment Hot Rats is the only Zappa album that resides in my collection. Largely drawn to it due to the merger of rock and jazz like sounds Hot Rats is an eclectic mix of thoughts, ideas and sounds from this visionary musician. Zappa makes and creates a collage of tones and noises and sews them together with a building melodic harmony. \"Peaches In Regalia\" is like a bloody Broadway musical put to the acid rock test on lots of acid, and with added dirt and genius, while Zappa's mate Captain Beefheart makes an appearance on the slick and sleazy \"Willie The Pimp\". While I always like my instrumental albums to be, well, instrumental, and get annoyed when many attempt to slip in a vocal track (Ian Carr and Nucleus tried it and failed miserably on their second album We'll Talk About It Later a couple of years on from this, and in fact they did so by trying to rip this song off with their tepid and dull \"Ballad Of Joe Pimp\") the vocals and performance on \"Wilie The Pimp\" work and create a little menacing side show story for the album. Then slap bang! We're back into the mood with \"Son Of Mr. Green Genes\" rolling around the jazz rock road. With piano, vibraphone and saxophones, \"Little Umbrellas\" is a fusion treat and by now the album was starting to become a personal favorite with me. While Davis struggled and frustrated with his double Bitches Brew, Zappa and his Mothers made it all look so easy with a defining effort, with \"The Gumbo Variations\" and the excellently titled \"It Must Be A Camel\" becoming, for me at least, staples of the jazz rock fusion canon. Hot Rats is an album with a purpose. The whole fusion era started off on a high expectant platform but it truly ebbed back from that point on. Though John McLaughlin's Mahavishnu Orchestra would take into to another plane a few years down the line but exclusively so. Released in the same year as Miles Davis Bitches Brew, Hot Rats offers up so much more colour and expression, laced with Zappa's idiosyncratic humour. But perhaps only just. Would it be fair to suggest that Frank Zappa hit the notes that were just out of Miles' reach? But while it may be viewed as idiotic to compare the two albums, it is an interesting juxtaposition to simply do so."
    },
    {
      "reviewer": "Bj-1",
      "date": "Posted Friday, November 18, 2005",
      "rating": 5,
      "text": "\"Hot Rats\" is often considered as Zappa's masterpiece, and I can understand why. This album is a fantastic mix of Jazz-Fusion, Blues and Rock. The tracks are long, but always interesting all way through, Especially \"Peaches En Regalia\" - which is one of Zappa's most known songs.Excellent instrumentation, Zappa's guitar solos are amazing and Captain Beefheart contributes cool vocals on \"Willie The Pimp\". This is an excellent place to start if you are new to Zappa. Either this, or \"The Grand Wazoo\".My rating: between 4.5 and 5 stars - Should be included in any comprehensive prog collection!"
    },
    {
      "reviewer": "Eetu Pellonpaa",
      "date": "Posted Friday, December 23, 2005",
      "rating": 5,
      "text": "I think this is the most mature and professional recording Frank that has ever released. The humor is present in the music, but only as a spice, as the album is mostly about good jazz and rock jamming. The opener \"Peaches en Regalia\" introduces the overall feeling and themes of this album, which are happy spirit, good co-playing and fine guitar solos from Mr. Zappa. \"Willie the Pimp\" has a small cameo appearance of CAPTAIN BEEFHEART, and most of the song works as a playfield for Zappa's wild guitar playing. Other elements to be noted are the imaginative use of xylophones and brass arrangements. \"Son of Mr. Green Genes\" is a matured reworking of a theme from the past \"Uncle Meat\" album, and the composition is now much better and has great musical climaxes in it. \"Little Umbrellas\" and \"It Must Be A Camel\" are also traditional like jazz songs with exceptional and funny rhythmic ideas. \"The Gumbo Variations\" between them is another improvisational jam number, reaching almost the length of 17 minutes.I would recommend this record for all music listeners who are interested of jazz fusion, and also to those who haven't appreciated Zappa's other works. I also noticed, that the CD version alters a bit from the original vinyl pressing. It seems that Frank did some subtle re-recordings at some places of this album later?"
    },
    {
      "reviewer": "belz",
      "date": "Posted Sunday, May 7, 2006",
      "rating": 5,
      "text": "4.5/5.0Now this is serious! Before listening to \"Hot Rats\" I used to think \"The Grand Wazoo\" was Zappa's greatest achievement. My bad, this album rocks! Quite everything on Hot Rats is great: from the soft and harmonic melody on \"Peaches En Regalia\" to the wild and intriguous foggy-jazz atmosphere on \"Little Umbrellas\" or the frenetic guitar on \"The Gumbo Variations\" and the vocals on \"Willie The Pimp\"!The only reason I don't give a higher rating is only because at some point \"The Gumbo Variations\" could have been a bit shorter. But this is not a big problem; this album offers an easy listening, is intense, emotional, and is clearly my idea of what jazz-fusion is or should be. Half way between essential and a masterpiece.4.5/5.0"
    },
    {
      "reviewer": "kunangkunangku",
      "date": "Posted Wednesday, June 14, 2006",
      "rating": 5,
      "text": "The first time Frank Zappa sans the Mothers entered jazz-rock territory and this is the result: an album of a genius, a classic of the genre. Featuring multi-instrumentalist Ian Underwood, violinist Jean-Luc Ponty and vocalist Captain Beefheart, with the support of Lowell George (guitars) and Don Harris (violin), among others, Zappa successfully brought every part of his compositions and directions and all into life at the most effective way; he managed to lead them to cut an album that flows so freely between jazz and rock, with so much excitement and energy.Among the most fascinating attractions here is the way each musician marvelously contributes their particular style in mixing sophisticated jazz compositions with blaring, straight ahead rock elements. On the longer compositions (such as “Willy the Pimp”) there are clearly evidences in which Zappa and his supporting musicians push the envelope as far as they can go. In doing so, they are playing freely, with much noise, and without being confined to any limitation -- except the space of the medium (i.e. the tape, the vinyl), of course. On shorter compositions with tight arrangement (say, “Peaches en Regalia”), they can also perform playfully and yet elegantly.After 25 years since it was released for the first time, this album hasn't lost its appeal. That's why anyone can make it as a gate to the world of Zappa."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Sunday, June 18, 2006",
      "rating": 4,
      "text": "How can I say that I'm a classic rock music fan while this legendary album by Zappa, \"Hot Rats\", I have never heard the music before until couple of weeks ago? It's a pity, really. But that's the fact that I can not say the other way. Couple of reasons, probably, that caused this. First, when it was in 70s I could only afford to buy cassette and in my country there was no such cassette with Zappa \"Hot Rats\" as far as I can remember. Second, when recently almost all albums of Zappa were released in digital format, the price of the CD is unbelievable - damn expensive! Lucky that my prog colleague Purwanto Setiadi (kunangkunangku) lent me his CD of this album, so I could enjoy.This album blew me away at first spin. Yes, I can see many repetitions of chords and notes especially on the rhythm section but every segment has its own unique texture that makes it weird but very enjoyable because they form excellent harmony. \"Peaches en Regalia\" (3:37) kicks off the album in relatively fast tempo with unique style mostly combining jazz with rock. \"Willie the Pimp\" (9:16) is a great example of how the classic rock music is combined with the joy of violin sounds. Captain Beefheart voice is quite unique and suits with Zappa music. In terms of rhythm and chords this song seems like repetitious but it's enjoyable because the texture mives differently in every piece of music segments. Guitar solo plays dominant roles. I'm not sure who is actually playing drums at this track but if it's Ron Selico I can relate with his controbution to John Mayall' Jazz-Blues fusion which I think the styles are similar.I can see \"Son of Mr. Green Genes\" (8:58) has influenced many prog bands (like Frogg Cafe) in their musical endeavor. It's not that this track is copied by others but the nuance has been transformed to others. The composition is tight with multi instruments as rhythm section and guitar makes its solo combined with keyboard. \"The Gumbo Variations\" (16:55) is an instrumental which gives a wide range of instrumentalists to give their expertise, especially saxophone, bass guitar, violin and guitar which form the music beautifully, flowing in relatively fast tempo. I usually get trouble with music where the rhythm section is somewhat monotonous with repeated chords. But this one is different - it's because I can hear different textures every time the music moves from one segment to another like this song. \"It Must Be A Camel\" (5:15) concludes the album in a combination of jazz and avant-garde styles with dominant piano and saxophone work.It's an excellent addition to any prog music collection. Recommended.Peace on earth and mercy mild - GW"
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Monday, January 1, 2007",
      "rating": 5,
      "text": "This was Frank's first record without THE MOTHERS and he dedicated it to Dweezil, Bub and Gil.The first song \"Peaches In Regalia\" is such an amazing instrumental ! Horned instruments are the focus such as sax, clarinet and flute. Amazing song ! \"Willie The Pimp\" is where Frank's humour comes out, with CAPTAIN BEEFHEART's gruff vocals suiting this catchy, melodic song so well.The song turns into this long, extended jam-fest with Sugar Cane Harris on violin and Zappa showing how great of a guitar player he is, as he just plays and plays. Great solo !\"Son Of Mr.Green Genes\" is a jazzy instrumental with another terrific solo from Frank, as well as some xlophone and some great interplay. \"Little Umbrellas\" may be the shortest song on the record, but it's a classic with lots of horn melodies that are arranged beautifully. \"The Gumbo Variations\" features some fantastic sax melodies to begin with followed by some great violin from Sugar Cane Harris and then Zappa comes in with some guitar before they all chime in to end the song. \"It Must Be A Camel\" opens with light drums, piano and horns before Jean-Luc Ponty comes in with his violin.This is a must have for all who are into prog.The music here is outstanding !"
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Tuesday, April 3, 2007",
      "rating": 4,
      "text": "A remarkable achievement in the history of music.It's 1969 and you're helping to forge a new direction for music. You're name is Frank Zappa and you are on top of your game and create your most critically acclaimed piece of music, Hot Rats. Now I know that some albums are better, but this is the piece everyone will remember you by, this is your 5th symphony. If you call yourself a fan of prog, jazz, and the like, this is one of those must have albums not only because of its historical implications, but because it's a damn good album.My preferred song here is the Gumbo Variations, which highlights the amazing abilities of Zappa and partly explains the direction he wanted to take with his music. Essentially, Zappa wanted to tear down barriers of music and normalcy, fusing together rock, R&B, and jazz to create not only Zappa's distorted vision of music (and later we find out the world and politics), but to give the listeners one heck of a good time.I urge listeners (especially beginning prog listeners) to make sure you pick up Hot Rats or another one of Zappa's highly acclaimed albums. He has done so much for the history of music and deserves our respect, and this album is no better place to begin your Zappa journey."
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Sunday, June 10, 2007",
      "rating": 2,
      "text": "Just jammingFor his final album of the 1960's, Zappa seconded a number of guest musicians including Jean Luc Ponty and Captain Beefheart. The performances though are primarily a duet between Frank Zappa and Ian Underwood.The opening \"Peaches in Regalia\" is surprisingly orthodox and tuneful, with strong hints of Holst's \"The Planets\" in parts of the melody. The sprawling \"Willie the pimp\" is moretraditionalZappa with a lengthy guitar workout and somedirtyvocals from the Captain, the only singing on the album. The lyrics, which are published on the sleeve, make it apparent why this is effectively an instrumental album. The track is essentially a blues guitar work out, with little progressive development and a single pace.\"Son of Mr. Green Genes\" which closes the first side is a long (9 minutes) jazz fusion recital. Zappa's guitar work here is exemplary, the track being relatively tight for what is essentially a jam. Underwood is given the opportunity here to display his multi- instrumental talents. For me, this and the preceding track are a little too indulgent though, both in terms of length and content.\"Little umbrellas\" is the shortest track on the album, at just over 3 minutes. This mini- epic manages to cram more changes of style and sound into its allotted time, than the other tracks do in total. From the shortest we are straight into the longest, \"The gumbo variations\" running to almost 13 minutes (the LP times appear to differ from those of the CD). I have to say that to my ears, the inordinately long, unstructured sax solo which occupies about half of the track is second only to an endless drum solo in terms of tedium. Thankfully, violin eventually assumes control, albeit still in full jazz improvisation mode. The album closes with \"It must be a camel\", a slower number which is otherwise more of the same.\"Hot Rats\" is an album which falls outside my normal boundaries of taste. I readily admit however that it has many redeeming features, with a high quality cast list and some fine instrumentation. Zappa's guitar work is superb if at times over indulgent. Where there is an element of structure to the music, such as on \"Peaches in regalia\", I find the album to be rewarding. Where however the musicians simply indulge in long unfocussed jams, I have to move to the other side of the road."
    },
    {
      "reviewer": "1800iareyay",
      "date": "Posted Saturday, July 7, 2007",
      "rating": 5,
      "text": "Zappa's first solo album marks his first foray into jazz fusion. The Mothers were quite talented, but his time Frank surrounded himself with some true legends, like violin virtuoso Jean-Luc Ponty and Captain Beefheart. This is one of Frank's more acessible records, which makes it a great place for newbies to join.\"Peaches en Regalia\" opens the album with tremendous compostion that gives the center stage to no man. Zappa is a true composer rather than a self-serving solo artist. He makes his priority crafting good music instead of being the one noticed. Peaches is one of my favorite instrumentals. \"Willie the Pimp\" followswith some great bluesy vocals from the Cap'n and a tremendous solo from Frank that lasts nearly the whole song. I guess he's a little self-serving after all, huh? Still, his solo is very musical. This is really the first song that clued people in on what a phenomenal guitarist Frank was. \"Son of Mr. Green Genes\" has great saxophone and piano fills and another killer solo, which condenses the virtuosity of the previous song into a shorter length. \"Little Umbrellas\" opens with weird piano before a sax fill comes in that makes the piano seem normal by comparison. The piano really moves this song, as opposed to the drums in Peaches and the guitar in the last two. \"The Gumbo Variations\" is a 16 minute band showcase featuring funky basslines, distorted guitars, and a 7 minute sax solo (yeah, you heard me). Afterwords, Ponty gets his time in the spotlight with a lenghty violin solo. The drums on this track are superb; crashing yet rhythmic, they stand out just as much as the sax and violin. The album ends with \"It Must Be A Camel,\" which features piano-sax interplay akin to \"Little Umbrellas.\" Zappa's clean guitar is great, as is the piano, which is played with a lot of emotion.If you wanted to convince someone of the instrumental prowess Zappa had, this would be a good record (Shut Up 'n Play Your Guitar would be another good choice). Despite his lenghty solo on Willie and the long solos he gives to his guests, Zappa's brilliance lies in his compositional skills that allow members to solo without dominating the sound. This is essential for any fans of jazz-rock, avant-rock, or Zappa.Grade: A-"
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Tuesday, October 2, 2007",
      "rating": 4,
      "text": "What would make you more frightened: having a giant cockroach climbing out of your pool, or Frank Zappa? Given the album cover, I just might choose the cockroach! Fortunately, there's no need to run from the music.Considering this was made in 1969, Hot Rats is a phenomenal album, coming out at the same time as many legendary debuts (though this isn't Zappa's first). We're a long way from I am the Slime here, and for me that's great news. There's a lot of diversity to be found, from the focused and entertaining intro tune to improv jazz numbers to the rocking jams. I think Zappa tends to be overrated to his followers, and underrated by everyone else, though I'm glad to see that Hot Rats gets proper respect.Peaches En Regalia. Just an awesome mixture of melody, instrumentation and creativity, and in 1969? That's impressive. This is the most concise offering of the album, but just one of many highlights.Willie the Pimp. Captain Beefheart delivers some memorable vocals, while Ponty keeps at that simple, killer riff. Then Zappa comes in for some enjoyable, greasy (as another reviewer expertly coined) guitar to take the song home. Downsides: there's a clicking sound near the beginning (and lasts a few minutes) that is really irritating if you pay attention to it, and there's no need for this song to be 8 minutes (and I'm not usually one to complain about extended soloing!).Son of Mr. Green Genes. Probably my favorite from the album, this has enough diversity to warrant its 9 minute run time (unlike the previous tune). Great guitar and keyboard interplay, and it makes me happy every time I hear it.Little Umbrellas. Zappa in jazz mode, and this is a great number featuring nice melody and tasteful horns.The Gumbo Variations. It took me a while to get into this one, but now I think I can appreciate it fully. I assume that's Underwood on the sax, and he delivers some blistering tones. Then we have some violin, followed by some guitar. Sure, it's too long, but the whole band is really cooking for these 16 minutes, and this is definitely my kind of jazz fusion: with a funky edge.It Must Be a Camel. The most experimental and improvisational piece, I could take or leave it. It's definitely entertaining, with some good guitar from Zappa and keyboard/horn harmonies, but it seems they were mailing it in a bit at this point.I love this album, make no mistake. It's just not a masterpiece, given the extensive jamming, though I definitely think you should have it in your collection."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Wednesday, April 23, 2008",
      "rating": 3,
      "text": "Hot Rats is being praised here on Prog Archives as being one of Frank Zappa�s finest moments, and it is certainly unique in Zappa�s discography. When I first started listening to Frank Zappa it was one of the albums I purchased first and I thought it was really good. It�s been a couple of years since I last listened to Hot Rats though and after listening to it a couple of times before this review I can honestly say that it�s one of the Frank Zappa albums I will never really be fully content with. Hot Rats is Zappa�s first real solo album if you don�t count Lumpy Gravy which had lots of Mothers of Invention songs incorporated into the classical music and the strange dialogues that made up that album.Hot Rats is a jazz/ rock fusion album with lots of soloing both from Frank Zappa himself on guitar, Ian underwood on winds and Sugar Cane Harris and Jean-Luc Ponty on violin. The music is generally good, but not outstanding. The only song here that I would classify as a masterpiece is Peaches en Regalia which is a very beautiful song with several intriguing themes. This song is not a vehicle for soloing as most of the other songs are. Instead it is beautifully arranged with lots of winds.Willie the Pimp used to be a favorite of mine when I was younger, but today I think it is badly arranged a pretty sloppy played. It�s always a joy to listen to Captain Beefheart�s voice but that�s not the main focus in this song. The Willie the Pimp theme which both starts and ends the song is really just an excuse for Zappa to play a 6 minute long wah wah guitar solo that gets boring after 2. I know most people really enjoy his solo in Willie the Pimp but IMO his solo skills were much better later in his career when he started using the vibrato arm extensively and played on the edge of feedback most of the time. I find his later solo style to be much more rewarding than this early attempt. Well I guess it�s an aquired taste and my bitching aside I still think the solo in Willie the Pimp is pretty good allthough a bit too long.Son of Mr. Green Genes uses the theme from the Mr. Green Genes song from The Mothers of Invention album Uncle Meat. The theme is of course played with a different instrumentation and it�s arranged a bit differently but stays true to the original in terms of notes played. Son of Mr. Green Genes is just another vehicle for a Frank Zappa guitar solo though and again I feel the solo is way too long and again the wah wah style Zappa played at the time isn�t as rewarding to me as his later efforts on the guitar.Little Umbrelllas is a little jazzy tune which is allright but nothing special to me.The Gumbo Variations with it�s 16:55 minutes is clearly the longest song here and the problem for me is that it�s one long vehicle for sax, violin and guitar soloes that seems to go on forever. The sax soloing is pretty jazzy and I don�t enjoy it one bit while the violin and guitar solo is a bit better even though 16:55 minutes of soloing is way too much for me when it�s not better than this. Again it�s allright but nothing more.It Must Be A Camel is a pretty good little song too, but again nothing excellent.The musicianship is very good and I�m especially impressed with Ian Underwood�s contributions to the songs. Ian�s multiinstrumentalist abilities are used to the full on Hot Rats. Ian Underwood is by the way the only Mother present on Hot Rats which gives the album a very different sound and mood compared the Mothers of Invention albums.The production is very good considering this is 1969 and once again Zappa proves that he is a unique producer as well as being a composer and musician.I must say I�m a bit disappointed about Hot Rats especially after reading the many reviews with high ratings on Prog Archives but I guess I just don�t share the general opinion about the album. Peaches en Regalia of course is a very positive thing on an otherwise average album but it�s not enough to make Hot Rats a 4 star album though. I�ll give Hot Rats 3 stars as I don�t feel this is a 2 star album even though I�m not that excited about it."
    },
    {
      "reviewer": "LiquidEternity",
      "date": "Posted Tuesday, September 30, 2008",
      "rating": 5,
      "text": "If you are interested in Frank Zappa at all, buy this.The pure mastery of this album is proved in the first four minutes. Peaches en Regalia, a clever little instrumental, displays such a scene of impossible melody and a myriad of styles that, to me, it literally defines what good prog really is. To guitarists, wondering what kind of skill the man might show here, the glories of the whole album don't even need to surveyed. Proof lies here, with what is not only some spidery fast fretwork but what I think is the most beautiful and perfect clean tone a guitarist ever recorded. The song is streamable from this site, so listen to it and see if what I have to say holds true.The album continues with the only non-instrumental song, Willie the Pimp, a nice and traditional Zappa-lyricked bit of humor, with the vocals performed by noted Zappa collaborator Captain Beefheart. The sung portion, however, is only the first few minutes, while the remainder is filled with a wonderful jam session. The main riff, doubled by a violin, returns to clinch the song at the end. Son of Mr. Green Genes and Little Umbrellas continue the album, and though they are less remarkable as far as song goes, compared to most music ever made, they are stellar.The highlight of this album, especially for the average prog nerd, is the 17-minute The Gumbo Variations. Mostly an extended jam, The Gumbo Variations follows an upbeat bass and drums drive, while solos, ranging from melodic to vicious, play over the top. These solos include some wild saxophone as well. I believe this song alone would launch Frank Zappa to prog stardom, whether or not he had ever written anything else. The album then closes with It Must Be a Camel, a much milder song than its predecessor.Hot Rats is a terrifyingly unique album, even among Frank Zappa's music. It stands as one of the greatest recordings the man ever made, if not his defining work."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Friday, October 17, 2008",
      "rating": 3,
      "text": "Review 74, Hot Rats, Frank Zappa, 1969Hot Rats is, as I understand it, one of Zappa's sacred cows. I think I can understand why: the playing is flawless, the first couple of pieces are highly entertaining and its mixture of jazzy and avant garde isn't too heavy on either component. My 'good' rating (which will surely be seen as a travesty, but that's that...) is not because I dislike the music much in any particular place, nor because I don't think the playing's great, but just because the album has such a thin emotional tie to me.The opener Peaches En Regalia, a sample here, opens straight into a cool, classy array of saxophone leaps and whimsical piano flourishes. Zappa's light-hearted rather banjo-like guitar fits perfectly in, and cheery organ swirls meet some hollow percussion whirls. Behind the interlinked leads, the rhythm section wanders about cheerily. All in all, an active, bouncy and highly entertaining piece.Willie The Pimp is the album's obvious highlight for me. A compulsive, edgy violin riff underlines the piece, accompanied by a mobile bassline and superb drumming from John Guerin. Zappa's own skills particularly come to the fore in this piece, with an extensive, gritty guitar solo, sometimes picking up on the earlier violin part before launching into manic swirls. A few fun piano and percussion flourishes are thrown in. In addition to these worthy features, Beefheart provides a brief amusing vocal complete with general screeching and trite lyrics. Classy stuff.Son Of Mr. Green Genes is where the album begins to take a bit of a nose dive in connection. While the previous pieces weren't really less jazzy and whimsical, they kept a constant connection and interest. Here, we have many of the same trademarks, neat piano from Ian Underwood, an array of sax and organ effects reeling off from Zappa's range of guitar sounds and wails. At about 3.00 in, the piece catches on quite effectively with a low sax bada-badada theme before wandering off to another guitar solo. Occasionally, the piece does hit just right with a brief jot of darker guitar or a particularly neat effect, especially with the funktacular jumping around 7.00 in, but overall, it fails to make a cohesive impression on me. I think it's that the whimsy gets a bit much at times, or that the guitar lead so key to holding it together is a little thinner than I like, but the reason's difficult to pin down.Little Umbrellas is a slightly darker piece in feel, with an especial highlight in the piano and organ-work, which ranges from tense chords to light keys to Super Mario soundtrack material, but, to be fair, it works. A slightly ponderous set of clarinet effects fill the background. Not really light, not really menacing, and it's alright, but it never really moves beyond that.The Gumbo Variations is comfortably the album's longest piece, with a fairly standard jazzy background held up by the rhythm section, and organ underlaying a great strangled saxophone. The saxophone is probably the biggest tie for a fair while, as a couple of neat guitar additions come in then disappear. A squeaky violin appears to replace the sax, and Zappa himself takes a bit more of a position. The rhythm section keeps a mobility throughout, and a couple of stylish effects interplays run nicely over the top. The brief drum solo is probably the piece's high point for me. So, again, nice, but not a lot more. Absolutely top notch playing and interplay, but it simply doesn't really make an impression too often.It Must Be A Camel is another highlight. After a wandering piano opening with a couple of cool slowed percussion ideas, and an almost obligatory irritating sax blare, it wobbles around for about a minute before Zappa comes in with entertaining guitar sounds all around and adds in a bit of dynamic before the piece comes to its conclusion. Nice, despite the moment of erk.All in all, then, this album really has nothing bad on it. There are a couple of really great and fun moments in there as well. However, I feel it could have benefited a lot from a little more dynamic playing, and I really just won't listen to it for any other reason than wanting to hear the end of Willie The Pimp and feeling obliged to give the rest another go. I don't dislike it, but my mind just isn't connecting with the comic and musical genius that a lot of Zappa fans and even non-fans would ascribe to it.Rating: Three Stars. Probably not essential, for me, but still a good buy. Favourite Track: Willie The Pimp"
    },
    {
      "reviewer": "MovingPictures07",
      "date": "Posted Monday, November 17, 2008",
      "rating": 5,
      "text": "If I had to sum up Zappa's career in one album, I think I would most likely have a heart attack first. However, this definitely has to be one of the contenders simply because it is one of the greatest and most influential albums of all time.1. Peaches en Regalia- Absolute brilliance all jammed into the span of a short length. The track is perfect, Zappa's style ideally constructed in a very concise format with his quirkiness, amazing musicianship, and odd melodies and time signatures. If I wanted to show someone a glimpse of what my musical taste entails, this might be the first song I grab. One of the greatest compositions ever written. Flawless. 10+/102. Willie the Pimp- One of Frank's signature guitar pieces and it's easy to understand why. His tone here is so unique and powerful, grading away a nearly 9 minute solo with amazing skill, precision, and Zappaish emotions. Beefheart's guest vocals at the beginning are quite fitting. 10/103. Son of Mr. Green Genes- Another masterpiece song showcasing Zappa's brilliant compositional style, his virtuosity, and the similar musicianship of those with which he always surrounded himself. Everything runs together perfectly here, the guitar, the drums, every single instrument is meticulously composed and sounds amazing. Not only that, but it's extremely expressive and I could listen to it forever. I really like the feel to this one; it complements yet contrasts uniquely with the two songs that proceeded it. Flawless. 10+/104. Little Umbrellas- Very pleasant fusion piece. Short and sweet fits this song nicely, except it's still definitely a Zappa kind of sweet and an entirely unique composition. The saxophone is wonderful here, as always, and all the instruments are amazing as well (as always). Nonetheless, if I had to pick... it's my least favorite on here. And, by my rating of this song, that REALLY says something. Since it's a really good song. 9/105. The Gumbo Variations- Holy hell. If you think you've heard it all before, specifically with regards to jazz or fusion, listen to this one. The instrumentalists are on FIRE here, and the duel between the saxophone at the beginning, violin in the middle, and then guitar later on is amazing. The drums are also extremely fitting and played with masterful precision. This is another stunning Zappa composition, managing to create a unique, perfectly crafted and played piece that pushes the boundaries of what music really is. Just listen to that avant-garde sax! Flawless. 10+/106. It Must be a Camel- Great song again pushing the envelopes of music as Zappa always did best (particularly with perfection on this album and a few select others). The instruments come together to make a wacky piece of fusion Zappaness that can only be described through hearing it. I love the sax on this one. 9/10This album is genius. If you haven't heard it, I highly recommend it, despite whatever preconceptions you have about jazz, fusion, Zappa, or anything. A true music collector can't really go without hearing this at least once."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Wednesday, December 10, 2008",
      "rating": 3,
      "text": "This, my first Zappa album, is as delicious a surprise as I could ask for, filled with gritty, greasy, lengthy jams. The instrumental blend of jazz/rock is excellently balanced here (with a touch of weirdness for good measure), and the heavy, bluesy grooves don't let up a single beat. Zappa's guitar work is nothing short of Herculean, since he delivers minutes-long solos throughout, the rest of the band doing a fine job keeping up and throwing their own jams into the mix.Yet, for me Hot Rats is definitely style over substance. The jazzy rock positively grooves... and grooves and grooves until it all blurs together into one extended showcase of crunchy improvisation.Depending on where one comes from, this makes either 47 minutes of joy or boredom; I am somewhere in the middle. I am not a fan of hippie or stoner rock, and appreciate the signature Zappa weirdness evident throughout, as well as the harder jams found on many of the songs. But, I tend to favor composition over improvisation, so the extended nature of solos and songs tend to get very repetative.Still, a fine, flavorful addition to any guitar lovers music library, easy enough for most anyone to groove along to-- for a while.Songwriting: 3 Instrumental Performances: 4 Lyrics/Vocals: NA Style/Emotion/Replay: 4"
    },
    {
      "reviewer": "ProgShine",
      "date": "Posted Monday, February 23, 2009",
      "rating": 5,
      "text": "01. Peaches En Regalia Jazz? A bit of everything, but one thing is certain, whoever was making that sound in 69? Neither the Beatles were ahead of everything, Zappa was way ahead of his time there. A crazy and amazing melody over the headphones. Many keyboards, a James Bond atmosphere in the air.02. Willie The Pimp Riff that would make equal only a few years later, that crazy voice! Violins more infatuate everywhere. And know what? Zappa has the roll up the guitar, my, how can the man playing guitar for so strange and cool? The guy was a virtuoso before it exists. More is not only virtuoso melodies, but the most crazy, and the band he had UAU. Extremely Jazz, but still not boring.03. Son Of Mr. Green Genes Man, where he took those sounds in 1969? This question will haunt me forever. The keyboards, the 'leak noise' all the sound beyond the experimentalism, is the barrier factor of the pure and simple song. Zappa is King on guitar, his riffs are disconcerting. And the music is super interesting and dancing from the in a musical way.04. Little Umbrelllas Bass sound and everything, but the contrasts are interesting, with him a violin and synthesizer, a battery rock 'dead' and lost a keyboard on the bottom and clear xylophone. And murmurs, should be clear that blows.05. The Gumbo Variations Take 2 announces Zappa, and that everyone should start with, say Zappa was authoritarian way in the studio, but a man who recorded over 50 discs in less than 30 year career probably knew what he was doing. Percussion in the band than the bottom and a beautiful line down, we have a saxophone solando everywhere. Basis for insanity is not missing, recorded live, shows the face of Mother Zappa and improvisation to the Jazz. But in this case interesting, because I think Jazz saccal. Violin enter the scene and finish the sound of even more expensive, the amount of virtuosos gathered here is giant. A groove infernal. So far (Already passed 11 minutes) Zappa is just the master, the guitar is tentatively here first. You then he finally gives the air of grace. After a brief solo for drums (I think they are 2) the bottom is a nice monitor, and gave him violins. The end is unexpected, full of details and madness.06. It Must Be A Camel Full of percussions broken, a lot of them actually. But behind all this is music! And how. The second part is the saxophones as the main vehicles of communication. Completely atonal, but not every man for himself because down and hold a base hit (and still doing it several times). In some moments the poor guitar appears broken, but it is meager.Zappa! This guy was [%*!#]ing seen!Source: www.progshine.com"
    },
    {
      "reviewer": "progrules",
      "date": "Posted Tuesday, March 10, 2009",
      "rating": 4,
      "text": "I can be pretty brief with this review and that's for the simple reason that everything there is to be said about this album has already been said in the other reviews. It's indeed a jazzy jamming album and that is for the full 47 minutes.But what I can add to this is that this album has increased my respect for Frank Zappa a lot. I only knew his Cheap Thrills release so far and that confirmed what I already knew: I'm not a Frank Zappa fan. But now it appears that it was mainly that album that made me feel that way because this magum opus by Zappa is a completely different story. I like just about everything I hear on this album and I had never expected that. Cheap Thrills was a bit of a foolish album to me and I thought that was the one and only Zappa. Boy, am I glad I decided to go for this one as well. And it was double luck because it was for sale.I like instrumental music, I like jamming, I like energetic music and I like melodic music. All four elements are prominently present on Hot Rats. It even could make me go for the highest score but I feel that would be a bit overdone. But four stars is the least I can do. A true classic !"
    },
    {
      "reviewer": "crimson87",
      "date": "Posted Saturday, April 11, 2009",
      "rating": 5,
      "text": "This was the first Frank Zappa album I ever heard , and it left me with my jar opened down to the floor. The musicians involved in this record are very talented and the various rhythm sections present on it make Hot Rats a really entertaining release. The record is entirely instrumental featuring loads of FZ soloing on guitar as well as sax or violin by other guest musicians.Peaches in Regalia is probably the most known FZ track in all his career. The song is one of those rare cases in which the popular and the sublime can coexist. Being a little over the 3 minute mark , the composition is varied as hell and also very colourful and uplifting. Truly one of the greatest openers in ANY record.The second song is mostly a terrific FZ solo. But almost every time that I hear Willie the Pimp , my attention is centered not on the soaring guitar , but on the solid drum & bass work by John Guerin and Max Bennett. Only with such a rhythm backup as that one you can make 6 minutes of guitar soloing sound fine and not overindulgent.Son of Mr Green Genes is , as the name suggests a rework on the Uncle Meat track but this time without any vocals. Musically this tune is more interesting and varied than the previous track. Apart from guitar soloing there are keyboards , clarinets and saxes. After two earthshaking instrumentals , the subtle Little Umbrellas feels like a breeze of fresh air. By far this is the most jazz oriented track on the album.Gumbo variations features interesting interplay between Ian Underwood and Sugar Cane Harris. Luckily , guitar soloing is replaced with violin soloing so we have a tad more of variety on the record. Finally the record closes with It Must be a Camel . featuring Jean Luc Ponty on violin. This track includes some dissonant moments as well , but it's very relaxing in the end.I know several FZ albums have been remastered in the 90's and Hot Rats is no exeption , people that owns the old LP version says there are some different guitar tracks on it. I can't make a comparaison since I never heard the 1969 release , but this Rykodisc version sounds clean as hell. Overall , this record is a masterpiece and one of the most iconic FZ releases. However I would not reccomend it to people interested in discovering Zappa since his overall sound is not vell represented on the album. Hot Rats is a ground breaking JAZZ ROCK release but I would reccomend some live albums of his or some of the mid 70's releases to the newcomer to catch a glimpse of what FZ is all about."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Wednesday, May 13, 2009",
      "rating": 4,
      "text": "My favourite of Frank Zappa's albums outside his body of work with the Mothers of Invention. HOT RATS sees Zappa abandon the mindless humour of the Mothers and insert copius amounts of extended jam sessions and jazz ideas making one of the first fusion records. There's many a blistering instrumental performance but it can sometimes get too long in the mouth. ''Gumbo Variations'' starts off with a nice bass riff but gets tiresome with solo upon endless solo (including a drum solo we never needed).I also wish there was a more consistent lineup here; only Zappa and Ian Underwood play on all tracks with a multitude of violinists, bassists and drummers. Still, both of the main performers really get their chance to shine (Zappa on ''Willie the Pimp'', Underwood on ''Son of Mr. Green Genes''). For those with less patience, ''Peaches en Regalia'', ''Little Umbrellas'' and ''It Must Be a Camel'' are all shorter, more focused fusion pieces with emphasis on tight interplay between band members.It's mostly instrumental save for Captain Beefheart on ''Willie the Pimp''. It's one of the better fusion records out there even if the jams get old before they end."
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Thursday, September 17, 2009",
      "rating": 4,
      "text": "Phenomenal Introduction to a GeniusHot Rats is the highest rated Zappa album on PA, contains perhaps his most famous song \"Peaches En Regalia,\" and is probably the most frequent entry point for fans into Zappa's vast catalog. This was the case for me, and certainly this strange music is like being dunked fed some new exotic cuisine, where you're not quite certain what the funky spices are. Usually one either learns to love the flavor, or runs away in disgust. My reaction was instead a guarded interest. And luckily I wandered around the catalog a bit until I found the exact dish for my palate, along with some selections that did little for me. However, the fact that I like one facet of Zappa's musicianship (ultra-complex jazz composition) and don't like the camp or stage-y stuff, is just a matter of taste. There are going to be some who gravitate to different albums, different smells, different kinds of funk.Hot Rats is going to appeal to the musician types more than the potty mouth lovers, but it's still a great place to start for anyone. The musicianship is very good, though not as insanely complex as that found on \"One Size Fits All\" or \"Roxy.\" The album contains several very long sections of jamming, most of which are quite good. The guitar tone during the long improvised end of \"Willie the Pimp\" is way ahead of its time and the licks are so great. At the same time, 90 seconds of song followed by 9 minutes of jamming doesn't exactly press my prog buttons that much.There are many ways one could merge jazz and rock, and Frank has managed to create a style that is fairly distinct from the bands formally labeled jazz-rock fusion. Zappa integrates more rock into a jazz that is much more structured and at times composed than Mahavishnu or Return to Forever. This shouldn't surprise given his affinity for classical music and writing movie score music from early in his career. His famous opinion, that there should be no difference between pop and high art, results in an accessible but still quirky sound that really has never been duplicated.Listening back over Hots Rats again for this review, there are moments where I think \"This really should be 5 stars.\" Some of the moments are just spectacular, with guest musicians Jean-Luc Ponty and Captain Beefheart taking strong tunes and upping the interest even more. But two things keep it at excellent rather than masterpiece level. First are the numerous extended jams over fairly basic progressions and time signatures. While interesting, it's hard to call an album relying so heavily on this element a masterpiece of prog. Second, I know Zappa does produce the kind of combined, precise complexity that reaches that summit later in his career.I absolutely recommend this album, especially for newbies to Zappa. It's a great piece of work. But once you've gotten accustomed to the strange combo of spices he puts in the stew, there are even more tasty morsels awaiting."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Thursday, October 15, 2009",
      "rating": 4,
      "text": "First of all, this is Frank Zappa's SOLO album, not Mothers of Invention's. Another thing - if many Zappa's works are absolutely RIO/avantgarde, this one is more usual misx of fusion and bluesy rock.Main music is produced by Zappa's guitar and Ian Underwood keyboards. Music is quite structured and fully orchestrated, Sugar Cane Harris and Jean Luc Ponty add their violins.\"The Gumbo Variations\" are perfect jazz-rock with exploding Underwood sax solos.And for sure,Cpt.Beefheart singing on \"Willie The Pimp\" gives his exclusive atmosphere.Please note, that that album is dated as 1969 (!),few years before of real fusion explosion all around the world. So, in fact, there are roots of modern jazz-rock and fusion! All music is full of Zappa's guitar solos, but is unusualy structured at the same time.And however Zappa has plenty of strong albums in different styles, this one is one of best structurised and organised, strongly orchestrated and great \"usual\" music album!And if Zappa,by himself or with band, often demonstrates more experiments and avantgarde ideas, than concentrates on music, this one is different. Very recommended for jazz-rock or fusion lovers as acceptable entrance to Zappa's world."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Monday, November 2, 2009",
      "rating": 2,
      "text": "There's a question that has been torturing me for decades. What do the people see in FRANK ZAPPA'S music and why in God's name I'm unable to discover it?In 1974 and after a friend bothered me for weeks, I bought \"Hot Rats\" expecting to find magical music, but to be honest, found nice music with little interest for me, I thought it may e the album so got \"We're only in it for the Money\", and my impression didn't changed at all, so after listening a couple more albums, decided to place my ZAPPA albums in a box and let them gather dirt for decades.A few months ago I had to move, so while checking my old record boxes, decided to give \"Hot Rats\" a new chance, and even when I found the music easier to listen, my impression didn't changed very much.The album starts with \"Peaches in Regalia\", a nice instrumental with some lush keyboards by Ian Underwood, but not much ore, still can't find feet or head in the music, seems like the guy went for some blend of early Symphonic and fun, but failed somewhere in the road, making a hybrid without head or feet.\"Willy the Pimp\" starts with an interesting Ponty violin section, but it's only a promise, the guys start to jam as if they were in 1967 on an acid trip, Captain Beefheart's voice doesn't help too much and even Jean Luc Ponty falls in the game and goes nowhere. The guitar? Yes, Zappa is good but nothing special compared with the hundreds of great guitarists in the 60's.After a couple minutes, the guitar jamming by ZAPPA turns boring and absolutely predictable, just distorted sounds with nothing more than most Acid Psyche bands of the era...Maybe a couple years too late.\"Son of Mr Green Genes\" is an improvement, the initial melody is somehow catchy, but still I don't believe it's defined as Prog, Rock or Funk, but still very pleasant to listen, the problem is when the jamming starts, I honestly don't know what he pretends, there were thousands doing this on those years, and some with much more interesting results.The winds are a good addition, but again ZAPPA'S guitar leads nowhere, just jamming with no structure or purpose, maybe the contrapuntal duel between ZAPPA and Underwood is interesting to prove skills, but musically leads nowhere in my opinion. The jazzy \"Little Umbrellas\" opens side two, again pleasant but nothing really special to consider this a masterpiece, too light to be considered innovative, the song flows gently with no surprises or really interesting moments.The incredibly long \"The Gumbo Variations\" should be called \"The Gumbo improvisations\", because again lacks of structure, it's true that Ponty, Zappa and Underwood have the chance to prove heir skills, but never sound coherent or structured, after a couple of minutes starts to bore, but when the drum solo starts, it's time to press the skip button before the cacophonic ending. Some people should know that sometimes less is more.Well, I had to wait 42 minutes until \"It must be a Camel\", the only really good track, melodic interesting and well structured, even the solos are coherent with the atmosphere, this track saves the album from a lower rating, mainly for the delightful piano.Before I rate \"Hot Rats\", must say that it's not a bad album, the musicians are talented, but the music is anodyne and lacks of interest (At least for me), I fail to see the greatness people see, but maybe it's my problem.To rate it I use my own scale, I gave 3 stars to ELP's debut, and I believe \"Hot Rats\" is not remotely in the level, so I would go with 2.5, being that this is impossible in our system, will go with 2 stars.Only for FRANK ZAPPA fans and classic Rock collectors."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Friday, January 22, 2010",
      "rating": 4,
      "text": "In the glorious year of 1970 I at last left the safe environs of my parental enclave and moved to the quasi- bohemian, virile town of Denton. I settled into a cozy efficiency bungalow mere blocks away from the University of North Texas (NTSU at the time) campus and relished the unlimited freedom that being on my own afforded. I answered to no one except my own conscience and that egotistical imp wasn't paying close attention to anything other than pretty girls. The burg was teeming with musicians of every ilk and I had many for neighbors who were in groups I'd seen performing in Dallas nightclubs. One of those maniacs was a fellow guitar player named Dave Brown and he was as avid a record collector as I was yet his generosity and trust far exceeded mine in that he left his place unlocked and encouraged me to barge in and borrow any album he owned as long as I returned it in a reasonable time frame and without gouges in the grooves. His taste in music tended to run in more offbeat, unconventional ruts than mine (he didn't share my affection for groups like The Move, for example) but for that reason I got exposed to many artists that I wouldn't have sampled otherwise because of him. He had all of Frank Zappa's stuff in his stacks and I must admit that a lot of it left me as cold as a Siberian Christmas, including \"Hot Rats.\" But that wasn't Zappa's fault or Dave's. It was mine. It wasn't until several years farther down the line that I came to realize that I just wasn't open-minded enough to appreciate what my na�ve ears were hearing.Only recently have I procured a copy of this, Frank's first solo effort, and at long last have been able not only to appraise it with the discretion that age bestows but also in a historical backlight of the blur of progressive thinking that was running unfettered in those heady days of the waning 60s. Forget pushing boundaries. There weren't any. Not for pioneers like Zappa, anyway. He had craftily weaseled his way into a lofty position where he could record what he wanted, who he wanted and how he wanted with impunity. He didn't play it safe with that creative license, either. He wanted to leave behind a legacy of innovation and imaginative contrasts that would flourish and thrive beyond his generation. Suffice it to say, he did just that but for me this album isn't his masterpiece. It's very good, no doubt, and I can understand and support its high ranking but it's his sly, satirical humor that I gravitate towards when considering what his best work is. That's just me. Frank had so many sides to his genius that he draws all kinds of proggers to his music so it just depends on who you talk to, I guess.Starting an album with supreme greatness like \"Peaches en Regalia\" certainly can't hurt your reputation one iota. It's one of his finest, most concise songs ever and it's as close to prog perfection as there is to be found on \"God's grey earth.\" It's grandiose yet playful as a speckled puppy. A splendid mixture of Zappa's favorite styles and influences. What I didn't know until now was that there are only four musicians playing on it. It sounds like twice that many, at least. Frank's on guitar, Ron Selico sits on the drum stool, Shuggy Otis plays bass and everything else is Ian Underwood. Now that's amazing. I'll never listen to this tune again without thinking about that humbling fact because what he does is phenomenal. He turns it into a carnival. Next up is \"Willie the Pimp,\" a plodding blues/rock thang that hasn't grown old gracefully. Captain Beefheart's raspy growl is entertaining but he's long gone by the three-minute mark and it becomes a long, tiresome jam session after that. Hey, it's Zappa's solo debut and he had every right to overindulge in a lengthy guitar lead since he so desired (bear in mind that it wasn't unusual, this was the golden age for talented but long-winded noodlers like \"Cream\" and \"The Allman Brothers\") yet I still must be honest. It wears me out.\"Son of Mr. Green Genes\" is a return to a more tightly-structured format. Here the multi-talented Ian has taken Frank's radical, complex ideas and fleshed them out brilliantly. Zappa's guitar is one part of the soundscape, not the focus, and the number benefits hugely from that. His guitar ride is more taste than flash and Max Bennett's fluid bass playing stands out in particular. There seems to be a lot more thought being put into the track than the previous cut and the pompous, over-the-top ending is to die for. \"Little Umbrellas\" follows and it's the kind of fantastically dense, challenging avant garde jazz piece that the \"serious\" musicians who populated the full-ensemble lab bands in the NTSU rehearsal rooms in those days of my randy youth would drool over (perhaps they still do). Yet at the same time this short ditty makes for pleasant, casual listening, as does so much of his material.\"The Gumbo Variations\" is a slightly funky boogie that comes off like a \"Wow, I've got all these excellent cats assembled here in the studio and the tape's running so let's play already!\" moment and who could blame Mr. Z for that? Underwood's sax solo is sinfully frantic and wild as a cornered Tasmanian Devil for a full seven minutes, then Sugar Cane Harris delivers a hot and passionate violin spasm that carries on for another five. Frank wades into the fray for a while, then they mercifully break it all down to the drums and bass before eventually turning it into a screechy melee that collapses from exhaustion. My hat's off to them for their unbridled enthusiasm but it ain't my cup of joe. The album ends on a positive note, though, with the impressive \"It Must Be A Camel,\" another appealing venture into a unique, eclectic jazz fusion climate that's hard to resist. Sitting through it reminds me that this was so very unlike anything else being created even out on the wooly fringes of the vast rock & roll prairie of that time period. It truly was, still is and ever will be music for the progressive mind.While I will always be much more likely to pull out and put on his wonderful \"Roxy and Elsewhere\" album when I need a little FZ shot into my veins, I must emphasize that the man never wasted an inch of recording tape in his too-short life and this is no exception. He epitomized creativity and when \"Hot Rats\" hit the music stores it only added to his reputation for being fearless. I clearly remember feeling a little uneasy each time I spied the wild-haired waif on the fuchsia cover who, at first glance, looked like she was about to crawl out of her crypt because I was afraid that I wouldn't comprehend what Zappa was doing in the vinyl grooves within. Even now I must entertain the possibility that I still can't fully grasp it all and never will. But I keep coming back, nonetheless. Only the greatest of the greatest have that irresistible, magnetic gift. 4.2 stars."
    },
    {
      "reviewer": "J-Man",
      "date": "Posted Wednesday, February 24, 2010",
      "rating": 4,
      "text": "A Superb Jazz-Rock Album!Hot Ratsis often praised as Frank Zappa's shining achievement, and I can't say that I disagree with that statement. While I think that some of his other albums are equal to the high quality shown throughout this album, this is surely one of the highlights in his brilliant discography.This album shows a departure from the avant-garde influenced psychedelic/experimental rock music that Frank Zappa had been known to play around this time. This album leaves most of the experimentation behind, and Zappa goes for making a pure jazz-rock album. The result is an almost completely flawless work of art, filled with excellent solos and groovy rhythms. This album is mostly dominated by Ian Underwood's windwoods and Frank Zappa's guitar heroics. While many people tend to criticize this album for being \"just jamming\", I heavily disagree. I think the album is filled with tasteful solos that are always fun and captivating. I guess it's just a matter of taste in the end.The highlight of this entire album, for me at least, is the spectacular musicianship. Of course, the guitar playing from Frank Zappa is nothing less than brilliant, but all of the session musicians are fantastic as well. The rhythm section is superb in all of the songs, which is rare for an album mostly dominated by solos. The memorable melodies and riffs are the icing on the cake, and they really make for a spectacular album.THE MUSIC:\"Peaches en Regalia\"- The first song on the album has always been my personal favorite from the album (though the whole album's great). Whereas most of the rest of the album is jazz-rock jam sessions, this song is structured beautifully with superb melodies. The woodwinds from Ian Underwood are undoubtedly the highlight of this track, aside from the beautiful songwriting. This is a great way to open up the album.\"Willie the Pimp\"- The second song takes a rapid departure from the previous track, showing a riff-based bluesy hard rock song. This features Captain Beefheart's low vocals, and I couldn't imagine the song without him on vocals. The Captain doesn't do anything spectacular, but it really adds to the mood of the song. The song mostly builds off of a solitary violin riff, but it is far from a linear song. The guitar soloing from Zappa near the end is superb, and it never tires. The late 60's psych influence is obvious in this section. The song ends with a few measures of the opening riff.\"Son of Mr. Green Genes\"- This song uses the same theme from \"Mr. Green Genes\" fromUncle Meat, and is one of my favorites from the album. The woodwinds throughout the song are the highlight, and give this song a very jazzy feel. The guitar solos are wonderfully crafted, and every instrument works perfectly in the context of the song. The drumming from Paul Humphrey and the bass playing from Max Bennett shouldn't go unnoticed, even though Zappa and Underwood take center stage on this song. The rhythm section is superb.\"Little Umbrellas\"- This song is a jazzy instrumental, and I wouldn't even consider it jazz-rock. This is just a beautiful jazz piece with superb keyboard playing from Ian Underwood. The arrangements are extremely noteworthy.\"The Gumbo Variations\"- The longest song on the album (almost 17 minutes) is excellent, though it takes some time to sink in. This is a psychedelic jazz-rock jam with some of the catchiest grooves and most interesting solos I've ever heard. The saxophone playing from Ian Underwood is one of the highlights of the entire album for me. He just does a superb job, and the rhythm section is always there to back him up. The drumming from Paul Humphrey is superb, and even though he has no solos, his playing is just as interesting as the people playing the solos. After Underwood's saxophone solo, Sugar Cane Harris has an equally excellent violin solo. Just listen to the rhythm section during this solo! It's fantastic! The flow of sections continues through Frank Zappa's solo that follows soon after. The excitement never shortens at all, and this song is captivating and catchy from beginning to end. Everything about this song is superb.\"It Must Be A Camel\"- The final song is a soft jazz piece in the vein of \"Little Umbrellas\". I prefer this song slightly to the one I just mentioned. This is mostly focused around soothing piano, saxophone, and odd rhythms. This has the only sections of the album that even remotely show Zappa's avant side, though I wouldn't call this avant at all. This is a great way to end the album, as it is filled with interesting chord progressions and melodies.Conclusion:Hot Ratsis a superb album by Frank Zappa, and it's one of my favorites in his discography. If you're at all interested in hearing Frank Zappa, this is essential listening material. If you're not a jazz fan, don't be put off by the \"jazz rock\" label that this album often acquires. I don't consider myself a jazz fan, yet I adore this album. My rating forHot Ratswill be 4.5 stars. I'm going to round down, because you can't round up to a \"masterpiece\". This is highly recommended!4 stars."
    },
    {
      "reviewer": "Dobermensch",
      "date": "Posted Friday, February 26, 2010",
      "rating": 1,
      "text": "This one hits all the wrong buttons with me. Fair does, Don Van Vliet's vocals certainly get things going, but this album leaves me detached. I much prefer 'We're Only in it for the Money' from the previous year. That one's so wacky and inventive there's nothing not to like about it. There are painful and excruciatingly long guitar and saxophone bursts that seem to go on forever on manye tracks. Vocals is the one thing this album really needs and is sadly missing. Zappa had a good voice, so where is he? This should have been so much better. All the ingredients are there but it just seems to fall flat on it's face, making me want to put on the wonderful 'Trout Mask Replica' instead. Very annoying."
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Monday, April 19, 2010",
      "rating": 3,
      "text": "'Hot Rats' - Frank Zappa (6/10)As a man of many facets in his music, this stands as being Frank Zappa's first real foray into the realm of jazz. Taking a few of his friends along for the ride (Captain Beefheart, and Jean-Luc Ponty for an added jazz flair) 'Hot Rats' has long been considered to be one of his best moments of his career. Relying on heavy instrumentation and the virtuosity of both himself and his fellow musicians, 'Hot Rats' ends up becoming an album of two measures; parts of it are heavily improvised and others are very evident of intent composition.My only other experience with Frank Zappa before initially listening to this had been the concrete piece 'Lumpy Gravy,' it was certainly a nice change of pace to have some actual music added to the mix. Even though I'm not the biggest fan of this style or album in particular, I can certainly see why it gets exceptional praise. The performances are spectacular and sure to impress even the most anal of critics. The only performance that I don't enjoy is actually that of Captain Beefheart's vocal work on the bluesy track 'Willie The Pimp.' At first it is a bit irritating before erupting into a display of bad taste. Apart from that however, I can at least appreciate the intent of putting a few vocals here and there, but it seems to fall short in the end.Three of the songs here are relatively laid back, at least in terms of the amount of improvisation that is allowed. The three longer songs are actually do not have more 'composition' as many would assume; instead they have a lot of room for the musicians to improvise. The main contender for this is the massive sixteen minute 'Gumbo Variations.' While I do enjoy listening to musicians solo and showing off their chops, such a large portion (especially when there are other songs with considerable solo sections as well) ends up getting a bit bland and it's easy to zone out and lose interest. There are certainly people that are going to get into this and think it's amazing, but not me.The three shorter songs are a lot tighter, and still show musical skill without having to do it in long-form. My favourite of the songs would have to be the slightly ominous (and most jazzy track) 'Little Umbrellas.' It's songs like this on the record that really prove that Frank Zappa is an amazing, underrated composer.I've been really trying to listen to this more and find more things to like about it, and while there's plenty to like here, I find the overdrawn solos and some of the obnoxious sounding timbres to get a bit annoying to the point that it can hurt the appreciation of the parts that really are masterful. Perhaps one day after listening, this will break through to me and I'll appreciate it as what it apparently is; a masterpiece. Until then, this hasn't convinced me as being anything more than 'pretty cool' and 'listenable.'"
    },
    {
      "reviewer": "seventhsojourn",
      "date": "Posted Wednesday, May 19, 2010",
      "rating": 3,
      "text": "Hot Rats (1969) was my first, but not my favourite, experience of Frank Zappa. It is widely recognised as having been influential in the development of jazz-rock/fusion, and it seems to be one of those albums you should hear before you die. However without meaning to sound disparaging, the best thing I can say about Hot Rats is that it's ok. It opens promisingly enough with the concise jazz-rock of PEACHES EN REGALIA, and continues with some excellent interplay between Zappa and violinist Don ''Sugar Cane'' Harris on WILLIE THE PIMP. Unfortunately the remainder of the tracks are on a gradual downward-sloping curve, with THE GUMBO VARIATIONS being the lowest point thanks to some painfully long solos. Another problem for me is that Hot Rats is a mainly instrumental album and I miss Zappa's trademark goofiness. It's good without being a classic, so 3 stars."
    },
    {
      "reviewer": "tarkus1980",
      "date": "Posted Monday, June 14, 2010",
      "rating": 4,
      "text": "If you consider jazz-rock one of the all-time greatest developments in rock music history, feel free to raise this rating a point; I like jazz more now than I once did, and as such I can finally buy into the idea that this is, in fact, a really freaking great album, but I still can't quite buy the idea of it as Frank's best (like a lot of people think). Frank's first officially solo album is quite a departure from his work with the Mothers, even if signs of this impending approach were manifesting themselves in pieces like \"King Kong\" (or in some of the various material that the Mothers recorded first on stage). If the main thing stopping you from enjoying the Mothers was the 'stupid' sound effects, or the ever-present feeling of being preached to, this album should probably be one of your first Zappa purchases (of course,Burnt Weeny Sandwichshould take precedence, imho, but that's for later). This is the first Zappa album to feature his attention focused solely on the music (which kinda makes sense, given that it's almost all instrumental), and that should be something both lovers and haters of the man should be happy about.I'm not thrilled with everything on here: no matter how many times I listen to them, I can't shake the feeling that the 3:04 \"Little Umbrellas\" and the 5:15 \"It Must be a Camel\" are clearly in the second tier of Zappa tracks. They have somewhat decent themes, and I find the conversations between the instruments somewhat engaging, but ehn, Zappa's done better. Still, they're good tracks, and they show that Zappa could write decent enough \"regular\" jazz pieces (as opposed to the wilder stuff that makes up the rest of the album). Well, and to be fair, \"It Must be a Camel\" has a couple of places where it really tears, so calling it \"regular\" might be a bit of an oversimplification.I'm also not as thrilled with the main attraction of side 2, the 16:55 of \"The Gumbo Variations,\" as I'm sure many many people are. The thing is, I like when jazz elements are sprinkled into rock, but this is something else entirely. This is Frank taking what I guess is one of the \"fundamental jazz aesthetics,\" (choose your own better description, please), the idea of having most of a group play a single primary theme over and over while one person in the group solos on and on and on and on and on, and fusing it with rock by (a) making the rhythm section play a rather funky foundation ad infinitum and (b) have almost the entire song dominated by a single multi-instrument solo. Indeed, there's a lengthy saxophone solo here, a shorter (but not quick either) violin solo, a bit of a guitar solo, and then a bit of a drum solo for crying out loud. Not only that, though, but if you pay close attention, you'll notice that, near the end of the saxophone solo, the violin starts playing underneath it, and by the time the sax stops, the violin is in full throttle (the same phenomenon occurs with the transition from the violin to the guitar; these smooth transitions allow the soloing to never actually stop, thus making it seem like one continuous solo). Now, don't get me wrong, I do essentially like listening to it; it's awesome to listen to, for instance, if you're driving on Lower Wacker Dr in Chicago on a sunny day. But the solos and the entertainment caused by them during the piece don't stick with me once the piece is over, if you get what I mean. Put another way; the violin solo in \"The Gumbo Variations\" may be stunning in terms of speed and virtuousity, but it's the violin solo in \"The Little House I Used to Live In\" that sucked me in enough to desperately need to hear it again and again. Still, \"stunning in terms of speed and virtuousity\" is a nice compliment, and it is really entertaining when it's on, so that still means a lot.So, ok, I'm not madly in love with side 2, even if I like it a lot. Side 1, on the other hand, is basically all top-notch winners. The opening \"Peaches En Regalia\" is a worthy contender for The Greatest Zappa Track Ever, one of the most famous jazz/classical/rock fusions that anybody ever came up with. It's really the closest thing I've ever heard to a symphony that lasts less than four minutes, a piece with so many elements and themes that work not only without negatively affecting one another but that even manage to find a real sense of emotion that was often lacking with his work with the Mothers that it's absolutely mind- boggling. (I have absolutely no idea what the correct way is to split up and punctuate that sentence. Meh.).\"Willie the Pimp\" is up next, and it's a 9:16 wankfest that guest features none other than Captain Beefheart on vocals. Wankfest is meant in a good way here, though; the main feature of this is not the recurring violin theme, nor Beefheart's voice, but instead Zappa ripping out an amazingly non-repetitive guitar solo for a good seven minutes. This guitar solo once made a list of the 100 worst guitar solos of all time, and on a certain level I can actually see the justification for this; to say that it's excessive doesn't quite convey just how excessive it is. On the other hand, while it can certainly become boring as a whole after a while, there isn't actually any moment during it that I can pinpoint as the place where boredom officially sets in, because Frank is doing so many things and playing so many interesting themes that boring ends up seeming like a silly trait to identify it as.Closing out side one is \"Son of Mr. Green Genes,\" an extension of one of the interesting shorter pieces onUncle Meat. At first I kinda lumped this in with the other pieces as \"just another piece of jazz-fusion,\" but for whatever reason this one grew on me quite a bit. Maybe it's because, throughout all of the jazz-classical trappings of the piece, the essence of a neat, weird, quirky little tune is always shining through. Whatever; I like it.So that'sHot Ratsas seen by me. I know of quite a few people who rate this as Zappa's best, and all I can say is more power to them. If I had it in me to enjoy jazz even more, it's likely I would too. As is, it's still a really marvelous album, one no Zappa fan can possibly be without."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Thursday, August 19, 2010",
      "rating": 3,
      "text": "With nearly a hundred written reviews and another 150 in rating form,Hot Ratsis currently the most discussed Frank Zappa release in the artist's discography. So it's only natural that I happen to have an opinion of my own on the matter which I dare to share with anyone who is concerned!This was the album where Zappa finally took a break from the Mothers of Invention and showed the listeners the unexplored frontiers of his talent that he would pursue from here on with his music. But was this first stab at the new direction enough to make it an instant masterpiece? I don't happen to think so! The reasons for this are many and are difficult to break down in simple categories, but that doesn't means that I'll try to do just that!Starting with the material that was written for the album, we see quite a versatile collection of compositions ranging from pleasant and more distinguishable performances onPeaches En Regalia,Son Of Mr. Green GenesandLittle Umbrellas. Here we see a much more personal performance from Frank Zappa that always seemed to be missing on his albums with the Mothers of Invention. This doesn't necessary mean that those albums were inferior in any way, only that Zappa hid his persona behind the collective banner that was the Mothers of Invention.Of course we can't have a Zappa-related album without a moment of satire andWillie The Pimpmarks such an occasion, featuring another in the line of many collaborations with Captain Beefheart himself on vocals! Personally I'm all for Frank Zappa's humor, but surprisingly this particular song has very little appeal to me even though the whole idea of a pimp who dresses up for the occasion sounds hilarious on paper.The second side of the album is almost entirely devoted to free-form jazz improvisations, staring with the very loose 17 minute jam titledThe Gumbo Variationsand concluding with the suitable low-key ending onIt Must Be A Camel. I can't say that either of these two pieces have any symbolic value to me outside of just being creative music made by the master himself. To me, these are just the stepping stones for future improvements on albums likeThe Grand Wazoobut I'm sure others will disagree with such an ignorant remark on my part.Hot Ratswas where Frank Zappa finally began going places after being relatively stagnant since the release ofFreak Out!. Even though there was a lot of improvement left to achieve, the '70s were definitely both the time and place for such an event to occur! Therefore I can only recommend this album to Zappa-adventurers who have already heard at least two or more of his albums from the '70s before entering this early domain. Hence good, but non-essential.***** star songs: Peaches En Regalia (3:37)**** star songs: Son Of Mr. Green Genes (8:58) Little Umbrellas (3:04) The Gumbo Variations (16:55) It Must Be A Camel (5:15)*** star songs: Willie The Pimp (9:16)"
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Monday, November 29, 2010",
      "rating": 5,
      "text": "I remember hearing this album back in the 70s with a friend who was a Zappa-freak. My impressions were that it was a little too straightforward hard rock for my tastes and that the vocal performances and lyrics were just not my cup of tea. Fast forward to 2008 when my discovery of ProgArchives helped to resuscitate my passion for prog, old and new, and I've been able to give Frank's music a fresh start. Though I still find myself unamused by many of the puerile lyrics and topics (often unnecessarily drawn out, IMHO), I cannot nor will I deny the unmistakable high caliber of compositional genius and performance prowess in the songs rendered unto vinyl. Frank was a top tier guitarist whose antiauthoritarian genius could often be rather abrasive and uncompromising. His music seems to convey this as well. You either love it or you appreciate it. Hot Rats contains a collection of superb guitar-based, tightly performed songs which definitely put on full display the superior axe-craft of the headliner. It is not an album I go to often, but if I were to choose a FZ/ Mothers album to spin, it would this one or \"Shut up..., Vol. 2\"--though I think \"Freak Out!\" is pure genius.1. \"Peaches en Regalia\" (3:39) Like many, this is one of my top five favorite FZ songs of all-time. (9.5/10)2. \"Willie the Pimp\" (9:23) great music that is rather diminished by Mr. Van Vliet's vocal. (8.5/10)3. \"Son of Mr. Green Genes\" (8:57) This song is great for the whole ensemble's contributions; I can listen to it while switching my attention from Frank to bass, drums, keys, and be equally amazed. (9.5/10)4. \"Little Umbrellas\" (3:09) an intricately designed, almost European-sounding instrumental with the delightful presence of multiple parts for reed/woodwind instruments and organ. (All Ian Underwood?!) I especially enjoy the presence of the double bass. My second top three song here. (9.5/10)5. \"The Gumbo Variations\" (12:54) jazzy blues or is it bluesy jazz? The simple bass lines seem to indicate the former, but Ian Underwood's sax seems to be treading into some serious jazz territory. Don Harris' violin solo in the middle section seems to be mirroring much of Underwood's sax lines, but then he takes it into his own world. Nice loosening up from the bass player in this section. When Frank finally joins in, or, rather, moves to the front, he only does so briefly before the violin and organ weave in with him. Nice performances; not a very exceptional or innovative composition. (8/10)6. \"It Must Be A Camel\" (5:17) piano and percussion dominate this song in the opening section, but then a SOFT MACHINE-sounding quirky jazz-song evolves as the horn and violin join in. Interesting sound recording of John Guerin's drums, as can be said for Frank's solo guitar sound. Again, it is the tightness of the ensemble through all of the composition's sonic and textural shifts that makes this one so enjoyable. My other top three songs. (9.5/10)A seminal album in the infancy of progressive rock music that stands up well over time. Five stars; a masterpiece of progressive rock music."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Thursday, January 20, 2011",
      "rating": 5,
      "text": "After the wonderful \"Uncle Meat\" album, Frank Zappa ventured even further into the jazz rock fusion genre. Here, he replaces the Mothers, except for Ian Underwood, with an array of musicians from the jazz and rock world.The heavily composed music comprises the three shortest songs on the album, but all three are remarkable pieces.Peaches En Regalianeeds no introduction, as it has become one of Frank's most famous works, butLittle Umbrellasshould also be recognized as one of his most beautiful pieces.The remainder of the album are extended jams based on relatively simple riffs. But over these riffs you get some blazing solos from Zappa, Underwood and Sugarcane Harris.Note 1: The CD releases are different edits. On the original Rykodisk CD,Peachesis the same as the LP, but all the rest of the tracks, saveThe Gumbo Variationsfade out a bit earlier than the record. On both Ryko versions of the disk,Gumbois about four minutes longer than the LP, and the later Ryko version restores about a half a minute back toSon Of Mr. Green Genes.Note 2: It was the aforementionedSon Of Mr. Green Genesthat spawned the rumor among the mundane that Frank's father was the actor who played Mr. Green Jeans on the \"Captain Kangaroo\" children's TV show. I'm surprised they didn't think his mothe was a Monster Magnet."
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Sunday, March 20, 2011",
      "rating": 4,
      "text": "Like many people, this was the first Zappa album I owned. I got interested in Zappa shortly after he died, when RollingStone had an article on him and his music. The cover featured Nirvana and many readers rightly complained that Zappa should have been on the cover instead; months later Cobain himself would be on the cover after his death. Go figure. One of the great things about the article was they did a short write up on some of his albums. It was mentioned that a lot of people seem to start with Hot Rats. I was very curious about this guy and his huge discography. I ordered Hot Rats and it was like nothing else my little teenage head had been exposed to.My copy of course was a CD; anyone who has only heard this album on CD has only heard the 1987 re-mix. You haven't heard Hot Rats until until you have heard the original vinyl mix. It's slightly different sounding than the CD, but the CD has a longer \"Gumbo Variations.\" This was one of the first 16-track recordings and has a much fuller sound than most music from 1969. This is also notable for being Frank's second 'solo' album (Lumpy Gravy being the first). Although he would still have Mothers later on, he made it clear with this album that he didn't exactly *need* them. The line-up features Captain Beefheart on the only song with vocals, \"Willie The Pimp\" as well as Ian Underwood who returns from Uncle Meat. Two violin players: Jean Luc-Ponty and Sugar Cane Harris, and future R&B artist Shuggy Otis (who wrote the song \"Strawberry Letter #23\") plays bass on \"Peaches En Regalia.\"Speaking of \"Peaches\"...ain't that one hell of a song. One of Zappa's all-time best instrumentals (of which he has many). Opens with a terrific drum fill. Lots of tape manipulation on some instruments, especially guitar and overdubbed drums. No shortage of wonderful melodies here. Love the multi-tracked saxes. \"Willie The Pimp\" has a great riff played by guitar and violin in unison. Like the overdubbed percussion. After Beefheart does his typical avant-blues vocals, Zappa proceeds to show why he is master of wah-wah guitar. Of all the songs out there with an 8-minute guitar solo, this is clearly one of the best.\"Son Of Mr. Gren Genes\" is of course a reworked, instrumental version of \"Mr. Green Genes\" from Uncle Meat. Frank liked to use that \"son of...\" thing from time to time. This version has better bass and drum work. Frank gives us another great guitar solo. Like \"Willie\" the heart of this song is a jam based on Frank's solo, but the music still loosely follows a structure. Ends with a reprise of the main \"Green Genes\" melody; very orchestral sounding in fact. The first three songs are almost flawless, but the second half of the album is generally not as strong. \"Little Umbrellas\" features upright bass. Short but sweet.The longest song and the most jam-oriented is \"The Gumbo Variations.\" First a sax solo. Then a violin solo. Then a guitar solo. Some interesting drumming during Frank's solo. A brief bass solo later on. \"It Must Be A Camel\" has a typical nonsensical Zappa title. Overall, this is probaly the least interesting song here. Sort of similar to \"Umbrellas\" but not as good. Cool overdubbed drumming at the start. Short drum solo before it goes back to the opening section (without overdubbed drums).This was jazz-fusion at a time when most 'fusion' was basically electrified jazz. This was an influential album but Frank did the experimental jazz-rock thing better on the two sequels to Hot Rats: Waka/Jawaka and The Grand Wazoo. I don't think this is the greatest place to start with FZ but, what the hell, it's where I started and within five years I had about 20 Zappa albums. A great album but the second half keeps this from being a masterpiece. 4 stars."
    },
    {
      "reviewer": "Anthony H.",
      "date": "Posted Saturday, April 16, 2011",
      "rating": 5,
      "text": "Frank Zappa:Hot Rats[1969]Rating: 10/10It's difficult for me to write about Frank Zappa'sHot Rats. This album is so near and dear to me, so central to my musical identity, that it's hard to conjure up words with which to evaluate it. Stylistically,Hot Ratsis a continuation of the jazz-fusion that first began onUncle Meat. It's fascinating to me how after releasing that album (his first real foray into jazz) in April 1969, Zappa managed to perfect this style so brilliantly a mere six months later. Zappa and Ian Underwood form the core of this album, but many other great musicians such as Don \"Sugercane\" Harris, Jean-Luc Ponty, Captain Beefheart, and Max Bennett also make appearances.The absolutely classic \"Peaches in Regalia\" opens the album. It's a short song, but it certainly doesn't lack in ideas. Classical guitar, piano/keyboards, sax, and gorgeous flute create one of Zappa's greatest compositions. \"Willie the Pimp\" begins with an unforgettable electric violin riff, and Captain Beefheart performs the only vocals on the album. The rest of the song is a lengthy improvised guitar solo from Zappa. This is yet another Zappa classic. \"Son of Mr. Green Genes\" may just be my favorite song here, and that's saying something. I don't think a better combination of big-band and guitar-rock has ever been made. Zappa's solos are sublime and the brass sections are mind-blowing; these nine minutes form a treasure trove of indispensible musical pearls. \"Little Umbrellas\" is a short composition that slows things down a bit. Heavy piano and brass create an almost menacing rhythm, and fantastic keyboard/piano/flute overdubs flourish the piece. \"The Gumbo Variations\" is a seventeen-minute track consisting mostly of improvisation. The opening bass and guitar riffs transition into a lengthy squealy sax solo. After the sax stops, Don \"Sugarcane\" Harris plays some of the best jazz/rock violin ever recorded. I can listen to this violin solo over and over again and never get tired of it. Bennett's magnificent bass playing is also particularly notable. \"It Must Be a Camel\" is a short piece that ends the album. Piano begins the song, followed by some extremely complicated sax playing. Guitar and violin make an appearance, and sax closes the song.I can say with high confidence thatHot Ratsis the greatest jazz-fusion album ever recorded. Some people would object to this statement, but it's honestly hard for me to understand why. Everything about this album is perfect: the musicianship, the songwriting, the emotion, the atmosphere, the creativity. This is one of those albums that I can listen to repeatedly and never grow tired of. There may be a few naysayers, but I advise ignoring them. Anybody who appreciates prog, jazz, or good music in general owes it to themselves to familiarize themselves withHot Rats."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Wednesday, June 1, 2011",
      "rating": 5,
      "text": "As one of the first musicians to experiment with fusing jazz and rock - coming from a rock direction just as the likes of Miles Davis and Tony Williams were approaching the idea from a jazz direction - it was only a matter of time before Frank Zappa tried his hand at an all-fusion album. Showcasing both his own guitar technique and the multi-instrumental capabilities of Ian Underwood, Hot Rats is the tour de force which proved that Zappa was still a major progressive figure despite the breakup of the original Mothers of Invention. Captain Beefheart pops in to deliver a furious vocal performance on the jazz-blues-rock meld of Willie the Pimp - the sole composition with vocals - whilst Zappa, Underwood, and the assembled musicians make full use of 16-track recording technologies to create dense, layered labyrinths of sound over the entire album. Standout tracks include Son of Mr Green Genes, a rich vein of improvisation structured around a song originally appearing on Uncle Meat, and the epic Gumbo Variations, but every single song on the album is a furious, blinding sample of Zappa's hot new sound. Five stars."
    },
    {
      "reviewer": "Wicket",
      "date": "Posted Monday, June 27, 2011",
      "rating": 4,
      "text": "In common musical circles, the name \"Frank Zappa\" is usually received with cringes and slight looks of disgust to many music enthusiasts, and there's a good reason.The name Zappa is synonymous with a psychedelic outlook, unusual instrumentation (he made xylophones cool again), odd time signatures and just an extreme characteristic of babbling nonsense that could make a family mother sue him for rude and inappropriate behavior (Oh wait...). However, in a muddy and cloudy sea of Zappa's 40+ albums, very few see my vote as top notch progressive rock compositions and Hot Rats, in my very honest opinion, his is finest outing. Many classic rock enthusiasts know Zappa for \"hits\" such as \"Dancing Fool\" and even \"Joe's Garage\", but in all honesty, I can sum Zappa up in just three words: \"Peaches En Regalia\". (Or is that 2 words?)Either way, I have becomes very familiar to this short but entertaining tune. As a jam band enthusiast as well, I have heard bands such as Phish cover this tune in great fashion (albeit without xylophones and shamisens). It also happens to be a great tune that doesn't have Zappa's subtle, deep and, at times, hypnotic vocals, which is why many non-Zappa regulars tend to take much this piece. However, to me, it's only the beginning of a great album.Peaches is a great piece to begin with, and nicely leads into \"Willie The Pimp\", because in all honesty, not many musicians would have a lone violin accompany a standard drum line into a 9 minute jam. Although I would not classify Captain Beefheart as the next Jon Anderson, his vocals sort of play into this, eh, \"pimp-like\" atmosphere Zappa and co. create throughout this tune. After Beefheart croons, it's pretty much a 7 minute guitar solo to the end, which is why as a jam band enthusiast I crave this piece. There's nothing to it, plus it's a great song to blast out on the open road.\"Son Of Mr. Green Genes\" seems to pick up where \"Peaches\" left off. Only it's longer. Roughly five minutes longer. At this point I realized that Zappa's voice was entirely absent from the album, which only made me smile wider. Yes, I appreciate his bravado and golden pipes on a cd every now and then, but this is an album of jams, jams that can only be with that Zappa flair of ingenuity in them.\"Little Umbrellas\" is probably the biggest take away from this disc, though. It's structured as if it was ment to be sung. Instead, recorders and sweeping saxes take its place in a song that seems even shorter than 3 minutes. Then, of course, is \"The Gumbo Variations\", which is, you guessed it, another jam. Only a 17 minute jam. Although I had other Zappa album's like \"Chunga's Revenge\", \"Joe's Garage\", \"We're Only In It For The Money\" and \"Sleep Dirt\", \"Hot Rats\" got me interested in Zappa's live shows which also contained a lot of improvisational jams as evidenced in (bootlegged) CD's such as \"Buffalo\" and \"Imaginary Diseases\".\"It Must Be A Camel\" concludes a fantastic album which, in my humble opinion, should've been played as an entire suite all the way through, but it's another track that ends in typical Zappa fashion, occasional spastic interludes, prominent vibrophone arpeggios and use of a brass section unlike any artist or band in his time. To sum it all up, it is the most easily accessible album by Frank Zappa to date. Of course, you as a reader of this review may have other ideas,but hey, ol' Frank never exactly lived by normal standards, either."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Monday, January 2, 2012",
      "rating": 4,
      "text": "\"Hot Rats\" is the first Zappa album I heard and it is certainly a good start as it is the genius of the man at a more sane level than some of the crude mumbo jumbo and difficult albums in his repertoire.It begins with the delightful jazz rock ofPeaches en Regaliathat is definitely quintessential to the man and features amazing guitar throughout and a melody that locks into your skull and stays there forever.This is followed by the brilliantWillie the Pimpwhich is the initiation of Zappa for me. I was drawn to it as it was featured on the website of all time greatest guitar solos. They were not kidding either as Zappa smokes up a storm on lead guitar, featuring some killer melodic phrases and fret melting lead hammering and speed picking. It is improvised in part and seems to make sense catering to the dissonant percussion and jazz domination of instruments competing against each other. It is the only track with vocals and they are well executed by iconic Captain Beefheart.Son of Mr. Green Genesis another terrific instrumental and features Zappa's manic guitar and a strong rhythm driving it home.Little Umbrellashas the marvellous saxophone sound of Underwood and a pulsating bassline. The dreamy sounds have an Eastern flavour and Ian Underwood's work on the organ is simply stunning on this track.Later we hear the legends of violin prowess Sugar Cane Harris and Jean-Luc Ponty screeching and improvising on the lengthy jammingGumbo Variations. This track is certainly complex and an incredible virtuoso performance with delicious guitar licks, Hammond and sporadic jazz drumming.It Must Be A Camelfinishes the album with jazzy percussive accents and wild piano melodies. Underwood's sax soloing is a work of art, allowing the music to breathe interweaving other instruments in the complex time sigs. It is something that only Zappa could pull off.Overall this is the place to start for Zappa, he restrains the zaniness and crude language, opting for allowing the music to speak for itself, and it is all the better for it."
    },
    {
      "reviewer": "thehallway",
      "date": "Posted Friday, January 6, 2012",
      "rating": 4,
      "text": "The start of a long chain of strange, brilliant albums that bodge together jazz, rock, blues, doo wop and 20th century classical music, sometimes messily, sometimes with grace. Hot Rats is often considered to be Zappa's best album; all I can say is that it is a strong one. Melodies are plentiful at times, totally absent at others, in all the right places it seems. But I suppose it's the improvisation that is the main draw here, spectacular on every track, particularly Zappa's guitar playing and the saxophone of multi-istrumentalist Ian Underwood. Sometimes, themes or solos outstay their welcome for the wrong reasons (i.e. the build-up of tension or growth in sound has already passed it's event horizon, and we are trapped in a single chord sequence for a further few minutes of pure pointlessness). That fact is a shame for Zappa, because it makes his naturally exciting music become boring at times.'Peaches' is a wonderful song, the only 'song' on the album, despite it being an instrumental. The piece is highly structured, and besides from it's lovely harmonies and upbeat feel, the point of interest is it's contrasting use of timbre. In a completely different way, 'Willie The Pimp' showcases the tightness of this ensemble even more, but is mainly a vehicle for Zappa's expert grasp of blues guitar soloing. Does his skill justify the track's length though? A matter of debate. 'Son of Mr. Green Genes' contains a better balance of the sensibilities of the previous two tracks. Variation is to be found, but over a repeated set of chords. What more can we expect from early jazz rock? This piece is performed brilliantly and highlights Underwood.A welcomely brief slice of fusion is 'Little Umbrellas', which less desperately comes across as an attempt to shove everything Frank Zappa stands for down one's throat all at once than some of his other compositions, working in it's ultimate favour. Pieces like this, and the slightly avant-garde yet accessible 'It Must Be A Camel', bring the variation and charm to this album that make it so especially deserving of being heard. The mammoth 'Gumbo Variations' comprises a jam in several sections, which are similar in composition but executed differently. It's a fun thrill-ride, and the main focus, which is the improvisation of the sax, guitar and violin, is nothing short of virtuosic. Not for the faint hearted, but something that will appeal more to jazz fans than rock fans, despite being more rocky in nature.Hot Rats, and Zappa's work in general, contains quite a unique sound. It has an intimate studio feel, with playing that is enjoyable if often over- enthusiastic about itself. More frequent changes of mood and tempo would improve the overall effect, but this is still a record I really enjoy listening to."
    },
    {
      "reviewer": "darkshade",
      "date": "Posted Thursday, December 12, 2013",
      "rating": 5,
      "text": "I think plenty has been said about this album already (just look at the many reviews). My review will consist explaining that there are 2 versions of this album, and if you like Zappa enough, you will want both.The original vinyl release and the newest CDs, released by Universal (UMe) in 2012, consist of the analog recording, and then there is the 1987 remix (done by Frank himself), which is a completely different mix. Certain harmonies can be heard on the remix, and vis versa, or some are missing on the remix and vis versa. The drums sound different on the remix, and has a fuller sound than the analog recording, but there is no better or worse version.Both versions of Hot Rats are essential, and are like 2 different albums, because of how different the mixes are. However, if you're one that doesn't like the revisionist work Frank did to some of his older albums, then make sure you get the vinyl, or the CD version released in 2012 by Universal. The 1987 version is from RYKO. Just keep in mind, that the remix has more music on it than the original (The Gumbo Variations is about 4 minutes longer on the remix)I grew up on the remix, so I prefer that one, but the analog version is drier, and fits more with the time it was released. But both are very good and worth owning. By the way, the music on Hot Rats is awesome, ahead of its time, great early jazz-rock fusion, and man does it ROCK. It's also got Peaches En Regalia, one of the best progressive rock songs ever written."
    },
    {
      "reviewer": "TCat",
      "date": "Posted Thursday, May 28, 2015",
      "rating": 5,
      "text": "Those interested in the jazz fusion side of Frank Zappa need to invest in this album and be familiar with it. Most people know there are many sides to Frank Zappa and his music, some are turned off by his humor and others are turned off by his eclectic jazz or classical works, and yet others love his doo wop music. How does one tell which album has which kind of music on it? You have to explore because his discography is so immense. But let it be known that this album \"Hot Rats\" is a necessary album, especially for jazz fusion lovers. This was FZ's first official, complete (well almost) jazz record and it is essential.This is also the first studio recording by Zappa after the breakup of The Mothers (though not necessarily the first solo album because he released solo projects while The Mothers were formed). The album itself is completely jazz fusion and instrumental, that is all except for one track, which is a straightforward rocker, which has vocals by Captain Beefheart. That track is \"Willie the Pimp\". The vocals are not very long though, and most of the track is devoted to an electrifying guitar solo.As far as the rest of the album, it starts off with FZ's most recognizable jazz fusion work \"Peaches en Regalia\", which is a short structured jazz work recorded at a faster than normal speed, but when it is performed live, is performed at this speed. This little gem is a quick study in jazz fusion progressive with tricky rhythms and quite a complex melody which is Zappa's trademark. This track works as a great introduction to the album and prepares you for what is ahead. Following this is the aforementioned \"Willie the Pimp\". This is one of FZs best straightforward guitar solos which stands out on the album since it isn't really jazz oriented as the other tracks. Next is another long track called \"Son of Mr. Green Genes\" which returns us back to the great jazz fusion that makes up most of the album. This track is based on the melody from \"Mr. Green Genes\" from the Uncle Meat album. FZ fans will definitely recognize the melody played as a jazz band and the melody acts as the basis for the mostly improvised piece. Zappa solos again but the feeling is different this time. Also, a rarity in Zappa tracks that feature his guitar, he returns to a clear variation of the melody in the middle of the improvisation. Other instruments are acting not only as support but also do improvisations. These things make this track unique among the many improvised solos in Zappa's repretoire.The second half of this album starts out with another short structured piece called 'Little Umbrellas' which is similar to the structure of 'Peaches en Regalia'. This is followed by an epic fusion piece called 'The Gumbo Variations' which is over 16 minutes on the CD re-issue which had originally been trimmed down to just under 13 minutes on the vinyl version. The longer version starts with some instructions from FZ to the band for starting the track. This is a perfect improvisation piece which features a brass solo followed by an amazing and quite excellent violin solo and followed by another Zappa guitar solo. There are short interludes between each solo involving different sections of the band, including a short percussion solo. Excellent music. The album ends with the 5 minute track called 'Must Be a Camel' which is mostly structured and involves the entire band. Apparently, the title for this track comes from the large melodic jumps that are in the main melody and how this made the notes on the written manuscript look like camel humps. Again, this is an example of Zappa's 'not-so-apparent' humor in his music.This album remains a staple in the Zappa catalog and is a great introduction to his fusion music. It should be in every progressive rock library and it sets a lot of standards for this style of music. People can't say they don't usually like Zappa music based on a single facet or style of his music. His style would change from one album to the next. You can be a fan of a style of his music and not so much of a fan of another style. The man, overall, is a musical genius, and anyone with a love or an understanding of music will recognize this. That is why Zappa's music is studied in universities and institutions alongside the music of Bach, Bartok, Gerswin and other music geniuses. Of course, Zappa had some not so great endeavors, but that doesn't take away from the fact that the man understood music and had a desire to make his music known to all people, hence the reason for so many different styles and also for his off-color humor. This album is a great representation of the jazz-fusion style of his music and is an essential album. 5 stars."
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Saturday, May 22, 2021",
      "rating": 5,
      "text": "Released in 1969, Hot Rats is one of Frank Zappa's most famous early period albums. An almost entirely instrumental album, Dadaist, with zany titles, and sounds often bordering on farce. A great revelry where the high register is always together with the low register, and Zappa's irreverent fury is expressed in long and quite well elaborated compositions, which move between rock and jazz and blues. In reality, there is little of progressive, at least, as it was thought at that time: in 1969 it was progressive In The Court Of ... by KC, certainly not this contemporary of his, which at most was considered jazz-rock.The first song is a catchy rockblues, with circus sounds, easy to listen, 1. Peaches en Regalia (3:39) rating 7.5 / 8.The second song completely changes mood thanks to the raucous voice of Captain Beefheart and the electric violin of Sugarcane Harris, here we are more on an improvised blues. It's a jam-blues masterpiece, similar to what Blind Faith did the same year, great work on Zappa's guitar. We are the antipodes of prog: it is an improvised jam 2. Willie the Pimp (9:23). Rated 8+The fourth song starts with a strangely pompous beginning for Zappa, but always attenuated by the noisy disorder, we are at the variation on the theme that dominates everywhere, with a music that combines jazz with the sound of a village band, the result is always high, however. 3. Son of Mr. Green Genes (8:57) Rated 8.5The second side opens with a short passage 4. Little Umbrellas (3:09) Rated 7,5 which seems to resume the previous one but here we have the multi-instrumentalist Undewood who begins to take over, however a nice song that, like the first of the first side, amuses with its catchiness.5. The Gumbo Variations (12:54) we are in the border area between free-jazz and fiatistic blues Colosseum's style. Again, as the name implies, this is a constant variation, it is music for jazz listeners, and at best of jam blues, not prog rock listeners. A prog lover would define a 13-minute piece as a suite, but here it is only improvisation, there is no work on the musical score, on the composition. Underwood is the leader.6. It Must Be a Camel (5:17) Final with a hybrid track, the least classifiable on the album. Rated 8.This album, far removed from prog rock, is a small masterpiece, very compact in sound and setting, producing a farcical jazz-rock hybrid combined with easy-listening but very ambitious small town band music. It is high-level improvisation, which stimulates the senses (but not the heart), manages not to be difficult, but has the limit of the improvisation.Rating 9. Small masterpiece. Five stars."
    },
    {
      "reviewer": "DangHeck",
      "date": "Posted Thursday, August 12, 2021",
      "rating": 5,
      "text": "The second solo studio album by Frank Zappa--following his 1968 sound collage early masterwork,Lumpy Gravy--it feels more or less like a collaboration with Ian Underwood, the musical force on this album whotrulybrings about its greatest greatness. Of course, compositions, arrangements and the production, as well as guitar and (not at all of lesser importance) percussion are provided by Mr. Zappa. But it is Mr. Underwood who provides all keyboards, from piano to synthesized organ, as well as all reeds, performing flutes, clarinets and saxophones throughout this great album. He makes this already great musictruly, and I feel truer than anyone else on any other Zappa release, shine bright.Stylistically, this is a stark turning point for Zappa, introducing early Jazz Fusion to our earholes, following the Psychedelic and 20th Century ClassicalUncle Meat, and preceding the final original Mothers albums,Burnt Weeny SandwichandWeasels Ripped My Flesh. I very seldom return to this album, aside from \"Peaches\" and the other two jazzier numbers, \"Little Umbrellas\" and \"It Must Be A Camel\". Therefore, in a few ways, I havevastlyunderestimated and under-rated this album, though always admitting its firm importance, in not only his catalog, but in all of popular music. Two releases come to mind forHot Ratsthat I would consider to be inseparable from its new Jazz-meets-Rock-meets-Classical Fusion:Chunga's Revenge(1970), the first with Flo & Eddie and Aynsley Dunbar (Underwood has a comparable function here), andWaka/Jawaka(1972), with the Wazoo-era Big-ish Band lineup, fronted by hornsmith Sal Marquez, the latter album considered to be (and suggested by its cover art)\"Hot Rats II\". Anyways,onto the review!Our album begins with the inimitable, timeless classic\"Peaches En Regalia\", a whirlwind of keys and woodwinds and just the most delicious soloing from Frank and Ian (it's pretty immediately a joint solo, in tandem, of guitar and flute), ending with the horny fanfare in the latter half. The organ and the auxiliary organ in this last half, driven by the straight-ahead rhythm section, really makes this song all the greater. Again, a true classic. As with many of these tracks, in my mind, a no-doubt-about-it must-hear.\"Willie The Pimp\"is more of a bluesy number, most notably featuring (for the first time) Frank's school-days friend and Howlin' Wolf aficionado Captain Beefheart. Alongside blazing and wild Wah guitar from Frank, it just as notably features Don \"Sugarcane\" Harris on violin. It's his blues-violin solo on \"Directly From My Heart To You\", off ofWeasels--on which he also provides lead vocals--that is one of my all-time favorite Zappa moments. To be frank, right off, \"Willie The Pimp\" is a great song, a driving jam with awesome drums and an endlessly interesting extended guitar solo from Frank (though nowhere near his peak), but it is honestly the weakest moment on the album for me: And that is a compliment to the album. It really isthatgood. I have been [only slightly] mistaken about itfor years...\"Son of Mr. Green Genes\", a callback to \"Mr. Green Genes\", originally a vocal number off ofUncle Meat, is a sped-up instrumental song [version, really]. Another must-hear classic from his catalog, it has a really solid, very of-the-time composition. This is another song featuring a bunch of soloing over its classic and memorable fanfare. Over its nine minute length, it has effectively three different solos by Frank.\"Little Umbrellas\"is a very Underwood-fronted track, with the theme performed on clarinet, matched with awesome mallet percussions and a lovely, jazzy backbeat. This song is just ear candy for me, through and through. In the middle section, Ian then has a duel organ and piano solo. Absolutely fantastic.Onto\"The Gumbo Variations\", I have to say a few words for context. I was richly blessed by my listen last night, asthisandnot\"Willie\" was forever the weakest part of the album [I feel now, in greater sobriety haha, they're about equal]. I felt this song, at a whopping 13 minutes was just way too long for its own good, despite all of its clear strengths. [I still feel it's a little too longwinded and kind of grating at that cost, to be honest.] This is a more straight Rock song with,for the first three minutes,a blazing sax solo. This is subsequently followed by the second feature by \"Sugarcane\", with a wicked electric violin solo. It goes on for nearly three minutes as well. Then it's Frank's turn. I would say, aside from Ian's solo to start the song, the strongest component of \"Gumbo Variations\" is the production and compositional choices on Frank's part. He does this thing where he introduces sections with a bunch of layers and parts and then proceeds to take most of them away, in and out of the jam, in and out of solos. And this accordioning is done to great effect, most effective, especially, over Ian's solo. To reiterate, is it still too long? Eh... Maybe.Finally, we have the wonderful\"It Must Be A Camel\", another very jazzy moment, with wild percussion and drums (which is just so Zappa) and piano. Its main theme is so infectious, despite being so strange. It pulls you to and fro, especially when he plays with numerous rhythms. The overall/underlying rhythm shifts around the mid-mark for a pretty tasteful solo from Frank. But like the other strongest moments on this album, this is an Ian-dominant song. Praise be.To be as clear as possible,True Rate: 4.75/5.00."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album586f.html",
  "last_parsed": "2025-05-18T13:24:38.026816"
}