{
  "album_title": "SHEET MUSIC",
  "artist_name": "10cc",
  "artist_page_link_local": "artist0b19.html?id=2552",
  "year": 1974,
  "rating_value": 3.67,
  "rating_count": null,
  "review_count": null,
  "genre": "Prog Related",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/2552/cover_345411242017_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "The Wall Street Shuffle",
      "duration": "3:54",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "The Worst Band in the World",
      "duration": "2:49",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Hotel",
      "duration": "4:54",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Old Wild Men",
      "duration": "3:21",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Clockwork Creep",
      "duration": "2:46",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Silly Love",
      "duration": "4:01",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Somewhere in Hollywood",
      "duration": "6:39",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Baron Samedi",
      "duration": "3:46",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "The Sacro-Iliac",
      "duration": "2:33",
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "Oh Effendi",
      "duration": "2:49",
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "Waterfall",
      "duration": "3:43",
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "Carat Man of Means",
      "duration": "3:28",
      "is_sub_track": false
    },
    {
      "number": 12,
      "title": "Gismo My Way",
      "duration": "3:43",
      "is_sub_track": false
    }
  ],
  "lineup": [
    {
      "musician": "Eric Stewart",
      "instruments": "lead electric & slide guitars, piano, electric piano, organ, Mellotron, marimba, vocals"
    },
    {
      "musician": "Lol Creme",
      "instruments": "guitar, piano, electric piano, Mellotron, synth, maracas, whistle, percussion, vocals"
    },
    {
      "musician": "Graham Gouldman",
      "instruments": "bass, acoustic & electric guitars, bouzouki, autoharp, tubular bells, tambourine, percussion, vocals"
    },
    {
      "musician": "Kevin Godley",
      "instruments": "drums, percussion, vocals"
    }
  ],
  "reviews": [
    {
      "reviewer": "mystic fred",
      "date": "Posted Thursday, August 3, 2006",
      "rating": 3,
      "text": "Amazed as I am to see this brilliant little album on PA, there is not a lot here to interest the hardened progger, but don't be fooled, beneath the quirky little pop songs lies some clever writing with few clues to how 10cc's music was to develop over the next few years, becoming much more deep and sophisticated.The memories came flooding back when I dug out the LP version of this album, I see the CD reissue includes \"24 Carat Man of Means\" and \"Gismo My Way\", good songs which originally appeared on singles B-sides. To the album proper, all the songs on the album are catchy and cleverly written and performed, from the amazing riff in \"Wall Street Shuffle\" to the quirky \"Oh Effendi\". \"Sheet Music\" still sounds fresh and original, excellent sound quality, bags of studio effects and great musicianship.\"Wall Street Shuffle\" is a satire on high finance and has that amazing heavy guitar riff I mentioned earlier, this was a big hit back in 1974, and contains every financial cliche you can think of! The group send themselves up on \"The Worst Band in the World\", it shuffles along to lines like \"we've never done a day's work in our lives and we're earning zillions - up yours - up mine...\", some very unusual lyrics but one of favourites, and \" a little bit of plastic with a hole\" still applies to CD's!!! \"Hotel\" leads in slowly with some atmospheric tweets and jungle noises to put you in the mood, then breaks into a calypso style rhythm, the song is a satirical ditty about living on a carribean island, shades of \"Dreadlock Holiday\"! \"Old Wild Men\" is a slow but beautiful song about..... being \"over the hill\" and far away (like me). The next track \"Clockwork Creep\" is the funniest on the album, which is about a bomb on a plane, will it go off or will everybody be saved...time is running out!!!!Side 2 kicks off with the great boogie style guitar riff of \"Silly Love\", which is right we all get rather silly about love, being up all night etc. \"Between you and me I think itsssss....SILLY!\" Still love hearing \"romance depends on cliches and toupees and three phase..\"! \"Somewhere in Hollywood\" has some interesting instrumental effects and time changes, tinkling piano, and as the title suggests is about \"lights..action..sound\", and film directors in general, and the vulnerable starlet. The next song \"Baron Samedi\" , another favourite of mine starts as a Santana-style rhythm which breaks into a slower chorus, and includes a few studio tricks, reminds me very much of early ELO. Plenty to keep the listener interested on this one!! The track \"The Sacro-Iliac\" is a quirky little song about a \"new\" dance, learn it and you'll never be alone at the bar again. The last track \"Oh Effendi \" is a quirky little song about War and Oil in the desert, rather topical these days it seems! The last phrase in the song, \"There's no more goodies in the pipeline\" thankfully didn't apply to 10cc, this LP was still just the start!Overall a very listenable album, some may find it rather poppy but I have always had a soft spot for it and enjoyed doing the review!"
    },
    {
      "reviewer": "Tony Fisher",
      "date": "Posted Friday, August 4, 2006",
      "rating": 5,
      "text": "One of the great albums of the 70s. It's not prog in the same way as Yes or Genesis, being rather more commercial and pop orientated, but the songs, production and musicianship are up there with the best. Undoubtedly prog and definitely art rock. 10cc always had a fixation with old cinema (in common with Bill Nelson of BeBop Deluxe), though this would emerge more on their next album, and they are masters of the piss-take, with biting wit evident on several songs. Worst Band in the World, Old Wild Men and Oh Effendi are particularly excellent send ups, the last perhaps in part due to three of the band being Jewish (Stewart is the odd one out); they could hardly resist having a go at the Arabs who trade oil for guns and forbidden pleasures. Clockwork Creep is a plane bombing seen from the bomb's point of view; sick but funny. Sacro Iliac is a mickey take of the latest dance crazes; being a committed non-dancer, I like the line \"Here's what you got to do - nothing, in any tempo and any rhythm\"; ie stay sat down and call it the Sacro Iliac. The other tracks are all very tongue in cheek: this is a band with a serious sense of humour. All the members contribute roughly equally to the writing, usually working in pairs (and not just Godley/Creme and Gouldman/ Stewart as they later became). Silly Love and Wall Street Shuffle were significant singles hits and gave the band a huge profile.And the music? Well the whole band are highly talented on their main instruments, but the three front men are multi-instrumentalists who can swop the keyboard/guitar roles around freely. Creme and Stewart both play some scything lead guitar. All 4 sing lead vocals on at least one track and they are remarkably consistent in their excellence, with harmonies being a strength. The production and sound quality is exemplary; the music on my old vinyl album leaps from the speakers with realism and clarity.Overall, I think that this pips The Original Soundtrack as their best album and I still enjoy it enormously. For consistency of material and excellent musicianship, it gets the full 5*."
    },
    {
      "reviewer": "chessman",
      "date": "Posted Saturday, August 5, 2006",
      "rating": 4,
      "text": "The second album from this band, and even better than their debut! This is 10cc at their freshest, wittiest, most diverse best! I always loved the cover of this record. Even the title is a play on words; is it Sheet Music? Or is it Sh*t Music? Very clever! The balance between all four musicians is perfect here. Eric Stewart kicks off the album with the brilliant 'Wall Street Shuffle', one of the heavier tracks on the album. As usual, it is full of clever lyrics, and Stewart's guitar is very powerful here, strident power chords mixing with lovely harmonies in the middle section. 'The Worst Band In The World' continues the guitar dominated tracks. Lol Creme takes over vocals and the laid back beat suits the song perfectly. Again all four join in for backing vocals and the song is really too short. The band really take the micky out of themselves with wonderful lines such as: it's one thing to know it but another to admit, we're the worst band in the world but we don't give a...(guess the missing word that rhymes with admit!) or, at the end: 'here we are together on your hi-fi, a little piece of plastic with a hole, and ending with 'fade me...fade me...' it is a superb track. On 'Hotel', Kevin Godley starts the singing off, then Graham Gouldman takes the main vocals. Nice acoustic guitar here, and a steel band effect in the chorus adds to the tropical feel. A good song. 'Old Wild Men' is sung by Eric Stewart and Kevin Godley. A slower, quieter track, with nice organ and subtle guitar, it is quite a poignant track. 'Clockwork Creep' brings back the fun and humour, with all four singing, though it is Lol Creme who really leads the song. Only this band could write a song about a bomb on a plane and make it enjoyable! Nice piano work here, it is not too distant from something their contemporaries Queen would do. Another great line here: 'oh, no you'll never get me up in one of these again, for what goes up must come - down, down, down, down down, etc. What was the start of the old side two begins with 'Silly Love' with more heavy guitars, and another set of brilliant lyrics, sung by Lol Creme. In the middle is another classic line by Eric Stewart: 'oh, you know the art of conversation must be dying, oh, when a romance depends on cliches and toupees and three pays.' Great stuff! 'Somewhere In Hollywood' is probably my favourite track on here. It is an epic! Lovely grand piano to start off with, superb singing from Kevin Godley with a short piece from Lol Creme in the middle. Another great line here as well: 'I've taken Lassie for walkies, when she was the pup that vaudeville threw up, destiny led her hand in paw to somewhere in Hollywood.' And the ending, with multi tracked vocals is very beautiful indeed. 'Baron Samedi' is an Eric Stewart song, and he excels on the old twanging guitar sound here. Again, in the middle, there are some superb harmonies. 'The Sacro-Iliac' is another Graham Gouldman led piece. Very clever, you can imagine him in an evening jacket singing this, pretty much like 'The Film Of My Love' on the following album, The Original Soundtrack. Again, very biting lyrics such as: 'and the lush on the floor isn't me anymore.' Finally, 'Oh Effendi' has great slide guitar from Eric Stewart and strong vocals from Kevin Godley. A song about Arabs, Sheiks and Americans, it is another satirical piece that ends the album wonderfully with the line: 'goodbye friends, there's no more goodies in the pipeline.' A strong reference to oil of course! The first bonus track, '24 Carat Man Of Means' is a solid rocker, with a nice chorus, but nothing spectacular, whilst the other track, 'Gizmo My Way' shows off the abilities of the musicians and the gizmo. A nice, laid back instrumental it is nice to see it added here. A wonderful album that I played to death in the mid seventies, the remaster has incredible sound. A must have for art rock fans and those who wish to avoid lovey dovey lyrics. Four stars, though I would push it to five somedays."
    },
    {
      "reviewer": "maani",
      "date": "Posted Monday, August 7, 2006",
      "rating": 5,
      "text": "[N.B. See my review of 10CC's debut album for important general comments about the band. Also, note that my ratings for 10CC are based on their subgenre, NOT on prog as a whole. Finally, I whole-heartedly recommend the reviews of my fellow 10CC aficionado, chessman.]On their debut album, 10CC put their collective tongues firmly in their cheeks and created a lyrically and musically brilliant homage to the 50s and early 60s. For the most part, the songs were \"simple\" but highly effective in evoking the sights, sounds and feelings of that era.With their sophomore album, Sheet Music, 10CC had not simply matured, but had already found - and, indeed, solidly claimed - its niche in progressive pop. Although the wit and wisdom are still there, they have turned from cheeky homage to socio- politics and pop culture - where their basic focus would remain for at least four albums. As importantly, their songwriting matured into a far broader spectrum of incoming influences and outgoing ideas. And where most of the humor on their debut album was simply \"playful and funny,\" the humor (and irony) here is more often sarcastic, sardonic, even cutting.As well, they have not only become a much tighter unit, they have also grown more confident as individual musicians and collaborative songwriters. Indeed, they often collaborate in Lennon/McCartney style, with one of them (or one 2-man \"team\") writing part of a composition, and another (or second 2-man \"team\") contributing a bridge or other part. This works beautifully, and allows for many permutations of contribution.Finally, the group has now completely mastered the recording studio and production techniques in such a way that even Klaatu (among the masters of production) paid tribute to 10CC by citing them as the group's most important musical and production influence, second only to The Beatles. The sounds, atmospheres, textures and effects that 10CC created on this album are obviously not the same as those we associate with the production of albums by Crimson, Yes, Genesis, etc. However, they are no less creative and effective in turning 10CC's arrangements into multi-layered, multi-textured masterpieces of sound and appropriateness.So, what of their sophomore album? It is the first of four that I unquestionably consider a masterpiece of the progressive pop.Wall Street Shuffle. From the opening fuzz guitar chords, you know that 10CC has gone from 50s fun and frolic to serious 70s songwriting. Possibly inspired by Pink Floyd's \"Money\" (which came out the previous year), this biting indictment of capitalism has an understated but solid arrangement, including a truly infectious instrumental break. Best line: \"You need a yen to make a mark if you wanna make money; you need the luck to make a buck if you wanna be a Getty or a Rothschild.\" A great opening track on a great album.Worst Band in the World. With tongue in cheek, 10CC takes on the music industry in this playfully ironic homage to...which band? Ah, but that would be giving it away! Here, 10CC uses musical trickery (\"tune up\") and lyrical snickery (\"Here I am a record on a jukebox, a little piece of plastic with a whole - play me...buy me and you play me and my plastic turns to gold\") to make fun of jaded rock bands who simply \"go through the motions.\" Some nice Stewart guitar work, and one their best-ever lines: \"Up yours. up mine...but up everybody's? That takes time...But we're working on it!\"Hotel. This is 10CC at their most wonderfully 10CC-ish. What seems at first to be a little ditty about island real estate ends up in cannibal country! With one of the most \"appropriate\" arrangements the band ever created - including some of their finest harmonies, superb sound effects, an appropriately tasty solo from Stewart, and literary and cultural references that fly so fast you can barely keep up with them - this remains one of my absolutely favorite 10CC songs. The cannibals' complaint: \"We get American menus with all-American men. We're getting sick of things American - we ate our way through half the Pentagon!\"Old Wild Men. A sort of \"companion\" piece to \"Worst Band.,\" here 10CC laments on behalf of a band (and who is it this time?) whose heyday has past. This gorgeous ballad includes some of Stewart's and Godley's most beautiful, plaintive vocals, and great guitar interplay between Stewart and Creme.Clockwork Creep. Oh boy. Where do I start? This is not only among the group's most spectacular, innovative compositions - a plane bombing told from the perspective of the bomb, the plane and a narrator - it also began a series of lyrical and musical \"clues\" (think \"Paul is Dead\") spread throughout the group's albums that relates the story of how the band survived a plane crash with the help of a guardian angel named...Mandy. [N.B. All of the band's most common thematic references - planes and airports, phones, islands et al - are woven into this superbly secreted subtext.] A frighteningly masterful arrangement. Indeed, if you had to choose just one song to represent what 10CC \"does,\" this would be the one. The best line is the plane's: \"Oh, the gravity of the situation - it's only my willpower that keeps this thing in operation.\" (willpower = autopilot; I told you these guys were masters of the double entendre.)Silly Love. With a slight nod to Zep and Queen, 10CC launches this rocked-out love song, with truly great guitar work from both Stewart and Creme, especially toward the end. Pure fun.Somewhere in Hollywood. Unquestionably one of Kevin Godley and Lol Creme's most brilliant compositions, this pop culture reference-filled song (partly an homage to Marilyn Monroe) has the most stunningly complex arrangement to date. Opening with quasi-symphonic elements, the song has an ever-moving chord progression which segues through multiple sections, including a wonderfully strange outro. Listen carefully for the tap-dancing during the first verse. Best line, re Norman Mailer: \"He's out on the patio, with his Polaroid and scenario, and he's armed, and he's dangerous... ly close.\"Baron Samedi. A sort of \"companion piece\" to \"Hotel,\" here we meet the leader of the cannibal tribe. With neat guitar effects, superb harmonies, and Stewart and Gouldman \"trading fours\" toward the end, this one, like \"Hotel,\" is 10CC at their most 10CC-ish.The Sacro-Iliac. \"Here's a new dance that you'll wanna do.\" Well, maybe. In any case, this hysterical composition is 10CC at their most playful, and includes some of their most subtly brilliant harmonies. Just plain fun.Oh Effendi. The sarcasm drips heavily in this biting double indictment of Middle East arms dealing and American cultural hegemony. Among 10CC's best harmonies and lyrics, here is just one, which might have been written yesterday: \"Allah be praised, there's a whole new craze, we're gonna shoot up the Foreign Legion, and it's up with the sheik and down with the frog, we're gonna liberate the region.\" Like \"Hotel\" and \"Baron Samedi,\" this is 10CC at their most 10CC-ish, and provides a fabulous close to a fabulous, perfect album.Re the two bonus tracks, \"Gismo My Way\" offers the very first use of the \"gizmo,\" an electronic guitar effect invented by Kevin Godley and Lol Creme, but is not particularly interesting. However, \"18 Carat Man of Means\" is without question their best pre- 10CC song, a catchy and satiric little number that pokes a loving elbow at their manager, Jonathan King, and is a perfect transition between the simplicity of their debut album and the more mature writing on Sheet Music. It also has one of their best- ever lines: \"My joint account goes up in smoke...you're drinking Scotch, I'm drinking coke.\""
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Tuesday, August 8, 2006",
      "rating": 3,
      "text": "3,5 stars really!!!Second album from this tremendously gifted quartet (all four actively participating in the songwriting, and not necessarily in pairs either as the later duo would have you believe), which is slowly developing its capacities at writing incredible rock hits that they would splash the airwaves with. There are a few more interesting moments for the investigating proghead such as Wall Street Shuffle, the hilariously tacky Hotel, and most of the songs are inventive and I get a feeling this quartet was in heavy competition with QueenThe songwriting scope is now reaching Queen's spectrum, with Wild Old Men that could've easily been on the Opera album, or Clockwork Creep approaching some Avant Prog that Forever Einstein would gladly call theirs, the hard-rocking Silly Love (could be on Queen's debut). On the prog rock side of things, the lengthy (relative, but clocking in at 6-min30) Hollywood is capable of catching your difficult taste for good arrangements, ambiances, and Baron Samedi is an intricate guitar-lined rocker with incredible percussions. Great stuff (does that sound like .... a mellotron at the end), great track, great group!!!Definitely a step forward from the debut, Sheet Music is not quite yet 10 CC at the top of their form, but no doubt this would come, soon. If you ever find their first two albums on one Cd, go for it. If not, stick to this one from their early period and forget the debut. Please note, that I have not heard the remastered and re-bonused track version of all of 10 CC's albums"
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Saturday, November 24, 2007",
      "rating": 4,
      "text": "10CC is in good shape for this \"Sheet Music\". With such a great opener it could only be a good sign of what we are going to get here.\"Wall Street Shuffle\" is an acid critic of the trading madness in the biggest financial place in the world. I quote : \"You need a yen to make a mark, If you wanna make money, You need the luck to make a buck\".Their so funny and typical style are best heard in \"The Worst Band In The World\" and \"Hotel\". Parodic and again vitriolic lyrics against the \"grandeur\" of the US and the American way of life : \"Let's buy a hotel, let's get a yacht. We'll get a golden island in the sun made of coconut. Let's buy an old car, we'll crash in a hut. We'll feed the food to the Ford, and we'll live off the coconut\". All this sung on a gentle and childish melody.And that's the paradox of this band. To be able to deliver complex and ferocious ideas while playing APPARENTLY simple and accessible music. But 10CC is also subtle and melodic (\"Old Wild Men\").As far as vocal harmonies are concerned, I guess that only the Fab Four or Jeff Lynne have done better. Just listen to the incredible \"Clockwork Creep\". Irresistibly amazing. This album, even more than its predecessor, is a kaleidoscope of innovation, research in arrangements. But lots of attention is needed to capture all these. There are tons of them but it is very easy to miss them if you are not on a permanent alert to catch most of them (catching them all being virtually an impossible job).Each piece (even short) is a mini-opera and clearly announces song like \"One Night In Paris\". Take \"Silly Love\" for example. How is it possible to have so many moods in less than four minutes ? A difficult trick. \"Somewhere In Hollywood\" starts with some notes reminding \"The Long & Winding Road\" from who you might know. And we'll be travelling in their crazy world agazin : pastiche, opera, enormous arrangements and superb melody. Seems so easy to write catchy songs while listening to 10CC.This whole album is an enchantment. Even \"Baron Samedi\" which starts a bit weak, will vomit an incredible amount of different styles, rhythms and fury. Not great as such but so complex when patiently listened to. The first weak song is probably the short \"The Sacro-Iliac\".The band continues their strong attacks again in \"Oh Effendi\" : \"Look what I did for the pyramid, I put a pool in and made it pay. I built an elevator and a film theatre, and I shipped it to the USA. `Cos there's a real big demand, and its written in the palm of my hand. I'm gonna change the face of the desert. Im gonna sweep away the sand\". Not really USA friendly.The bonus tracks are not bad but they are weaker (which is most of the time the case) even if \"Gismo My Way\" is a pleasant and atmospheric instrumental.This album is overflow with imagination, creativity and fantasy. Close to perfection. Four stars."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Wednesday, March 26, 2008",
      "rating": 4,
      "text": "What a great album from 10cc. Their debut was really a good album, but it is with Sheet Music that they earn their place in prog archives.The music is very elaborate and intricate when you dig into it. On first listen Sheet Music seems very commercial and not really that exciting to a prog rock fan, but try a little harder and you�ll discover that this album is more complex than many of the bands we normally consider to be progressive. There are many parts in every song but somehow 10cc makes it all sound nice and commercial. This is something really special in my opinion and something that rarely happens in pop music.The Wall Street Shuffle starts with a rocking riff which is also played during the chorus. The vocals are really impressive in this song there are used many styles and ranges. There are also some really beautiful harmony vocals in some of the sections. The middle section with the piano reminds me of ABBA which is another very commercial band that had lots of progressive/ symphonic tendencies in their music.The Worst Band in the World is a great song with lots on intricate vocals and vocal harmonies. There are also some time changes here to make the song exciting. This is one of the less commercial songs here. I really think this song is great.Hotel is a crazy song with lots of wild vocals and calypso style moods. This might turn the hardcore prog rocker off but just listen to the complexity hiding behind.Old Wild Men is a beautiful song but it�s probably one of the less progressive songs here.Clockwork Creep might be one of the most progressive songs here. It�s complex and exciting. The vocals are outstanding and intricate and the lyrics are funny.Silly Love is a really great rocker. It reminds me of the swedish band The Ark who probably have Sheet Music as one of their influences. It rocks really well.Somewhere in Hollywood is a complex song in it�s own right. Very diverse.Baron Samedi has some funny lyrics about woodoo and some great vocal harmonies. This song always gets me in a good mood.The Sacro-Iliac took me a while to like and it�s probably the song here that sounds most like it�s a leftoer from the debut. Beautiful vocal harmonies again.Oh Effendi is another favorite of mine. It�s just the most cheerful tune. Really a mood lifter if I ever heard one. Again there are complex parts and time signature and tempo changes.The bonus tracks Carat Man of Means and Gismo My Way are different entities. Carat Man of Means are the least exciting song on Sheet Music but Gismo My Way is a great instrumental track that I find strange wasn�t included on the original LP. It actually sounds like the melody from Frank Zappa�s Watermellon in Easter Hay.The lyrics has to be mentioned here too as they are of high standard and they are always delivered with a gleam in the eye not unlike Zappa at times.The musicians playing here are outstanding and especially Eric Stewart who also mixed and produced Sheet Music is really impressive. The playing throughout the album is of high standard.The production is godly I tell you. One of the best productions I have ever heard. It�s really enjoyable and elaborate.This might be the best commercial album I have ever listened to and I�ve debated with myself wether this deserved 4 or 5 stars, but I have come to the conclusion that it deserves 4. This comes highly recommended from me. You�ll have to listen to believe it."
    },
    {
      "reviewer": "fuxi",
      "date": "Posted Saturday, May 17, 2008",
      "rating": 3,
      "text": "This is hardly prog, but it may just be 10cc's most endearing record. There's not a weak track to be found; the whole album overflows with delightful melodies and vocal arrangements. As with many of 10cc's albums, you could criticise it for some non-politically correct lyrics. 'Well there's a big black Mama in a tree / She's gonna cook us / She's gonna call up the rest of the tribe' run some of the lines of 'Hotel'. Shall we simply assume such lines somehow sounded less offensive in 1974?I suggest we do not take that question too seriously; SHEET MUSIC is catchy theatrical rock as pure entertainment. It contains some of the band's most effective 'heavy' numbers (most notably 'The Wall Street Shuffle') and some of their sharpest satires (such as 'The Worst Band in the World' and 'Oh Effendi'). Above all, it features a couple of songs which are comic in spirit but, at times, deeply moving; this has a lot to do with 10cc's gift for writing beautifully sentimental melodies. Anyone who has heard 'Old Wild Men' ('Where are my boys? / They're in deepest water. / Where are they now?') and 'Somewhere in Hollywood' ('I had a part in the talkies / when you were a little girl') will understand what I mean. Just let the music flow and... enjoy!"
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Friday, May 23, 2008",
      "rating": 2,
      "text": "Not the worst band in the world\"Sheet music\" was 10CC's second (third if you count the pre-10CCHotlegs) album. Released in 1974, a year after the debut, here we have another collection of sophisticated pop songs including a couple of hit singles. The singles concerned are \"The wall street shuffle\" and \"Silly love\", which together constitute the best of what is on offer here. These particular singles managed to avoid the worst of the band's tendencies towards over-indulgence.Unfortunately, the same cannot be said of the remaining tracks, which overall have the sound of potential singles which were not quite good enough. \"Hotel\" is a prequel to \"Dreadlock holiday\", but interestingly is written by the Godley and Cr�me side of the band. Indeed, the lines are rather blurred here in terms of the split which would later tear the band apart, with all four band members collaborating with each other, usually in differing pairs.\"Clockwork creep\" is notable only because it contains the \"What goes up..\" segment which subsequently opened \"I'm Mandy fly me\". It is though symptomatic of other songs such as \"The sacro- iliac\" and \"Baron Samedi\" which flatter to deceive by appearing to have more substance than is actually there. Such songs leave a feeling rather like seeing the emperors new clothes in that because they soundclever, they must be good. Thatclevernessthough is superficial, and does not stand up to scrutiny.There is the odd hidden treasure here. \"Old wild man\" is a decent melancholy ballad which features the distinctive Godley and Cr�me harmony vocals. The feature track from a prog fan's perspective is \"Somewhere in Hollywood\", a 6� minute Godley and Cr�me composition. The track reflects the far less commercial direction the pair would subsequently take post split.My version of the CD is the Castle communications release from 1993, which features the sole bonus track \"Waterfall\". This single B-side is for me the highlight of this album, the backwards instrumental and delightful vocals combining to create a genuine little gem.In all, an album which contains a couple of hit singles and a bunch of wanabee hits."
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Sunday, November 2, 2008",
      "rating": 2,
      "text": "Sheet Music is a slightly more consistent album than The Original Soundtrack. However, there is no multi-part suite here like A Nuit A Paris, or as good a ballad as I'm Not In Love. This is well recorded, well produced, very polished and sophisticated pop music with only very slight relations to prog. Many of the songs fall flat and none of them stand out, they are melodious but not very memorable. The key ingredient for a successful pop album is therefore largely missing.The vocal harmonies are lovely, and there are many instruments involved, but somehow they do not manage to make interesting music. They (try to) hide their lack of musical originality and their lack of instrumental and vocal virtuosity behind a wall of humour and sarcasm. It rarely works. Indeed, the lyrics are often very bad! This album, like most 10cc albums, is therefore only for fans of this band. There are a lot of other bands you need to consider in the prog related world before you turn to 10cc. And if you do, you should start with the album How Dare You! which is a more consistent album than Shiit, sorry... Sheet Music."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Saturday, August 27, 2011",
      "rating": 5,
      "text": "\"Up yours. Up mine. But up everybody's, that takes time. But we're workin' on it.\"10CC's second album show them maturing away from the novelty sound of their debut release into a more refined, but no less humorous art rock sound.From the opening chords ofThe Wall Street Shuffle, you get the idea that this band means business. The only relic of the novelty parody sound of the first album isThe Sacro-Iliac, a song that teaches us a new dance, where the essential move is to do \"nothing, in any beat and any rhythm\".The songs touch on all sorts of topics, all with 10CC's usual sly humor. And there is no question that this is a prog album. Inventive arrangements, odd chord structures and changing time can all be found here. Especially onThe Worst Band In The World, which includes the like quoted at the top of this review.An enjoyable trip from start to finish.4.5 stars, rounded up."
    },
    {
      "reviewer": "Marty McFly",
      "date": "Posted Monday, September 12, 2011",
      "rating": 3,
      "text": "A must, if only to understand continuity of music and \"better\" pop of 70s, the kind that was aspiring higher, than just to charts. The one that wanted to impress Prog lovers and show them that their stuff can be done in extremely accessible way as well and still offer something of value.Oh yeah, we also get Rock numbers that sound really like R., they can do it well. But such descriptions doesn't matter at all, because this can be actually labeled with umbrella term Art Rock, awright ? That means all kinds of various stuff put together and mixed (there's something of Supertramp's symphonicity, something of Mike Batt's eclecticity) as Sheet Music. The result is what's important and for some, it may be too crazy music. There's not much common to these songs, each one is different and even some of the songs sounds like collected with few various pushing tendencies together.3(+), But in the end, all that counts in such kind of music is if you enjoy it. Nothing more. And this is one of the rare times where rating reflects my feelings perfectly."
    },
    {
      "reviewer": "Matti",
      "date": "Posted Wednesday, December 2, 2020",
      "rating": 3,
      "text": "\"Our second album wasn't our difficult second album, it was our best second album. It was the best second album we ever did.\" - Graham Gouldman.Sheet Music is the second album of 10cc (not counting the 1970 album under the name Hotlegs). Occasionally flirting with the early rock'n'roll stylings, luckily less than the eponymous debut, it is not quite as fine and coherent as the next albums, The Original Soundtrack (1975) and my personal favourite How Dare You! (1976), but the charmingly original and witty songwriting and arranging style shared by the tight quartet of Stewart, Gouldman, Godley & Creme is definitely blooming here as well. 'The Harlem Street Shuffle' is a catchy opener. For a few seconds it's almost like any other funk rocker with powerful riffs, but it contains many clever details along the way, and especially the multi-level vocal parts are genuine. 'The Worst Band in the World' is amusing in its ironic approach. Pure 10cc excellence -- something that may irritate the listener in too big doses.'Hotel' starts in a bizarre and experimental manner with whirling synths and delicate vocals before turning into a lively celebration of a tropical holiday. Thank god the next track 'Old Wise Men' is a serene slow-tempo song with a more spacey soundscape, and those great vocal harmonies. 'Clockwork Creep' and 'Silly Love' are over-the-top hilarious, fast paced songs: The Alan Parsons Project song 'Pyramania' pales in comparison in that matter, but this cheek-in-tongue craziness is not really what I enjoy on the long run.'Somewhere in Hollywood' (6:37) has nearly an epic feel and it stays quite calm, which is a good thing in this album context. I frankly don't like 'Baron Samedi', especially for the \"rough\" vocals. 'The Sacro-Iliac' is a little vocal harmony oriented song, and also 'Oh Effendi' reminds me of Frank Zappa at his most humorous [=irritating]. For a fan of this quirky band Sheet Music is among the most essential albums, but I advice newcomers to start with e.g. How Dare You! 3� stars rounded down."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Thursday, May 2, 2024",
      "rating": 3,
      "text": "All I knew about 10CC back in the 70's was the songs I heard by them on the radio. So it was very surprising to listen this one for the first time. The witty lyrics, the quirky sounds, the vocal arrangements all bringing to mind either Frank Zappa or QUEEN much of the time. There are some inappropriate lyrics for sure and silliness rules the day here.I don't remember hearing any of these songs back in the 70's although apparently \"The Wall Street Shuffle\" and \"Silly Love\" were released as singles. Honestly I will repeat myself a lot if I describe each track. Lots of piano, plenty of guitar, both upped by the vocals and silliness. \"The Worst Band In The World\" is a sarcastic track with the focus on the vocals and Zappa came to mind.My least favourite song is \"Hotel\" for the lyrics and silliness. \"Old Wise Men\" isn't much better. I thought of QUEEN on \"Somewhere In Hollywood\" the longest track at over 6 minutes. \"Baron Samedi\" is a nervous sounding piece, quite jittery. Rough vocals at times. Zappa came to mind in spades on \"The Sacro-Lliac\" with those vocal arrangements. The closer has a country vibe to it and is a catchy vocal driven tune.Not my music at all but I enjoyed spending time with it, a talented band. They were Neil Sedaka's backing band? Lol."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album202d.html",
  "last_parsed": "2025-05-18T12:35:27.870070"
}