{
  "album_title": "ENIGMATIC OCEAN",
  "artist_name": "Jean-Luc Ponty",
  "artist_page_link_local": "artistdfcd.html?id=2094",
  "year": 1977,
  "rating_value": 4.3,
  "rating_count": null,
  "review_count": null,
  "genre": "Jazz Rock/Fusion",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/2094/cover_50181782013_r.JPG",
  "tracks": [
    {
      "number": 1,
      "title": "Overture",
      "duration": "0:47",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "The Trans-Love Express",
      "duration": "3:56",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Mirage",
      "duration": "4:54",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Enigmatic Ocean",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Part I",
      "duration": "2:20",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Part II",
      "duration": "3:35",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Part III",
      "duration": "3:43",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Part IV",
      "duration": "2:24",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Nostalgic Lady",
      "duration": "5:20",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Struggle Of The Sea Turtle",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Part I",
      "duration": "3:32",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Part II",
      "duration": "3:33",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Part III",
      "duration": "6:05",
      "is_sub_track": false
    }
  ],
  "lineup": [
    {
      "musician": "Jean-Luc Ponty",
      "instruments": "4- & 5-string electric violins, violectra, piano (5), bells, conductor & orchestrations, producer"
    },
    {
      "musician": "Allan Holdsworth",
      "instruments": "lead electric guitar"
    },
    {
      "musician": "Daryl Stuermer",
      "instruments": "lead & rhythm electric guitars"
    },
    {
      "musician": "Allan Zavod",
      "instruments": "clavinet, piano, electric piano, synthesizer, organ"
    },
    {
      "musician": "Ralphe Armstrong",
      "instruments": "bass and fretless bass (5)"
    },
    {
      "musician": "Steve Smith",
      "instruments": "drums, percussion"
    }
  ],
  "reviews": [
    {
      "reviewer": "greenback",
      "date": "Posted Sunday, November 20, 2005",
      "rating": 4,
      "text": "This is a very good fusion album from violinist Jean-Luc Ponty. Ponty changed here for an Xth time some members of the line-up: the drummer and the bassist are no longer Mark Craney and Tom Fowler, but the result is still VERY impressive and satisfying. There are tons of electric guitars, violins, drums and bass. The tracks are quite fast and there are not many breaks. Most of the instruments are outstanding, especially the bass, which is ABSOLUTELY relentless. Ponty & Zavod still use an old keyboards technology here, so that the record contains conventional fusion, but the performance of the musicians is quite impressive. It is never dull and very sophisticated. Again, Daryl Stuermer plays some bland, sober & subdued electric guitar solos, and Allan Holdsworth appears on a few passages. Zavod plays some excellent keyboards solos."
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Thursday, August 10, 2006",
      "rating": 5,
      "text": "Of all the fusion albums I own, there are three albums that really changed my opinion on the genre itself. The first was Bill Bruford's second album One of a Kind, which really opened my eyes to the zany and highly syncopated side of fusion. The second was Al Di Meola's Elegant Gypsy, which opened my eyes to the guitar-dominated fusion sound (and being a guitarist I could definitely see a new inspiration in my playing). And the third is this album, Jean Luc Ponty's 1977 album Enigmatic Ocean. His style of fusion ranges on a tight groove and some dynamic unison runs and motifs with the keyboard, guitar, and of course his signature violin (which utilizes a lot of different guitar effects on this album, such as wah and phasers). The lineup for this album couldn't have been any better, too, featuring guitarist extraordinaire Allan Holdsworth (who was on One of Kind, ironically). Future Zappa alumni Allan Zavod also gets a good go on this album (Ponty was himself a Zappa alumni so the connection to Zappa is extended a bit more) on the keyboards. And Daryl Stuermer (of future Genesis fame) gives a nice performance overall alongside Holdsworth on the guitar.The album opens with a short but sweet Overture, which sort of sets the mood in a way to what the album would sound like. The Trans-Love Express starts off the journey with a fantastic bass performance from Ralph Armstrong (who is superb throughout the entire album). The tight groove in the rhythm section is further augmented by various runs and melody lines from Ponty and Holdsworth. Mirage begins with guitar arpeggios and some underlying mixed percussion (as well as well-timed bass harmonics). Ponty's violin utilizes a phased effect on this track and his budding experimentation with effects proves to be most effective. Zavod's keyboard solo make good use of the keyboard and has a sensational floating feel to it. The first of two suites on the album is the title track of Enigmatic Ocean (which is spread out over four parts), which clocks in at a bit over 12 minutes. It begins with an atmospheric keyboard laden introduction that turns into an arpeggio based keyboard motif. This song is also the first to feature some lead guitar work from Holdsworth, who exchanges licks with Ponty at many points of the song itself. Holdsworth's signature style of very noodly and fluid runs comes through with flying colors on this piece as well. It's a fantastic piece in the end, with every musician giving their best and coming through successfully as well.Nostalgic Lady and the second suite The Struggle of the Turtle to the Sea round out the album with more fantastic instrumental performances. Nostalgic Lady has one of the most addictive bass lines I've ever heard, especially when put as a counter melody with the stellar unison guitar/violin work. It's probably my favorite non-suite track of the album and it really is a perfect blend of melody and cohesiveness. The Struggle of the Turtle to the Sea is the second suite of the album, this one running a bit over 13 minutes. It begins with a tight groove from the rhythm unit, an underlying unison guitar theme and a violin lead on top of it all. The second part opens with a brilliant piano motif from Allan Zavod and some superb guitar from Stuermer and Holdsworth. The song ends with a fantastic bass groove (man Armstrong can really play the bass). Armstrong puts on the distortion in the middle of the song and offers a solid bass solo. The song reaches a fantastic climax when from what I can grasp Stuermer gets a chance in the spotlight and offers up a mean guitar solo (you can actually tell it's Stuermer as he and Holdsworth have terribly different soloing styles). In the end, this piece finishes off the album in epic fashion and is one of best fusion pieces I've ever heard.Overall, I'd rank Enigmatic Ocean amongst my top three fusion albums ever. Everything about this album is perfect, from the stellar overall mix and sound, to the fantastic musicianship (fantastic is actually an understatement). If you're looking for high energy and melodic fusion, then you'll find a lot to like about this album. If you're a fan of the violin, then this album also comes with a high recommendation. Actually, I'd recommend this album for anybody who is just getting into fusion and for those who are into fusion but don't know who Jean-Luc Ponty is. Masterliness. 5/5."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Sunday, November 5, 2006",
      "rating": 5,
      "text": "A Masterpiece of Jazz-Rock!This is another favorite of mine in terms of Jean-Luc Ponty solo album. In this album, Ponty expresses his musical talents into more free-form style with more exploration and experimentation of rock. Obviously there must be jazz components in each of this composition because that is his roots in his musical direction. Ponty gives good balance in terms of featuring soloist in each segment of the music. This is to say that he is not ego centric and putting all solos under his virtuosity. Musicians involved in this album have high standards in their respective instrument. Who does not know Allan Holdsworth where his guitar playing style has been copied or referred by many guitarists in the world. Daryl Stuermer has been popular with his involvement in Genesis tour where he plays guitar. Ralphe Armstrong is an excellent bass player. Allan Zavod is an excellent synthesizer / keyboard player, and also Steve Smith in drumming. All great players plus great compositions become this album is a masterpiece of jazz-rock fusion that proggers must own the album.The album begins with an OVERTURE (0:47) that sets the overall tone of the album, followed with THE TRANS-LOVE EXPRESS (3:56). This track indicates excellent works of bass guitar (tight bass lines), guitar solo and violin solo.The epic and album title ENIGMATIC OCEAN (Part I - IV) is truly a great jazz-rock composition with excellent movements from one part to another. The music is dynamic and it combines jaw dropping drum work of Steve Smith and tight bass lines by Ralphe Armstrong which flow in relatively fast tempo, accompanying the guitar solo and stunning violin work. It's a masterpiece progressive music where all shifts in tempo and style are performed in speed. My adrenalin pumps faster when I'm listening to this track. This is what I perfectly expect from any jazz-rock fusion outfit. The music then moves into medium tempo one with tight bass lines, featuring guitar work. The tempo then moves into faster one with nice musical breaks - after long guitar and violin solos. It's really a superb epic!NOSTALGIC LADY (5:20) gives musical breaks after long hard driving rhythm section and stunning solo of the epic ENIGMATIC OCEAN. The tempo is slowing down, guitar and electric violin demonstrate the solo excellently. The music moves gradually into higher tones with more textures of the music through violin and guitar solo and fills. This is a nice thread as we can hear Allan Holdsworth as well as Jean-Luc Ponty solo intertwiningly. Jean-Luc Ponty also plays grand piano at this track.STRUGGLE OF THE SEA TURTLE is a contemporary jazz rock fusion at its best! It opens with a mellow part featuring violin solo and dynamic bass lines. The music moves in crescendo and brings more complex arrangements to the music. Allan Zavod provides his keyboard solo wonderfully during part 1. The music reminds me to Chick Corea's Return To Forever - with different style. Great violin solo as well as great bass guitar lines and solo are demonstrated clearly at this track. I think this track is one of the best jazz-rock fusion songs I have ever heard. It's so energetic and so captivating.Overall, I have no complaint at all about this album and I think this album deserves five star rating. It has strong songwriting, excellent performance and tight composition in which all tracks seem like tied into one cohesive whole. It's highly recommended.Keep on proggin' ..!Peace on earth and mercy mild - GW"
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Thursday, November 23, 2006",
      "rating": 4,
      "text": "Jean-Luc Ponty has quite the pedigree, having played on \"Hot Rats\" by ZAPPA and \"Visions Of The Emerald Beyond\" by MAHAVISHNU ORCHESTRA.This record is not out of place among those great albums.After the less than a minute opener \"Overture\", we have the uptempo \"The Trans-Love Express\" with the focus on the violin (surprise !) as well as some good bass and a guitar solo from Daryl Stuermer. \"Mirage\" has such a good beat to it, the drums are great throughout this song.The guitar melody is pretty cool too. \"Enigmatic Ocean\" is a four part song that begins with synths, followed by violin that just seems to build.\"PartII\" features aggressive violin in an uptempo passage that is replaced by guitar followed by a synth run. A chance for the guys to each show their stuff. \"Part III\" has more guitar and violin, while \"Part IV\" sounds awesome with the violin melodies and more amazing drumming. \"Nostaligic Lady\" opens with piano and violin, but the drums and violin carry the song. Another good one ! \"The Struggle Of The Turtle To The Sea\" opens with \"Part I\", a slower paced song (it's turtles !) featuring drums, violin and synths.\"Part II\" opens with piano and \"Part III\" is a jazzy tune , and check out the guitar solo from Allan Holdsworth !There are so many solos on this record and the drumming really surprised me, all the guys play amazing !"
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Saturday, September 15, 2007",
      "rating": 4,
      "text": "The only album i own from this musician, and a great one i might say. One of the ones i really enjoy of jazz-fusion. First, notice 2 big names on Enigmatic ocean, Allan Holdsworth (no introduction), Daryl Stuermer (known from Genesis, Tony Banks solo). Talking about the music, some very fine moments are Enigmatic moments part II and Struggle of the sea turle all parts. Wonderfully crafted album with a lot of keys, violins and with amazing drums. One of the best jazz albums from the '70. I will not give the highest rate because sometimes i had the impression that the musical lines is repeting, but not in so big cantity to make a Collectors/fans only album. So my rate is 3.5 rounded to 4. Recommended"
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Monday, October 1, 2007",
      "rating": 4,
      "text": "Enigmatic Ocean seems a happy merging between jazz fusion, disco, and funk. This is all catchy, upbeat, and entertaining stuff, but it all sounds a bit the same, and as this was released in 1977, I don't hear much in the way of progressing from what has been done before. That's not as much of a downside as it may seem, because Ponty and company don't seem to be possessed by the need for the often pompous, silly, and spastic previous contributions to the genre: these guys just seem to enjoy laying down a nice groove and taking it from there.Overture/Trans-love Express, Mirage. A foot-tapping, catchy set of opening songs, these numbers provide a nice glimpse of what is to come: infectious rhythms (though not terribly original), lots of violin (certainly well-played), and some sporadic blasts of guitar and synthesizer to spice things up.Enigmatic Ocean (I-IV). The opening and closing segments are almost identical, playing the catchy main theme, though both seem to serve as conduits for the middle sections. Part II really kicks things up (almost to Mahavishnu Orchestra territory) in a good way: everyone is firing on all cylinders, though spectial mention goes to Smith's inspired drumming and some blistering work by Holdsworth. Part III dies down for a funky groove that works nicely, and again Holdsworth steals the show. Now I know what all the fuss regarding his abilities is about!Nostalgic Lady. This is a short break between the extended pieces, but certainly not to be forgotten. Holdsworth and Ponty work back and forth between gorgeous guitar/violin harmonies and back-and-forth soloing.The Struggle of the Turtle to the Sea (I-III). Probably the proggiest moments of the album are found here, though they don't stray far from the basic template. Zavod and Armstrong (synths and bass, respectively) get a bit more of a workout here, but by now there is a bit of same-ness to the music. This piece isn't inferior to the rest of the album, but it also adds little to what has been done before.All in all, this is nice music, and worth your money. It's great to put on for company or while attending to work or chores, and it also has a very well-produced, full sound. The downside is a lack of creativity and originality, which is why four stars for me seems to be the upper limit for Enigmatic Ocean."
    },
    {
      "reviewer": "The Quiet One",
      "date": "Posted Tuesday, December 15, 2009",
      "rating": 5,
      "text": "An Ocean of Jazz Rock DelightsEnigmatic Ocean is not simply a solo work by grand violin player Jean-Luc Ponty, the album presents a whole band full of very talented and famous musicians from the jazz rock realm, each musician being as unique and as vital as Jean-Luc is for the music that Enigmatic Ocean offers, so it's definitely a group work rather than a solo work which I'm going to talk about.First I'll talk about Allan Zavod, while not as reknown as any of the other members on board, his singular keyboard delivery is by every means one of the aspects that makes Enigmatic Ocean such an addictive and great jazz rock record. Zavod is the responsible of creating that marvellous floating atmosphere all through the album which no other jazz rock record features; Allan is indeed a subtle player but that's what makes his presence on the album so indispensable, Ponty didn't want an excentric keyboard player who could play extreme synth solos, he wanted someone that could pull-off a particular ambience to the whole album, while of course giving out some ocassional solos. Notable proof of Zavod's unique presence is the 12 minute suite entitled Enigmatic Ocean.Then there's Ralphe Armstrong, member of the second line-up of the Mahavishnu Orchestra. His playing on this album is absolutely outstanding but foremost it's very on top of the mix making him also an essential part of the music. He delivers lots of frenetic funky-tinged bass lines which resonate all through the record, specially on The Struggle of the Turtle to the Sea Part 3 which features a solo by him!To complete the rhythm section Ponty brought Steve Smith, a future reknown session drummer of both pop and jazz artists. His playing is steady and is very ala classic jazz rock, full of fast fills, but let's say he knows what to play when and why.Then comes Allan Holdsworth, the so mighty jazz fusion guitarist of many famous jazz rock records. As he is known to do, he always standouts even if it's not he who leads the compositions. He delivers his unique tone everywhere within fast solos which are only to compete with Ponty's rapid and unstoppable violin soloing.The only member left to talk about is of course the ''owner'' of this splendid record, that is Jean-Luc Ponty, member of plenty of jazz-related artists/bands. Like Holdsworth, he's also used to standing out in each recording he is featured in even when it's not he who is the composer, but this time he is the composer! Varying from melancholic notes to the rapid-paced ones while soloing with Allan which is truly mind-blowing; he is obviously indispensable for this integral work.So Enigmatic Ocean is indeed a group-work, each member contributing their own touch and as a result creating a fantastic and unique jazz rock album which each member has space to standout. While Ponty is not recognised as a fusion innovator in terms of compositions, he actually plays it safe with grooves and soloing on top, the quality of these two elements is simply masterful plus it's distinguishably Ponty and you don't easily confuse it with other melodic fusion acts, and because of that it's a true masterpiece of collaboration between members. Essential to your Jazz Rock/Fusion collection and highly recommended for fans of any of the members on board, also Zappa fans might get a good kick out of this."
    },
    {
      "reviewer": "friso",
      "date": "Posted Monday, February 8, 2010",
      "rating": 3,
      "text": "Jean-Luc Ponty - Enigmatic Ocean (1977)About a year ago I started collecting jazz-rock/fusion albums. The high-rated albums of the genre were of course the first records I tried.Jean-Luc Poty + band sounds like a modern fusion group with a very careful and overproduced sound (unlike Mahavishnu for instance). Every sound is clean, but there's still plenty of space in this recording. All musicians have a highly developed technical style, but don't expect a lot of emotions: this is high quality jazz-rock with interesting harmonies and cool melodies (which is good), but without emotional playing and lyrics. This gives the album a relaxing feel, although some of the solo's are played at insane speed and harmonic inventiveness.Jean-Luc Ponty's sound on electric violin is not very violin-like. Some people don't even recognize the violin when they first heard this album. The electric sound fits in the musical landscape of the band. His solo's are fast and correct in an harmonic sense, but never very daring and experimental. Solo guitarist Allan Holdsworth makes of of an impression with his exceptional solo-guitar style and Daryl Stuermer gives some more aggressive solo's during the album.The drums and bass are great during the whole album, but nothing is really worth mentioning.The compositions have an symphonic jazz style. The compositions have two parts: the main themes with the band working together to get certain melodies and sounds and the solo parts. The latter are easy jazz/funk chord progressions that give the musicians lot's of space to play their solo's. The compositions of the main themes is the main reason people interested in progressive might want to have this album. Some of these melodies are real symphonic prog-like progressions with the typical experimental chord progressions, accompanied by challenging harmonic melodies. Intro-themes of some Genesis tracks like The Giant Hoghweed comes to mind as a good point of reference. The easy themes with solo's are nice, but not all the solo's are that interesting. The guitars and the violin are nice but the keysolo's with a pathetic keyboard sound (typical seventies jazz..) are a bore.Conclusion. This is high quality jazz-rock with a lot's of interesting compositions and a some more solo's of highly technical musicians. This could however never be a masterpiece IMHO. I don't have an emotional attachment to the pieces and the music completely lacks dynamic depth. For me this is a good album, but not essential by any means. Get this if you like the technical sound of jazz with some nice symphonic landscapes and extended soloing. Three stars."
    },
    {
      "reviewer": "Peter",
      "date": "Posted Thursday, April 1, 2010",
      "rating": 5,
      "text": "In 1977, French jazz fusion violinist par excellence Jean Luc Ponty released his outstanding ENIGMATIC OCEAN. With some ten or eleven albums already behind him, and having lent his bowed magic to influential innovators like Frank Zappa, John Mclaughlin's Mahavishnu Orchestra, and others, Ponty was a seasoned veteran -- a true musician's musician.With his impressive r�sum�, the violinist was easily able to attract a stellar group to join him for his latest solo outing. ENIGMATIC OCEAN features a peerless cast: keyboard wizard Allan Zavod was a one-time Berklee professor of music who'd been discovered by none other than Duke Ellington, and had played in the bands of jazz greats such as Glen Miller, Woody Herman, Maynard Ferguson and Cab Calloway. Electric guitar virtuoso Allan Holdsworth had been a notable figure on the early British progressive scene, including stints with Tempest, Soft Machine and Gong. Holdsworth had also played for none less than Tony Williams (ex Miles Davis), one of the most famous and respected jazz drummers ever. (Soon after his work with Ponty, Holdsworth would go on to play on Bill Bruford's first solo album, FEELS GOOD TO ME, then join UK, for that prog all-star act's eponymous debut.) Second guitarist, American Daryl Stuermer (who'd go on to serve in Genesis' live shows), had successfully auditioned for Ponty two years previously, and had already played on the violinist's AURORA and IMAGINARY VOYAGE albums, as well as on two recordings with keyboardist George Duke (another Zappa and Ponty alumnus). Meanwhile, American bassist Ralphe Armstrong had joined the Mahavishnu Orchestra at the tender age of seventeen, cutting his musical teeth in that pioneering fusion act from 1973 to 1975. (Armstrong also had a Zappa connection, having played on stage with Frank in '75 and '76.) Finally, drummer Steve Smith was, like Zavod, a former Berklee student, had played in jazz big bands, and previously toured with Ponty. (Smith would later join Journey, and serve as much-sought session drummer for a long list of top-name pop and rock acts. In addition, Modern Drummer magazine devotees would vote him the #1 All-Around Drummer five years in succession and one of the Top 25 Drummers of All Time.)With musicians like these on board, it's hardly surprising that ENIGMATIC OCEAN features flawless playing and utterly fluid transitions and interplay. Still, it is the complex, lovely and uplifting music itself which makes this recording such a sheer delight, and an album to revisit again and again. It starts with a brief introductory \"Overture,\" followed by two excellent 4 and 5-minute pieces: \"The Trans-Love Express\" is a fast-paced workout with funky percolating bass, spot-on drum and cymbal work from Smith, an impressive Stuermer solo, and blinding violin from Ponty. \"Mirage\" is more stately. The bass chugs along nicely, but it is Zavod's electric keyboards which especially shine here. Next is the first of the albums two longer suites: \"Enigmatic Ocean\" is a wonder: a four-part epic of multiple moods, scintillating solos, infectious themes and ever-engaging writing. (Holdworth's trademark, effortlessly-soaring lead is a standout.) This is 70s fusion at its finest! The next offering, the graceful \"Nostalgic Lady,\" is another winner, with tasteful fretless bass and slower violin providing a soothing respite from the prevailing intensity. Finally, the album concludes on a brilliant high with its second suite, the 13-plus minutes, three-part \"The Struggle of the Turtle to the Sea\" which easily rivals the title set for jaw-dropping displays of masterful musicianship from all players. (Armstrong and Holdsworth particularly distinguish themselves.) Again, there are memorable intertwining themes and hooks aplenty. This is fantastic listening on a grand scale!Thus, Jean Luc Ponty's ENIGMATIC OCEAN remains one of my favourite CDs. It is a landmark work of 70s fusion and its maker's unquestionable masterpiece. Amazing stuff, brilliantly written, played and recorded -- an absolute aural feast for progressive music fans!"
    },
    {
      "reviewer": "kenethlevine",
      "date": "Posted Sunday, July 18, 2010",
      "rating": 3,
      "text": "Ah, fantastical titles - Mystical Adventures, Imaginary Voyage, Aurora - promise to lift us above the hubbub to another plane of musical experience - and for some clearly they deliver. As one of the better known fusion artists and rightly acclaimed for his use of violin in this idiom, PONTY gets a fair bit of attention in a sub genre that probably appeals more to people with legitimate musical training. To the rest of us the music does not do justice to the thematic ambitions.A case in point is the closing suite, \"Struggle of the Sea Turtle\". I mean, as well played and even engaging as some parts are, especially the first couple, this is really just a guy playing some technically accomplished fiddle with solid accompaniment. Turtles are among my favourite animals and I'm feeling a bit cheated because it's more like the flight of the bumblebee or something.In any case, this is an improvement over \"Imaginary Voyage\", with a tighter band performance and more focus on revisiting and bolstering themes. The requisite \"hit\" this time is the sultry \"Trans Love Express\", and \"Nostalgic Lady\" is another example of Ponty's crossover appeal. While the title cut certainly has good moments, in the end it's an oddly amorphous and overly long tribute to GENESIS more than a jazz-rock fusion piece.In case you haven't figured it out, I rarely wade into jazz rock waters as I find the style a bit too enigmatic and irreconcilable with its themes, but it's worth dipping your toes into the icy waters of Ponty's ocean."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Thursday, January 27, 2011",
      "rating": 5,
      "text": "This was the first of Jean-Luc Ponty's true jazz fusion masterpieces (though many will argue on behalf of Aurora and Imaginary Voyage). It's funky (as was the soft jazz of the time) and well displays the virtuoso talents of several of its young contributors--including super guitarists Daryl STUERMER (just before he left to take on a life-long GENESIS/PHIL COLLINS gig) and Allan HOLDSWORTH, bassist-extraordinaire Ralphe ARMSTRONG, keyboardist Allan ZAVOD, and drummer STEVE SMITH. Many place their attention on the title suite but I've always found that I much prefer both \"Mirage\" (4:23) and \"Nostalgic Lady\" (5:24) to the two suites--both of which put on display much of the electronic effects that will become Jean-Luc's signature sound(s) for years to come as well as this groovy, almost dreamy rhythm structure and pacing. This is a pretty great album, but I still hold strong in my feeling and belief that Ponty's best album is the next one, Cosmic Messenger with Individual Choice being his second best--these two having, IMHO, much better sound production."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Saturday, October 22, 2011",
      "rating": 4,
      "text": "A high-class late 1970s fusion album from Jean-Luc Ponty, with unexpectedly catchy tunes showing a very mild (but quite noticeable) disco and funk influence. Whilst the idea of disco fusion might sound disastrous, Ponty and his backing musicians show superb judgement in precisely how much disco they allow to creep in, hitting a perfect balance where they use enough to keep things vibrant, energetic, upbeat and catchy, without going too far into schmaltzy kitsch territory. Ponty also makes sure to get the best use out of the talent available to him, the electric guitar contributions of Allan Holdsworth being particularly high quality."
    },
    {
      "reviewer": "tszirmay",
      "date": "Posted Wednesday, June 27, 2012",
      "rating": 5,
      "text": "I have been reserving this review at great personal cost to my sanity which kept threatening me with shutdown. \"Enigmatic Ocean\" ranks as a perennial favorite in my top 10, and it will never waver away. This is music in its finest configuration and being a bass enthusiast, I cannot find a more glorious figure in 4 string Progland, Squire, Clarke and Levin be quiet! Ralphe Armstrong epitomizes what this devilish instrument should be played like in an instrumental setting, with a simple tone and a devastating technique that just hauls the rest down the highway! Fluid and explosive, funky and jazzy, deliberate and daring, Armstrong simply shines (I saw him live in red jumpers, he was bewitching in front of 60,000 witnesses opening for Supertramp in Montreal, way back when), bopping wildly in the process only to intensify the bond between body and mind. Truly exemplary throughout this splendid disc in particular, hence I suggest newbie fans to maximize their pleasure by listening mainly to the bass guitar as they explore this album the first time. What a ride you are in for, OMG! Hey, I have done so many times I never get sick of this puppy! A fusion-jazz-hybrid that simply cooks non-stop, fueling barely restrained passions, immense technical abilities and just groovin', baby! Swirling free-for-all is perhaps the best way to describe this genial music, it's positively upbeat and riveting!Then, we get to the nasty stuff, with ex-Soft Machine guitarist Allen Holdsworth showing off his remarkable style, the man is sick with talent, going into oblique guitar tangents one couldn't even fathom, let alone reproduce. I caught myself a few times nervously gigging at his licks, head-spinning technique. Then having the audacity to let Ponty rip on the violin, it's just added gravy! Steve Smith of future Journey fame explains why he is so highly rated by both rock and jazz purists! The man shuffles instinctively and with brawn! The Aussie wizard Alan Zavod is perhaps the most underrated keyboard player in prog, the guy plays like no other with crisp and ornate coexisting on a variety of ivories and synths. Lastly, future Genesis guitarist Darryl Stuermer shows off his talent, a proper foil for the crazy Brit while he is soloing his brains out as if imprisoned inside a tornado.\"Overture\" does exactly what the title implies, a proper table setting with a bright candle promptly lit, fine instrumental linen, a violin napkin and all the cutlery one could hope for. Shimmering and very much an awakening, the Ponty voyage begins, well-propelled and shiny. \"The Trans-Love Express\" gets things cranking, 'bedibeep' rhythm with the Stuermer guitars raging with a wicked solo and the soaring violin, this is where you notice Armstrong's bubbly undertone. It looms, dances and explodes all over the bass, sideways and ahead, a rare combination that the man pulls off with apparent impunity. This is so good, it's frightful! You follow up this rambler with his classic \"Mirage\", probably his most well-known tune and you just know the rest will be just a breeze of utter beauty. Shifting like the windswept dunes, the shiny rhythm just sways as if caressed by the gale, searing violins howling at the sun and warm rays of joy glimmer in every direction. Its sensual, bold and exciting, with tremendous ability to go around, Smith and Zavod just killing it in a sublime solo while Ponty and Armstrong add their own solid imprint on the psyche. This is just so unconceivably tasty music. Then we have the masterful 4 part opus, \"Enignatic Ocean\" remains Ponty's crowning achievement, never to be outdone later, a compelling 12 minute epic in the true sense of the word, a progressive rock approach to jazz that simply beefs it all up with spectacular sounds. I mean Part 2 is simply ridiculous, the speed and precision is beyond comprehension, easily surpassing the legendary Return to Forever's playing, this becomes solo-land with Ponty, Stuermer, Zavod and Holdsworth exchanging furious salvos, while the rhythm section keeps things at a blistering pace. Ridiculous! Then Part 3, revs up the funk as well as the experimentalism, with a tortured Holdsworth in full screeching regalia, only then will Jean-Luc unleash one for the ages. Need I say, Armstrong is blasting all over the low end with some dazzling runs, Smith holding up the artillery? Yeah, ridiculous and absurd! \"Nostalgic Lady\" is where things get a tad more classical jazz-rock, flush with resonating rhythms and that darn bass maniac/magician, channeling both Ponty and Holdsworth to even loftier heights , both pulling off masterful solos, two minds fused as one in pursuit of the aural nirvana. Words cannot give this piece justice, as its more sheer brilliance. 'Piece de resistance, mais oui mon cher Jean-Luc' is what we get with the over-the-top three part \"The Struggle of the Turtle to the Sea\" festival and you must be properly anesthetized because what's coming up now is, well?. Another dozen minutes or so of archetypal musical fusion with so much illustrious artistic expression on display, all seemingly effortless. The 3 part suite serves also as a platform for all out soloing, slithering playing by all highlighted by a masterful Zavod synth anguish (Part1) and Ponty's raging catscratcher, here a hollow body Barcus-Berry electric violin (on Part 2). But it's the final section that ultimately slays the beast with Ralphe's glorious solo (straightforward and with devices) which is just as exquisite as his \"Egocentric Molecules\" assault on the next \"Cosmic Messenger\" album, a screaming Stuermer volley followed by a Smith percussive spotlight. Who else but Holdsworth to put the turtle in the water, free at last?!This album is a must have, you have no worthy collection if this one isn't on the mantle. It's currently sitting comfortably in my # 3 spot.5 Puzzling Seas"
    },
    {
      "reviewer": "apps79",
      "date": "Posted Thursday, December 25, 2014",
      "rating": 3,
      "text": "1977 sees Ponty moving to the production of albums in a prolific way.Zavod and Stuermer remain among his stable collaborators, but for the recordings of ''Enigmatic ocean'' he recruited also Fusion legend Allan Holdsworth on lead guitar plus he had a new rhythm section, now comprised of ex-Mahavishnu Orchestra bandmate Ralphe Armstrong on bass and drummer Steve Smith, who later played with Focus and became a long-time Journey member.The album was recorded during the summer of 1977 and released again on Atlantic.Despite all these Ponty albums being dominated by a violin-driven atmosphere and his love for Jazz, there are little details that mark each of his works as different from the previous one.This time his music had a strong dash of Funk, more particularly in the short instrumentals, plus he developed his efficiency on long compositions, presenting two pieces, each clocking at around 12 minutes long.So, tracks like ''The Trans-love express'' or ''Mirage'' are mostly played in a Fusion/Funk way with soft grooves, Ponty's always flashy violin solos and the occasional keyboard splash with synth and piano in evidence, creating a happy atmosphere with an ethereal vibe.Of course the self-titled track and ''The struggle of the turtle to the sea'' are more interesting and sophisticated in every way.''Enigmatic Ocean'' takes a step closer to the progressive realms, it has all these dramatic moods created by a progressive band without lacking the intense harmony always present in Ponty's albums.Mid-70's MAHAVISHNU ORCHESTRA are a good comparison for this 4-part mini suite, which is characterized by its furious rhythms and guitar/violin interplays, featuring lots of extremely virtuosic solos by Ponty, Holdsworth and Zavod.The standard funky echoes though are still popping up, making this a bit of an inconsistent effort.''The struggle of the turtle to the sea'' is propably the better of the two long tracks.While still displaying an obvious flair of Jazz Fusion, it also offers some of the most bombastic atmospheres on a Ponty album and plenty of proggy vibes.Again some funky lines are added for good measure during the third part, but the first two are excellent examples of Prog Fusion, very pompous, professional and dramatic instrumental music with the star of Holdsworth shining through and Zavod making one of his most convincing performances ever.Solid Jazz Fusion, a bit held down by the mass of period Funk appearing in the process.It's still very competitive, intricate and at times fascinating instrumental stuff with the standard violin washes of Ponty.Recommended."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "albumce62.html",
  "last_parsed": "2025-05-18T12:48:44.102787"
}