{
  "local_path": "C:\\Users\\salmo\\Documents\\GitHub\\AlbumExplore\\ProgArchives Data\\Website\\ProgArchives\\www.progarchives.com\\artist3162.html",
  "name": "AREA",
  "genre": "Rock Progressivo Italiano",
  "country": "Italy",
  "biography": "Formed in 1972 in  Italy - Disbanded in 1983 - Reformed from 1993 to 2000 - Active again since 2009\n\nUndoubtedly one of the more adventurous, AREA were also a very important band on the seventies Italian prog scene, their first three albums in particular come highly recommended and essential listening to anyone discovering the RPI genre.\n\nThe band formed in 1972 stabilizing with a line-up of superb musicians for their debut album featuring ex I RIBELLI vocalist\n\nDemetrio STRATOS\n\n, ex I CALIFFI  guitarist Paulo Tofani, bassist Patrick Djivas (later to join PFM), drummer Giulio Capiozzo, keyboardist Patrizio Fariselli and on sax, flute and clarinet Victor Busnello. \"Arbeit Macht Frei\" (work will make your free) was released on Cramps records in 1973 and is a very accomplished debut by anyone's standards featuring an exciting blend jazz, rock and prog with Arabian and Greek (Stratos was Greek) influences along with a touch of the Avant. The bands lyrics show a politically left wing stance and Stratos was already displaying his inventive vocal style, using it as an instrument much of the time rather than in the traditional sense, something he would develop to further extremes on future albums (including solo work).\n\nBy 1974, when their second album \"Caution Radiation Area\" was released, Djivas had jumped ship for PFM being replaced by Ares Tavolazzi and Busnello also left but was not replaced. It's a harder listen than the debut leaning more towards the avant with a heavier emphasis on free jazz, once again the musicianship is exemplary and features some incredibly powerful moments. In comparison \"Crac!\" released in 1975 whilst still displaying the same inventive mix of styles was more accessible and is an ideal early port of call to the uninitiated. That year also saw the release of their first live album \"Are(A)zione\".\n\nTwo further studio albums followed where the band continued to expand their musical palette, \"Maledetti\" released in 1976 where the band used a host of other musicians to help out and \"1978 Gli Dei Se Ne Vanno, Gli Arrabbiati Restano\". By this point Tofani had left the band. It would also prove to be the last album to feature Stratos who sadly died of cancer in 1979 at the age of only 35.\n\nThe three remaining musicians attempted to continue bringing in some outside help in the brass department for the all instrumental album \"Tic & Tac\". Clearly Stratos was a talent too big to replace. Drummer Capiozzo continued in the eighties with a band called AREA II, but was the only original member, leaning more towards the pure jazz elements. He was reunited with Fariselli for one more AREA album, \"Chernobyl 7991\" released in 1996.\n\nWhilst certainly not typical of the RPI genre AREA nevertheless remain an outstanding example of the inventive Italian prog scene. Not for the faint-hearted but for those looking for something more adventurous will find AREA a highly rewarding listening experience.\n\n-Paul/Nightfly\n\nSee also:\n\n-\n\nItalian Prog\n\n-\n\nHERE",
  "albums": [
    {
      "title": "1978 - Gli Dei Se Ne Vanno, Gli Arrabbiati Restano!",
      "local_path": "albumdc6c.html",
      "year": 1978,
      "rating": 3.87,
      "type": "Studio Album"
    },
    {
      "title": "Tic & Tac",
      "local_path": "albumb3a3.html",
      "year": 1980,
      "rating": 2.68,
      "type": "Studio Album"
    },
    {
      "title": "Chernobyl 7991",
      "local_path": "album79ff.html",
      "year": 1996,
      "rating": 2.48,
      "type": "Studio Album"
    },
    {
      "title": "Live in Torino 1977",
      "local_path": "album0465.html",
      "year": 1977,
      "rating": 3.69,
      "type": "Live Album"
    },
    {
      "title": "Live 2012",
      "local_path": "album8710-2.html",
      "year": 2012,
      "rating": 3.7,
      "type": "Live Album"
    },
    {
      "title": "International POPular Group",
      "local_path": "albumfedb-2.html",
      "year": 2004,
      "rating": 3.0,
      "type": "Compilation"
    },
    {
      "title": "Area Gold Edition",
      "local_path": "albumfe52.html",
      "year": 2007,
      "rating": 4.51,
      "type": "Compilation"
    },
    {
      "title": "Live Concerts Box",
      "local_path": "albuma777-2.html",
      "year": 2007,
      "rating": 3.5,
      "type": "Compilation"
    },
    {
      "title": "The Essential Box Set Collection",
      "local_path": "album4211.html",
      "year": 2010,
      "rating": 4.33,
      "type": "Compilation"
    },
    {
      "title": "Area",
      "local_path": "album4a9b.html",
      "year": 2013,
      "rating": 3.0,
      "type": "Compilation"
    },
    {
      "title": "L'Abbattimento Dello Zeppelin",
      "local_path": "albumf711.html",
      "year": 1973,
      "rating": 3.0,
      "type": "EP/Single"
    },
    {
      "title": "L'Internazionale",
      "local_path": "albumd099.html",
      "year": 1974,
      "rating": 2.75,
      "type": "EP/Single"
    }
  ],
  "scraped_at": "2025-05-18T11:15:59.478246"
}