{
  "album_title": "MISPLACED CHILDHOOD",
  "artist_name": "Marillion",
  "artist_page_link_local": "artistd1ca.html?id=233",
  "year": 1985,
  "rating_value": 4.27,
  "rating_count": null,
  "review_count": null,
  "genre": "Neo-Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/233/cover_3722172052016_r.JPG",
  "tracks": [
    {
      "number": 1,
      "title": "Pseudo Silk Kimono",
      "duration": "2:13",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Kayleigh",
      "duration": "4:03",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Lavender",
      "duration": "2:27",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Bitter Suite",
      "duration": "5:53",
      "is_sub_track": false
    },
    {
      "number": "i",
      "title": "Brief Encounter",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "ii",
      "title": "Lost Weekend",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "iii",
      "title": "Blue Angel",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "iv",
      "title": "Misplaced Rendez-Vous",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "v",
      "title": "Windswept Thumb",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 5,
      "title": "Heart of Lothian",
      "duration": "6:02",
      "is_sub_track": false
    },
    {
      "number": "i",
      "title": "Wide Boy",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "ii",
      "title": "Curtain Call",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 6,
      "title": "Waterhole (Expresso Bongo)",
      "duration": "2:12",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Lords of the Backstage",
      "duration": "1:52",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Blind Curve",
      "duration": "9:29",
      "is_sub_track": false
    },
    {
      "number": "i",
      "title": "Vocal Under a Bloodlight",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "ii",
      "title": "Passing Strangers",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "iii",
      "title": "Mylo",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "iv",
      "title": "Perimeter Walk",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "v",
      "title": "Threshold",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 9,
      "title": "Childhoods End?",
      "duration": "4:32",
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "White Feather",
      "duration": "2:23",
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "Bonus Disc on 1998 EMI & Sanctuary remasters",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 1,
      "title": "Lady Nina (extended 12\" version)",
      "duration": "5:50",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Freaks (single version)",
      "duration": "4:08",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Kayleigh (alternative mix)",
      "duration": "4:03",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Lavender Blue (Lavender remix)",
      "duration": "4:22",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Heart of Lothian (extended mix)",
      "duration": "5:54",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Pseudo Silk Kimono (demo *)",
      "duration": "2:11",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Kayleigh (demo *)",
      "duration": "4:06",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Lavender (demo *)",
      "duration": "2:37",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Bitter Suite (demo *)",
      "duration": "2:54",
      "is_sub_track": false
    },
    {
      "number": "i",
      "title": "Brief Encounter",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "ii",
      "title": "Lost Weekend",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 10,
      "title": "Lords of the Backstage (demo *)",
      "duration": "1:46",
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "Blue Angel (demo *)",
      "duration": "1:46",
      "is_sub_track": false
    },
    {
      "number": 12,
      "title": "Misplaced Rendez-Vous (demo *)",
      "duration": "1:56",
      "is_sub_track": false
    },
    {
      "number": 13,
      "title": "Heart of Lothian (demo *)",
      "duration": "3:49",
      "is_sub_track": false
    },
    {
      "number": "i",
      "title": "Wide Boy",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "ii",
      "title": "Curtain Call",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 14,
      "title": "Waterhole (Expresso Bongo) (demo *)",
      "duration": "2:00",
      "is_sub_track": false
    },
    {
      "number": 15,
      "title": "Passing Strangers (demo *)",
      "duration": "9:17",
      "is_sub_track": false
    },
    {
      "number": "i",
      "title": "Mylo",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "ii",
      "title": "Perimeter Walk",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "iii",
      "title": "Threshold",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 16,
      "title": "Childhoods End? (demo *)",
      "duration": "2:23",
      "is_sub_track": false
    },
    {
      "number": 17,
      "title": "White Feather (demo *)",
      "duration": "2:18",
      "is_sub_track": false
    },
    {
      "number": 18,
      "title": "* Misplaced Childhood album demos, recorded in February 1985 and previously unreleased.",
      "duration": null,
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "maani",
      "date": "Posted Tuesday, January 6, 2004",
      "rating": 5,
      "text": "The best of the Fish-era Marillion albums, Childhood has an \"edge\" that was lacking on Script and Fugazi. From the sweetness of \"Kayleigh\" to the edgy jokiness of \"Lavender,\" from the solid-rock brilliance of \"Heart of Lothian\" (one of the best rockers in prog-rock) to the cathartic \"Childhood's End,\" Fish & Co. are at their combined musical peak here. A must-have for prog-rock fans."
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Thursday, February 26, 2004",
      "rating": 3,
      "text": "As most people consider this their pinnacle , isend them back to the Script. Those who tried it after receiving my advice now agree with me. This concept is loud and clear but it is too bad there are so much vocals as the musicians don't get the space and time to better this all too important album as this is one of those albums that kept hopes alive however dimly"
    },
    {
      "reviewer": "Peter",
      "date": "Posted Wednesday, March 3, 2004",
      "rating": 4,
      "text": "Marillion's excellent 1985 album MISPLACED CHILDHOOD lends considerable weight to the argument that not all the best progressive rock was written in the 70s. Granted, this recording could never have happened if Genesis hadn't first blazed the trail that Marillion follow so well here, but that's just the way that art often develops. Marillion may be inspired by Genesis, but wasn't the music of Beethoven an edifice built upon the foundation that Hayden and others had laid? Regarding the often-leveled charge of Fish's vocals being \"imitative\" of Gabriel's, I find it well within the realm of probability that two people could have very similar singing voices, and conclude \"lucky me!\" Having more musical choices is always good, and I simply like to hear Fish sing, passionately fronting this very polished and powerful band!In classic \"prog\" fashion, MISPLACED CHILDHOOD is a concept album in which all the tracks run together in a seamless whole. The excellent, often moving lyrics give an account of loneliness, lost love, substance abuse, the shallowness of fame, man's inhumanity to man, and -- most poignantly of all -- a longing for the lost innocence of childhood. This sentiment is beautifully captured in \"Lavender,\" as a Mother Goose rhyme is masterfully and magically transformed into a touching love song, complete with a singing lead guitar courtesy of Steve Rothery (whose cutting licks delightfully recall those of fellow \"Steve\" Hackett!)Though the album's words take us through some bitter emotional territory, the music is varied, compelling (if overtly derivative) and evocative of its subject matter throughout. The final message is not one of despair, however, as the dawning of wisdom, the reclamation of the spirit of wonder, and the realization of the limitlessness of the future is effectively portrayed in the final two triumphal and cathartic songs, \"Childhood's End\" and \"White Feather.\"In keeping with its theme, MISPLACED CHILDHOOD shone out like a beacon of hope for the future of progressive rock in the 80s, and still thrills today! It is recordings like this one, made some ten years after the heydays of it progenitors, that give me continued faith in the future of the genre. A latter-day progressive rock classic!"
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Saturday, March 13, 2004",
      "rating": 5,
      "text": "I do not think that anyone should be without this recording in their collection. This remains in my opinion still MARILLION's most complete work of art yet. Songs range from the quiet chambers of Lavender to the psychedelic sounds of the Watering Hole. \"Misplaced ...\" also had a fair amount of commercial success and is perhaps their best known work. I also agree with the masses on this one and \"Kayleigh\" still remains one of those songs which has touched my soul. The album is so very well constructed and works well to its completion. FISH sings at his best here and surprisengly the album does not carry an over produced feel to it."
    },
    {
      "reviewer": "corbet",
      "date": "Posted Saturday, March 20, 2004",
      "rating": 2,
      "text": "Wow. One of the most disappointing CD purchases I've ever made. After all the glowing praise for this album and this band, I was ready to heave off my bias against post-70's prog and revel in an absolute masterpiece. Instead I was introduced to a singer who makes me want to vomit being backed by a crew of anonymous, unremarkable musicians. Fans of classic prog (Gentle Giant, Yes, ELP) take note: you won't find anything remotely like that here. To the more \"open minded\" listener (or maybe a semi-deaf Genesis fanatic), this may end up a dear treasure to you like it is to so many others. Your call, best of luck."
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Friday, March 26, 2004",
      "rating": 5,
      "text": "Growing up in publicAfter a couple of early album which, while competent and enjoyable, sounded a bit too like (Gabriel era) Genesis tribute albums, Marillion suddenly found their own identity with \"Misplaced Childhood\".Nominally a concept album, this is not so much a story, as series of individual tracks blended together to form a coherent, beautifully constructed piece (as Genesis did with \"Supper's Ready\"). The album opens withorchestralkeyboards introducing Fish on the brief but melodic \"Pseudo silk kimono\". This leads into a couple of what might be considered surprise hit singles. \"Kayleigh\" (a name which Fish apparently conjured up from the names Kay and Leigh, but which led to a generation of similarly named female offspring!), and \"Lavender\", an interpretation of the \"Lavender blue\" nursery rhyme song. These two tracks manage to achieve the usually elusive feat of blending in completely on a classic prog rock album, while simultaneously holding a wide commercial appeal.The \"Lavender\" theme reappears in instrumental form later on side one, as part of a powerful lead up to the closing track (on LP side one), \"Heart of Lothian\". The title of this track relates to Fish's Scottish heritage, Lothian being the area in which the city Edinburgh is located (one of the city's football clubs is \"Heart of Mid-Lothian\"). Side 2 is the slightly weaker side, but it's all relative, and in CD format the album flows well from start to finish.In summary the best album by far from the Fish era, and possibly the best Marillion album to date.A special 2 CD edition was released a few years ago, containing studio rehearsals of the final tracks."
    },
    {
      "reviewer": "greenback",
      "date": "Posted Sunday, April 11, 2004",
      "rating": 5,
      "text": "What a masterpiece!This album is a real concept and progressive album. The keyboards, the guitars, the vocals, the drums are in a perfect harmony! The 2 ballads Kayleigh and Lavender are really essential: they give to the album a romantic touch; that's why many young female teenagers like this album! The romantic moods are also present in many other parts of the album, because of guitar and keyboards arrangements. Many heavy metal fans like this album, because of the guitar. Finally, the music is complex enough to be liked by real prog fans in search of always more sophisticated albums.Extremely recommended!"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Sunday, June 13, 2004",
      "rating": 5,
      "text": "SUPERB! This is the band's third album and the best that this band has ever produced to-date (2004). This is now 19 years after release date and I still consider this album still a MASTERPIECE. This album would not die with a passage of time.In my opinion, there are two things that bound to any kind of music: 1.) the story that the musicians want to tell the listeners, and 2.) the structural integrity of the music composition itself. This album has fulfilled both excellently. As Fish described the first three albums in the MC sheet music book as \"SCRIPT was bedsit thoughts, FUGAZI was hotel thoughts and MC is home thoughts.\", some lyrics in this album can be considered as too personal with some of them touch the national pride as well. But the beauty of it is that anyone who listens to this story may relate with his / her own, assuming (for example) \"Kayleigh\" synonymous with his girlfriend. Anyone can also relate the \"I was born with the heart of Lothian\" with their own interpretation of \"Lothian\" or any national anthem. I think this is the strong point of this album, story-wise, as it was born from actual experience of the lyricist. Be it a real story or an imagination.For those of you who are new in prog rock, this album is a must. You won't regret as there are \"ear candy\" pop stuffs like \"Kayleigh\" and \"Lavender\" as as well as nice melody and stunning prog music. The music of MC is beautifully crafted, well structured in terms of composition. All 10 songs were organized into two parts. I guess this is due to the availability of two-side LP when the album was created. Otherwise it would be a one piece of music. Again, with this album I admire highly on the band's ability to create a nice, natural and smooth TRANSITION between chapters in a song and between songs. The transitions piece, I think, has successfully accentuated the story and created a solid music nuances. Considering this is a concept album, there is NO tag line melody that is typically used repeatedly throughout the album. Each song carries its own melody and identity. Mixed together, they create a great music composition. This makes the album is worthy for exploration. With this album, you would hardly compare MARILLION with GENESIS. MARILLION is different.DETAILS: (for those of you who want to explore further. Otherwise, just BUY the CD! The 2 CD version is better as later you would enjoy the other version of MC. You should listen to CD 2 after you get used to CD1.)\"Pseudo Silk Kimono\" with a howling keyboard sound and heavy voice of Fish \"Huddled in the city of pseudo silk kimono wearing bracelets of smoke ..\" has a dense in mood. Rothery's guitar work at the background is really nice. Disappearing sound of \"Pseudo ..\" was then followed with a nice keyboard intro of \"Kayleigh\". It's a catchy transition here. \"Do you remember?\". This track transcends various relationships that Fish had experienced with bitter end as he was so committed with his career to be a famous singer. Again, at he end of this track a piano sound brings the music to \"Lavender\" nicely.In the first part of \"Bitter Suite\" Fish sings in a poet reading style \"A spider wanders aimlessly ..etc.\" . The music has transformed to a little bit spacey kind of music. The only unique thing is at vocals here. The tone has then climbed up when he sings \"A train sleeps in a siding .. etc\". This part ends nicely with \"Her mother said she's beautiful, her daddy said 'a whore'\". Terrific piece, melodically really!I consider \"Bitter Suite\" is the trunk, melody-wise, of the album especially when at the third part (Blue Angel) when Fish sings \"J'entend ton Coeur\" the music moves fabulously with slow piano, keyboard and guitar sounds to the beautiful melody of fourth part (Misplaced Rendezvous). \"It's getting late .etc.\" Woooowwww!!!! What a wonderful piece here, my friend!! It's damn nice! But the ecstasy has not ended yet as when the lyric part reaches \"The parallel of you .. you\" yeaaah .. another nice piece! It then bring you to fifth part (Windswept Thumb) \"On the outskirts of nowhere ..\" .The climax is really at the \"Heart of Lothian\" where the music brings together to a relatively higher tempo than the preceding tracks. \"Wide boys! Wide boys!\". It rocks! I admire Fish technical ability to sing seamlessly \"rooting tooting cowboys, Lucky little ladies at the watering holes .\".Part 2 (B side) is much energetic and really stunning. The band does not allow any poppy touch in any of five tracks that make up Part 2. Opened with a high energy \"Waterhole / Expresso Bongo\" with dazzling percussion and drumming sounds, high tone vocal, this track sets the whole tone of Part 2. You may observe how brilliant the transition between this track to the next \"Lords of the Backstage\". \"A love song with validity ..\" and \"I just wanted you to be the first one ..\" are the lyric parts that people used to emulate. They have nice melody!Hey, I bet you would say the next track \"Blind Curve\" is another really (really) wonderful track! I never imagined that human kind could create a very stunning, well structured, and nice melody musical composition as great as this track. From \"Last night you said I was cold ..\" to \"Strung out under necklace ..\" to \"Oh I remember Toronto .\"My childhood .. misplaced childhood ..\" to \"I saw a war widow .\" all are brilliant music pieces! It might require 3-page review for this track only. It's really a great track!The other two tracks are excellent also. \"I will wear your white feather / I will carry your white flag. I will swear I have no nation / But I'm proud to own my heart\" is a nice lyric of a concluding track \"White Feather\". Relating to reading a book, it seems to me that the concluding track is like the ending of the story. Brilliant work!So, what do you think? - Gatot Widayanto, Indonesia."
    },
    {
      "reviewer": "chessman",
      "date": "Posted Saturday, June 19, 2004",
      "rating": 4,
      "text": "I remember vividly when this came out, and every Marillion fan I knew went crazy over it. Well, I almost agree! It is excellent, although the first couple of times I heard it I wasn't that impressed. However, the music grew on me, and now I rate it their third best album ever, just behind Script and Clutching at Straws. The music flows nicely, and there is true atmosphere and power in each piece of music. Lyrics, as always when Fish lead the band, are superb, deep but understandable, and almost poetical. Each track has something to recommend it, although for me, ironically, the weakest track is the overrated 'Kayleigh', which is nowhere near as good as it is made out. (Strangely, an old friend of mine, who hated Marillion, actually said that was the only track of theirs he liked!) Nevertheless, I would recommend this to any prog fan."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Saturday, August 21, 2004",
      "rating": 4,
      "text": "'Safe in the sunshine....safe...' Dereck W. Dick, man we used to bash your mug in college. People with a Marillion shirt would generate 2 reactions: 1) Did this guy slept in a freezer and woke up from '85? 2) Yuck. I come from Quebec City okay? I know Marillion had their 15 minutes here. They were the first part of Rush in the Power Windows Tour. And Rush got booed when they hit the stage 'cuz people wanted more Marillion. Rush got booed! By Marillion! Good god, sometimes truth is stranger than fiction. And it's true, FM prog is not very popular. I never understood neo-prog. I want to, I honestly do. And I wouldn't mind liking it either. There is so many recommended bands in that catergorie. Sigh* Anyway, this record is great. Storytelling and lyrics are close to memorable. Fish has a knack with agencing words that sounds great together. Hey, where could you find poetry lines like pseudo silk kimono, diamonds trapped in black ice, cemetary eyes, moonwashed colored halls... In this case, Fish has talent to write great lyrics that makes ideas pop-up immediately in your cranium. I like this album. It's quite catchy and the songs stand on their feet. It's far away in quality from almost everything produced today, so it deserves an ear. I know I've been VERY mean to Marillion before and I do feel that...only idiots don't change their minds. Dereck Dick really created a world of mystery and fantastic covers and illustrations (just check the singles cover art....pure beauty). Maybe because I have a fondness for comic books, but the Marillion-art is breathtaking. We could easily make comic heroes with that. Part of the band like Iron Maiden art was. Anyway, this album for me was a gentle and very pleasent entry in the neo-prog vein. And by the way, in college, there was a boy with a Clutching at Straws cd in his Discman. He was hanging out with the gang who swore to get the head of Fish on a stick (fishstick). He was bending his head in shame while watching helpless students get laughed at for sporting a shirt of their favorite band. That quiet kid, too afraid of getting the disapprobation....was me."
    },
    {
      "reviewer": "Guillermo",
      "date": "Posted Sunday, September 5, 2004",
      "rating": 5,
      "text": "I first listened to Marillion in a FM Radio Station, in 1986. The song was \"Kayleigh\", but the version that I listened to was the live version from \"Brief Encounter\". I liked the song very much. One day in early 1987 I went to a record shop, and I found several Marillion albums, except \"Brief Enounter\", but I found \"Misplaced Childhood\". This album is Marillion`s best album with Fish, and is one of their albums that I still like to listen to. It`s an album full of great music, with many emotions in all the songs. I stopped buying Marillion`s albums after \"Holidays in Eden\", an album I don`t like. Maybe \"Misplaced Childhood\" is one of those albums ( like \"The Dark Side of the Moon\") that never sound dated. The cover is also very good. If someone who doesn`t know the band wants to buy one of Marillion`s albums, this album is the best choice."
    },
    {
      "reviewer": "Tristan Mulders",
      "date": "Posted Tuesday, September 7, 2004",
      "rating": 3,
      "text": "Marillion - Misplaced ChildhoodThis is one of those albums which are only good if you look at the whole package instead of the separate songs. Considering the songs as individual tracks I would say a maximum of 2 stars would be possible. Separately seen, there are only two songs on the album which I think are superb: that is the epicBlind Curvetrack and the moody opening songPseudo Silk Kimono; the first being a long suite with various changes in moods -varying from light and optimistic to dark and depressing- and great instrumentation. The second being a very dark and brooding song which only features layers of synthesizer sounds and Fish's distinctive vocals.If I look at Marillion's Misplaced Childhood album as a concept album instead of a collection of individual -sometimes linked- songs, I can enjoy the album a lot more. This probably has to do with the fact that all together the album tells the listener a story, a bit depressing story, but hey, it is the Fish who is writing the lyrics, so that sort of speaks for itself.His lyrics are again very poetic and dramatic, but this album shows a bit of a change regarding the complexity of his lyrics. The meaning of his words are more obvious than on the previous Script for a Jester's Tear and Fugazi albums. This is a good transition with the last Fish-era Marillion album, 1987's Clutching at Straws -that album included lyrics that were even more down to earth than those found on this album. I always felt that the albums that Marillion wrote with Fish on vocals were one big suite, starting with Script for a Jester's Tear and ending with Clutching at Straws. Displaying the somehowMisplacedlife of the Fish man. Misplaced Childhood is no exception and can really be seen as part three in this series of autobiographic pieces of art."
    },
    {
      "reviewer": "richardh",
      "date": "Posted Tuesday, February 22, 2005",
      "rating": 3,
      "text": "Somewhat overrated album.Includes Kayleigh ..the song that spawned a million little brats plus a lot of other sub prog stuff from these Genesis wannabies.Nothing wrong with wanting to be Genesis though,just pity that it had to be Eighties Pop Genesis.OK there are some good moments ,in particular Blind Curve and White Feather, but why anyone except the most ardent of Marillion fan would regard this as 'essential' is perplexing.As a pop album it would barely merit a 3 but as a prog album just forget it."
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Sunday, May 8, 2005",
      "rating": 4,
      "text": "In many ways this album is Marillion's most significant recording: \"Misplaced Childhood\" was not only their most successful album, but also the one in which the romantic essence of singer/lyricist Fish's heart met its most solid expression in musical terms: definitely, the communion between the four instrumentalists' ideas and Fish's tormented intimate imagery is 100 % cohesive in this absolute neo-prog cornerstone. Fish is no longer a singer who sometimes witnesses his surroundings and some other times looks into himself - for \"Misplaced Childhood\" he actually is what he sings about. Right from the vibrating melancholy displayed in the synth harmonies of the opener 'Pseudo-Silk Kimono' you can tell that this is going to be a sentimental journey of overwhelming proportions: this song's lyrics announce the prelude to an attempt to move over a period of infinite sadness, which means that the first step to be taken is look it straight in the eyes in order to trace back its roots and be prepared for redemption. Fish is no longer a singer who sometimes witnesses his surroundings and some other times looks into himself - he actually is what he sings about. Kelly's labour throughout the album is more subdued than in Marillion's previous two efforts, but still his keyboards are the most prominent sonic source: his orchestrations and harmonic layers (plus some occasional solos) serve as the repertoire's crucial focus around which Rothery's melodic sensitivity and Trewavas/Mosley's effective rhythmic foundation create the successive moods for all the diverse sections comprised in the album. By now, Marillion stands closer to \"The Wall\"-era Pink Floyd than Gabriel-era Genesis. 'Kayleigh' is a classic prog ballad, a sad invocation for regret and self-blame: immediately after, 'Lavender' brings the hope of wishful thinking under a nursery rhyme-meets-Elton John's guise. This other ballad is more properly a transitional passage between 'Kayleigh' and 'Bitter Suite', the first of two suites contained in \"Misplaced Childhood\". Kicking off with a psychedelic instrumental section, things start to acquire a form with the sequence of bass drum and bass that sustains the keyboard and guitar's combined layers and Fish's first opening lines; then comes a brief Latin-jazz oriented bridge, followed by two slow tempo motifs. The 2-part 'Heart of Lothian' brings some Celtic-like stuff in Rothery's guitar leads and Kelly's complementing counter-leads during the 'Wide Boy' portion: the band manages to confidently shift from 7/8 to 5/4 to 4/4 seamlessly in a fluid continuum. 'Waterhole' finds the band displaying an exotic Arabesque motif with a rocky rough edge before turning into the syncopated mood of 'Lords of the Backstage'. 'Blind Curve' is the most complex of both suites, and it should be, since it contains the crucial turning point in the lyrics. The first three slow tempo motifs continue to explore the misery and solitude of the rock star and his unhealed wounds from the past, until the mesmeric presence of a child makes our hero aware of his urgent need to recover his lost innocence in order to stop his unhealthy appetite for self-destruction ('Perimeter Walk'); this weird experience allows him to open his eyes to the world and transcend his mere individuality ('Threshold'). That's when the celebratory spirit of 'Childhoods End?' comes in: this catchy number is more than a simplistic single-oriented song (something like 'Follow You Follow Me'-meets-'Every Little Thing She Does is Magic'), it's a manifesto of hope reborn. I see the march of merry children depicted in the Celtic-oriented 'White Feather' as a sharing of the truth that our hero has discovered about the very depths of human nature - innocence is the key to our will power. This happy ending is not without drama: the emotional tension still pervades the most optimistic tracks, but again, emotional tension is what \"Misplaced Childhood\" is all about. One noticeable minus point is Fish's decreased vocal energy: his dangerous drinking habits were starting to burn out his voice - but this is not a handicap for the band's overall effort, it's just a detail that does not essentially affect Fish's capability to convey genuine emotion through his singing. Rating: 4.25 stars for this album, not as powerful as \"Fugazi\" (my fave marillion album), but still brilliant in its own terms."
    },
    {
      "reviewer": "NJprogfan",
      "date": "Posted Friday, May 27, 2005",
      "rating": 4,
      "text": "Casting aside the pop tune, 'Kayleigh', this album has a very nice flow to it. One song melds into the next flawlessly. I'm not a big fan of concept albums and Fish, in my view, is not the best singer in the world, but the man can write some deep lyrics, just don't try to understand them while listening. My only gripe with this album and Marillion as a whole is that it's Fish's vehicle and damn if it's not going to be a depressing affair. Sure, there's some upbeat numbers, especially my two favorites on the album, 'Waterhole' leading into 'Lords of The Backstage'. But, for the most part, the songs tend to have the same tempo. Guitar is in the out front with Fish, while keyboards are mainly window dressing, unlike the first two albums which have more variety musically. Still, taking it all in, the album is wonderfully produced, crystal clear and is definately a solid work. More excellent, than good, it warrants four stars. But just barely! On a side note, I saw them play this album from beginning to end when they opened up for Rush back in '85. It was more powerful live and I recall Fish's voice being exceptional. Be it as it may, a live recording of that concert would still get the same rating..."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Thursday, June 9, 2005",
      "rating": 4,
      "text": "The most accessible and accomplished of the FISH-era MARILLION albums, Misplaced Childhood's most notable achievement is the seamless integration of well-conceived musical and lyrical motifs into a seamless concept album.A first-time listener should not be put off by the undoubtedly commercial 'Kayleigh' and 'Lavender', as these short songs lend their central themes to the more progressive developments later in the album. This makes Misplaced Childhood a whole greater than the sum of its parts - FISH is, after all, an acquired taste as a vocalist, and the musicianship is not outstanding. However, MARILLION are not afraid to allow their simple, direct approach to create a soundtrack to FISH'S journey of self-discovery chronicled here.And it is this journey that lifts the album above all other 'neo-progressive' efforts. The lyrics take us through themes of lost love, ruination and despair, both personal and that of wider society, but offer us a glimmer of hope at the journey's cathartic end. To my mind this sort of journey is an important function of progressive music often overlooked by listeners and reviewers alike.The '70s influences on this record are clearly discernible, and for this MARILLION seem to attract criticism. However, this is clearly a 1980s record, with superior production values and sensibilities. MARILLION forged their own path, and it is insulting to allocate them something other than a genuine place in the history of progressive music."
    },
    {
      "reviewer": "Trotsky",
      "date": "Posted Sunday, June 12, 2005",
      "rating": 4,
      "text": "This concept album is a seamless suite (every song segues into the next) of superb songs that ostensibly depict the troubled childhood of Marillion's larger-than-life lead singer Fish. Those looking for endless bits of outstanding instrumental prog are going to be disappointed, for Misplaced Childhood is very much a singer/songwriter's prog album rooted in the 80s. It also contains enough tragedy-laced beauty to attract anyone with an open mind.The wonderful synthy opener Pseudo Silk Kimino sets the tone for this album, with guitarist Steve Rothery and keyboardist Mark Kelly laying the groundwork for Fish's powerful vocals and arguably even more powerful lyrics. It soon breaks into Marillion's definitive pop song, the glorious Kayleigh, which conjures up all sorts of images of love among the ruins of the bitter Thatcherite UK experience. The almost-as-memorable Lavender (a penny for your thoughts, my dear!), which actually had to be extended for a single release, then follows.The five part Bitter Suite is a soundscape over which Fish initially recites a poem, before a Steve Rothery solo leads into an moving description of Fish's encounter with a French prostitute (which musically echoes Lavender). Parts IV and V (Misplaced Rendeszouz and Windswept Thumb respectively) are both achingly beautiful and brief. Heart Of Lothian is one of those pieces that makes comparisons with middle-era Genesis (or rather Peter Gabriel vocals with Mike Rutherford on guitar and Tony Banks on synth ... a combination that didn't really happen, I believe!) inevitable, yet there is a delightful flavour to this majestic song that is Marillion's alone.Waterhold (Expresso Bongo) is an ultra-busy piece in which underated drummer Ian Mosley gets to shine. It segues into the relatively forgettable Lords Of The Backstage (which has one of those stuttering offbeat rhythms prog bands are obliged to churn out from time to time), but there is nothing ordinary about the epic Blind Curve. Incorporating some delicate Steve Rothery acoustic guitar moments and atmospheric Mosley drumming, this album centerpiece is one of the more emotionally gripping tunes a progger is likely to encounter, although it's worth repeating that Marillion's strongest card is Fish, and not one of the instrumental players.The mood gets so intense that it almost needs a lighter pop-rock song like Childhood's End? to lift the dense fog of desperation that is likely to descend on anyone who listens to this album properly. Childhood's End? is one of those songs that may not sound that great on its own, but has its own visceral power and purpose within the context of this album. The closer White Feather is just that ... two minutes of instrumental neo-prog to wind down a lovely work of art.This pop-prog masterpiece is surely one of the finest releases of the 80s (in fact it is Marillion's own Script For A Jester's Tear that tops it!). It should be said though that while I think Marillion was a dominant player among its contemporaries, I don't rate these guys among my top 50 prog bands. Also there's the fact that I was 12 when this album came out and that may have prompted a sentimental attachment that elevates Marillion's worth to beyond what a new listener may perceive when he or she first hears this band/album. Whatever the mitigating factors might be, I love this album. ... 71% on the MPV scale"
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Tuesday, June 14, 2005",
      "rating": 2,
      "text": "In those days of Marillion-mania I was so glad and proud that Marillion had become 'a biggie'. The tour was a massive garden party for Marillion freaks and progheads in a sheer euphoric state of mind. More than twenty years later I look back at this album a bit more objective. In fact it's a 50% good and 50% disappointing record, the balance between the musicians chemistry is disturbed. In my opinion this is caused by the too dominant role from Fish, his lyrics are drenched with the impact of his drinking habits and self-destructive behavior. \"What a waste\" once Fish sung ...."
    },
    {
      "reviewer": "Tony Fisher",
      "date": "Posted Friday, June 24, 2005",
      "rating": 4,
      "text": "Not quite as good as Fugazi, but a great album and only just short of the 5* grading. A loose concept album (are Fish's lyrics autobiographical?), it includes the excellent singles Lavender and Kayleigh. So what if they were commercial, they were fine songs; their only crime is that they offend the \"musn't sell well or it's pop\" brigade, hence some totally unjustified low ratings. This album is pure prog with fine musicianship and solid songs. The keyboard and guitar work is as strong as ever and the fine bass lines underpin the melodies, which blend seamlessly into one another. Standout tracks are Heart of Midlothian, Childhood End and White Feather but overall the material is consistent if not quite up to the standard of the first two albums. But at least they were now developing their own style rather than relying on Genesis for inspiration and that can only be good. Well worth buying."
    },
    {
      "reviewer": "kunangkunangku",
      "date": "Posted Thursday, July 21, 2005",
      "rating": 5,
      "text": "An encounter with the haunting keyboard sound at the overture of \"Pseudo Silk Kimono\" was part of my bedtime each night sometimes in 1985. It was almost like a ritual: the day was done, time to go to bed, so my friend dimmed the lights in his room, put the cassette version of this album into the tray of his compo stereo set and... that was it. I had to get through all of them because I stayed at his place for several weeks. I never look back to it with regret as it was my first fruitful introduction to Marillion, a great band to whom I've been its fan since then.To tell the truth, the keyboard sound was the magic from which I was drawn deeply into a distinctly flavored 1970s-style progressive rock opus. Then also the lyric that followed: Huddled in the safety of pseudo silk kimono/ wearing bracelets of smoke, naked of understanding...I was so amazed by the beautiful sound came out from the speakers. The music flowed seamlessly, and expressively moving. Catchy melodies -- and eloquently guitar playing that reminded me of Genesis guitarist Steve Hackett -- spread across almost every songs, telling a personal story about childhood experiences and self-confessed of rock star-type indulgences.When I finally bought my own copy shortly afterward, also a cassette version, and had time to listen to it myself, I grew completely sure I wasn't wrong with my first impression. And I am not make any mistake indeed as I always find new experiences and nuances each time I listen to it. Even nowadays, when I already got the CD version from a sale at a record store in Singapore.This album is a masterpiece."
    },
    {
      "reviewer": "The Crow",
      "date": "Posted Wednesday, August 31, 2005",
      "rating": 5,
      "text": "This is the best Marillion's album with Fish, and one of the band's highlights. And this is the best Neo-Progressive album from the 80's that I've heard...Every song of this third Marillion's release is great, with a pop feeling that make this album a bit commercial, but it isn't bad in my opinion. Kayleigh, Lavender, Childhood's End?, White Feather... are songs very enjoyable by any kind of people, while others like Bitter Suite and Blind Curve are wonderful pieces for prog-lovers. The job by the musicians (except the awful Ian Mosley) is wonderful, specially the Steve Rothery's guitars, and the Fish's lyrics are marvellous, while he sings very much better than the two previous albums. He made a great and very personal work here, and it's hard for me to say that, because I clearly prefer Marillion with Steve Hogarth...Recommended for people who want to hear the best progressive made in the 80's."
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Tuesday, October 18, 2005",
      "rating": 5,
      "text": "After the stellar brilliant debut Script for a Jester's Tear and the sophomore slump of Fugazi, Marillion returned to the studio and created their first concept album. Vocalist/lyricist Fish draws from personal experience and weaves his words with images that simply stun the listener. Musically, the entire group supplies top notch performances. Rothery shines with his David Gilmour-esque guitar solos and his Alex Lifeson-esque riffs. Pete Trewavas supplys thumping and powerful bass while keeping in perfect rhythm with Ian Mosely, who supplys top notch beats and keeps the rhythm while the rest of the band goes off on and creates colorful sounds. Mark Kelly is the real musical hero of this album, creating many moods and textures with his caravan of synths. But the true star of this album is Fish, who captivates and articulates his emotions with beautiful words and emotional vocals.From the opening synths of Pseudo Silk Kimono to the fade out chorus of White Feather, the listener is taken on a journey that tackles love, loss, despair, and triumph. The highlight tracks are Bitter Suite, which is a suite tackled within a 5 minute mainframe, Heart of Lothian, with a thumping chorus that is catchy and mesmerizing, Blind Curve, which features a stunning Rothery guitar breakdown, and the resiliant Childhood's End, which features a standout performance from Pete Trewavas. All of these songs feature brilliant choruses, stellar riffs, and mesmerizing vocals.Overall, this is one of the jewels of the Marillion crown, no fan of the group should go without it. Neo-Prog doesn't get much better than this. Arguably one of the best in it's genre, Misplaced Childhood is a masterpiece of progressive music that no one should go without listening at least once. 5/5."
    },
    {
      "reviewer": "Raff",
      "date": "Posted Saturday, November 12, 2005",
      "rating": 2,
      "text": "I'm probably going to make a few enemies with this review, but I just can't help saying that, in my humble opinion, \"Misplaced Childhood\" is one of the most overrated albums in prog. I've tried to get into it countless times, but now I've just got to admit that it bores me to tears. OK, it's well played and Fish's lyrics are as usually quite interesting - but to me it will never rank as high as other prog masterpieces. While Marillion's first album was without any doubt one of the best things to come out of the '80s (in spite of the strong Genesis influences which somewhat undermined its originality), their third is really nothing special at all. Two catchy pop songs (\"Kayleigh\" is not bad, but not very progressive either), and then a ton of lead. I found it such heavy going that I can hardly remember the titles of the songs, with the exception of the above-mentioned two hits.After this album I practically stopped listening to Marillion, though I've been planning to catch up with their Hogarth-era production. I'm really sorry to destroy what to many people is a myth, but this pompous, pretentious, uninspiring album was really a big disappointment."
    },
    {
      "reviewer": "sleeper",
      "date": "Posted Monday, May 22, 2006",
      "rating": 5,
      "text": "Misplaced Childhood was supposed to be the album that flew in the face of everything that the record company (EMI) wanted Marillion to be (a more predictable and boring pop band was what they were after) by being one big song. In the end we got an album that is effectively 2 pieces of continuous music and the record company got the hit single and fast selling album, so every body was happy.The album starts with the very spooky Pseudo Silk Kimono witch effectively maps out the album's theme for you in just 2 minutes. However once their done sending shivers down your spine they segue into what is probably progs most poppy song that is still undeniably prog, Kayleigh. It was also the song that made them stars to the general public but more importantly it showed that this was not going to retrace the steps of either Script for a Jesters Tear or Fugazi.Indeed, the album is punctuated by short, clever blasts such as Lavender, witch continues the story after Kayleigh, around the 2 centre pieces, Bitter Suite and Blind Curve. Its these 2 songs that really make Misplaced Childhood as good as it is. Bitter Suite continues the theme of lost love and dreams wonderfully, whilst Blind Curve shows the pitfalls and trappings that can bring one down in the pursuit of that dream as you get closer to attaining it.The album finishes off by first accepting all that has come before it and then giving the most feel good ending to a song since Genesis' Suppers ready (yes I know its another Genesis reference but this ones deserved).Musically all members are firing on all cylinders in this album but overall it does lack that final spark that was so evident on Script for a Jesters Tear and Fugazi. Perhaps Fish getting over his paranoia and insecurities was good for him but he did write some amazing songs with them and that last edge went with them.Overall this is better than Fugazi but just lacks that last bit of magic to beat Script for a Jester Tear. It's still a masterpiece though and should not be turned down for anything."
    },
    {
      "reviewer": "ClemofNazareth",
      "date": "Posted Tuesday, June 13, 2006",
      "rating": 5,
      "text": "I am an engineering project manager by trade, and the one thing that keeps me going when the stress and the long hours and the difficult decisions of creating something new bear down like the weight of the world, is the prospect of that ever-so-rare moment when someone stands in front of something you and your team have built and says – “Wow”. That almost never happens, but a couple times over the years it has, and the feeling that fills over your mind and washes over your soul is more powerful then the most potent drug that money can buy. It validates everything you have worked for, every pain you’ve gone through to get to that point. It’s the working man’s equivalent of a professional orgasm.The perfect album is like that too. It’s like hot, wet dirty raw animal sex, only without the cigarette afterwards. Seriously. Almost never happens, but we keep buying them and playing them and reading about them and hoping that just every so often, even just once, we will lay that vinyl on the rubber mat or slide the disc into the tray or close the lid of the tape player – and our world will change forever. If you’ve ever felt that, you know exactly what I mean. If you haven’t, oh man – you have one intense, soul-freeing moment ahead of you when it finally happens. If you’re not sure, then it hasn’t happened – once you have ever felt that, then there is no doubt.So yes – this is one of those albums for me, no doubt about it. I still have the original vinyl release that I bought in the summer of 1985, and I still play it. With a wife and kids and cats and a job and responsibilities and distractions it doesn’t happen all that often any more. But every once and a while the kids are busy being kids, the wife is shopping, and the cats are chasing mice or whatever it is that cats do. And sometimes, on those rare occasions, I lay out the vinyl and drop the needle - and I just disappear. Magic!This album came out during what was supposed to be the summer after my final year of college. I hadn’t graduated though – not enough money to take classes, not enough hope or energy to keep trying. I had a girlfriend at the time too; well, to be more precise, I had an infatuation at the time, and I used to meet her in the student lobby every day and bring her a single white rose, then just sit and look at her in the afternoon shade while she read her books. I’m not sure she completely realized I existed, let alone that I was hopelessly smitten with the idea of being in love with her. We hung out some and I imagined that it was more than it was, but one day while driving home from dinner she informed me that she was a lesbian and was moving away to be with another woman. Well, it’s not like I hadn’t heard that excuse before, but it turns out that this time, with this girl, it was actually true. Open chest, shred heart. Lost my job too, something about not wanting people around who smoked too much pot and weren’t very reliable, blah blah – not really sure of the details, I wasn’t actually listening at the time. So I wandered down to the mall and joined the Marine Corps, basically just to reaffirm my manhood and all. Seems kind of drastic now in retrospect. There’s a point to this story if you’ll bear with me.Anyway, at the mall I also shelled out ten bucks that I couldn’t afford for this album. Great cover, really clean, sharp airbrush of some kid in a military-school getup holding a parrot, or bluebird, or magpie – whatever. I knew who these guys were, since I had had a similar pivotal moment a couple years prior while listening to ‘Script for a Jester’s Tear’. So I pretty much expected to be lifted up and blown away. High hopes – can’t blame a guy for thinking positive.Well, blown away I was. Repeatedly. Totally. Hopelessly.It’s possible that considering my state of mind and of my personal affairs and of the fact that I had apparently just signed myself up to be shipped off sans hair and trained to kill people I didn’t even know, well – in that specific state of mind, it wouldn’t have surprised me if a Wham! album or a cloudy day or a stain on my shirt would have blown me away. Seriously though, any of those things just might have, but certainly wouldn’t have had the same staying power this turned out to have. And anyway, I eventually crawled out of that fetid hovel of a sh!thole I had dug for myself and managed to piece together a pretty decent life (remember, the wife and kids and cats and fulfilling career – that whole thing).But still, twenty years later and worlds away from that life, I still find my way into that place that Fish and company introduced me to in that other place and time, and it still leaves me breathless.The very first strains of Mark Kelly’s eerie and seductive keyboards mark the signal for the beginning of this now-familiar journey. Fish has said in later interviews that the album concept was inspired by a day-long acid trip, and the supernatural tones and his whispered murmurs evoke that feeling just moments into the listen. Memories of darker days come screaming back into my consciousness like a demon across a dark room as Fish morbidly echoes wretched emotions and base hopeless regret amid the funeral procession of sound of “Pseudo Silk Kimono”:“Nicotine smears, long, long dried tears, invisible tears; safe in my own words, learning from my own words –Cruel joke, cruel joke”and then viciously skewers my raw wounds while stepping seamlessly into a pitiable reminiscence of love gone sour with “Kayleigh”. Steve Rothery could have convinced me to shave my head and sell trinkets in airports had he been inclined to after hearing the supernatural sounds that emanated from his guitar strings on this song. Maybe this became a hit and earned contempt among the musical snobbery, but to me he was providing an exquisite backdrop to the story of the love I never actually had, but that I had managed to lose anyway:“Do you remember barefoot on the lawn with shooting stars; do you remember loving on the floor in Belsize Park. Do you remember dancing in stilettos in the snow…”well, I didn’t remember any of those things, since none of them had actually happened. But it could have been, right? This could be my story, couldn’t it? Much more poignant than the reality, for sure. Doesn’t matter anyway, since this world in my mind is where I am at the moment, and those things happened in here.Still we are traveling back in time together – Fish, Marillion, my thoughts and me, and the next scene is a bit closer to my reality of those childhood days before all this sh!t went so horribly wrong, when children’s songs and prancing through the park and gazing at rainbows still held my imagination, and when a warm breeze and a fleeting laugh was enough to cap a beautiful and memorable day; when “Lavender” was the color of the flowers and of the ribbons and of the dress of the little girl who was sharing this childhood moment in the park with me:“Lavender’s blue, dilly dilly, lavender’s green; when I am King, dilly dilly, you will be Queen.A penny for your thoughts my dear, a penny for your thoughts my dear; I.O.U. for your love, I.O.U. for your love”.But this childhood dream, like the childhood is represents, is chased away by the growing shadows of time, and I wake to find myself back in the now. A dank, dark street fills my view, all strewn with trash and filth and broken dreams; and inhabited by others of the walking wounded who are also seeking a moment, or even just a touch, or just a diversion to distract the reality of what is, and the terrible weight of what cannot be undone. We have arrived at the crossing to the quagmire, the “Bitter Suite”:“It's getting late, for scribbling and scratching on the paper; something's gonna give under this pressure. And the cracks are already beginning to show –It's too late”.This is too much reality now – its time for another flashback to somewhere else. The next offering from my muse, the boys in the band, comes in the form of the celebration and angst that fills the “Heart of Lothian”:“'Cos you look like an actor in a movie shot; but you're feeling like a wino in a parking lot - how did I get in here anyway?Do we really need a playback of the show?”Now, it doesn’t make a bit of difference to me that I have never even been to England, or Scotland, or wherever the hell ‘Lothian’ is. To me, it is a place where everything is okay, and the people in the crowd raise their glasses and call my name, the mood is light and the music is sweet, and the darkness envelopes but cannot consume. I have my member’s pass, and I belong here.And then a slightly insane Scotsman issues forth a call that pierces the night and turns like a spirit into the rallying cry of the damned:“I was bor-ororororororororororororororororrororn, with the heart of Lothian!”F**kin’-A right!!What were we talking about?My new friends and I down another round and shout our rallying cries in the “Waterhole”. The night passes, the streets are empty, the band plays on – and we down another round.Of course, with the battery on my psyche and the world’s weight continuing to beat me down and the drinks clouding my mind that wasn’t too clear to begin with, that demon of distress and dire dread begins to consume my brain, and once again I regret:“a lifestyle with no simplicities; but I'm not asking for your sympathy.Talk, we never could talk, distanced by all that was between us. A lord of the backstage, a creature of language –I'm so far out and I'm too far in”.I stagger from the pub and into the waiting black sedan, and as we pull away from the curb the landscape begins to change. Now the focus is not on me. Now I’m on the outside, and looking in. Now this other wretched soul who’s been tracking my shadow as I wander the streets in search of the light, he is speaking now – and the venom flies out of his mouth. We careen around a blind curve, out of control and flying wildly into the night. I grab for a handhold, and refill our glasses while he spews forth more hate, more disgust, more of his melodic dirge. And I am captivated by the sound. His eyes pierce me and open into a world of black abyss. Nothing moves in that chasm as we both black out.In the morning I drag my destitute self to the window, expecting once again to peer out on the cataclysm that is my world. But the rainbow has returned, and the magpie flies across my field of vision, and I know this is a sign. Something has changed. The despair of that reality can keep its grip on me no longer; the darkness cannot hide my destiny, I realize - can it?“Now you realize that you've got to get out of here. You've found the leading light of destiny, burning in the ashes of your memory.You want to change the world, you'd resigned yourself to die a broken rebel.But that was looking backward - now you've found the light”.Sure, why not? Slowly but with no pause I raise a white feather – it could be a white flag; and I surrender not to fate, but rather to destiny, and the difference is clear:“These are our hearts - you can't take away our hearts. You can't steal our hearts away;I can't walk away - no more”.Okay, it’s just an album, not a religion or anything. But here’s my point – so what?!We listen to music for the same reason we look at art, for the same reason we crave the touch of another human spirit, for the same reason we choose to breathe and go on every day no matter what the pain or trials. Because the beauty and the intensity of the experience acknowledges and validates our pains, our longings, our passion; and that validation gives us hope.And that’s enough.peace"
    },
    {
      "reviewer": "imoeng",
      "date": "Posted Friday, June 16, 2006",
      "rating": 5,
      "text": "Misplaced ChildhoodBrilliant, a truly masterpieceWell I'm not going to pretend, this is my first Marillion's album and I just bought it two weeks ago. There are lots of story behind it (buying the CD) actually, firstly, a friend of mine, Gatot is his name, which is a member here : ) always talk about Marillion's Misplaced Childhood. Moreover, his picture on progarchives is this album's CD cover. This really makes me think that the album is reaaaaaaaly good, possibly too good. Another thing is that when I listened to a song from Misplaced Childhood on this site, Childhood. Ends ?. It was when I realized how great is this album (well, at that time, just a song actually) and also because its somewhat similar to Dream Theater's Take Away My Pain.Alright, back to the album. Based on my research, this album is Marillion's most successful album, very commercial if you would like to say that. It was released in 1985, but the one that I bought was the remastered edition, in 2002, but I'm pretty sure the songs have no different whatsoever. This album was also Marillion's first concept album, the story was about a lost love and childhood. Also, just like many other prog albums, the cover is really great, just like the one on progarchives, but there is another side, so its just a half of the cover. Now lets go through each song.Pseudo Silk Kimono - \"Huddled in the safety of a pseudo silk kimono wearing bracelets of smoke, naked of understanding.\", that is the first line of the song. The intro is really calming and peaceful with deep bass line. For me, this song is just the beginning of the long epic, the album itself which is considered as a long song.Kayleigh - Just a short story. When I listened this song for the first time, I didn't realize that this song is ultimately famous, until the \"do you remember.\" I felt so, I don't know, so strange, because my dad always play this song and sang loudly in the car. Well at that time, I wasn't into progrock, so I just closed my ears. Again, I researched about this song, and I know that Kayleigh, well, it was Kay Lee actually, whose dated with Fish. Also, if you look at the lyrics, the song is more about love breaking. The song starts off with the same style from Pseudo Silk Kimono, but this time, its more \"groovy\" with nice bass guitar and drum combination. The composition is just like a typical song, verse, chorus then verse followed by another chorus.Lavender - Ahh, I really love this song but its hard to choose which one is my favorite, simply because all the songs, without exception, are extremely great. \"I was walking in the park dreaming of a spark.\" with a calm piano sound and cool drum line. When it hits the chorus, the mood increases but somewhat the song still, like, calms the heart (well, calms my heart). Also, the guitar solo is quite simple, yet profound, really suits the song.Bitter Suite - Sorry about this, but somehow I like to relate certain songs to Dream Theater songs : ) This one is really like Dream Theater's Trial Of Tears with cool drum lines and nice ambience at the beginning of the song. The song itself was divided into five. The first part is just a non-melodic vocal, if you know what I mean, that Fish was like just read the lyrics. The best part for me is Blue Angle, where the piano and guitar lines really great along with cool bass and drum and I reckon is the most melodic and touching part of the song. \"I can hear your heart, hear your heart.\", really great that I feel like in my own heaven. This part ends with a melody like the one in Dream Theater's Octavarium (sorry again!!).Heart Of Lothian - The intro is just amazing, really great yet very progressive. You can tell from the drum beat and guitar melody along \"wide boys, wide boys, wide boys, born with hearts of Lothian.\" The next verse was played along with nice guitar melody and deep drum lines. The climax of the song, for me is at the end of the first part, Wide Boy, \"I was born with the heart of Lothian.\". While the second part is somewhat very calm and quite with a nice ambience from the keyboardWaterhole - The song is very dynamic and very rockish. One thing is that, the second verse or maybe you consider this as the chorus, really surprised me, \". when you think its time to go, don't be surprised, .\" they way that he sang that line is just very \"progressive\". The last 4 second of the song, the guitar melody and beat changes, possibly for the intro of the next song.Lords Of Backstage - This is also a song that Om Gatot (well I called him like that) always talk about, its the \"I just want you to be the first one.\" part. The song is somewhat very short and is the introduction of the next song. The duration of the song is just nearly two minutes.Blind Curve - ARHH!! This album really means everything to me, since probably this is the most beautiful album I've had so far (well, one of the most beautiful). Right now, I'm listening to the album and this song really is the, uh, I don't know, its like the point of all. The intro is just amazing, cool but has very deep feeling. At the second minute, the which is the third part, the song composition is just great, very amazing, again, simple yet profound with very good vocal style. \"So I talked about conscience and I talked about pain, and he looked out the window and it started to rain.\", simply amazing. Again, I want to compare this to Octavarium, that the fourth part, is somewhat like Octavarium's fourth part (I just realized that it's the same part!!). The vocal style is like reading a poem, without any melodic with dark and deep drum line. Slowly, the energy increases, \". the childhood, the childhood, the childhood, oh please give it back to me.\" then the music \"breaks\" and the mood really goes up, AMAZING!! The last part is just as amazing as the other parts, really beautiful. The last guitar solo is very great, simple but great, very touching and followed by the next song.Childhoods End ? - Yet, my favorite (well its not my \"real favorite\", I just often play this song in the toilet every hour when I'm at school) song. The song starts off with cool muted guitar line and groovy drum and keyboard. The best part is the bass lines, which very jazzy groovy, well, very neo-progressive, that every I played this song using my IPod, I always push the earphone deep to my ears so I can hear the bass lines. There are two different guitar sound, distortion and nice \"funk\" clean style. Again,, when I compared to Dream Theater, this song is really similar to Take Away My Pain, and the guitar part is the main similarity.White Feather - A really great song to ends the album, really energetic and dynamic. In my opinion, the song should ends in with fixed ending, not faded out. However, I still couldn't find the relation between the story and this song since this song is more like some unity stuff.Well, in the end, what more can I say. This is my first Marillion's album, first neo- progressive, and someone introduced this album to me. But I never felt like this, I never enjoyed such an album although I just bought it few hours before I started to love the songs. Without any hesitation, five giant stars.Keep On Proggin' In The Free World!!!"
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Thursday, March 29, 2007",
      "rating": 5,
      "text": "Worthy of its praise, \"Misplaced Childhood\" really ushers Marillion into the limelight and leaders of their fleeting progressive movement. Playing better here than ever before, the band has composed a tremendous and sweeping album with many dynamic movements of varied tones and melody. As exceptional are Fish's poetic lyrics and storytelling ability, and whose voice is more beautiful here than on previous efforts (although he still sounds goofy during the really dramatic parts).The one-two punch of \"Kayleigh\" and \"Lavender\" will always hold a spot in fan's hearts, but later songs are almost as good, with \"Heart of Lothian\" delivering an intensity not found since \"Script for a Jester's Tear\".All in all a perfect example of the '80's progressive sound and a perfect addition to any art lover's library.Songwriting: 5 Instrumental Performances: 4 Lyrics/Vocals: 4 Style/Emotion/Replay: 5"
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Friday, May 4, 2007",
      "rating": 4,
      "text": "After the disappointing \"Fugazzi\" (even the band will admit this), Marillion is going to deliver a far much better album. A concept one. I think it is necessary to put things again into perspective here. Prog rock was a dying genre in these days.Just think about the crap that the giants were producing around this period : Yes, Genesis, Tull, Crimson etc. It is quite remarkable that a band was able to dinamize the genre again and be very popular on stage at the same time.This is another good reason to be thankful to Marillion and never forget their great value.This album was my first contact with the band, many, many years after its release (2001 to be precise). The first spins I gave to it were pleasant, but I was not submerged by admiration, I should say. I rediscovered it three years later when I entered in my Marillion-mania mostly born out of \"The script\". I bought a great deal of the Marillion discography, and I must say that \"Misplaced Childhood\" grew significantly in my scale of musical value then.I purchased their first eight albums in the double-CD format with lots of valuable bonus tracks for each of them. At that time, they were all very reasonably priced (around 13 ? or so). This album is no exception to the rule. The second CD will feature the whole of \"Misplaced\" as the band has recorded just before flying to Berlin at the famous Hansa studio (where Bowie recorded \"Heroes\"). It is very interesting to listen to earlier version of each track and find out how close to the final product they were although the track sequence was not yet finalized.The genesis (no play on words here) of the album came out the destructed mind of Fish. As he will outlined in the superb booklet that goes together with this double CD version. At this time of his career he was seriously addicted to alcohol.He will describe this period as such : \"I'd been paying the price. My big on / off relationship had finally bit the dust, left behind in a haze of exhaust fumes as I careered off in search of my elusive grail. I was off balance and quickly lost in a depraved wilderness in which I soon made a home.The touring lifestyle fed my addictions on every level and when the bus dropped me off at my newly acquired house in Albert Street, Aylebury I found myself very alone and dislocated from all the distractions that had fed my desire to escape commitments, responsibilities and realities. I was faced with long periods of quite empty days and very dark nights\".Then, Fish will enter his acid trip which he described as such : \"An enveloppe arrived. Inside there was a short letter from an old girlfriend with the recommendations to digest the accompanying contents - a tab of very strong acid\". He will only swallow half of it but due to euphoria, he will get the second one a few hours later. Then he will get on his bike and head for Steve's house...Steve had to drive him back and lock him. Fish will describe that night as a : \"long white-knuckle roller-coaster of a night\".It was in this state of \"mind\" that Fish will : \"scribble my lyrics in my lyric book on the off chance of catching something from the trip\". And \"Misplaced\" was born.Marillion took it on tour in the late 1984 (the first half of it). As Fish will humoristically mention (and he has a great sense of humour) on a boot recorded at the Hammersmith Odeon on December 14, 1984 : \"We are now going to play a part of the album that will come up in May/June of next year. It is made of two tracks called : side one and side two ! At that time, their record company, although pleased with the development of \"Misplaced\" was rather nervous to release a concept album with no singles to be aired. In 1985, it was not really common. But the band knew that two singles would come out : \"Kayleigh\" and \"Lavander\".So, this was the hectic genesis of \"Misplaced\". Apparently, the recording sessions were on par. Steve tells us : \"We had a lot of fun in the three months we worked in Berlin but I think we all probably aged at least three years during our time there\" !Pete adds : \"It was also the very first time that we had money to spend and the time to spend it\" !But, again, Fish describes these sessions with lots of details: \"To give you a tantalising taste of the debauchery, I could mention the bedside phone book at the hotel with lists of escort agencies dealing in home delivery of beautiful women who took care of most of my weekly wages and left me resorting to banging on band members'doors at 4 AM looking for loans\" !A few others epic moments such as : \"stripping off naked in a restaurant for a bet, having a bottle of Jack Daniel's with the band name on it in my favourite brothel, throwing bricks over the Wall trying to set land mines off, deliberately taking out EMI executives with huge quantities of alcohol and sleeping through playbacks so they'd give us good reports when back home, my first and last heroin experience etc. etc.\".Sex and drugs and rock'n'roll, are very good indeed...(Ian Dury, RIP). Although the other members are less explicit about their own behaviour, these three months must have been quite a fun...Although this album is a very good one, I can hardly rank it at the level of a masterpiece. Actually, I have rated very few to this level (TIAB being one exception). This album is really Fish's one. He will play it in its entirety for the twenty years anniversary of its release. I attended one of his concert in April 2006 and I must say that it was a very emotional moment. To hear this excellent work as well as to see Fish on stage. He is a great entertainer and a born showman. It is amazing to hear such a voice coming out such a strong body.There will be some very good moments but too few of a powerful caliber like one could hear in \"The Script\". Very poppish and melodious singles of course with \"Kayleigh\" and \"Lavender\". I quite like the intro as well as \"Childhoods End\". There is also a wink at another great concept album during the very end of \"Bitter Suite\". One can hear Fish singing \"Reing On Me\" which can be heard on \"Love, Reign On Me\" from Quadrophenia (The Who).The double CD version is of great added value, and you should not hesitate to get it if still available at a reasonable price. Four stars."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Sunday, May 20, 2007",
      "rating": 5,
      "text": "The first time I heard this album I knew I had purchased something very special.There is a lot of emotion in this recording or is it just that this record pushes my emotional buttons ? I don't know, but it's that element of the music that pushes it up to a five star record for me.\"Pseudo Silk Kimono\" is a short song with fragile vocals and synths that create a melancholic mood. \"Kayleigh\" reached number two on the UK charts and is a song about one of FISH's ex girlfriends. I have read comments from several young women who were named Kaykeigh after this song. \"Do you remember...\" I love these lines and this song. Rothery treats us to a tasteful guitar solo as well. \"Lavender\" features some beautiful piano melodies in this uplifting song that ends with a great guitar solo. \"Bitter Suite\" has many mood shifts and the intro is very atmospheric with some great drumming. A monologue comes in followed by some reserved yet at the same time theatrical vocals. I like the guitar melody that comes in.The piano/vocal melody brings GENESIS to mind later in the song.\"Heart Of Lothian\" is more uptempo with some uplifting guitar that soars. \"Waterhole (expresso bongo)\" has some more fantastic guitar from Rothery as well as some good synth work from Kelly. The bongos are a nice touch. \"Lords Of The Backstage\" features some outstanding vocals and drumming. \"Blind Curve\" is perhaps my favourite.The Gilmour like guitar is impressive 2 minutes in. Fish's vocals are amazing ! This song is atmospheric and emotional for me. What an exhilarating ending with dramatic vocals and soaring guitar. \"Childhood's End ?\" is a song that makes me feel so good. I love the way it ends. \"White Feather\" is a positive and upbeat tune, and is lyrically a perfect way to end this record.I think this is MARILLION's best album."
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Monday, June 11, 2007",
      "rating": 5,
      "text": "MARILLION at it's best....one of the bands that kept the spirit of prog alive in the 80s.Holy cow, what an album Marillion made way back in 1985, i can't describe in words such a masterpiece, with all that i will try to write some lines for this album. \"Misplaced Childhood\" really ushers Marillion into the limelight and leaders of their fleeting progressive movement. Playing better here than ever before, the band has composed a tremendous and sweeping album with many dynamic movements of varied tones and melody.The music is magic and Steve Rothery's guitar is full of emotion and Mark Kelly�s work in keyboards is superb accompanied by the rich, genius poetic lyrics of Fish. The whole album is beyond simple music, all tracks are divine, so i can't choose one track to be the best, all are super and smooth. Overall, this is one of the jewels of prog music, no one should go without it. Neo- Prog doesn't get much better than this. Arguably one of the best in it's genre, Misplaced Childhood is a masterpiece of progressive music that no one should go without listening at least once. 5 stars, a must for everyone."
    },
    {
      "reviewer": "Prog-jester",
      "date": "Posted Friday, August 3, 2007",
      "rating": 5,
      "text": "The album for a HeartThis record is phenomenally captures the spirit of that time. Cold War, Berlin Wall, parents and children, cheap drugs and life on the road…In times of Italian disco and hair pop-metal MARILLION managed to get a Grammy for this album; “Kayleigh” was №2 in the charts, and “Lavender” was №5. Stop telling me you don’t care for popularity – every Prog band has a wet dream of becoming a bit more popular, a BIT more, I’m telling you!I won’t even dare to describe songs or tell anything about the story Fish is telling. If you still didn’t listen to this album, it is really a shame. There are albums, that are Musts for every Prog-fan, and MARILLION’s “Misplaced Childhood” stands in Top-20 for sure as the best Neo-Prog concept album ever written. Turn your head off, please. Let the music speak. Yes, “Waterhole” and “Lords…” are a bit lame and they’d better throw “Freaks” instead of these two. Yes, “Kayleigh” is a pure pop song. Yes, all songs are rather short. SO WHAT??? Turn your heart on, buddy, and listen to the album precisely. Just check out how Rothery plays “Heart of Lothian” and “Lavender” solos – so mellow, so sincere, so touching! Get the videos from that era – aren’t they wonderful despite their amateur attitude? Listen to Fish’s climax in “Blind Curve” – don’t you feel yourself filled with anger too? F&%#ing politicians, they think they know how to change the world! And these songs of social anger are still actual, and this is sad.I know people, who hate Prog but adore this album. It has something unique, something that wasn’t present even on the perfect “Script…” and on a cold and biting “Fugazi” records. I simply cannot believe someone hates this album or calculates the number of complex signatures used or something. Turn you head off, folks, I insist. Be proud to own your heart. Thank you, Fish and guys, for my NON-misplaced childhood. I love your stuff :)"
    },
    {
      "reviewer": "obiter",
      "date": "Posted Saturday, August 25, 2007",
      "rating": 2,
      "text": "OK, this is where I thought Marillion went a bit pop on it.Lavender ... oh please don't do this to me. Should be a theme tune to a children's TV programme. Kayliegh: hideous pop number. No that's wrong: great pop number: inane song. What happened with this album? We had the sublime Script the magnificent Fugazi: why this inane pop??? Well I supose it sold more units and made the band more money.Marillion baffle me: it's like the Tragically Hip: Road Apples (wow), Fully Completely (awesome) Trouble at the hen house (where's the toilet?).it's obvious that many people loved this album: well hey some people like Beaujolais ...."
    },
    {
      "reviewer": "progaardvark",
      "date": "Posted Wednesday, September 19, 2007",
      "rating": 3,
      "text": "Many consider Misplaced Childhood as Marillion's crowning achievement and a masterpiece. For some reason, Misplaced Childhood just doesn't do the same thing for me. Maybe I'm just a goofball, but it doesn't come close to their debut Script for a Jester's Tear and I don't even find it to be at a level of quality similar to Fugazi. For me, Misplaced Childhood doesn't develop into anything interesting musically as it chiefly seems to focus more on lyrics than composition. Also, the concept doesn't seem to really interest me and often seems vague and wandering. I find that the production seems more flat than on previous albums and it is quite obvious that the songs are more commercial sounding (in fact Kayleigh and Lavender did very well on the singles charts in the U.K.).Even though I don't think this album is as good as previous albums, it's still a good and mostly enjoyable listen. For me, it's the entire \"side two\" set of songs (tracks 6-10) that I enjoy the most. On side 1, I like Lavender the best, which sort of reminds me of the type of song Fish would perform on his future solo albums (Kayleigh is also a precursor of Fish's solo style). Not a bad album, but far from a masterpiece to my ears. Good, but not essential. Three stars."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Thursday, October 4, 2007",
      "rating": 3,
      "text": "Many of the characteristics of classic albums can be found in Misplaced Childhood, including some very catchy melodies, recurring themes, solid transitions between songs, and a somewhat unifying concept. On the other hand, this album also has many of the notable flaws that plague so many 80s albums, from cheesy synths, overly simplistic songs and rhythms, and very little interesting musical (to say nothing of virtuosic) contributions from the individual musicians. If Fish was \"safe in the sunshine\", so is Marillion with this album, taking few risks and in so doing making few notable contributions. I understand that Marillion made a positive historical contribution to prog with their debut, but Misplaced Childhood represents some regression in my opinion.Pseudo Silk Kimono, Kayleigh. This is not a great start, from the simplistic synth opener (painfully magnifying Fish's vocal limitations), to the catchy yet poppy Kayleigh (at least this one has a nice guitar break and Fish sounds much better).Lavender, Bitter Suite, Waterhole, Lords of the Backstage. In a word, boring. The first two have many slow parts, failing to develop quickly enough to hold my interest, and the latter two are too short to really make an impact. After enough time, I usually just blow past these tunes.Heart of Lothian, Blind Curve. Here the music really picks up. Heart of Lothian is a great song, don't get me wrong, but Genesis comparisons are hugely overstated. It starts out in 7/4 time, then moves to 5/4, with great guitar and synth interplay for a killer intro, but then settles into a simple 4/4 groove for the rest of the song. So there's the one minute of really inspired prog on this album for me. Blind Curve is the extended piece (nearly 10 minutes) and sounds like the closest song resembling Script for a Jester's Tear on the album. If the album was dragging for you to this point (as it was for me), here is where things really pick up in emotion and quality, leading to a great finale.Childhood's End?, White Feather. These are basically two well-transitioned songs that make for an EXCELLENT close to the album. Great powerful (yet melodic) singning by Fish, coupled with some great melodies and tasteful synth playing, really ends this album on a high note.In sum, I like the second half much more than the first, though there is nothing awful or truly spectacular throughout. I see this as one of many solid, yet flawed albums, and three stars seems appropriate."
    },
    {
      "reviewer": "Fight Club",
      "date": "Posted Tuesday, October 9, 2007",
      "rating": 5,
      "text": "Wow! What an album! This was Marillion's third album and one of the best they have ever produced. It also seems to be a favorite among fans of the Fish-era Marillion. This album is proof that not all the classic prog albums were made in just the 70s. Here we have Marillion who in my opinion, might be the best band the 80s has seen.The great thing about this album is does it not only have great musical structure, but a great story to go along with it. A lot of people may be able to relate to it, Fish's story about childhood girlfriends, breakups, etc. Yes I know it sounds like it'd probably be boring and cliche, but trust me it's not. It's quite an imaginative story and really engages the listener.Now if you're not familiar with Marillion, I definately recommend this album to start with. However, modern rock fans might be more into the Hogarth-era Marillion. This is definately a prog classic, however it also extremely appealing to fans of standard rock and pop music (my mother is complimenting it right now as I listen to it). The songs are very catchy with a clear 80s sound. Lots of synth textures, grandiose guitar solos, etc. It makes a beautiful and unique sound that only Marillion seems to have perfected over the countless imitators.There are not really any standout tracks here, as the album is meant to be listened to as a whole. They trick the listener very well as the songs transition seamlessly from one to another. I didn't even realize I was on the 5th track right now! So those looking for a movie-like experience will find it in this album. Those looking for a collection of hits may be disappointed.Now this album is heavily influenced by Peter Gabriel era Genesis. Fish's vocals are very reminiscent of Gabriel's, but a little deeper. Don't fear that they are Genesis clones though. They are influenced but create a unique sound of their own that evolved into the neo-prog genre. Overall, I think this album is very successful and a fantastic piece of work. Especially considering the amount of trash that was put out during the 80s. Highly recommended!"
    },
    {
      "reviewer": "progrules",
      "date": "Posted Friday, October 19, 2007",
      "rating": 4,
      "text": "Back in the eighties when there was a lack of interesting progbands (unlike nowadays !) you were pleased very easily and this was the case when I found out about this album by Marillion. I thought it was a sensation, there was not going to be any better around for a long time. If I would have reviewed it back then I would have given it 5 stars, no doubt. But we are almost a quarter of a century further in time (how it flies !), many many progalbums have come along that are equal or even (far) better than Misplaced Childhood and so I will not go as far as 5 stars, despite the sentimental value which is of course there ! I don't like the 3 opening songs of this album by the way, they are too commercial to me. On the other hand, it is a fact that if there was no song like Kayleigh, that was in the hitparade in Holland and is still in the top 100 of all times here in the Netherlands, many people wouldn't know Marillion and there would be no good example to give to \"ignorant\" people what prog music is.So the album to me really starts with Bitter Suite, that's really progressive, somewhat gloomy, very interesting track. It's followed by The Heart of Lothian, a sort of native track emotionally sung by Fish, also a little bit commercial. Then we are treated with very progressive passages with Blind Curve and some shorter tracks, these are the tracks I was in love with in the eighties, the reason why I loved this album and of course still do in a way. But it's only half of the album I am really enthusiastic about so I have to remain objective and give it 4 stars"
    },
    {
      "reviewer": "apps79",
      "date": "Posted Sunday, October 28, 2007",
      "rating": 5,
      "text": "If someone would tell you that an entirely concept album - among the best in history - was written during a 10-hour acid trip,you would say he was insane.But that is the truth behind ''Misplaced Childhood''.The same year ''Fugazi'' was released,Marillion recorded the excellent ''Real to reel'' live album,the band toured constantly to the point Fish and crew were exhausted.An envelop with acid sent by a friend to Fish was the beginning of ''Misplaced childhood'',a trip through life with strong autobiographical elements.The rest of the band accepted Fish'es concept idea and the album started slowly to took shape.However EMI was not on call to repeat the high budget and long recording process as with ''Fugazi''.Marillion found themsleves at Hansa Studios in West Berlin, Germany,where producer Chris Kimsey was responsible of keeping the band tight to release the album.The album was finally released in mid-1985.The album contains track by track thematic elements around love,dissapointment, lost childhood years, immerse success and pride,all were actually characteristics of Fish himself and his life so far,with lyrics in an enigmatic way,showcasing Fish was not exactly in the right state of mind.The beautiful artwork was a work by airbrush artist Mark Wilkinson,while the boy on the front sleeve was actually a neighbour of Wilkinson,named Robert Mead,who became a trademark of the band like jester,being part of various singles of the band.The concept opens with ''Pseudo Silk Kimono''.Mark Kelly introduces the concept with magnificent soaring atmosphering synths,surrounded by Rothery's background crying guitar and Fish'es storytelling voice.Here Fish sings about the story of his acid trip.The opening track will give birth to ''Kayleigh'',maybe the most recognizable Marillion tune around the world.The title refers to Fish'es lost and gone love for her past girlfriend Kay (middle name: Lee),who's name he misspelled.The most accesible track of the album with again nice lyrics and beautiful soloing by Rothery.''Kayleigh'' is connected with the following dreamy ''Lavender'',led by the sensational piano of Mark Kelly and the hoping voice of Fish and based on the lyrics of a traditional song,at least 300-350 years old.There is a sign of optimism in this one,giving hope to a sudden love on a dreamy walk.''Bitter suite'' is split into a five-part 10-min. suite,dealing again with one of Fish'es lost loves,Magdalena.The atmosphere this band could create sets on top with grandiose guitar playing,synth layers around and Fish'es voice slightly distorted to end up with a sensational pastoral outro.''Heart of Lothian'' is one of the most emotional Marillion songs ever,despite his full energy.It refers to the pride of the Scottish people for their ground and the youth of Fish himself,when he was hanging out all the time.The track contains fantastic Rothery soloing,Fish on the top of his form,a superb break in the middle and a pounding rhythm section,thus giving the composition a sense of a real pride.The tightly connected ''Waterhole'' and ''Lords of the Backstage'' refer again to the combination of lost love and life on the road with upbeat tempos,obscure keyboard work by Kelly,pounding drumming by Mosley and the theatrical singing of Fish being a highlight.Another five-part suite ''Blind's curce'' will follow with plenty of themes around love,losing a friend and childhood nostalgia.Fish'es lyrics are perfectly mirrored in Marillion's music.The atmosphere remains full keyboard-oriented,grandiose and bombastic with a psychedelic middle-part and featuring some of the best guitar soli in the history of progressive rock.Please try to deal with the lyrics here and the experience will be more than memorable.Then comes the sign of hope back.Fish realizes that even he's grown up,the child is still there,deep inside him.''Childhood's end?'' is a wake up message sent by Fish to all people,wrapped under his ethereal singing,the energetic chorus and the full performance of the band with extremely dynamic guitars and backing synths.The album will close with ''White Feather''.With a groovy tune and a powerful no-surrender polyphonic singing,the band sents a message of optimism,joy and inner strength to all children of the world.The album became fairly a huge selling success in the UK.It combines the energetic,often complicated and highly atmospheric musicianship with some of the most esoteric lyrics ever written,indicating Fish was far beyong a simple lyricist.The combination of the two will give an unmet experience.The result?If I was alone in a desert island with an album and a player in hand,this work would propably have the most chances to be the one.A complete progressive rock milestone,extremely highly recommended."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Thursday, February 14, 2008",
      "rating": 5,
      "text": "\"Misplaced Childhood\"is the 3rd full-length studio album by UK progressive rock actMarillion. The album was recorded between March 1985 and May 1985 and released throughEMI Recordsin June 1985. It�s the successor to\"Fugazi\"from 1984.\"Misplaced Childhood\"proved to beMarillion�smost commercially successful release, and they toured for a full year in support of the album.As\"Fugazi\" (1984)didn�t sell quite as well as\"Script for a Jester's Tear\" (1983), and cost double the money to record and promote (the video for\"Assassing\", had been exceptionally expense to film) compared to the budget of the debut album,Marillionwere under an intense pressure to deliver an album that would be more commercially satisfying toEMI Records. The label booked Hansa Studios in (West) Berlin (the same studio whereDavid Bowierecorded his Berlin album trilogy) and brought in producerChris Kimsey(Peter Frampton,The Cult,Emerson, Lake & Palmer...etc.), and they lived and worked in Berlin from March to May 1985.\"Misplaced Childhood\"is a concept release, dealing with subjects like love, relationships, lost childhood, and life-on-the-road. The atmosphere is often melancholic and the album is drenched in longing for the innocense of childhood. According to interviews with lead vocalistFishmost of the concept was conceived during an hours long acid trip, and maybe therefore the story is a bit fuzzy and not necessarily linear told. The lyrics are obviously very personal and strongly emotional andFishhas a strong voice and a paatos filled delivery, which have great impact on the listener. You can relate to the stories thatFishtells and feel the emotions when he sings about break-ups (\"Kayleigh\") and being a long way from home (in another country) in a hotel room, when told that someone close to you has died back home (\"Mylo\").Fishis a master of conjuring up vivid images of the topics in this lyrics.The album features two side-long suites, but it�s individual tracks, which seque into each other, rather than two side long tracks. Except for\"Bitter Suite\"and\"Blind Curve\", which are both longer tracks (7-9 minutes in length), the tracks on\"Misplaced Childhood\"all feature more \"regular\" 2-4 minutes song lengths. Other than\"Kayleigh\"which was a big hit song, also among non-progressive rock audiences, the album is still very much a progressive rock album. The instrumentation, the theatrical/concept lyrics and vocal performances, and the dynamics of the music, all point in that direction. The instrumental part of the music may not be quite as challenging as on the two preceding album releases, but then againMarillionwere never the most complex or technically challenging progressive rock groups. They always favored atmosphere and melody over complex song structures and technical playing.\"Misplaced Childhood\"features a warm, detailed, and organic sounding production, which suits the material well. It�s far from the thin and rather odd sounding production of\"Fugazi\" (1984)(which I personally appreciate, but understand why others don�t).Kimseydefinitely worked wonders here and\"Misplaced Childhood\"is an incredibly well sounding release. Upon conclusion\"Misplaced Childhood\"is the next logical step inMarillion�sdevelopment as a band, and it�s also through and through a high quality release. A 5 star (100%) rating is deserved."
    },
    {
      "reviewer": "JLocke",
      "date": "Posted Saturday, February 16, 2008",
      "rating": 5,
      "text": "After a slight stumble in ''Fugazi'', Marillion released MISPLACED CHILDHOOD, an album that has been considered by many to be the band's magnum opus. And I would have to agree with that opinion. While ''Script for a Jester's Tear'' summed up what Marillion was about, and proved that good prog had not died with the past greats, but was very much alive in these newer, fresher artists who were more than eager to introduce prog to a whole new generation.So, what makes MISPLACED CHILDHOOD so special? Well, for one thing, it does everything right that ''Jester'' did, but it also adds so much more life and appeal to the music. Where as the band's debut album was very grim in tone throughout (but no less a masterpiece, I assure you), this album is so much more lush and colourful by comparison. It also has a much clearer 'concept', with an almost narrative way of presenting the lyrics, which were no doubt chemically-induced, but no less poweful. Fish certainly hasn't been one to deny his exerimental side when it came to substances, but this album is certainly understandable even by sober listeners, which is great, too!MISPLACED is interestingly enough the second Marillion album I listened to, as in my ignorance I didn't realize there was an album between the two in release date terms Since ''Fuhazi'' is in my opinion a much weaker album then either of the other two, I am glad that this was my second Marillion adventure, and it is quickly becoming my favorite of theirs, which is saying something, because ''Script'' was such a fantastic album as well. Also something I think I should bring up is that this album as a whole, with the concepts and music and lyrics and artwork, is a record that could even give Pink Floyd's ''The Wall'' a run for it's money! And anyone who knows me at all is aware of how high a pedestal I hold THAT album on, so that should give you an idea of how great a record MISPLACED CHILDHOOD is.''Pseudo Silk Kimono'' is a good intro track, with beautiful melodies in it's own right, but not nearly as powerful as the songs to follow. I like to look at this song as a sort of appetizer before the main course. ''Safe in the sanctuary . . . safe.''What will come now is a narrative about a man's desire to revisit the innocence of childhood which he feels he has lost as he reflects on all of the negative effects his life has had on him. Great, great stuff, here when it comes to emotion, and Fish is no shy guy-- he tells it like it is.''Kayleigh'' I'm not sure if what I heard about Fish's invention of this name is true or not, but if so, it is very interesting. Wouldn't be too difficult to believe, since this song was a hit single for a time. Either way, the opening riff for this song reminds me very much of Pink Floyd. I think mainly because the notes Steve Rothery is hitting here are very similar to the notes found in the middle breakdown of the song ''Pigs (Three Different Ones)'' by off of Pink Floyd's ''Animals''. Anyway, that similarity soon leaves, however, and the riff changes into something much sweeter and more beautiful than anything Marillion has done up to this point in their career. Yet, it doesn't feel too sweet for comfort. Actually, it is possibly my favorite track on the album, just because it brings some of the warmest feelings to my heart a song ever could. Rothery is truly a genious guitarist.This song, not unlike every other song on MISPLACED, is very Fish-oriented, with vocals present for almost the entire time without relent. While I enjoy Fish's voice enough to not be bothered by this, I do realize that some may be put off by the lack of instrument-only bridge sections. But since this is a very Fish-driven concept, I don't think this is unjust. And since Marillion is indeed Neo-Prog, the constant vocal presence helps make the songs more appealing to more passive audiences. So while it may annoy some, most of us understand why the album is set up that way, and to me, this only adds beauty and depth to the record, since Fish's voice really is so amazing to listen to.''Lavender'' Is another phenominal song, but much like it's predecessor has enougb comercial pizazz to get stuck in your head the rest of the day (But in this case it is good because it is PROG, man!). It also features a very moving guitar solo by Rothery. Nothing fancy, but it just works!Oh yes, something else I should probably mention . . . this album also happens to be the best flowing album of all Marillion releases, with each track seamlessly flowing into the next, and while this segueing of tracks doesn't always work (Like anything else in art, it has to be done the right way in order to work well within the piece as a whole), it does work in this case. The first real 'concept' album by Marillion, MISPLACED CHILDHOOD does a fine job of making everything gel together flawlessly without much difficulty, or at least it seems to be the case.''Bitter Suite'' Kicks off alot darker and moodier than the previous three tracks, with some great ambient keys by Mark Kelly, and truly striking drumwork on Ian Mosley's part. I must admit, I wasn't all that impressed by him on ''Fugazi'', but he is truly gifted on his instrument, as this song demonstrates. Some truly psychedelic sounds are featured here, eliminating any symphonic prog links the band may have if not just during this one song. The song continues in this way until Fish does some spoken-word lyrics that are metaphoric, but still have a bit of humor in them to jazz things up a bit. I always get a bit of a giggle at his line about ''some obscure scottish poet''. Pete Trewavas also does some great bass playing here, preceeding another incredible Guitar solo from Steve Rothery. It stands on its own, then suddenly reprises the solo from ''Lavender''. This idea of everything coming back around is also a good sign of a well-constructed concept album, where the tracks are all actually part of something bigger. The poetry, ''She was paralyzed in the streetlight, she refused to give her name'' are just some of the many examples that prove Fish as being truly one of the greatest lyricists of all time. The melodies found in this song are very strong as well, and as a standalone track, it works beautifully, but also fits into the bigger picture nicely as well.Here, the band seems very emphatic on proving that they can indeed play music that is not merely a heavied-up Genesis (though I personally have never heard the connection between the two bands besides Fish's singing voice anyway)''Heart of Lothian'' 's opening guitar section reminds me very much of ''Hey You'' from ''The Wall'', which is fine by me! Around a minute and twenty seconds into the song, Mark Kelly gets some times to shine as he plays some wonderful piano parts that really fills out the song at this point. Not to mention, whenever Fish sings ''This tiiiime'', the way his voice wavers so drastically up and down lets us know that the old theatrical singer we know na dlove hasn't gone anywhere, and in fact does some of his best voice work ever on this record. Soon Kelly takes off on his piano sounds and brings the song's melancholic mood into a much softer, more joyous palor. The guitar soon follows suit by plaing the same tune overtop of the keybaords, but finally Rotghery once again breaks into an empassioned original-sounding guitar solo that completes this song's transformation into something completely different tham what it atarted out to be, which is a great thing, as many neo-rpog bands tend to to not evolve thir individual songs as much, but Marillion were the pioneers of this genre, and were influenced by the older prog guys, so that familiar and very wlecome song structure is present in their music, and certainly it is here. Great piece of music.''Waterhole (Expresso Bongo)'' is the first track on the album that can possibly be considered as 'heavy', and even then that's pushing it. The opening sounds are like something I would expect from a Robert Fripp album, or some other ambient noise-driven record, but then the song soon changes and becomes quite aggressive, with some distorted guitar riffs serving as a blanket for the intense keyboard work to colour the top of. There are some lyrical referrances to past songs to be found here as well, once again helping the concept as a whole connect properly. This song doesn't really speak to me much, though, and I think it is just because of how short it is, it doesn't egt the chance to evolve and change and become something interesting. So in a way, it the polar opposite of the previous song, and honestly, quite boring. But since it is so short, it doesn't take much effort to sit through it, so the album for me is still listenable as a whole without any breaks.''Lords of the Backstage''. Ah! Now this is music! Great riff at the beginning, great tune throughout, amazing vocal performance, consice instrumentation, no filler or overly-long moments in the whole thing. While musically it is a bit stagnant, it isn't very long at all, and helps lighten the mood once again on this very multi-emotional roller coaster of an album. Good!''Blind Curve'' is the longest songon the album, and has so many amazing parts to it, it is going to be difficult to touch upon them all, so I will give a general overview. Well, first of all, absolutely SOARING soundscapes provided by Steve Rothery's gitar wizardry gives this track the epic feel that it needs to hold ones interest for such a long stretch of time (nearly ten minutes). Remember, this is Neo-prog, so Marillion needed to be clever here in order to hold the casual listener's interest, and they obviousely did, since this record was their biggest hit during the Fish era. Post-Hackett Genesis could learn a thing or two from these guys. See, Marillion knows how to mix pop and prog well, unlike Genesis' later years. Around three minutes in, Fish delivers his best vocal work on the record, hands-down, with very unique jumps from highs to lows while keeping the melody something worth listening to. It's great. Just great. Close to 4:30, Rothery displayes some fabtastic spacey-guitar work accompanied by . . . nothing. The song is silent at this point other than the guitar, and I love it! See, this is what makes prog great for me. These are bands who know when to play alot, and then at the same time they know when to leave enough space for everything to sink in. If yopu constantly beat the listener over the head with aggressive rocking, they will never fully appreciate the beauty of your band's music. Marillion does not make that mistake ever, and this section of the song really shows off their uncanny ability to hit the listener right in the gut with some of the loudest, most powerfull silence a band could offer. The song soon becomes much darker and more atmospheric, with big echoing drums and some truly wicked flanger-effected bass playing. Fish's proclamation: ''Childhood . . . my childhood . . . misplaced childhood . . . give it back to me.'' is very haunting and heartfelt, I think. Really great track, and those are only some aspects of what make it great, there is alot more that I could fill up an entire webpage with in regard to any of the songs, really. But that is the general idea. Bottom line: it's a great song.''Childhood's End?'' Featueres another great riff at it's opening, and then maintaines the same quality throughout. A great song that I feel could have been the album closer, as it givesme a certain sense of resolution at it's end.''White Feather'' Is the other 'weak' track on the album, if you can call any of them really weak at all. But there is one moment in which the music builds up and then has one last burst of energy that is always nice to listen to, but on the whole, not all that impressive. I'm not going to detract any stars from the rating, however, because it is too great of an album to not give it's due just because of a couple of duds.This is the pinnacle of what made Fish-era Marillion great. If you wanna know what they were all about, this is a great place to start. May even be a bit more accessible than ''Jester'', even though it has a couple of poppy tunes. To be frank, even the lighter songs on MISPLACED CHILDHOOD don't feel all that radio-friendly, so I don;t think the 'hits' they had on this record was intentionall. It isn't as if they decided to record some totally unrelated pop material in hopes of hting it big; every song on this album flows naturally, none of it feels contrived. A true masterpiece, to be sure. As far as I am concerned, essential. Five stars. If you don't like this album, then Marillion probably isn't for you, because this had everything that made them great present within it.Now, I am very tired, and after staying up all night writing this review and listening to the album numerous times, I believe I deserve a nap. Nighty-night.Oh . . . and happy listening, of course."
    },
    {
      "reviewer": "LinusW",
      "date": "Posted Saturday, April 5, 2008",
      "rating": 3,
      "text": "A long time favourite of my father's, it was inevitable that I one day should come to Marillion. The celebrated prog revitalisers of the '80s - celebrated, idolised, loathed and neglected all at the same time by the prog community - are at least an important band in the history of music.Misplaced Childhood, the bands third album, is by many considered the pinnacle of their career and it is with caution and mixed feelings I approach the album. It isn't the first time I've delved into the dark, bitter world of Fish, and having said that, this would possibly not be the first time I'd leave it after a few spins. I've always felt that this was nothing more than pretentious (it's always a risk to use that word as a prog rock fan...) sophisto-rock with a distinct '80s flair. Neither have Fish's vocals ever been a favourite of mine. And while I stay true to those statements, this time something happened. It clicked, for lack of better words. Suddenly I felt a strong will to listen to Marillion those times you know you want hear something, but can't put your finger on what.Because behind the thick pretentious layer (the neutral meaning of the word...) is an album full of quality and emotion. And if put in context, the glam-hair-metal heydays of the decade, this is nothing short of a masterpiece. However, on a personal note and speaking as one who didn't live through those days, I don't find it that good.The production smells like the 80's. I've used the Rush albums from the same era as comparison before. Cold, hollow, electronic, restrained and disciplined are words that come to mind. But just as the '70s had its characteristic sound - but with a little more variation - I've never been put off by this. It's great with records that reflect their time, and an interesting cultural phenomenon. Sharp drums, somewhat in the back and 80's keys are other trademark attributes, and Misplaced Childhood is not an exception. Steve Rothery's guitar is highly emotional and crisp and clean, and the true pleasure of the album. Enchanting, hypnotizing from time to time. A fact that fits well with the dark concept. Sometimes he's very close to '80s-Alex Lifeson, but I'll leave out who influenced who, or if there is an influence at all. Could be either way, as far as I'm concerned. Ian Mosley is an expressive and powerful drummer and together with Pete Trewavas he forms a stable rythm section. But above all, this is an album very heavy on vocals and lyrics. Sometimes too heavy, as the other musicians almost drown behind Fish. I'd like more focus on the rest of the talent in the band, as some of the band's finesse is lost by that fact alone.Like all Neo-prog I've heard to this date, atmosphere is the key to success. It's all very theatrical with the expressive vocals of Fish, texture keys and narrated - and moody instrumental - parts. Misplaced Childhood is in many ways a perfect marriage between commercial catchy melodies and progressive complexity and atmospheres. And while this gives an edge in some camps, it's just as much a drawback in others. I'll settle for a place somewhere in between and complain about cohesion instead, and the shorter tracks, while still good, feels slightly out of place.With all things considered, I'll award this my most glowing three stars ever. And I've most certainly built up hunger for more Marillion. Very interesting.//LinusW"
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Monday, June 16, 2008",
      "rating": 5,
      "text": "I normally try to come up with something witty on this line but - Wow. Just wow.This is quite an amazing album. Now, I don't claim to be anything of an expert on the genre despite how many books/webpages/liner notes I've read, but one thing about all these things have something in common. They usually all talk about the saving grace that is Neo-Prog which emerged in the 80s to save our precious way of writing music from complete destruction. Of course when talking about the subgenre of neo prog you often hear, ''Marillion this, Marillion that'', but it's really not until you hear one of their classic record that you know exactly why so many people talk about them. In first hearingMisplaced ChildhoodI could immediately understand the attachment so many proggers had with these guys then and now. This is an emotional thrillride of a record full of all the pomp rock progressive arrangements that we're used to in the progressive realm while having enough of a modern edge to make it big in the world they were born in.For those who (like myself) got into the genre late and have yet to approach this band I'll say a few words about the music, trying not to be redundant. To accurately sum up Marillion, takeGabriel-eraGenesisand slam it into the 80s without having their poppy edge. Indeed, the first couple times I listened to this record I said to my friends, ''this is one of the bestGenesisalbums I've ever heard!''. Lead singer Fish has a very Gabriel-eque voice here and it lends well to the music because it's different enough to keep them from becoming total clones of their apparent parent band. The music is a bit different as well, with bass and guitars keeping prominence for the most part. The music dares to use synths and dares to be catchy as well, but when it does it's done with such an emotional edge that no one can point a finger and scream ''POP!'' at them before becoming doused in the subjects of the song.Of the standouts of the record, there's quite a few.Pseudo Silk Kimonoopens up with a strong yet subdued synth and introduces Fish's voice. Short but effective. This segues into (arguably) the best short song on the record,Kayliegh, which is a stunning piece. Emotional, catchy and gorgeous this is the kind of prog that people would never have expected. The lines ''Do you remember...'' are almost tear jerking in their delivery and make for a very pleasant listen.Childhood's End?is another good one, this one heavier than some of the other tunes, and along withWaterholethere's a few rockers to be had here. The bass line onChildhood's End?is especially upbeat and makes for a lovely four minutes.The longer songs of course dominate. No one can deny how good it is to hear a song likeBitter SuiteorBlind Curvecoming out of 1985. Both divided into segments, they each play out like most prog (mini)epics do. A nice rising action makes for a satisfyingly heavy and emotional climax coming into the last minutes of the songs. Some very spine chilling moments to be had here.This one is a hard one to top. An amazing effort that if you've skipped until this point you should consider trying to look it up. I (and many others) say that this one is completely essential, not to be missed. 5 Hearts of Lothian out of 5!"
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Wednesday, July 2, 2008",
      "rating": 5,
      "text": "Who knew that the year of my birth could bring the second renaissance of progressive rock and one of the genre's all-time classics.Misplaced Childhoodis my favorite Marillion album since it has so much to offer regardless of the circumstances when I listen to it!I always consideredScript for a Jester's Tearto be a bit too dominated by amazing lyrics whileFugaziwas more of an instrumentally driven affair. Here the band manages to finally fuse together the music with the lyrics and make it into a perfectly balanced combination without overshadowing one another. This is what also makes this album twice as rewarding compared to the previous two releases.The music here is timeless and out of all Marillion's albumsMisplaced Childhoodis the only one that has really withstood the test of time for me. It's a well-balanced concept album with the two medley tracks,Bitter SuiteandBlind Curvestanding as the two pillars supporting the rest of its weight. I always feel the greatly rewarded whenever I here the guitar intro ofChildhood End?implying that I've went through this storm of emotion and can appreciate the conclusion in all its glory!This was a great period for both the band and the development of Neo-Prog. Too bad the winning steak wouldn't last long for Marillion, but I can live with that, as long as I have this album in my collection!***** star songs: Pseudo Silk Kimono (2:13) Kayleigh (4:03) Lavender (2:27) Bitter Suite (5:53) Blind Curve (9:29) Childhood End? (4:32)**** star songs: Heart Of Lothian (6:02) Waterhole (Expresso Bongo) (2:12) Lords Of The Backstage (1:52) White Feather (2:23)Total Rating: 4,69"
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Monday, February 16, 2009",
      "rating": 5,
      "text": "Every once in a while I find an album that's a bonafide masterpiece of progressive rock and I become somewhat apprehensive about writing the review for it. I want to do it justice and describe it in such a way that others will be encouraged to discover it for themselves. \"Misplaced Childhood\" is one of those rare recordings that transcends the mundane and climbs to a level of artistic expression that is sublime. Not only is it flawless in its design and execution, it also delivers the kind of symphonic prog that satisfies me in every way possible. There's simply not a moment when I'm not totally absorbed and enchanted.I must commend the people of the UK for making this album #1 right smack dab in the middle of the 80s. As I recall, it was wholly ignored in the USA and that's our cross to bear. In 1985 we yanks were blindly oblivious to anything nearing the fringes of progressive rock because we had our heads stuck so far up our MTV virus-infected backsides that anything requiring more than 3 minutes of our attention (unless it was MJ's corny \"Thriller\" video) never got a glance. A band as courageous as Marillion might have blown some wind into the dying coals of prog over here but the record labels, obsessed with how a band looked on TV rather than how they sounded, never bothered to make us aware of their existence. Lord knows there were millions of proggers who would've loved to know about them.The opener, \"Pseudo Silk Kimono,\" with its sumptuous backdrop drawn by Mark Kelly's dense keyboards, instantly pulls you into their realm and sets the mood for the entire aural experience ahead. Vocalist Fish wields firmer control over his theatrical style on this album and the articulation of his hallucinogen-fueled words is yet another reason it soars so high. He's sad, alone and slightly out of his mind, shuffling aimlessly in his cheap robe \"wearing bracelets of smoke/naked of understanding\" and covered with \"nicotine smears/long, long dried tears.\" What follows is \"Kayleigh,\" a gorgeous song that could've been as big a hit in Dallas as it was in London had it only gotten a few spins on the radio. It owns all the characteristics of what I think neo-prog is in that it blends the progressive sensibilities of the 70s with the state-of-the-art studio techniques and instrumentation of the 80s to create a unique type of music. With this classy tune they had a popular single that provided vital exposure without cutting the corners of their integrity. Steve Rothery's guitar effects and Ian Mosley's drum sound are exceptional and Fish's lyrics about the euphoria of young love and the devastation resulting from its loss strike directly where it hurts most. \"Do you remember/chalk hearts melting on a playground wall?/do you remember/dawn escapes from moonwashed college halls?\" he pleads, \"I'm still trying to write that love song/it's more important to me now you're gone/maybe it'll prove that we were right/or prove that I was wrong.\"Kelly's piano leads into the beautiful \"Lavender\" with its tasteful dynamics and haunting melody. Here Fish faces the rueful realization that his lady love may be gone forever as he walks through a park. \". I heard children singing/they were running through the rainbows/they were singing a song for you/the one I wanted to write for you, for you\" he laments. His use of alliteration on this track is masterful as are Ian's drum rolls at the end. \"Bitter Suite\" is next and its five parts go through a slew of emotions ranging from despair and bewilderment to insecurity and disillusion. During the mysterious \"Brief Encounter\" he mutters \"the mist crawls from the canal/like some primordial phantom of romance/to curl under a cascade of neon pollen/while I sit tied to the phone like an expectant father.\" On \"Lost Weekend\" the group briefly streams into a surprising jazz motif and during \"Blue Angel\" they apply a heavier rock ballad feel while Fish tells of a desperate tryst. \"Two hundred francs for sanctuary/and she led me by the hand/to a room of dancing shadows/where all the heartache disappears.\" he sings. That's followed by the sensual \"Misplaced Rendevous\" in which a reunion with his former lover doesn't happen because \"the weekend career girl never boarded the plane.\" Mark continues to paint with deep keyboard hues, but for \"Windswept Thumb\" he employs his piano joined by Steve's acoustic guitar as Fish relates that he's \"on the outskirts of nowhere/on the ringroad to somewhere/on the verge of indecision.\"\"Heart of Lothian\" has a respectful Genesis-like atmosphere. Divided into two segments, \"Wide Boy\" slips into half-time as Fish seeks refuge among the rowdies he grew up with while on \"Curtain Call\" the drums are silent and the music drifts as if suspended in mid-air. He ends his wry commentary on escapism with \".and the man in the mirror had sad eyes.\" Menacing tribal drums underscore \"Waterhole (Expresso Bongo),\" a vicious rip into the underbelly of life in the pubs where girls are \"lying on every word and every arm/turning down their noses to the best lines and the cheap wines\" and the boys \"wear their lovebites for their crimes.\" An infectious 7/8 time signature is incorporated for the stunning \"Lords of the Backstage\" during which Mosley fiercely attacks his drumkit and Fish tries in vain to educate his lost lady about touring. \"A lifestyle with no simplicities/but I'm not asking for your sympathies/talk, we never could talk/distanced by all that was between us/a lord of the backstage/a creature of language/I'm so far out and I'm too far in.\" he confesses.\"Blind Curve\" is another multi-sectioned epic. \"Vocal Under a Bloodlight\" sports a hard beat and Fish proclaims that he's \"happy to be lonely\" but he's not convincing. \"Passing Strangers\" is softer in tone as he tells about being \"strung out under a necklace of carnival lights.\" Rothery gets to show off his guitar skills (both solo and in stacking harmony tracks) on \"Mylo,\" a number that features a lovely mix of instrumentation while Fish bemoans \"the price of infamy/the edge of insanity.\" After a short guitar interlude a growling synthesizer drone colors \"Perimeter Walk,\" a dramatic piece where he speaks, then shouts about the loss of his innocence. \"Threshold\" is huge in scale and it's as if the band has opened the floodgates to let the music gush while Fish finally looks out from his shell and sees that there are bigger issues in the world than his broken heart. \"I see black flags on factories/soup ladles poised on the lips of the poor/I see children with vacant stares/destined for rape in the alleyways/does anybody care?/I can't take anymore.\" he rants.On \"Childhoods End?\" Ian and bassist Pete Trewavas establish a solid groove while the guitars and keyboards splash up a brilliant, bright background. Fish accepts a brutal truth. The relationship is over and \"she's got to carry on with her life and you've got to carry on with yours.\" The album ends in the stately, military aura of \"White Feather\" as he's now turned his attention towards more noble causes like taking on the dogs of war. Accompanied by a glorious children's chorale the group fades into the ether proudly proclaiming \"you can't take away our hearts/ you can't steal our hearts away.\"The most impressive aspect of this incredibly cohesive piece of art lies in the way it flows seemingly without effort. Of course, that's what makes it so extraordinary because every progger knows that this kind of music is anything but easy to produce and even harder to record without a single seam showing. But that's exactly what this band, on only their third album, did. Their musicianship and their enigmatic frontman's vocal and lyrical prowess show a maturity and confidence that comes only through dedication and commitment to a common goal. With \"Misplaced Childhood\" Marillion achieved a level of excellence that the majority of bands can only dream of."
    },
    {
      "reviewer": "progkidjoel",
      "date": "Posted Saturday, April 25, 2009",
      "rating": 5,
      "text": "Marillion - Misplaced ChildhoodThe only thing misplaced was direction... And they found direction!Review by ProgKidJoelMarillion's third studio album, MISPLACED CHILDHOOD, is considered by many to be their most consistent piece of art. This album is perhaps the least dark and distressing from the band with FISH, although is by no means soft, and is still emotionally stirring. Its worth mentioning this is a gapless album, and for maximum listening pleasure should be heard as such.The album opens with PSEUDO SILK KIMONO, a soft synth and guitar track with soft vocals. This sets the scene for a prog masterpiece, although this is not immediately evident in the follow up. This track has a genuine falsetto vocal track by FISH, and some lovely guitar effects by the master, ROTHERY.PSEUDO SILK KIMONO is followed by the band's biggest commercial hit so far, KAYLEIGH. This is an 80's classic, but be warned - This track isn't recommendable for prog purists and/or members of the anti-pop movement. Filled with great lyrics and genuine 80's synth effects, this carries nicely, and is a brutally catchy tune. The chorus is a real sing-along delight, and the guitar solo is fantastic. This is the track which blasted Marillion into the big time, making them worldwide number 1's overnight. The bass is also quite pleasing in this track, featuring a classic TREWAVAS bump-along texture.Kayleigh, I just wanna say I'm sorry, but Kayleigh I'm too scared to pick up the phone, to hear you've found another lover, to patch up our broken home!LAVENDER is another one of the singles from the track, and once again, features beautiful lyrics, vocals and all-round musicianship. This is a genuine ballad, but much like KAYLEIGH, isn't really prog based. This is a great track, albeit short. It flows into a guitar solo, and this is much extended on the single edit, which unfortunately is only available on the 2CD remaster. LAVENDER and KAYLEIGH lead perfectly into the album's first epic......BITTER SUITE. This track opens with some fantastic drum fills and spacey guitar. At around 1:30, this track takes structure with a flowing bass rhythm and eventual spoken word poetry from FISH. Soon after, some great vocals and synth effects come in. The lyrics in this track have always been a point of interest, as they are both incredibly poetic and emotionally insightful. This track eventually breaks into excellent drums with equally great guitar soloing over the top. This eventually reaches the same riff as LAVENDER, with different lyrics and a new vocal rhythm and harmony. The lyrics in this track are amongst the best any band has ever produced, and are near the peak for Marillion. This track is fantastic and leads perfectly into the next.HEART OF LOTHIAN was the third single from the album, although was in a much edited format. It picks up perfectly where BITTER SUITE left off. The sound is incredibly 80's on this track, but it (once again) proves that Marillion also have technical chops as musicians. The track picks up with a joint guitar and bass riff, leading into a great 80's tune. The guitar work on this song is amongst the cleanest I've ever heard, and the rest of the instruments work in perfect macro to compliment the unnatural cleanliness. Around halfway through, this track changes pace, slowing down, but continuing with more perfect guitar work. The last minute of this track is known as CURTAIN CALL, and is much softer than the former segment, names WIDE BOYS. The lyrics in CURTAIN CALL are also fantastic, and the guitar work is similar to that of PSEUDO SILK KIMONO.Marillion break up the pace with two shorter songs, the first being THE WATERHOLE: EXPRESS BONGO. This track opens with eerie guitar squeals, and continues with a great synth riff and some fantastic drum work. The lyrics are brutally angry on this track, and the guitar work remains demonic and erratic throughout the track's two minute length. There isn't too much to say about this track, and even though it is short, it adds massively to the sense of album over song, and also adds deeply and purposefully to the concept. This closes with much lighter synth work, leading into another track marked by the same changes.LORDS OF THE BACKSTAGE is the shortest track on the album, and once again, this is still able to add on a critical level to the album. This track has some lovely synth and guitar synchronization work, and the lyrics are both entertaining and insightful in this track. This short song leads into the albums true epic, BLIND CURVE.BLIND CURVE opens much more directly than many other tracks on this album, with great guitar work and near-immediate vocals. This is one of Marillion's most iconic tracks, and stands as the best on the album. Something of true fantasy and wonder about this song extends from its thoughtful phase changes - Through several moods and emotions, this track still feels like one, even after various breaks and splits. This is a great song, and is the centerpiece to the album. This is the album's proggiest track, featuring an epic guitar bridge worthy of the masters who inspired it. After this short interlude, the album has another spoken word moment over darkly intense bass noise and guitar effects. This is one of Marillion's most emotionally revealing moments, with an epic buildup and ear piercing vocals. This continues into a song of protest, and is one of Marillion's strongest which fall into this category. The lyrics are brilliant, although brutally honest about the problems faced by society today. This track ends with the same riff as LAVENDER, and flows into my favourite track on the album!CHILDHOOD'S END is one of Marillion's best songs - Deeply insightful and anthemic, although still lighthearted and enjoyable on a poppy level. This is a great track, and has references to the cover art and the loss of innocence described so vividly in this album. This song is mostly about moving onwards, and forgetting your past failures whilst learning from them. This is much better than the PINK FLOYD song of the same name, and this is one of the defining tracks on the album.You, poor child, that once loved, before they broke his heart. Our heart. The heart... That I believed was lost.This track closes in a great prog fashion, with speedy synth and drum work all round.WHITE FEATHER is another great short track, and the most important thing about this song is the closure it gives to the rest of the album. This is a truly angry track, but remains enjoyable and anthemic throughout its two minute lifespan. A choir of FISHES also helps this track to gain momentum, and the great instrumentation helps give a lot of quality to this song.This is probably Marillion's best album with FISH, and has the most unique atmosphere from the four. The sound is different to every other album, and there is a reason this disc is considered the defining neo-prog album, and one of the best 80's prog albums - Its as close to perfection as possible!An absolutely essential album for everyone!-Joel"
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Thursday, May 14, 2009",
      "rating": 5,
      "text": "Review number 250 - this is one of the most influential, timeless albums of the neo prog 80s. Marillion effectively reinvented prog.Misplaced Childhood is Marillion's magnum opus. Each track blends seamlessly into one overall powerful experience. It is the best the band have produced unlike the flawed Fugazi and Script for a Jester's Tear, this CD works on every level; musically, conceptually and vocally Fish has never been better.It begins with the hypnotic keyboard motif that I had to learn after hearing this. A beautiful serene piece of art with the wonderful vocals that chime in instantly transports us in to Marillion's world. The narrative begins of a man who is attempting to revisit his innocent childhood days that have been lost in the sea of fire - the trials and temptations that have plagued his life robbed him of the innocence and thus his dreams have been squashed.''Kayleigh'' is the bonafide single that all Marillion fans have heard. It was my introduction to the band, found on the best 80s compilation CDs. Steve Rothery blasts a memorable riff and the keyboards soar over the top with a crystalline sound that is essential mid 80s fair. The melody is wonderous and memorable and one of the best from the band as a result.''Lavender'' is another single that takes on the theme of the nursery ryhme that is a childhood memory but the lavenders - the positive side of life - is gone robbed by negative effects on the life of the protagonist.\"Bitter Suite\" features a beautiful piano with encircling guitar motifs that hook onto an infectious melody.\"Heart Of Lothian\" begins with an incredible introduction and them locks into an off beat metrical pattern that shifts from 4/4 to 7/8 and back again. There is an ethereal ambience in the keyboards that compliments the vocal prowess of Fish. His vocal gymnastics never tire on the ear on these tracks.\"Waterhole\" is an anthemic rocker that leads seamlessly into:\"Lords Of Backstage\" is an effective short transition track that segues into:\"Blind Curve\" and here is where the album really excels. The vocals are poetic and Fish's artistry is second to noe. There are dark overtones but it feels uplifting simultaneously. Listen to Fish build to the crescendo climax as he reflects on the dark memories - \"the childhood, the childhood, the childhood, oh please give it back to me\" and there is a significant break in the meter where the jagged guitar solo launches into full volume. It is an amazing track and one of the best I have heard from Marillion.\"Childhoods End?\" has a very deep bass line that throbs throughout and is significant to the dark tone of the lyrics. It is the end or the beginning of innocence? The concept is heavy handed but the real star of the track is Fish who wails up a storm with an amazing vocal performance: \"it was morning and I found myself mourning for a childhood that I thought had disappeared - I saw you... Hey you, surprised... to find the answers to the questions were always in your own eyes, do you realise.... for she's got to carry on with her life and you've got to carry on with yours...\" Simple and direct but effective to touch on the theme of a love lost and how to survive \"to be reborn in the shadow\" to find \"the leading light of destiny burning in the ashes of your memory...\" Powerful. I love the guitar riffs and the lead breaks over Fish's vocals \"There is no Childhood's End, There is no Childhood's End, oh lead me on\". Then the iambic pentameter changes completely in order to segue immediately into:\"White Feather\". A low key track that is a low point on the album but it certainly wraps it all up concluding the CD, fading away in true 80s style.How to conclude this review is to simply state the fact. This is as about as good as Marillion gets. The first few albums are all great but this is the masterpiece make no mistake. I would even be bold enough to state that if this album does not appeal to you, Marillion is perhaps not for you. But on the other hand for those of us who have discovered the genius of this band, this CD is truly a pleasurable experience. Great headphone music and one of the best outright examples of Neo Prog."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Wednesday, May 27, 2009",
      "rating": 5,
      "text": "Still I can't understand why MARILLION doesn't get the credit they deserve, yes it's true they have a strong GENESIS influence, but if you embrace a genre more than a decade after it's birth, most surely you will be influenced by one of the pioneers.It's also truth that the selection of keyboards is not the best, specially because in 1982 they got rid of their Mellotron and used an emulator that didn't sounded remotely as goodBut we must focus in the music, they were able to make excellent Prog in a decade that despised Prog and keep the genre alive, and \"Misplaced Childhood\" is one of the top albums of the decade.\"Misplaced Childhood\" starts with \"Pseudo Silk Kimono\" and it's soft beautiful Synth intro, that leads to a section where Fish proves why he is one of the best vocalists in Prog history, only supported by Mark Kelly's keys, does an amazing job keeping the interest of the listener and preparing us for \"Kayleigh\" which enters after a brilliant transition between songs, now the work of the band is complete and at this point Rothery defines what would be the new role of the guitar, as peer of the keyboards and not relegated to a second plane, amazing song, despite the critics.\"Lavender\" starts with an extremely beautiful piano intro and Fish's peculiar style as a story teller, everything sounds natural and coherent and Mosley with the powerful drums adds the energy required when the song needs a change. At this point Fish makes a radical change from storyteller to singer and does it with amazing proficiency, only 2:25 minutes but sometimes less is more, great song.\"Bitter Suite\" starts with that mysterious keyboard intro that became MARILLION'S trademark in songs as \"Assassin\" that usually lead to a vibrant passage, in this case they choose a tense narration to create more suspense, and Fish singing in an almost howling style with his unique Scottish accent until Mosley again announces a radical change with a short drumming, the whole band joins the song and Rothery assumes his role of leader of the band, up to this point not a single weak moment.\"Heart of Lothian\" sounds like a more ambitious work, carefully structured with an elaborate introduction, and a complex development with sudden and subtle changes sometimes lead by the vocals, in other cases by the soft piano, but around the second minute the radical change comes, a prepared explosion of power and musicality keeps the listener at the edge of the seat not knowing what to expect next, as usual Fish jumps from soft and gentle to aggressive and vibrant. As a note, if the changes in most Symphonic bands are sudden and surprising, MARILLION prepares each change, going step by step. Maybe they loose a bit of surprise but prove how carefully elaborate each song is.\"Waterhole (Expresso Bongo)\" is something different, for the first time the band seem to set the beast free, if everything was gradually and carefully planned, now they allow themselves to attack the listener with everything the have, not a second of rest,As in the previous track, \"Lords of the Backstage\" doesn't prepare the listener for anything, they start strong and even let the intensity of the track to grow as the seconds pass, as announcing an explosion of music, somehow in the vein of \"Tubular Bells\" but before the climax reaches, the short track ends leaving the conclusion for the dramatic \"Blind Curve\", in which Mark Kelly adds his peculiar organ combined with Rothery's guitar in a collaboration that reminds the one patented by Banks & Hackett, but different, more aggressive, with a vocalist that guides the band to an excellent guitar solo, radical changes, lush keyboards and a very solid interplay between Trewavas and Mosley make of this track one of the highest points of the album, 9 minutes of first class Progressive Rock.\"Childhood's End?\" reminds me instantly of \"And Then They Were Three\", but if GENESIS would had sounded like this, I would kept following the band for some years instead of closing that chapter. Strong, perfectly structured, dramatic when required, everything is in it's place and sounds great.The album ends with \"White Feathers\" an excellent and surprising finale.Some people may believe I go too far with my rating, but if \"Script for a Jester's Tear\" was the birth of Neo Prog, \"Misplaced Childhood\" completely defined the sub-genre and raised the bar so high that the new bands would have to work very hard to reach this level. If this is not essential, I don't know the meaning of the word, so 5 stars is my rating."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Thursday, September 3, 2009",
      "rating": 4,
      "text": "This is where Marillion Mark 1 realizes its full potential. It's full of catchy songs, laid back atmospheric passages and every track flows nicely into the other. The unifying vision of this album lifts individual tracks to a level that is higher then their intrinsic qualities. Even run of the mill poppy tunes like Kayleigh and Lavender work perfectly in this context.I'm sure this album and especially the popularity of it, is a thorn in the flesh of prog purists but what is the relevance of that debate? Aren't we just after discovering and enjoying outstanding music whatever genre it is? Even if that genre could be tagged pop-prog. 4.5 stars"
    },
    {
      "reviewer": "snobb",
      "date": "Posted Wednesday, December 30, 2009",
      "rating": 4,
      "text": "After years when it looked that progressive rock is dead or is still alive in a form of old great names ( and far not so great their new albums), Marillion came as new wave of old feeling.To be honest I never liked neo-prog music ( and don't like it till now). For me there were Rush (till their Signals), then Saga , then -some silence, and then - Marillion. Just more modern form of progressive mainstream rock. I was happy with their few first albums, and Misplaced Childhood possibly is the one, where they got their peak. If earlier works were still Gabriel/Genesis connected, there they found their own soundMelodic, different, technically strong, never boring - this album was a new prog standard for the generation. Unhappily, the band didn't stay at their top for too long. After Fish left the band, they became not too much interesting, and ( what is much worst) gave inspiration for myriad of faceless boring clones, which later formed the basis for so named neo-prog.This album could be recommended for widest range of listeners as one of the best neo-prog examples ever."
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Wednesday, February 24, 2010",
      "rating": 4,
      "text": "The jewel of the Fish yearsAnd the best Neo album I've personally ever heard. Events in my personal life have had me thinking about the past a lot lately, I suppose it's just the next midlife crisis. Some would say I look backwards too much but I would counter that too many people seem to be running from their past, which is no better frankly. I think there is much to be learned by thinking about events and outcomes of decades gone by, as I've found they can be clues to explaining things in your midst today. Is it coincidence that this old friend found its way back into my rotation after many years of not hearing it? Maybe. But the rush of memories and emotions it brought back were nothing short of intriguing.\"Misplaced Childhood\" is a masterpiece for so many reasons and it is easily the best of the Fish years. The album comes from the high point of the first Marillion era, when the band members said they were confident and happy, and stated that the album pretty much \"wrote itself.\" The good times were short lived of course but what a statement they left. The thematic concepts of the album come primarily from one wild night when Fish took a double hit of some solid LSD and spent the night writing between bouts of freaking out, providing yet more evidence that some of the best rock music ever written was assisted by chemical inspiration, as much as some would like to deny that fact.\"An envelope arrived one of these days. Inside there was a short letter from an old girlfriend with the recommendation to digest the accompanying contents - a tab of very strong acid. Very Alice indeed! Not having indulged for a while I swallowed a cautious half, and after a few hours and with a pleasant euphoria, I took the other - setting off on my bike to Steve Rothery's house. Very bad mistake....Steve had to drive me home and after locking all the doors I set off into a long white-knuckle roller-coaster of a night....I immersed myself in a warm bath for a while, returning to the womb and trying to reassemble myself. I spent the rest of the night crouched on the floor listening to music, watching walls breathe....I'd started to doodle and scribble in my lyric book on the off chance of catching something from the trip. It was sometime during the night that I was visited. 'Incubus' was on the deck; I was in 'Padres Bay' when suddenly I felt a child standing behind me on the stairs. I knew he was dressed as a soldier and vanished as soon as he entered the corner or my eye. Perhaps it was my muse; perhaps it was the drug. It was enough to propel me into reaming off a large scrawl of prose. Contained within were the diamonds and structure on which would hang up the entire concept of Misplaced Childhood.\"[Fish, from Marillion.com]Lyrically and musically the album is almost magical in its successes. The concepts Fish wrote about were personal mostly, but great rock concepts have a way of allowing the listener to assume emotional control of the content: \"Kayleigh\" becomes *your* lost love, the melting chalk hearts from *your* playground, the haze of summer lawns emerge from our *own* memories. (Not literally of course, the names and places will be different, but you catch my drift-we internalize the tracks to our own experience). He delivers the storylines masterfully and with incredible passion.The band rises to his challenge of performance here delivering heartfelt melodies, interesting proggy interludes, beautifully linked songs and transitions, recurring themes, and spirited jamming. When you consider all of the elements the album can compete with works like Dark Side or Trick of the Tail (while it falls short of Floyd for me it easily bests TotT). But think about Dark Side's recipe: great transitions, poignant lyrics, interesting proggy moments and great melody....same recipe. The difference is mainly in the \"sound\" of the two bands and the time periods. Some proggers will blast the album for being too overtly accessible but in reality it is not so different than those highly approachable '70s albums.I love how dynamic and briskly paced everything is kept. From the mysterious beginning of \"Pseudo Silk Kimono\" to those amazing first chords of \"Kayleigh\", which if you listen carefully perfectly sound-simulate the effect of time travel leading to the \"do you remember?\" lines of the songs....just freakin' perfect melding of sound and theme. They dive right into another contagious track with \"Lavender\" showcasing Rothery's abilities to mimic that gorgeous, transcendent Gilmour quality of pleasurable note production. \"Bitter Suite\" begins with an understated but dramatic little drum solo, a great touch by Mosley. \"Blue Angel\" revisits the \"Lavender\" melody as the album displays the kind of recurring themes throughout that give it that cohesive, confident, and deeply considered compositional base.\"Misplaced Rendevous\" opens with a lovely acoustic swirl before \"Windswept Thumb\" closes this amazing suite with my favorite, simple piano melody. Mark Kelly lavishes the album cover to cover in beautiful texture and mood, while Pete Trewavas delivers this huge, thumping bass throughout....giving the album some real rock punch! The second side tries to best \"Bitter Suite\" with a 10-minute emotional bloodbath in \"Blind Curve\" which deals with the death of a close friend (I believe.) The interlude between \"Mylo\" and \"Perimeter\" is fantastic---and the pain, loss, and anger expressed through the suite is deep.Just when it begins to get a bit much at the end they pull it back nicely with a refrain of the pleasing \"Lothian\" riff. If only they had ended with the upbeat and natural sounding conclusion of \"Childhood's End\" which so perfectly wrapped it. The one black eye of this album is the tacking-on of the dreadful last track \"White Feather\" with its cringe-worthy, utopian lyrics, which was simply so unnecessary. My rating of 5 stars is tainted by the fact that I hate the last track, so I must qualify that I stop the disc after \"Childhood's End.\" Perhaps that's cheating, but hey, it's my review. I can't penalize such a treasure like this for one dud track.Get yourself a remastered version of this album and hear one of the best rock albums of the 1980s. The cynical (of which I often include myself in their ranks) may mock you, but when you get this disc in your car alone, you'll enjoy it just like the other guilty pleasure albums people sometimes diss....Grand Illusion, Wind and Wuthering, Moving Pictures, Snow Goose, In Absentia, Point of Know Return, etc. \"Misplaced Childhood\" may not be the greatest progressive album but it was a perfect moment in time, a band hitting full stride, and somewhere to take refuge in the mid '80s."
    },
    {
      "reviewer": "ProgressiveAttic",
      "date": "Posted Thursday, March 11, 2010",
      "rating": 2,
      "text": "Gabriel era Genesis... but two steps back.This is a difficult album to review because it was meant to appeal to classic era prog fans (such as myself) but the quality of the music is way inferior to any of the classic bands they are trying to emulate. First of all, I have to make clear that I don't doubt of the capabilities, talent and potential of each and everyone of the musicians involved in this album since I've seen what they can do, specially on \"Script for a Jester's Tear\", which is almost the \"lost Gabriel era Genesis album\". Here, again, Marillion displays their Genesis influence to an extent that it becomes a clone, but this time they add a Pink Floyd \"The Wall\" era element to the music. As I said before, these influences and overall sound would appeal to prog fans but the compositional quality is quite diminished in comparison to their debut in an accomplished effort of making prog more accessible (indeed, it peaked on the charts).I have always said that if you want to emulate a classic band without being dull you should, at least, be able to keep the musical standard and be somewhat original. \"Script for a Jester's Tear\" accomplished that masterfully, producing pieces that aren't just copies of already existing Genesis tunes. But now, Marillion embarked the pretentious project of making Gabriel era Genesis accessible to the masses but by doing that they sacrificed their Genesis-like musical standard (and saying this is a enormous compliment to their debut) and everything that made this prog classic's music interesting. I have nothing against pretentiousness when it makes things interesting, but this time it bores me to death. At the end, the pretension of this album, unlike classic-era prog, is to simplify the music. So, instead of being progressive they are being regressive! Something common among several Neo-Prog bands.This album is considered a masterpiece by many and I can understand its appeal: it caries the essence of some of our favorite bands, it is easy to comprehend and has interesting lyrics. Not only that, it was one of the few sources of prog in the 80's and it got some airplay, therefore it produced the illusion and hope that the progressive rock era wasn't over. But we have to realize that: 1) The music lacks originality, 2) Is simplistic and 3) If you wanted to get 80s prog King Crimson, Rush and other authentically progressive bands where active during the decade. Well.... we can say this is the cornerstone of Neo- Prog, which in my book isn't really a compliment (although there are some enjoyable and decent Neo-Prog albums out there...clearly, this isn't one of them).Now to the music. Fish has a voice outstandingly similar to Peter Gabriel's (and that is another big compliment), his performance and lyrics are the highlight and only interesting aspect of the album. The guitar work is actually closer to David Gilmour's than to Steve Hackett's, but nothing really noteworthy comes out of it. The rhythm section is apt but, again, uninteresting. The keyboards are not bad, creating an atmosphere with lots of unexploited potential and some pleasant piano interventions appear every now and then.There is actually no technical flaw here, but the uninteresting and boring music makes me want to give the lowest rating. Nonetheless, the great vocal performance, technically flawless playing, pristine recording and, to a lesser extent, historic significance of this record (it kept the symphonic prog sound tradition alive) made me reconsider.Total: 2.40.Two stars for a decent, boring, unoriginal and regressive album. Just for collectors of prog history."
    },
    {
      "reviewer": "J-Man",
      "date": "Posted Wednesday, April 21, 2010",
      "rating": 5,
      "text": "My 150th Review on ProgArchives!For my 150th review here at ProgArchives, I've wanted to discuss an album that is really special to me. After some tough decision making, I've decided that it was finally time to review one of my all-time favorite albums - Marillion'sMisplaced Childhood. I have been holding off this review for a long time, for an almost unexplainable reason. I've been afraid that after I put my own critical spin on such a special album that it might loose a little bit of its luster.Misplaced Childhoodhas been one of those albums that has really shaped my life recently. I have been listening to this album on a nearly twice-a-day basis for well over two months, memorizing every word and note until it is engraved into my head. Words can't describe how fantastic I think this album is, but I'll try my best to explain how awesomeMisplaced Childhoodis throughout this review. But if you really want to know how good this album is, just go out and buy it - you won't be disappointed.After a slight stumble withFugazi, Marillion comes back stronger than ever with this 1985 masterpiece. OnMisplaced Childhoodwe here a much more mature and developed band. The production is better, the compositions are fantastic, and the band sounds even better on their respective instruments. When you add on the beautiful lyrics from Fish, a well-crafted concept, and some of the most heartfelt music on the face of the earth, it really makes for a fantastic album.I'm usually a sucker for concept albums, so that does increase my enjoyment ofMisplaced Childhoodquite a bit. This is an extremely well-crafted concept, and should set an example for other bands. It reuses just enough musical and lyrical themes to give the listener a great emotional impact without ever becoming repetitive or derivative. I just can't praise the seamless flow of this album enough. All of the songs flawlessly flow from each other. I wouldn't have the song order any other way.The musicianship is fantastic, as we're always used to from Marillion. Of course, Fish takes center stage on this album with his emotional lyrics and fantastic vocals, but the other four musicians have no shortage of great material onMisplaced Childhood. Steve Rothery plays some of his finest solos ever on this album. He really is a fantastic guitarist and suits the mood of the album perfectly. Mark Kelly's lush and melodic keyboards set the mood of the album perfectly. He doesn't have as many solos as Steve Rothery, but he sets a fantastic rhythm (and sometimes lead) section. Ian Mosley's drumming has gotten much better sinceFugazi. I found his drumming a little uninteresting on the previous album, but that isn't at all the case here. He does a great job throughout the entire course of the album. Pete Trewavas does a great job as well. That man really knows how to play the bass, and he shows that he's the master throughout all ofMisplaced Childhood. None of the musicians ever \"shred\" or show off, but they don't need to. Marillion is made up of top-notch musicians, and you can tell that from their distinct melodic style.The production is unquestionably from the 80's. The synthesizers, electronic drum sound, and guitar tones may turn some people off, but I really enjoy it. I honestly love the production of 80's neo-prog albums like this, and I think it givesMisplaced Childhoodsome of its charm.This album contains 10 songs, all of which are fantastic and worth hearing. My favorites areKayleigh,Heart of Lothian,Lords of the Backstage,Blind Curve, andChildhood's End. I realize that I've mentioned half of the songs, but they are all so fantastic that I can't narrow it down any more. Keep in mind that all of the songs segue into each other, and are meant to be listened to together. My only complaint with this entire album is the closing track,White Feather. It's a good song, but I don't think it's a great way to end such a fantastic album. If it were placed somewhere in the middle of the album I would be fine with it, but it isn't as strong of a closer as I would've liked it to be. It's a minor complaint in the big picture, however. This is a fantastic album, and one mediocre track can't change that.Conclusion:Misplaced Childhoodis a masterpiece of progressive rock, and is one of my all time favorite albums. I can't stop praising this fantastic album, and I don't think I ever will. You aren't a true prog fan until you ownMisplaced Childhood, so do yourself some justice and go out and buy it now. Of course my rating will be 5 stars for this absolutely essential progressive rock album. This is one of the defining albums in the genre.5 stars."
    },
    {
      "reviewer": "stefro",
      "date": "Posted Tuesday, June 29, 2010",
      "rating": 4,
      "text": "The album that broke the band big time, 'Misplaced Childhood' was the group's third album and, commercially speaking at least, represents the apex of the 1980's neo-prog revival. The album featured that rare beast for a prog band: a hit single in the shape of the Fish- penned honest-to-god love song 'Kayleigh' which, again, represented a peak of sorts, topping various charts across Europe and giving the band some valuable exposure in the process. Fish would, of course, leave the behind three years and one album later in 1988, but the four albums produced whilst he was the group's figurehead represent the band's true golden era, an almost perfect merging of dark lyricism, shiny neo-prog musicanship, fantastical artwork and, the magic ingredient, a commercially-viable pop-edge that gave the band unexpected success in the face of doubting critics who were championing punk, new wave, goth-rock and synth-pop above anything produced by Marillion or their less successful contemporaries, the likes of Twelfth Night, Pendragon, IQ, Pallas and Abel Ganz. 'Misplace Childhood' and it's follow-up 'Clutching At Straws' were both big sellers, repaying EMI's faith in the much-maligned band, and the fact that Marillion found any kind of success whatsoever is actually quite extraordinary considering the musical circumstances surrounding them. The Fish-era band(four of which are still in the band at the time of writing, 2010, with lead-singer Mark Hogarth replacing Fish in 1989) can probably be seen as the last great progressive rock band to be accepted by the mainstream, and certainly the last prog band to be associated with a major-label. Since the beginning of the 1990's the band's sound has changed greatly, with their new material completely at odds with their 1980's output, but such is the nature of the genre. After all, it's called 'progressive' rock. These days prog is very much a niche genre made by fans for fans on independent labels. The reformation of several big-name bands from the 1970's golden-era, such as Genesis and Yes amongst others, has shown that their is still much blood in the old prog body, and that the newfound popularity across Europe and America can be attributed, in part, to bands like Marillion who bravely decided to try and re-invigorate the genre in the face of much ridicule after the bloody punk whirlwind had come trashing through the land. Punk, of course, was short, brutish and a rather nasty short-lived phenomenon that momentarily put pay to the genre's big beasts, but the seeds of recovery were sown at the beginning of the 1980's and out of the dark punk forest came Marillion and company, complete with their double-necked guitars and keyboard castles. Unlike their (friendly) rivals, they found worldwide commercial acceptance, and, although thy didn't know it at the time, 'Misplaced Childhood' became the last great hurrah of the progressive rock genre. A true concept piece, it's an album thats well worth a place in any serious prog fans collection. STEFAN TURNER, LONDON, 2010"
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Wednesday, July 14, 2010",
      "rating": 4,
      "text": "I`ve been quite reluctant about writing a review on this album. The reason why is that its great success had both positive and negative effects. The positive ones were immediatly felt: it brought the band (and the neo prog movement) international exposure and fame, something unimaginable for the 80�s. Before Misplaced Childhood prog music was a thing of the past and the new bands were seen by critics and press as something of an anomaly, forever to remain in its small underground place. Now they were on the charts with a number two single (followed by two others). The album showed that prog music was far from spent or dead. A new generation had arrived. Critics went ballistic with that.But it also had negative side effects. In the long run. Misplaced Childhood was also seen by hardcore prog fans as a sell out, Marillion going pop. And I cannot help to think that the prejudice so many people still have against neo prog derives from the fact that Kayleigh was a hit single. This narrow-mindness would be later enhanced by the fact that most neo prog bands were then pressed to follow suit, every recording company asking for its prog acts to come up with something similar. It may explains why so many new groups did try to do it at least once (certainly IQ, Pallas and Twelfth Night tried - and failed). The fact that bands like Yes and Genesis at the heigh of their careers did have hit singles on the pop charts never crossed the minds of those who critize neo prog. Go figure!But what about the album itself? Was it really something (intentionally) commercial? Hardly. The music might sound softer and more accessible, but it is still a symphonic prog album and no one could predict that it would be such hit. In fact the band had to fight with their label to release a conceptual record, something EMI didn�t even wanted to hear about. Concept albums were a thing of the past and nobody could expect it to be welcomed in a time critics still praised punks and accused prog bands of being everything that was wrong with the 70�s scene. Thank God the band prevailed. With this CD they proved the world that prog music was not only alive and well, buit it also had a whole new market.So this CD has a history. And I am a BIG Marillion fan. However, Misplaced Childhood with all its importance is not one of my favorites. to me. Their brilliant debut Script For A Juster�s Tear comes first, Clutching At Straws is second, Fugazi third and then I have Misplaced Childhood.. I still think it is a great album, like everything this group did with former singer Fish. The LP�s first side is simply marvelous. I loved the concept too. It was something quite bold and new for the time. However, the second side was not that inspired and it lacked the tremendous energy side A had plenty of. Besides, the production is far from perfect. So much I liked the live La Gazza Ladra CD version (where they play the whole Misplaced album on the second disc) better.Marillion was a band that it was as important to prog in the 80�s as Yes was for the 70�s. While Fish was on board, they could do no wrong. And I really like this CD with all the flaws I mentioned before. So although I still think it is not their best, it is also a fantastic work, then and now. That�s why I rated it four stars: it is an excellent addition to any prog music collection. Maybe I should give it an extra half star for its historical importance. I guess it is also a classic. But Marillion did even better ones. Thank you, guys. I love you."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Tuesday, November 23, 2010",
      "rating": 3,
      "text": "A very decent album of fresh Genesis material. If only I hadn't grown up on Peter Gabriel, Steve Hackett, and Tony's masterful keys.1. \"Pseudo Silk Kimono\" (2:13) great vocal but those keyboard strings are so dated! (4/5)2. \"Kayleigh\" (4:03) I always liked this song despite its pop formula. (8.5/10)3. \"Lavender\" (2:27) love the way this one builds. (8.75/10)4. \"Bitter Suite\" (5:53) great instrumental intro with Hackett-like guitar leads into Andy Summers texture behind Fish's narrated story prep. Then we transition into a rumba-like dance groove for an excellent Rothery solo (maybe the first one I've ever been impressed by). A little bit borrowed from \"As Sure Is Eggs Is Eggs\" for the next section (which I was expecting to be the song's finale). The final slowed down/softened section is curious--how it belongs--and why it bleeds/feeds directly into the next suite is a mystery to me. (9.25/10) - I. Brief Encounter - II. Lost Weekend - III. Blue Angel - IV. Misplaced Rendez-vous - V. Windswept Thumb5. \"Heart Of Lothian\" (6:02) Really! Getting excited about singing about \"wide boys\"?!?! The continuous wailing of Rothery's guitar feels quite at conflict with Fish's impassioned vocal. They may be expressing their passion about the same thing, in different ways, but it's like putting apples with onions. (8.25/10) - I. Wide Boy - II. Curtain Call6. \"Waterhole (Expresso Bongo)\" (2:12) interesting drum & percussion. Glad to have that guitar in the background: This mix works! Nice dynamic music--and appropriate vocal/lyric. (4.75/5)7. \"Lords Of The Backstage\" (1:52) Not up to the rest. (4.25/5)8. \"Blind Curve\" (9:29) a very well constructed/designed prog epic that helps me see, for perhaps the first time, this band's own unique vision. The talents and personalities still seem very built upon the members of GENESIS, but they've finally come up with a song that, for the most part, feels as if they might be breaking free of the themes and motifs of their inspirateurs. (17.75/20) - I. Vocal Under A Bloodlight - II. Passing Strangers - III. Mylo - IV. Perimeter Walk - V. Threshold9. \"Childhoods End?\" (4:32) What?! Where's the prog? (8/10)10. White Feather (2:23) Oh, good! They found a little more prog (though there's a little FLOCK OF SEAGULLS/early SIMPLE MINDS in here as well) (4.25/5)Total Time: 41:05I like the flow and connectivity of the album (after \"Kayleigh\") and the rhythm tracks are outstanding but the guitar play and vocal performances are often a bit incongruous with the music--which makes me wonder if, at times, the band members are all on the same page; how much tension was there within the band at this time? Even so, the sound engineering is definitely a step up from their debut album (I can hear everything!)B/four stars; an excellent Neo Prog contribution to Prog World."
    },
    {
      "reviewer": "kenethlevine",
      "date": "Posted Monday, November 29, 2010",
      "rating": 3,
      "text": "While the dish isn't quite humble pie, I do have to eat my words to some extent. Now this is preferable to eating Fish's lyrics, which in quantity rival the most excessive American all-you-can- stand buffets. But yes, I must admit this is a good album, and one of the first I have heard from early British neo that points to the better Euro neo that would follow in subsequent decades.The album starts very strongly, with the sinister \"Pseudo Silk Komono\" yielding to the appealing \"Kayleigh\". The latter's verses are magical, as is its lengthy instrumental break, but the chorus is almost tragically uninspired in every sense. \"Lavender\" and \"Bitter Suite\" both share another weak melody, and Fish's observations are no comfort. But the highlight here is the grandiose \"Heart of Lothian\" where the Scots singer one-ups Peter Gabriel and stands almost on his own, notwithstanding continued stalwart support from Steve Rothery. The closing numbers are similarly varied with alternating delicacy and potency.While I cannot deny the import of this disk independent of its colossal popularity, I think \"flawed masterpiece\" might be an accurate description. That is, for fans of this style, it's a TKO, but for those more into a collective approach to prog, \"Misplaced Childhood\" seems anchored around an oversized Fish. Perhaps I should be \"Brave\" and look at the Hogarth era again?"
    },
    {
      "reviewer": "lazland",
      "date": "Posted Tuesday, November 30, 2010",
      "rating": 5,
      "text": "I'm not going to call this album the band's magnum opus, because, in my humble opinion, the next incarnation of the band went on to make two such albums. It is, however, the towering height of both the Fish era and also what we now call neo prog in the 1980's, a monster smash hit of an LP, which, in turn, spawned three incredibly big hit singles, a generation of girls by the name of Kayleigh, and all without face paint on as well!The direction the band had taken in Fugazi, heightened commerciality fused with progressive rock, reached its zenith with this album. Whoever would have thought that a concept album revolving around an autobiographical account of life's ups and downs and societal ills would have been so popular in the era of post punk and new romanticism?Side one has the hits Kayleigh, Lavender, and Heart Of Lothian. The first is pure pop/prog joy. The second is a great poem set to music, although the only minor gripe I have about Lavender is the fact that the single version (which was extended from the album version) features one of the most achingly beautiful guitar solos ever committed to vinyl of all time, let alone by Steven Rothery, and was absent from the album. Hearts Of Lothian is a simple barnstormer of a song, with Fish wearing his heart on his roots sleeve and the band playing as if their lives depended upon it. By this time, they were so massive that the pop video even featured TV celebrities doing star turns. The end of the track slows down to a sensitive backing track with Fish baring his soul to us all.The other tracks on side one are Pseudo Silk Kimono, a slow and thoughtful introduction to the work as a whole, and Bitter Suite, which is a superb progressive ballad and leads nicely into the Hearts track.Side two can comfortably be called the more progressive side, and proceeds to give Fish's, at times, exceptionally bleak view of the world. I remember more than a few letters in music papers at the time bemoaning the fact that at least Roger Waters was old enough to moan about all in sight, whilst Fish was a mere stripling. I find it utterly brilliant, with a relentless pace virtually unchecked throughout.Waterhole leads into a massive rocker, Lords Of The Backstage, one of the finest tracks the band ever recorded. The main epic of the album, Blind Curve. Nine minutes of dark and lyrically poetical symphony. Childhood End and White Feather close the album, in which all of the demons are finally exhaled.There are no standout performances on this. This is the sound of a band playing together at the top of their game and all in the same direction. It all culminated in a fantastic festival called Garden Party held at Milton Keynes Bowl with, amongst others, Jethro Tull supporting to a massive audience. As most of the band have said since, they should have stopped there and rested for a couple of years.This is an essential album, and easily deserves the full five stars. There is not a weak moment on it, and for those who do not own it, it is extremely important to the understanding and appreciation of progressive rock at the time of its release."
    },
    {
      "reviewer": "octopus-4",
      "date": "Posted Friday, December 17, 2010",
      "rating": 5,
      "text": "It's one of the few albums that I don't need to relisten to for writing a review. Also there are already more than 100 reviews so I'll just try to add a few. I remember each word and each note of the whole Misplaced Childhood and I've played it in a cover band when I was young. I still remember to have purchased it together with Soft Machine's Land of Cockayne. Two great albums.Misplaced Childhood is the first Marillion's concept album so exhamining it track by track has a little sense even though \"Kayleigh\" has become a hit single and gave them a lot of popularity. The structure of this album has something of The Dark Side of the Moon. The most rocky track is Waterhole which opens the side B as Money does on DSOTM, and the two final songs Childhood's End and White Feather have the structure of Brain Damage and Eclipse. This is the only pence that I can add to what has already been written about this albumSaid so, the music itself has very few of Pink Floyd apart some Rothary's solos but unlike the two previous studio albums it has also less of Genesis. Fish is in an excellent shape and all the album is very well arranged.Good lyrics and consistent melodies complete the picture.One of the very few progressive acts of the early 80s released very closely to another great concept album: Camel's Stationary Travellers.5 full stars."
    },
    {
      "reviewer": "The Truth",
      "date": "Posted Saturday, January 15, 2011",
      "rating": 5,
      "text": "Genesis clone? Well kinda, they're pretty much their own beast.Misplaced Childhood is one of the best \"album long suites\" ever conceived. Unlike some bands, these guys take their influence (mainly Genesis) and create something totally unique out of it. The product is something truly amazing, this great piece of work.The album itself consists of several shorter songs that flow into each other pretty much seamlessly. Although they are all practically eighties pop music, one can't help but indulge in the beauty that the band creates. With eighties pop music, mind you, one of my least favorite genres of rock music.When you add Pink Floyd, Gabriel-era Genesis, and Van Der Graaf Generator influences to pop music, this is what you get, an amazing record of emotional brilliance that can be easily played on the radio. What a package!I love each listen, 5 lovely stars.PS Will go more in-depth with an edited review at some point."
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Saturday, April 30, 2011",
      "rating": 2,
      "text": "So this is the highest rated Neo-Prog album? Oh lord. My experience with Neo consists of a Marillion compilation, their album Afraid Of Sunkight and an IQ album. After hearing this, I would have to say if I were forced to live in a Neo-Prog world, I would consider myself an IQ man. I wanted to listen to a full Fish-era Marillion album. I went with this instead of Script because I feared that album would be too Genesis sounding and derivative. Well, there is still lots of Genesis influence here, along with some very 1980s commercial rock influences.This went #1 in the UK and featured two top ten hits. The music on this album is hardly 'prog' at all, instead just slightly adventurous commercial 80s rock. Not until the fourth track do you really hear anything proggy. \"Kayleigh\" was a big hit. Not a bad song but very 80s and very poppy. Instead of sounding like Gabriel, Fish instead sounds like Phil Collins solo during the chorus. Nice mid-80s style guitar solo. \"Lavender\" was the other hit. A piano-based ballad that's nothing special to my ears. Very PG-era Genesis sounding when the rhythm section enters.\"Bitter Suite\" has a cute title. Features narration in a Scottish accent; not sure if Fish is Scottish or not or if he's just acting. Interersting drumming in the middle. The last two or three minutes are good but also very Genesis sounding. \"Heart Of Lothian\" is another Genesis sounding song but doesn't really stand out at all. Three distinct sections in this song. \"Waterhole\" is the track I enjoy the most but it's only 2 minutes long. Almost sounds similar to Gabriel solo musically and Peter Hammill vocally. \"Blind Curve\" rips off the opening chords of the Genesis song \"Dance On A Volcano\" in places. The Scottish narrator is back. It's a long song and it's proggy but nothing really grabs my attention. \"Childhood's End\" is a nifty, very 80s sounding song but it's not prog at all. Almost sounds like 80s Gabriel solo in places.After hearing this album, I think I can conclude that Marillion is not a band for me. I haven't heard anything they did since Afraid Of Sunlight so there might be hope yet. My future explorations into Neo will include groups not as popular as Marillion, in the hope that I hear something not so commercial nor derivative. Marillion are the most popular Neo band for a reason: their music is highly accessible and commercial and not very proggy. I'm going to give this a 2.5 but rounded down to 2 stars. Fans only."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Tuesday, December 6, 2011",
      "rating": 5,
      "text": "Marillion's first concept album might be a slick and occasionally saccharine presentation of their sound, lacking the murky depths of the other three Fish-era albums, but it remains a remarkably competent stab at producing an album-length suite of continuous music in the tradition of Dark Side of the Moon and Thick as a Brick. Sure, Kayleigh and Lavender might have been big commercial hits and aren't particularly proggy, but when placed in context there's an edge to them that's lacking if they're listened to in isolation, and most of the other tracks are significantly more arty - though by and large less complex than the material on Script, Fugazi, or for that matter Clutching at Straws.The only major beef I have with the album is White Feather, which feels like a tacked-on sing-along to provide the album with a good track to close concerts with rather than an organic part of the concept; not only is the transition to it from Childhoods End? awkward, but said preceding track does a better job of providing closure to the concept and bringing things full circle. (It's also just not a very good song). But even taking that into account, this is a decent achievement on Marillion's part; it's my least favourite of the Fish-era albums, but I do like it a lot when I'm in the right mood, and really \"least favourite Fish-era album\" is like saying \"least-favourite masterpiece\"; Marillion did not last long with Fish compared with the long and illustrious career they had with Steve Hogarth, but golly did they make every one of those first four albums count."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Sunday, August 4, 2013",
      "rating": 3,
      "text": "Misplaced Childhood lacks the quirky eccentricities of Script for a Jester's Tear, the instrumental drive of Fugazi, and the bleak moodiness of Clutching at Straws. Instead, it's largely a flavorless album devoid of spice. While there is nothing inherently wrong with simplicity, the progressions on this album are bland and wholly predictable. Generally, this is not a progressive rock masterpiece (it's hardly progressive rock), but it does contain some very good music, especially to the ear not put off by 1980s rock clich�s, which this album has in spades.\"Pseudo Silk Kimono\" Stark synthesizer providing a simple development sits beneath Fish's unmistakable vocal.\"Kayleigh\" A saccharine pop song, but a strikingly good one and immediately catchy, \"Kayleigh\" is a light bit of fun in the vein of Toto.\"Lavender\" A childlike, sweet follow up to \"Kayleigh,\" this is again unoffending soft rock. The lead guitar consists of a modest but fitting motif.\"Bitter Suite\" Synthesizer and spoken word open this darker song, which primarily consists of Steve Rothery performing another elementary solo.\"Heart of Lothian\" Passionate and patriotic, this is one of the highlights of the album, featuring a splendid counterpoint between the vocal climax and the lead guitar.\"Waterhole (Expresso Bongo)\" The sixth track picks up with some dark energy, but unfortunately doesn't do much with it, preferring to just peter off into the next track.\"Lords of the Backstage\" Vividly bright, this tune is a major contrast to the previous song.\"Blind Curve\" For the most part on this album, Marillion had been sitting comfortably in syrupy pop music, occasionally dipping a toe into the complexities progressive rock is well known for, but here, the band embraces the compositional involvedness that was more evident on an album like their very first one. The ubiquitous clean electric guitar transforms the chord progressions into even more satisfying entities. The piece drops off into a percussive chasm, one that sounds quite like the very beginning of Genesis' \"Back in NYC\" before moving back into simplistic symphonic rock.\"Childhood End?\" Pete Trewavas elevates an otherwise straightforward synth-pop song with compelling bass playing, and Mark Kelley's synthesizer lead concludes the piece wonderfully.\"White Feather\" The closer is a brief, energetic rocker, and little more."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Thursday, July 17, 2014",
      "rating": 5,
      "text": "MARILLION did something strange on their 3rd album MISPLACED CHILDHOOD. They upped the progressiveness in terms of theme by creating their first concept album that despite being broken up into ten tracks is really two long pieces that flow together. Supposedly based on Fish's acid trip where he had visions of the extremes of life including lost love, sudden success and lost childhood. On the other hand the band decreased the progressiveness and made a more mainstream sounding album in the music department. In fact, do I dare say this sounds like progressive AOR? I certainly don't mean that as an insult because I rather like well developed AOR and it doesn't get any better than the smooth melodic MARILLION magic that is crafted so well on this most successful of their albums. The album is one of the top sellers in their canon and spawned hit singles as well with \"Kayleigh\" hitting the number 2 position on the UK charts.Although MARILLION was accused of blatant Genesis worship from the beginning I find it to be the most true on this album where Fish nails the Gabriel sound more so than on other albums. The swirling synths and guitars bring \"Wind And Wuthering\" to mind and seems like the next logical continuation of that particular sound that they brought back to life. This album is simply a masterpiece of melodic prowess that flows beautifully from beginning to end. I admit that out of the four Fish-era albums that this one is my least favorite but it is one that nevertheless is beautifully constructed in a manner that makes me want to hear it throughout its entirety when I put it on. Liking less is a relative term in which the other surrounding albums are just so outstanding that despite being in fourth place it still deserves the 5 star mark in my world."
    },
    {
      "reviewer": "Modrigue",
      "date": "Posted Thursday, May 12, 2016",
      "rating": 3,
      "text": "A deceptionEven after several listens, I still don't understand why this album is often considered as MARILLION's best and as one of the greatest representative of the neo-prog genre. I do enjoy the other studio records from the Fish-era though, but here the music is a bit too consensual. For sure, the band gained more audience by turning more accessible and radio-friendly with this release, making the compositions less progressive and complex, which isn't necessarily a bad thing. However, despite being the first MARILLION concept album, \"Misplaced Childhood\" is too smooth and do not possess the creativity and the magic of their previous opuses. The evasion and fantasy are still present, but are melted with 80's pop cheesiness.The opener \"Pseudo Silk Kimono\" is a melancholic intro for \"Kayleigh\". This hit single possesses a nice beautiful ambiance, but is ruined by its soapy melody. The poppy commercial \"Lavender\" is also rather boring. The worst track of the record. On the contrary, the progressive \"Bitter Suite\" is one of the best compositions of the disc. It features a spacey introduction, numerous changes and pretty floyd-ian peaceful passages. \"Heart Of Lothian\" is another poppy neo-prog rock song.Then comes the hard oppressive \"Waterhole\", quite surprising with its tribal ambiance. As a transition, \"Lords Of The Backstage\" is forgettable but fortunately short enough to avoid being irritating. The 9 minutes \"Blind Curve\" is the longest and other progressive track, in the style of \"Bitter Suite\". Despite its very nice guitar solo, this composition is average, as it contains lengthy insipid passages. \"Childhoods End?\" is in fact the opposite to \"Kayleigh\": the only good things are the powerful melody and its fantasy finale, typical of the neo-prog genre. Concerning \"White Feather\", this hard FM ender seems rather out of place.\"Misplaced Childhood\" has interesting tracks, but less breathtaking moments than on \"Script for a Jester's Tear\" or \"Fugazi\". The mixture of commercial pop and neo-progressive structures does not work always very well and doesn't provide such evasion as the other previous opus.An overrated album, not the best point to start with to discover neo-prog, especially if you're allergic to 80's FM pop. However, this is still MARILLION with Fish, therefore the result remains overall enjoyable."
    },
    {
      "reviewer": "Matti",
      "date": "Posted Friday, May 19, 2017",
      "rating": 3,
      "text": "Misplaced Childhood represents a significant moment in my music listening history. At the age of 14-15 I was listening to the vinyls of my elder sister and brother, Dire Straits being my first favourite band. There were a bunch of prog oriented early 80's albums too, by e.g. Asia, Saga, Rush, Yes and Jon Anderson that I found interesting. At the time I didn't yet buy vinyls myself, I used to tape music on cassettes. And then I saw this band on TV, it was some New Year's night concert featuring many artists - I don't remember who the others were. I do remember the line \"do you remember\" repeated several times, and the singer had some red paint on his face. I purchased Fugazi as my first vinyl and persuaded my friend to get Misplaced Childhood. So begun my most dedicated fandom period of my life, lasting for a couple of years.Since it feels awkward for me to write a review for such heavily reviewed album, I first thought to write one for the 'Kayleigh' single. I'm getting tired of reviewing singles so much, so here's my very subjective view on this famous Neo Prog milestone. I bought it on CD several years later at the early 90's, but it isn't my favourite of the Fish era, that honour goes to Clutching at Straws. And up to this day my reception of Misplaced Childhood is somewhat ambivalent. Like many other prog listeners, I find it a bit cheesy as a whole, with the super-clean production, sugared synth carpets and sentimental guitar solos.'Pseudo Silk Kimono' is irritatingly all cheesy synths, but it functions as a conceptual mood-setter, followed seamlessly by the radio-friendly song for lost love, 'Kayleigh' (which I have as a ringtone on my phone nowadays!), which is seamlessly followed by another radio-friendly love song, naively romantic 'Lavender'. What is this? A potpourri of pop songs? Luckily, 'Bitter Suite' and 'Heart of Lothian' are multi-part compositions with various moods. I love the quietest, more mystified parts (\"A spider wanders aimlessly...\", and later, \"It's getting late for scribbling and scratching on the paper...\") whereas 'Blue Angel' and 'Wide Boy' sections are really cheesy, especially for the guitar solos. On the next album there's a lot more diversity in guitar and keyboard sounds. Is Misplaced Childhood perhaps over-produced in a way, emphasizing the sentimental concept?The album is practically two side-long, pauseless entities, and that's definitley one of its strengths. The second part (side of the vinyl) contains the ultimate highlight, but there are also songs that feel like fillers to me. 'Waterhole (Expresso Bongo)', terribly boring. 'Lords of the Backstage' is refreshingly bold and bright. 'Blind Curve' is a magnificent journey into deep, sore emotions, and finally there's new blood on guitar parts too. The melody in 'Mylo' is spellbinding, and the creepily quiet section 'Perimeter Walk' gives goose bimples. Unfortunately the 'Threshold' section returns to the cheesiness and the similarily wailing guitar solo by numbers heard on the first side. 'Childhoods End?' is a fine, sunny and powerful catharsis after all the dark emotions the concept album has gone through. The synth solo at its end sounds very Genesis-like. But for me 'White Feather' is a boring anti-climax.This is definitely an important album, but the certain weaknesses and the overall cheesiness make me round my 3� stars downwards. This is not to say I wouldn't understand five-star ratings perfectly well!"
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Wednesday, January 30, 2019",
      "rating": 5,
      "text": "Marillion with this Lp record a prog classic with minimal arrangement effort and maximum commercial feedback. \"Misplaced Childhood\" is a concept album that develops as a single suite, and Marillion would have liked to be just a suite like \"Thick As A Brick\", but the record company has imposed them to indicate each song.The first side opens with \"Pseudo Silk Kimono\" (2:13, vote 7+): slow, meditative, based on the keyboards. A good preamble to the second song, the most commercial of the album, \"Kayleigh\" (4:03, vote 7,5/8): strophe, refrain, guitar solo, strophe, refrain. Here are the Marillion: commercial melodic rock, great cleverness, purring sound, with a soft production. The drums have a good, full sound (Ian Mosley); guitar is very fluid, thin, not at all heavy; good bass (Pete Trewavas) and good keyboards; voice like Gabriel's, but more nervous, snappy. No more instruments than the four of the typical rock complex. Production of the album completely homogeneous, arrangements without any real alternative to the guitar solo (Steve Rothery). Yet it works. It works very well!There is nothing really brilliant, innovative, particularly original, such that I can say: this is a new form of art, they have the gift of pure talent. Marillion are very epigonic of Genesis, Yes, Pink Floyd... But they can processed them obtaining an excellent synthesis. Marillion can get the best with the least amount of effort. Because if it's true that they don't have that quid of the gifted, it is equally true that they don't have the typical defects of progressive. In fact, the sound, considering that we are in the mid-eighties, is good, clean but good: it's not muffled, it doesn't have the usual defects of the eighties. The group has no virtuosos, and they doesn't linger in solos: it's the synergy of the instrumentalists that produces the result. This is true team play. The compositions are synthetic, they go straight to the point, with excellent progressions, without wandering, without getting lost in the cerebral masturbations in which many bands are forwarded when they prolong dramatically a song with endless variations on the theme. Marillion put a lot of meat into the fire, don't digress, and with a purring sound, express emotions through music, voice and lyrics. For example, the transition lines on the piano (Mark Kelly) between \"Kayleigh\" and \"Lavender\" (2:27, vote 8,5) by itself is much more inspired than entire records of some symphonic rock groups (I don't name them!). Lavender's progression with its epic melody reaches climax, and represents the highest point on the album. Too bad that Lavender ends after only two and a half minutes: they had to prolong it another minute, as they did with the single record!They sacrificed the song for the suite, in fact Lavender fades into the recited suite (\"Bitter Suite\", 5:53; Vote 7,5/8), which creates a variation at the usual rhythm punctuated by drums, vocals, guitar solos. But here, after the recitative, the rhythm returns and the guitar plays again the Lavender melody. Finally, the rhythm changes, there are some excellent instrumental passages, the voice of Fish is not beautiful but it's very expressive, the singer knows how to do it, puts his heart (and we feel it!), it's not the cool virtuosic song of some prog groups, here we are close to classic rock given the synthetic capacity of the composition, the classic arrangement and the pathos transmitted. And so we approach \"Heart of Lothian\" (6:02, vote 8+), with a very evocative progression, which then flows back into the epic mood, touching another climax, yes, \"I was born with a Heart of Lothian\", sings Fish, with an anthem rhythm that would be an exceptional stadium song. And in fading the first side closes. Great. Short, inspired, pimp, catchy, yet without tricks, without overdoing, direct. They know how to do it, they will not be geniuses, but they can compose music of excellent quality, and play it and interpret it with the heart, obtaining great pathos. Vote side A: 9.The second side is slightly smaller, more homogeneous, more rhythmic and less melodic, based on a long central piece. The first two short pieces (Waterhole -Expresso Bongo- 2:12; Lords Of The Backstage -1:52; vote 7,5) are the same song with a change of rhythm, the drums are always present, sometimes they may be slightly lumpy, but the voice of Fish and the guitar by Rothery act as a counterpoint, and so we get to \"Blind Curve\" (9:29; vote 8+) that towards half stops the beating on the snare to make room for a guitar phrasing that echoes to create an evocative atmosphere where finally the voice of Fish in one of his dramatic \"crescendo\" finally arrives at the climax (the only one on the second side), asking, desperate to have his childhood back, childhood that he can not find anymore. Then the rhythm starts again, and Blind Cruve end playing again the epic Lothian melody by guitar; then Rothery intones another rhythm, always very strong, as in all the second side, to propose another classic rock song, \"Childhood's End?\" (4:32) which has a good crescendo, even if it doesn't reach the climax.The last piece (\"White Feather\"; 2:23, vote 7), as indeed the last fading movement of Heart of Lothian, is not particularly significant, it is functional to the text. Vote side B: 8,5.So this short album closes, which runs away perhaps too quickly but without a weak moment. The fact is that you listen with pleasure, without effort, and never get bored, despite you find always the same arrangements. I bought this record when it came out, in 1985, I was a teenager, and sounded hypnotized by Lavender, Heart of Lothian and Kayleigh: I liked the record right away, that melodic rock punctuated by a pulsating drums, a gritty voice and solos guitar was immediately addictive to me, I really felt the epic of the moment. The second side has no successful singles like the first, it is less varied, but holds well. It is a miracle how they can achieve such high results without doing anything truly original, but the beauty of this music consists precisely in its usability, in the synergy that is created between the melody and the sound of the group. So, what rating to give? It would be more a four and a half stars that a five- stars, because the vote would be more an 8.5 / 9 than a 9 (in my particular ranking the 5 stars start from the vote 9). But I see the representation of Marillion for neo-prog and I see the pleasure I have listening to this album, soI give vote album 9. Rating: Five Stars."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Friday, June 7, 2019",
      "rating": 5,
      "text": "Review N� 261'Misplaced Childhood' is the third studio album of Marillion and was released in 1985. With its lush production and mix, this album became the greatest commercial triumph of the band, especially in Europe where the group raised the peak of their fame and became known as one of the most famous progressive rock bands in the world. It was also their most commercially successful album, reaching the first position in the U.K. charts and spending a total of forty one weeks on the chart, the longest chart residency that a Marillion's album ever got. It was also a very successful album in U.S.A. The band even made a tour with Rush as a support act. In short, this was really a truly successful album, really.The album featured also the most successful single of the group, 'Kayleigh', which reached the second position in the list of the most commonly listen in U.K. and was a worldwide success too. The name of the song was conceived by Fish slightly disguising the name of an old girlfriend of him, Kay Lee, on which the song was inspired. 'Lavender' was another song that was also released as a single and it was also a great commercial success. It reached the fifth position on the chart. Much of the song titles contain autobiographical references. For example, 'Kayleigh', as I said before, and 'Heart Of Lothian', an explicit reference to a traditional region of Scotland, in Edinburgh, where Fish was born.'Misplaced Childhood' is a conceptual album, the first conceptual album released by the group, consisting of a continuous piece of music. Armed with a handful of lyrics born out of a self confessed acid trip, during 10 hours after consuming LSD, Fish came up with this very well elaborated concept for the album. The story of the album is essentially about lost loves, sudden success, acceptance, lost childhood and it has surprisingly an upbeat ending.The line up on the album is Derek Dick 'Fish' (vocals), Steve Rothery (guitars), Mark Kelly (keyboards), Pete Trewavas (bass) and Ian Mosley (drums).'Misplaced Childhood' has ten tracks. Because this is a conceptual album, the music moves and flows continuously. The music is very fragmented. Most songs consist of short themes tied together in a remarkable way. The lyrics are even more fragmented and because of the personal nature they're pretty difficult to interpret. 'Pseudo Silk Kimono' is a short introduction to the album. Mellow synthesiser tones, a warm bass and a guitar hinting in the back, that's all that accompanies Fish's soft whispering voice. As the synth tones of 'Pseudo Silk Kimono' fades, the guitar intro to 'Kayleigh' starts. The lyrics for the song were considered too much personal by the band. This is a classic prog ballad, a sad invocation for regret and self blame. A piano segue connects 'Kayleigh' and 'Lavender'. This is one of the most original songs in prog rock history combining a traditional English nursery rhyme with classic rock components. It's magically transformed into a touching love song where the sentiment of beauty is masterfully captured. 'Bitter Suite' is one of the lengthiest and more complex songs on the album. This very fragmented song starts with a very ambiguous little poem. It's brooding and dramatic, with multiple sections and with a very beautiful piano ending. 'Heart Of Lothian' was the last song chosen to be released as a single. It's a pretty straightforward rock song. The lyrics are about Fish's nationalism, proud to be a Scots. It's catchy and irresistible. It has cohesive keyboards and drums, catchy guitar riffs, strong bass lines and Fish's dramatic voice. 'Waterhole (Expresso Bongo)' is very aggressive, lyrically and musically. It starts with menacing keyboard tones before drums kick in and a high paced rock song full of percussion. 'Lords Of The Backstage' is another high paced rock song. This song deals about the poor combination of love and life on the road. The music quietens again for the epic on the album, 'Blind Curve'. It's again a very fragmented song like 'Bitter Suite'. Rothery takes over with one of the most beautiful guitar solos. 'Childhood's End' is a sweet song. Trewavas playing is superb, keyboards also make an important part for the song and the strumming playing of Rothery's guitar would become his trademark for years. 'White Feather' is a great song to close the album, very energetic and dynamic.Conclusion: Besides be their most commercially successful album, 'Misplaced Childhood' is, for me and without any doubt, their best studio album until today, and is also, in my humble opinion, one of the best studio albums ever made in the progressive rock music. Even the former drummer of Dream Theater, Mike Portnoy commented that this was the best Marillion's album of all time. With 'Misplaced Childhood', Marillion proved they weren't a clone of Genesis and with it they reached the status of be considered one of the best progressive rock bands ever. 'Misplaced Childhood', put Marillion on the same quality level of Genesis, Yes, Pink Floyd, Gentle Giant, King Crimson, Jethro Tull, Van Der Graaf Generator, Camel, Emerson, Lake & Palmer, Rush and Dream Theater. It put them as one of the greatest and most influential prog bands of ever too. If you don't know the band yet and want to buy a Marillion's albums, this is the best.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Friday, May 22, 2020",
      "rating": 5,
      "text": "Misplaced Chilodhood is one of those albums in which it seems that everything a group wants to transmit, it achieves from start to finish in a sequence of songs that maintains a level that does not decline, and the pauses that are few, only serve to take a bit of air and continue on the journey that these neoprogressive giants invite us to take. In my opinion, the highest point of the album is located in the sequence that goes from Lavander, going through Bitter Suite and finally Heart of Lothian, which incidentally marks the end of side A. Probably Kayleigh, is the best-known song by Marillion by all, and in fact it is excellent, but I think the previous 3 are one step up. Excellent guitar playing by Steve Rothery, with a smooth and velvety style, as well as intense and deep, which marked the neoprogressive genre onwards, the Mark Kelly keyboards that I consider were its highest point, and the excellent vocal performance of Fish , proud adoptive son of Peter Gabriel. The genre had a before and after, marked by this album, from it a whole new current was generated that still flourishes today."
    },
    {
      "reviewer": "A Crimson Mellotron",
      "date": "Posted Wednesday, August 21, 2024",
      "rating": 4,
      "text": "It is on 1985's 'Misplaced Childhood' that Marillion truly saw the stars line up, the former becoming their breakthrough album, a success both commercially and creatively, though some might argue that the band has released stronger and more coherent records after that What is certain is that 'Misplaced Childhood' saw this inevitable maturation of the neo-prog giants and skyrocketed them into the realm of the mainstream. Gone are the days of the gothic undertones, for what concerns the music, of course, as the strikingly vivid and profound lyrics of Fish only seem to be getting better with every release. The same could be said about his vocal performances, too. In a successful and compelling crafting of a more recognizable identity, while armed with a new produced, Marillion seem to shake off the symbolic dust of classic prog, as this album has an explicitly more accessible and streamlined sounds than its two predecessors, producing three fantastic singles, one of which a super-hit.Does not the jester escaping from the window on the back side of the album's sleeve depict precisely this shift in the band's sound, this maturation that sees them embrace a much more authentic artistic presentation? A loose concept album focusing on Fish's childhood, the band finally let the songs flow into one another and manage to put out quite a concise and straightforward album, much in the vein of the classic rock albums of the previous decade. Heavily leaning towards being a very exemplary pop album, this is the record that finally sees Marillion embracing a more outstretched palette of influences. Staying true to their own style, however, the uplifting poetry of the words to the songs navigates the listener on a memorable sonic journey all throughout. The record does suffer a little bit from the hits overshadowing the other shorter songs, but the two longer pieces are great, with 'Bitter Suite' being especially good. A very important album that had put Marillion on another level."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album503e.html",
  "last_parsed": "2025-05-18T00:09:17.729670"
}