{
  "album_title": "MIRAGE",
  "artist_name": "Camel",
  "artist_page_link_local": "artist0c98.html?id=50",
  "year": 1974,
  "rating_value": 4.42,
  "rating_count": null,
  "review_count": null,
  "genre": "Symphonic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/50/cover_4930226112010.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Freefall",
      "duration": "5:47",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Supertwister",
      "duration": "3:20",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Nimrodel / The Procession / The White Rider",
      "duration": "9:12",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Earthrise",
      "duration": "6:42",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Lady Fantasy",
      "duration": "12:46",
      "is_sub_track": false
    },
    {
      "number": "a",
      "title": "Encounter",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "b",
      "title": "Smiles for You",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "c",
      "title": "Lady Fantasy",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 6,
      "title": "Supertwister (live) (3:14) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Mystic Queen (live) (6:09) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Arubaluba (live) (7:44) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Lady Fantasy (original Basing Street Studios mix 1973)",
      "duration": "12:59",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Thursday, February 5, 2004",
      "rating": 4,
      "text": "this as good as Camel gets but I never was nuts about this band . Being a non-cigarette smoker, I never really like the concept of this album cover . The music is still exciting and fresh but sometimes slightly clumsy for the goal and ambitions they were trying to reach."
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Monday, March 15, 2004",
      "rating": 4,
      "text": "2nd release from CAMEL which I would rank as one of my favorites from their discography. Heavily rooted in their classic sound, \"Mirage\" is a great exploration into CAMEL's soft instrumental passages and sonic harmonies. There are not any thunderous crashes or loud bangs on \"Mirage\" which instead work on warm and soothing space textures. The classic CAMEL line up is present (Bardens, Ward, Latimer and Ferguson) who perform to their best standard! \"Mirage\" contains 2 epic tracks (\"Nimrodel The Procession The White Rider\" and \"Lady Fantasy\") which are given lots of space to explore a fine range of dimly lit moods and melodies. Song are superbly crafted and contain some of CAMEL's most treasured musical moments."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Wednesday, March 24, 2004",
      "rating": 5,
      "text": "I remember the day I bought this album,a weird guy with a red beard recommanded me the record. I was suspiscious. You know, just like when your mom askes you not taking bonbons from a stranger. I kept the bill, in case...and threw it away 15 minutes later. Impossible (and I'm choosing my words here) to regret buying that record.2 numbers are getting my constant attention: The song about the Lord of the Rings (track 3) and Lady Fantasy. In the last one, I love the way they end up the song the way they open it. It's basic, but surprinsingly effective (killer guitar riff...makes your eyes watery).Latimer also proves himself to be a skilled flautist. This guy is a very very very underrated musician. And you know why? In part (theory) because he has no charisma. But the good thing is that the bands with no charisma (Trace, Focus, Anglagard) is that they get down faster to buisness. And we like that , right? Anyway, thanks tho the red beard guy.Are you a newcomer in progressive rock? You want to chip in but don't know where to start? This is a wise and long lasting choice. This record is oldy THE soft spot in my heart. It's heartwarming, it's catchy, jazzy and don't waste one minute on filling. It fell in the cracks of obscurity, but buying it (remaster version has cool bonuses, for a merely 20$) is making a long time commitment.Catchy tunes, great guitar lines, effective and tasty keyboards and a song about the Lord of The Rings, this record will blow your freakin' mind off. It did for mine, and I'm still perfectly mornal...er narmol...normal (there you go)."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Wednesday, March 31, 2004",
      "rating": 4,
      "text": "By means of this mature album \"Camel\" demonstrate their talent and good ideas as well for the first time... of course a \"melodic prog band\" They are, never tiring and sometimes very captivating (listen to the splendid \"Supertwister\", a jewel within the so called \"light style of Canterbury\") and for this reason -during this phase. They already were talented. Nevertheless they never performed too many bombastic solos, except on some tasteful solos by Mini-Moog synthesizers and good music passages characterized by a simple choice of themes and a remarkable variety in dynamics as well in some circumstances!The last mini-suite \"Lady Fantasy\" is an ever-green; instead \"Earthrise\" shows the best style regarding both the technique of the unforgettable Peter Bardens and the simple harmonic solutions of Andy Latimer at his guitar, enriched with a good range of effects!! This is not the best album by CAMEL but naturally is one of the most famous and powerful works as well...!Recommended anyway!!"
    },
    {
      "reviewer": "greenback",
      "date": "Posted Thursday, April 8, 2004",
      "rating": 4,
      "text": "This second album is still very rock, with tons of aggressive guitars, keyboards, fast drums and bass. The keyboards are still basic: mostly aggressive organ and Doors-like organ. The best track is \"Supertwister\", a wonderful instrumental track full of sentimental flute and Fender Rhodes: there are many rhythm changes. At the end, you easily believe that the poured liquid is very hot. The electric guitar can be very rhythmic, trying to follow the fast drums and bass. The ensemble is very progressive, loaded, but we feel here their style is not really anchored yet: sometimes they are still too much near the prog hard rock, like those guitar solos on \"Lady fantasy\". This album has really the Canterbury style. Some parts are in the right direction: the first part of \"Nimrodel\", where the guitar sounds like Focus, tend to give the future characteristic sound of Camel. We find many rock elements here that are present on the first album.Rating: 4.5 stars"
    },
    {
      "reviewer": "Prognut",
      "date": "Posted Friday, April 9, 2004",
      "rating": 4,
      "text": "A classic....Camel intricacy started to mature in this second album. Synphonic touches, but mainly I would place this one right in the middle of Canterbury style. I always liked Camel, and this CD is a gem on my collection..agree!!..not the best one, but one very close to be. This is one of the most mellows albums of Camel all around, and not the first one to own if you are a newcomer..you may consider to start with anything from the 80's and then work your self backwards. For the progheads fans, nothing really to add...!!:-) You probably already own this one. Recommended!!!!"
    },
    {
      "reviewer": "daveconn",
      "date": "Posted Saturday, April 17, 2004",
      "rating": 5,
      "text": "This is the CAMELshair smoking jacket I slip into most often, well worn over the ages and sculpted to my musical temperament like a certain pair of jeans in need of a patch. The band had obviously settled on what sort of music they wanted to make with \"Mirage\", and it's palpably progressive at every turn, shrouded in a magical mist that falls and rises with the needle. The sleepy vocals, carried on the winds of a magnificent mellotron and buttressed by the bass and drums, conjure a waking dreamstate that few albums can match. This\" Mirage\" first takes the form of \"Freefall,\" whose seductive siren's call simply smokes, followed by the instrumental \"Supertwister\", featuring Andy Latimer's heretofore unheard (and otherworldly) flute playing. It's all leading up to the two-part \"Nimrodel\", a transcendent retelling of GANDALF's reappearance as the white wizard that remains my favorite journey in all of CAMELogue.For this heroic feat alone, CAMEL could count itself minstrel-kissed through the ages. \"Earthrise\" shakes off some of that sleepy, far-off land with a sweaty workout that finds Pete Bardens' brilliant organ working overtime while Andy Ward attacks his kit with unrelenting energy. The three-part \"Lady Fantasy\" would seem to continue in this vein, but soon slides effortlessly into a mesmerizing melody spiced with keyboard commentary from Bardens that beats down The DOORS' hallowed path. If I were assembling the Gods in order, a task best left to presumptive chess players, \"Mirage\" would appear near the head of the receiving line for progressive initiates.The entire album bespeaks what's best about the genre: a self-sustaining musical world where fantasy is the reality and the strings of man remain unseen. CAMEL provides a different ride than the great carriages of the immortals (YES, GENESIS), using softer strokes in lieu of striking genius, but \"Mirage\" is no mere illusion of prog heaven, it's the genuine article. So climb aboard and strap yourself in for a ride you won't soon forget."
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Sunday, May 9, 2004",
      "rating": 4,
      "text": "An oasis of musicOnly their second album, yet the music here shows great maturity when compared to the first album \"Camel\".The standout tracks are the two long pieces, \"Nimrodel etc.\" and \"Lady fantasy\". Andy Latimer's guitar work is beautiful and profoundly atmospheric throughout. How many other bands could have benefited from having a guitarist who could make their guitarweepso gently? Peter Bardens is more adventurous on keyboards, throwing in some interesting mini-moog solos.The other tracks are less worthy of note but are nonetheless finely crafted pieces of quality prog. In all a very enjoyable album, which included several tracks which would serve them well in live performances for many years.The 2002 remastered CD includes four bonus tracks, two of which are live recordings of tracks from the \"Camel\" album, one is a brief live version of \"Supertwister\", and finally the original studio mix of \"Lady fantasy\". While the bonus tracks are by no means essential, the audio quality of the remastered album is excellent."
    },
    {
      "reviewer": "Chris S",
      "date": "Posted Monday, June 21, 2004",
      "rating": 4,
      "text": "Talking about branding? This album had it from the day it was released, not to mention a bit of a messy lawsuit from the cigarette manufacturers. It is a very solid follow up to the first album and has something magical about it right from the start. Perhaps it is that perfect blend of keyboard and guitar, either way it is so well produced and spatially defined it is hard to actually strip out any individual track. It is a classic but I still think their best was yet to come.What I found most hilarious was that one of the previous critics above actually dismissed the album in the main because he was anti-smoking...thanks for the chuckle"
    },
    {
      "reviewer": "The Prognaut",
      "date": "Posted Tuesday, June 29, 2004",
      "rating": 4,
      "text": "Necessarily, in order to be exposed to the radiation of symphonic prog rock and to the pure essence of CAMEL, you have to get yourself immersed into \"Mirage\". I happen to be incontrovertibly meticulous with this very recording because it doesn't remind me of anything I have already listened to or it doesn't resembles any particular sound contained from what it was to come within the CAMEL years. The distinctive part of \"Mirage\" and the one that makes us remember this mid seventies jewel, is undoubtedly \"Lady Fantasy\": an incommensurable piece that drags us all along through its more than 12 minutes of the most pure and selective guitar playing by Andy LATIMER, through what to my concern is the greatest piece of work by Pete BARDENS achieved with the band on keyboards, and obviously, the exceptional well orchestrated conceptual context the suite overdrives by itself.Sometimes I think of \"Mirage\" as the medullar point of departure of the band to take on their next subsequent productions. Without this album on the CAMEL scene, I severely think we won't be able to understand some other sparkly passages of their songs like the ones composed and arranged to be included in \"Pressure Points\", \"Harbour of Tears\" and \"Rajaz\". These albums are all for one, irremediably we cannot conceive one without the other and this is not just my conceitedness speaking, it is my true belief that somehow we cannot think of this English band without recalling such classic recordings.\"Mirage\" is essential to any prog collection. It works both ways: for all of those people out there that are eager to start taking their first footsteps into the prog way, and for the devoted progholes that already haven't came across this unmistakably wonderful diamond."
    },
    {
      "reviewer": "frenchie",
      "date": "Posted Sunday, July 11, 2004",
      "rating": 3,
      "text": "After mainly listening to symphonic prog rock bands like Yes, Pink Floyd and King Crimson i thought i would give camel a try after reading the good reviews of this album. Mirage is an impressive album yet i was a little disapointed at the lack of exploration on this album. All of the prementioned bands tend to have vast amounts of explorational soundscapes on their songs with no limits, including many different styles, instruments and experimentation, which i believe to be one of the most important features of progressive rock. Mirage does have some of these elements in songs like \"Nimrodel\" and \"Lady Fantasy\" but i still found these songs very lacking in any direction.Still, i am new to camel and was impressed by what is here. I especially enjoyed the keyboard and flute duo on \"Supertwister\". This is a decent instrumental and keeps the flow of the album going. The singer isn't too special. i found his voice to be dull, flat and he doesn't really stretch his voice. It was a shame to hear the lack of emotion in Camel's songs. The guitar work is excellent here, especially in the guitar solos. This is one of the most solid guitar based symphonic albums i have heard yet it still isn't enough to keep me gripped.\"Lady Fantasy\" is probably the best track on the album and it has clear progressions within the song and is very consistant but i think they could have made it flow better as it sounds patchy in areas. Altogether this is a very enjoyable album, but it feels very claustrophobic and is rather limited compared to bands like Yes and Pink Floyd."
    },
    {
      "reviewer": "Certif1ed",
      "date": "Posted Wednesday, September 1, 2004",
      "rating": 5,
      "text": "Not a Mirage - the Real Thing!A masterpiece of prog if ever there was one.From the punchy opening of \"Freefall\" to the sublime \"Lady Fantasy\", classic Camel at their very best! A cliche, maybe, but generally we use cliches because they work and, in this case, there's no other phrase that best sums up this wonderful album.So, on with the smoking jacket, up with the volume, and pour a dram of the finest Scotland has to offer and relax as we take a journey through the rock machine that is \"Mirage\".\"Freefall\" lives up to its title perfectly with twisting, turning, free falling chunks of pure magic, Bardens and Latimer duelling gently, Ward and Ferguson providing solid support and rhythmic counterpoint. As usual, I'm not too sure why Camel thought that lyrics were necessary - but the vocal lines are fairly amusing if you take them tongue-in- cheek as I'm sure they're intended!\"Supertwister\" again shows the lengths Camel would go to dream up apt titles as it snakes and turns through various time signatures and keys, each one more breathtakingly beautiful than the last, Latimer picking up the flute for his Bardens challenge on this outing. The flutter-tonguing at around 1:30 has to be heard to be believed - you'd swear birds were flying out of your speakers! Somehow this track is only 3:20, yet packed with incredible ideas - you simply wish it were 10 times longer.Then we open a beer in time for \"Nimrodel\" ;o)A drop-dead gorgeous exotic sounding mellow opening raises the curtain for the bells and crowd noise of \"Procession\". I know nothing of how this amazing little mediaeval- style march was put together, but it's over too quickly, and \"The White Rider\" takes us on a spacey journey of discovery, replete with oboes and, of course, flute. There are unbelievably more twists and turns, key changes, surprise cadences and powerful melodies in this one track than on the average Genesis album... OK, I'm posiibly getting carried away, but words are not quite enough to describe the joys of this track, so what I've said will have to suffice :0). Have fun working out which literary figure is \"The White Rider\" (it's not hard).If you have the vinyl version, then it's at this point you realise with utter delight that you have another side to go - but how could it possibly get any better?The answer comes as soon as the needle drops - Camel are well into the prog groove on this album, and the classic \"soft sixths\" sound re-establishes itself after a twinkling spacey introduction, with Ferguson providing gorgeous fat bass as usual before revisiting the slightly funky groove the band established on the first album, and also the slightly darker, muddier textures - which work a lot better on Mirage than on the debut, showing a remarkable growth in the band's style. Latimer demonstrates how to noodle in reverse AND keep the noodling relevant to the music - is there no end to this man's talent? Bardens then demonstrates his equivalent keyboard skills to provide perfect balance. Just as you get to feel that this is pretty much free form, earlier sections are revisited, giving a satisfying structuredness to the whole composistion.\"Lady Fantasy\" is neck-hair raising proof that the best was saved for last. I may have enthused about the earlier tracks on this album, but I cannot even begin to describe the sheer beauty of the melodies, structures, timbres, rhythm and harmony of this track... I can even overlook the melancholy vocals (never a highlight of any Camel song)... \"Lady Fantasy\" is packed full of moments that make me want to jump out of my cosy armchair and shout \"Yeah!!!\" - but fortunately I'm a restrained kinda guy, so won't subject you to that.It's a Masterpiece alright!"
    },
    {
      "reviewer": "Blacksword",
      "date": "Posted Friday, September 3, 2004",
      "rating": 4,
      "text": "Camels second album should be in every rock collection. Latimer & Co produced a classic album here, which I guess partly thanks to the sleeve artwork would never be forgotten. But, there's nothing wrong the music, infact compared to their their worthy, though slightly flawed debut, Mirage is an excellent work. 'Freefall' opens the album. Its upbeat, quirky, full of twists and turns and spiralling guitar licks. My only objection is Andy Latimers decision to sing over it. Camel always knew their strength was in instrumental music, and thats what they should have focussed on in these early years. Nevertheless, Latimers singing is sensibly kept to a minimum and the song drives head long with energy and confidence. 'Supertwister' follows with its changing time signatures and its flute flurries. A lovely piece of music, which leaves you in restfull mood before 'Nimrodel' A few prog traditions come into play here. The marching sequence in 'Procession' is reminiscent of 'The battle of Epping Forest' by Genesis. Then when 'White Rider' comes in, I'm reminded of Pink Floyd. I may be painting a picture of plaigerism here, but take my word for it, you can tell they are not ripping anyone off. This is distinctly Camel and no one else. This is confirmed when Latimers clarinet plays some very haunting melancholic melodies.Both 'Earthrise' and 'Lady Fantasy' are great pieces of music, although I've always felt that they could have done something a little more adventerous and less repetitive in the middle section of 'Earthrise' Latimers guitar playing and Pete Bardens keyboards are often at the centre of Camels musical world and wishing no disrespect to Andy Ward and Doug Ferguson, their contribution tends to be ignored. I can safely say that they worked hard to make this excellent album."
    },
    {
      "reviewer": "chessman",
      "date": "Posted Sunday, February 20, 2005",
      "rating": 3,
      "text": "Isn't it strange how opinions change over the years? I remember in the mid seventies, when Camel was just coming to prominence. They were considered by many prog fans as distinctly 2nd division, when compared to the 'big boys' such as Yes, Pink Floyd, Genesis, and even ELP. That is how I used to feel about them myself when I listened to my mate's albums. He had this one, and Moonmadness. Last year I decided to give them another go and bought the remastered versions of both albums. Now I can only comment on these two albums as I don't possess any others, (Although I have heard the odd track, such as Ice,and a couple of things off \"Harbour Of Tears\"), but these two are considered amongst their best, so... I have to say that my opinion hasn't changed one little bit! Camel produce pleasant, professional music and are a consistent, hard-working band, but their music doesn't do anything for me. I think the cause of that is simply they are not distinctive in any way, lots of bands formed around that time sounded similar. The music doesn't stick in one's mind for long, and even the titles confuse me sometimes! Peter Bardens' keyboards are very good, and Andy Latimer's flute is distinctive, and adds a nice touch to it. But compositionally there is nothing to prevent me considering this as background music. For instance, the opener here, \"Freefall\", tries to be aggressive, but ends up sounding amateurish and disjointed to me. The second track is far better. \"Supertwister\" has the nice flute and is far more gentle. Likewise the third track is well enough played and presented, but the last two are very ordinary and mundane to me. Latimer's guitar, whilst well played, doesn't have a distinctive personality, and it could be a number of seventies guitarists playing when I listen to it. He is technically precise, but hardly inventive, and even sounds quite dated now, as opposed to his peers, such as Howe and Gilmour. I apologise if this review goes against the views of most Camel fans, and I know their following is loyal, but they just don't stand out to me. Vocally they are suspect too, something like an inferior version of Floyd. On the remastered version I possess, there are 4 bonus tracks, three of them live, but these neither add, nor subtract from the enjoyment of the disc. In fact, they go on a tad too long and one can find oneself waiting for the end to come. Don't get me wrong, as I said at the start, this band is a decent, hard working act with a good following, who produce pleasant and technically efficient music. For me, where they fall down is in the bland and unmemorable compositions, and the weak, almost apologetic vocals. Of the two discs, Moonmadness is distinctly better, having stronger songs, but this one is worth a listen as well. Nice, but not essential. Fans of the 'big' prog bands will probably smile and dust these off once in a while for a nostalgic listen."
    },
    {
      "reviewer": "Trotsky",
      "date": "Posted Sunday, February 27, 2005",
      "rating": 5,
      "text": "As far as I'm concerned this album is the ultimate expression of the talents of Camel's classic line-up of Latimer, Bardens, Ferguson and Ward. A dramatic improvement over Camel's enjoyable first album, Mirage is the ultimate answer to the band's many critics.It kicks off with the fiery largely instrumental Freefall. Dominated in the begining by Andy Latimer's guitar, it contains some nice moments from organist Peter Bardens as well. The vocals, which admitedly were flawed on the first album are exactly what's needed to set the careening tone of this pulsating track.Amazingly Latimer didn't play his flute on the first album, but when one hears the intoxicating Supertwister it's instantly clear that he's a wonderful player. The seriously underrated rhythm section of bassist Doug Ferguson and drummer Andy Ward also show their skill as they negotiate a delicate, complex piece that ranks among my favourite instrumentals of all time.The monster Tolkien-influenced track Nimrodel/The Procession/The White Rider is another thing of great beauty. It commences with some eerie keyboards that fade into a skillful flute-dominated fanfare before the main part part of the song kicks in. A moody, ethereal melody about the travails of Gandalf then unfolds before Latimer launches into a lovely quintessentially Camelesque solo, with the trademark jazzy chords, slow build-up and gloriously melodic choice of notes. Bardens then takes over with a daring Moog synth (or is it an ARP?) solo that will take your breath away if you have even an ounce of soul within you (it might just get my vote for Camel's greatest- ever moment). A return to the vocal melodies then follows before the track closes with a dark almost metallic riff that sees Latimer wig out like never before with an effects- laden solo.Mirage's fourth track Earthrise is a lengthy instrumental that starts off with some jazzy tones before moving into some high-octane instrumental exchanges between Latimer (who might just overdo some of his guitar \"frenzies\"). Being merely a very good track, Earthrise is the cut I enjoy least here.The album concludes with another indisputable Camel classic ... Lady Fantasy. Moody intro, melodic vocals singing melancholic fantasy lyrics, a brazen keyboard solo, a dramatic tempo change which Latimer graces with some glistening guitar leads, and beyond the solos, some of the most heart-breaking memorable melodies I've heard in prog-rock, a virtual fade-out into atmospheric guitar swells before the vocals return, and then Camel catches fire with some hard rockin' (replete with solos from the Bardens/Latimer monster) before one of those melodies returns to close out the track.This is compelling, absolutely essential stuff that has captivated me for quite a long time and I recommend it heartily as one of the truly great progressive rock albums. ... 92% on the MPV scale"
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Monday, March 7, 2005",
      "rating": 5,
      "text": "After a very promising debut album in which the playing was generally stronger than the material, Camel created their first artistic pinnacle with \"Mirage\". This album has all the best qualities a rigorous should expect and demand from a symphonic prog masterpiece: musical ideas full of genuine inventiveness and lucid ambition, well harmonized performances, amazing guitar and keyboard solos, eerie mellotron nuances and synth layers, a solid rhythm section that fluidly sustains the repertoire all throughout its shifts and variations, and of course, the quasi-mandatory two or three long epic tracks - in this particular case, two of them, 'The White Rider' and 'Lady Fantasy'. These multi-part numbers had been included in the band's usual live setlist from their early days, but it wasn't until now that they met their official recorded versions. 'The White Rider' is a dense sonic journey into the realms of a magical world (after all, it was inspired by an episode of Tolkien's opus \"Lord of the Rings\"), starting appropriately with an echoing arpeggio sequence on guitar upon which an eerie Mini Moog briefly expands some evocative lines; then, after a brief military match interlude, the main theme kicks off with a featured mellotron upon which the guitar and the oboe alternately slide in a delicate manner. The minimal lyrics delivered by Latimer are then followed by a brief flute passage, and then a rockier section that serves as the perfect foundation for some organ and guitar soloing. After a second brief sung part, the cosmic closing motif finds Latimer displaying psychedelic flashes on guitar while Bardens' synth and Ferguson's bass provide a disturbing background. The other long prominent track is my all-time Camel favourite composition: the 12+ minute 'Lady Fantasy' is, in fact, one of the best prog compositions ever. From the synth arpeggios that form the intro theme you get the sneaking suspicion that this is going to be really big. The attractive main guitar motif, reprised later for the closure, is one of the most emblematic and recognizable landmarks of prog rock history: it somewhat comprises the emotion of melancholy essentially inherent to the distance and illusion of platonic love. Both the rockier and the languid passages of 'Lady Fantasy' are delivered with amazing ease: the band feels truly energetic and comfortable while going through all the variations of theme and ambience. The soloing by Latimer and Bardens is very confident and sensibly elaborated, and Ward's drumming here is one of his best Camel inputs ever. Once the main guitar motif has been reprised and the final mellotron echoes have vanished, the listener gets the feeling that they have witnessed a musical epiphany of divine proportions. What about the shorter tracks? Well, they're great too. 'Free Fall' finds the band assuming a hard attitude over a jazz-oriented basis: Latimer's guitar parts are really harsh, though still immaculately crafted, while the rhythm section keeps a solid path a Bardens builds an effective bridge between Latimer and Ward/Ferguson with his organ, synth and electric piano. 'Supertwister' is a delicate Bardens-penned number dedicated to the guys of Supersister (close friends with Camel), where Latimer leaves his guitar in favor of his flute, displaying well articulated lines on the canvas of organ and electric piano drawn by Bardens. The final result is an amalgam of soft jazz and pastoral mood. The jazz thing is more intense, and at times more bombastic in the amazing 'Earthrise', a 6+ minute tour-de-force that rivals in energy and catchiness with some of the most accomplished passages of 'White Rider' and 'Lady Fantasy'. Overall conclusion: an absolute masterpiece, a classic that must be regarded as an obligated starting point for each and every prog novice and an item of worship for each and every prog expert collector."
    },
    {
      "reviewer": "maani",
      "date": "Posted Friday, March 18, 2005",
      "rating": 4,
      "text": "This is my first taste of Camel (sorry, couldn't let that pun go unused...), and, if I were you and haven't heard it, I would definitely run - not walk - a mile (or more) for this Camel. It is simply an absolute joy to listen to; interesting, creative and fun from the first note to the last. And although the band is listed as \"symphonic prog,\" I would have to agree with my colleague, Jose Gabriel, that this certainly sounds like it sits right smack in the middle of Canterbury territory: much of the composition, approach and playing reminds me strongly of Hatfield and The North, National Health and Caravan, though it is not quite as \"complex\" and jazz-tinged as the first two, nor as melodic (or \"lyric\"-al) as the latter. What really surprised me were the other influences I heard: a little bit of Floyd, a little more of Crimson (Wake/Islands period) and, oddest of all, a great deal of The Allman Bros., especially in the jam sections. Indeed, it is quite possible that the two bands were influencing each other at some level. / There is little point in describing each composition individually. Indeed, this is one of those albums for which you don't want to give too much away: for maximum effect on the new listener, it should be listened to without detailed description. Suffice to say that the musicianship is top-notch throughout, and these guys can jam as good as any band I've ever heard. Add to this that it is obvious that the band is having great fun, and you've got a truly wonderful product. A gem."
    },
    {
      "reviewer": "Fitzcarraldo",
      "date": "Posted Saturday, April 9, 2005",
      "rating": 4,
      "text": "Highly accessible, well-crafted (and 'safe') Progressive Rock with oodles of melody (some infectiously melodic riffs) and not a dud track on the album. The song writing is not as sophisticated - or odd - as some of the 'giants' of the genre, but the music is highly enjoyable nonetheless. The sound is a sort of symphonic Progressive Rock with discernable musical influences from the Canterbury Scene bands (but not jazzy-sounding at all, to me). Very good playing by all the band members: Latimer's guitars and flute do it for me, with an honourable mention for Barden's keyboards. But then I should also mention Ferguson's bass and Ward's drumming, which are top notch. There is plenty of racy music on this album, but also plenty of dreamy, relaxed sounds for chilling out. I can easily put this on as background music when I'm lazing or tinkering around (or having a beer, as the sound effect at the end of 'Supertwister' always gets my taste buds tingling). To me the music is very pleasant but not stellar, perhaps lacking slightly in innovation and surprises. There are a good variety of tempos and moods, though, lest I give you the wrong impression.Incidentally, I caught the band live a couple of times in the 1970s and the second time, despite the audience's pleas, the band flatly refused to play 'Lady Fantasy', which was their anthem and very popular with the band's fans. I have to say that this annoyed me: you don't bite the hand that feeds you, however fed up you are playing the same song.The Decca Deram 2002 CD re-release has four worthwhile bonus tracks of the same vintage as the album, three of them recorded live and two of which are compositions not on the original album. I cannot conceive of any fan of the Progressive Rock genre disliking this album, and have no hesitation in recommending it. A very secure 4-star rating from me (Excellent addition to any progressive music collection)."
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Tuesday, July 12, 2005",
      "rating": 4,
      "text": "3.75-4 StarsThis album is more representative to the sound of Camel, toning down somewhat (but not all) the fierce musicianship presently on their debut album, preferring melodicism and deeper atmosphere. Flute is introduced as well as more progressive song structures and textures. Given that the band would continue dropping their original classic rock style in future albums, this is a good blend of progressive rock and classic rock that can be recommended to fans of either genres.There's little doubt that all band members continue at the top of their game instrumentally speaking, just like in their debut. Great guitar tones, great keyboard patches. Very solid rhythm section.Freefall begins the album with a straight up rock vibe and surprisingly mediocre vocals, easily the weakest song the band composed up to this point. Not to say that it's useless: far from it, but you'd find more passion on their first album, this song seems like a failed attempt to re-light the fire.Supertwister is a more delicate, yet intricate piece with outstanding flute passages and impeccable chemistry between band members as they change tempos and time signatures with ease. My personal favorite song here.Nimrodel is fractured with an abandoned motif in the first minute, followed by a military march. Then the song properly starts with much better vocals, melodic guitar and flute lines, and excellent instrumental sections. The first is marathon-paced with synthesizer solo, the second mid-paced and atmospheric with a bass-heavy synthesizer motif and beautiful guitar soloing on top. You simply forget about the song's flawed intro.EarthRise is another successful instrumental with plenty of guitar and synthesizer fireworks. I love the drive this song has at times with rapid-fire guitar strumming and percussion work, it makes you forgive its slight repetitiveness.'Lady Fantasy' oh what an awful first minute. Repetitive guitar riffing with painfully loud piercing synthesizer loops going on and on and on. Maybe I should edit the song and stop whining as there's very little that goes wrong afterwords. Melodic lines, strong romantic lyrics, great keyboard playing, a couple frantic breakdowns, its variety works well. The highlight is obviously the middle section with subtle guitar and synthesizer backdrop to a highly emotional guitar solo that simply weeps. It's depressingly beautiful.4.5 Star Songs: Nimrodel, Supertwister4 Star Songs: Earthrise, Lady Fantasy.2.5 Star Song: Free Fall"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Friday, July 29, 2005",
      "rating": 4,
      "text": "Through this album Camel proved that they had matured in their musical compositions and overall performance. All five original tracks featured in this album are excellent with varied compositions but they all have similar style - yup, Camel's style. One track is truly exceptional and it has become my most favorite track from Camel: \"Lady Fantasy\".The album opener \"Freefall\" (5:47) represents diverse styles with an upbeat tempo music and changing tempo from medium to fast and returns back to medium. The electric guitar work by Andy Latimer dominates the song combined with great Hammond organ work, inventive bass lines and dynamic drumming. \"Supertwister\" (3:20) is a very nice'n'cool track which starts with a mellow style and it turns into faster tempo with flute as main melody and some touch of jazz music. The song is very relaxing as it has many tempo changes from relatively fast to slow tempo style. The melody is also excellent. \"Nimrodel\" (9:12) is an epic containing The Procession and The Whit Rider. It starts with nice exploration of keyboard work followed with marching music that suddenly brings to melodic and melancholic music with flute work. The music turns fast in the middle of the track demonstrating fast-paced keyboard work and stunning solo. Guitar rhythm is also a good one to enjoy at right speaker, while keyboard solo at left one. Guitar then continues the solo even though it's shorter. It's an excellent track.\"Earthrise\" (6:42) has eastern nuance at the opening part followed with simple guitar fills and keyboard. The music flows in moderate tempo. My favorite track \"Lady Fantasy\" (12:46) starts off with soaring organ / keyboard sounds followed by dazzling drum work and electric guitar in relatively complex arrangements. It turns into simpler one with guitar melody augmented with Hammond organ work. It's basically the richness of combination between guitar and Hammond organ (like the sound of The DOORS) augmented with bass lines that make this track is a great one to enjoy.Overall, it's an excellent addition to any prog collection. Overall rating is 4+ out of 5 stars. Keep on proggin' ..!Progressively yours, GW"
    },
    {
      "reviewer": "el b�thy",
      "date": "Posted Sunday, August 7, 2005",
      "rating": 4,
      "text": "My introduction to Camel, and the best introcution album to this wonderful band if you ask me.Mirage is the first of their three almost masterpiece albums; sadly non of them (Mirage, The Snow Goose and Moonmadness) achieve that 5 stars status... but they are not that far behind either, specially Moonmdaness.But I should be talking about Mirage not Moonmadness. Definitly their most powerfull album of this trylogy, with some almost hard rocking moments, like Freefall, the album opener and the instrumental piece Earthrise. But, it�s obvious where Camel are at their best... the softer side, the melodies! Ah, talk about a band with some of the most beautiful melodies you are gonna listen to. Supertwister, an almost Canterbury song in my ears, is a little instrumental with some lovely flutes and delicate keys work. And of course the two longer songs, something Camel did not due very onften, long songs that is,: Nimroel and their all time classic Lady Fantasy. Both are full of Latimer and Bardens extensive solos... ah, I just love Latimers solos, so much emotion. Even though Nimroel is my personal favorite, I must say Lady Fantasy is the best song of the album and a strong contender for best Camel song for that matter.A must in any prog collection... or good music collection for that matter, as Camel is one of those bands that can appeal to the a hardcore Avant fan, to the most inexperienced rock listener."
    },
    {
      "reviewer": "Andrea Cortese",
      "date": "Posted Thursday, September 1, 2005",
      "rating": 4,
      "text": "Almost every track here was destined to become a Camel classic. Freefall is a powerfull opener to the album, great contribution by the recently disappeared Peter Bardens (died in January 2002, Pete rest in peace.). Also Supertwister, is Bardens'one, one of my best loved Camel songs! With also a good enchanting flute. Nimrodel/The Procession/The White Rider is an impressive long track by Latimer, inspired clearly by Lord Of The Rings. Lady Fantasy is signed by all Camel members and has a superb increasing keyboard intro!This is a sure masterpiece-gift from Camel to the world's all prog lovers.in my opinion it's not the best Camel album because not comparable with the greatness of Moonmadness in which Camel (too soon, sadly!!) touched the highest peak of maturity!!Excellent!"
    },
    {
      "reviewer": "philippe",
      "date": "Posted Sunday, October 23, 2005",
      "rating": 3,
      "text": "Second and eponym album by Camel. Released in 1974 it reveals in part Camel's original sound to come: talented keyboard's parts, short technical interludes delivering the improvised capacities of the musicians, effective melodies. \"Freeball\" is a heavy rock song mainly based on the instrumental section. \"Supertwister\" is a small interlude with sympathetic flute parts. \"Nimrod - The Procession - The White Rider\" represents the progressive part of the album; with a long introduction and various melodic instrumental parts harmonised by calm, rather discreet vocals. \"Earthrise\" is a catchy \"rhythmical\" song with interesting guitar plans. \"Lady Fantasy\" represents the summit of the album with fascinating keyboard / guitar duet and a nice flavour of psychedelic / supernatural atmosphere. Globally this album sounds old dated, also maybe to accessible & mainstream for me to consider it as a progressive rock masterpiece. However a pleasant listening and one of the best offered by the band."
    },
    {
      "reviewer": "belz",
      "date": "Posted Sunday, October 23, 2005",
      "rating": 5,
      "text": "4.6/5.0Anything below 4/5 on this album is a shame! This is really a huge album, even if not as great as SnowGoose or Moonmadness! The rhythm on Nimrod, the crazinest of Earthrise or the magic of the keyboards on Lady Fantasy, everything on this album is great!Like most people, this was my first experience with Camel (Later, I discovered SnowGoose and Moonmadness). Now, I unserstand a bit more their Canterbury scene influence, mainly Caravan on those two albums: If I could do it all and In the land of grey and pink. However, Camel has its own sound and originality. This album is complex yet simple and easy to listen if you're new to prog music. An absolutely fantastic album if you like Canterbury Scene or Symphonic progressive music with huge keyboards and melancolic voice!"
    },
    {
      "reviewer": "Seyo",
      "date": "Posted Monday, October 24, 2005",
      "rating": 4,
      "text": "In retrospect, particularly after listening to CARAVAN, my evaluation of CAMEL dropped a bit, although I never considered them a first-class prog. It is basically a continuation, not very original one, of the Canterbury style prog, with nice and melodic songs with pleasant guitar, organ and synth solos, but nothing jaw-dropping. \"Mirage\" is pwerhaps their best album from the 1970s and compositions \"Nimrodel\" and \"Lady Fantasy\" can be recommended as top-prog musicianship, but even they are not flawless. Lack of inspiration CAMEL obviously knows how to compensate with hypnotic and pleasant solos. Highly enjoyable album of the mediocre band, but recommended to most prog collectors."
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Wednesday, January 4, 2006",
      "rating": 5,
      "text": "This is the best a human being can hear from this band. Everything is very good stuff. The warm voice, the extraordinay instrumental parts, all is best. My favourite from them. And i think one of the best prog album of all time. You must have this masterpiece. Nimrodel and Freefall are super songs. The best effort from CAMEL, 5 stars for sure."
    },
    {
      "reviewer": "Philrod",
      "date": "Posted Friday, January 13, 2006",
      "rating": 4,
      "text": "After being highly disappointed with their second album The Snow Goose, I decided to give Andy Latimer and co. a second try with this album. Mostly everything have been said by my colleagues, but I would still say that this is an album of clearly higher quality thanits successor, with a progressive classic in Lady Fantasy and some incredible songs. Talking about Lady Fantasy, this song is clearly a highlight of the progressive genre. The different parts of the songs are all extremely good, and they fit together in the most simple and effective way. Great musicianship all around, the lyrics are also good, even if Latimer's voice is not the greatest in the business. Really if you want to discover Camel, start with this album rather than Snow Goose. 4/5"
    },
    {
      "reviewer": "thellama73",
      "date": "Posted Tuesday, May 30, 2006",
      "rating": 3,
      "text": "My introduction to Camel, I bought it without knowing anything about them except that they were Prog. I was blown away by what I heard.Lady Fantasy is everything a Prog epic should be. It has beautiful melodic lines, extremely hard rocking moments, shifts in tempo, time signature and mood and the lyrics... aren't terrible. I am almost equally fond of the Tolkein inspired suite Nimrodel, which features my favorite keyboard solo ever. I am personally a big fan of flute driven progressive rock, and this album is a shining example of that.For me, the least interesting track is, oddly enough, the opener Freefall, which I feel falls a bit flat and sounds rather dated.I would be remiss if I did not comment on the bonus material included on the reissue. It's over a half hour worth of extra music, and while the version of Lady Fantasy isn't that different from the original, it's such a good song that I don't mind listening to it twice at all. I will always be at a loss to figure out why Camel was relegated to the second tier of Prog, rather than elevated to the heights of Genesis or ELP, but such is life."
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Monday, November 6, 2006",
      "rating": 5,
      "text": "The reason that I got in touch with Camel was that an older proghead with a huge collection asked me to listen to Camel because of that funny part with the opening of a can of beer ... but I was so delighted about Andy Latimer his compelling guitar work that I became a fan for life. To me the album Mirage sounds as their most dynamic, adventurous and varied effort, \"no fillers, all killers\": a powerful and often howling electric guitar in the opener Freefall, pleasant work on flute in Supertwister (with the opening of that can of beer in the end), a wonderful harmony of lush violin-Mellotron, twanging guitar, a deep bass sound and excellent guitar play (loaded with emotion) in Nimrodel and wonderful guitar play and varied keyboards (floods of Hammond and a spectacular Minimoog solo) in Earthrise. But the absolute highlight is their 'magnum opus' Lady Fantasy, my favorite Camel composition and a 'crowd pleaser' too: lots of exciting shirting moods, great work on guitar and keyboards, splendid interplay by all musicians and after a hypnotizing middle- part, there is that mindblowing heavy and bombastic eruption featuring swinging clavinet and a compelling organ solo and in the end beautiful violin-Mellotron, goose bumps! Camel wrote progrock history with Lady Fantasy but never reached that level again ... in my opinion."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Sunday, November 12, 2006",
      "rating": 4,
      "text": "One of Camel's finest works, if not the best.I have often debated whether I am more impressed with this or Moonmadness, and the truth is, both are quite exquisite. Side 1 of this album is simply superb, with flowing melodies with wonderful work from all band members, and the vocals are even not that bad, often a downfall of Camel's works. Latimer's touch is unmatched here, and the keyboards flow gracefully with the music rather than being an interference.My preference is side 1, with the classic song Freefall, the unique and quirky SuperTwister, and the journey of Nimrodel/Procession/The White Rider. The medieval beginnings here are a nice touch, and we are led into perhaps Camel's most aggressive and assertive instrumental section. A small point of complaining here is I am a bit disenchanted with the drums, but the human qualities that the rest of the band members make their instruments achieve more than makes up for the staleness I see there.Earthrise is perhaps the worst track on the record, if one were to point fingers, with a less than memorable musical middle, that perhaps could have benefited from fewer keys. We close with Lady Fantasy, another glorious epic that ranks among some of Camel's best. Parts at the beginning I am less impressed with, but as we build more towards climax the band picks it up with some impressive riffs and well thought out structure.One of Camel's most essential releases. It is often a shame that Latimer's playing is overlooked to that of Howe's, Hackett's or Gilmour's, but I believe he is the best out of this bunch, adding an undeniable humanistic quality and artistic prowess to his technical abilities. A fantastic accomplishment."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Monday, February 5, 2007",
      "rating": 3,
      "text": "Second studio Camel opus. Quite different from their first one produced a year before. Due to the lack of (commercial) success they had to change from label and opted for Gama. During the recording sessions, Gama signed a long-term deal with Decca to release all Camel future albums.This one is of course famous for its sleeve. While the band was touring in America, the American division of Camel cigarettes requested the withdrawn of the design to avoid legal procedures. In the US, \"Mirage\" has been licensed to Janus record. The album sleeve was quickly redesigned and the album was renamed \"Janus 7009\" (sounds like \"90125\", no ?). In the rest of the world the cover remained unchanged.The European division of Camel was willing to produce small packs of five cigarettes with the Camel artwork and track listing. The cigarette company was really keen on to idea of a sponsorship deal with the band that they seriously suggested renaming the songs on \"Mirage\" to relate to the Camel brand and smoking. The association with the company did go as far as free cigarettes given away at concerts, having amplifyers were covered by camel (fake) skins ! The US sleeve for \"Mirage\" will be almost similar to the one of their first album.Most of the tracks had already been performed in live sessions so that the album was quite easy to record in the sense that the band knew already what they had to improve (or not) for these studio sessions.\"Freefall\" does not pass really well the proof of time : it sounds like a 60'ies number and is quite boring. Vocals are rather poor and somewhat old fashioned. \"Supertwiser\" is already a typical Camel piece of music : quiet, relaxing with very nice flute playing by Latimer.The mini-suite \"Nimrodel-The Procession-The White Rider\" is a wonderful song : full of emotion (musically and vocally). The symphony of the band at a climax. The track starts quite slowly and develops into a solid rock number with great synth work. The last part of the song though ends in a psychedelic trip which could have been better. One of the highlight.\"Earthrise\" is a very nice intrumental which is rather premonitory for the next album to come : \"The Snow Goose\". Then comes the suite \"Lady Fantasy- Encounter-Smiles for You-Lady Fantasy\" which about thirty years later will still be a regular in their live sets. This song is very good : lots of keys, rythm and mood changes. Rocking alright at times. Another highlight.Although the album was well received by the specialized press, it failed to chart in the UK (it reached Nr. 149 in the US)On the remastered version there are about thirty minutes of bonus tracks which are fine but not essential. Most of them were recorded during their Marquee Club concerts in October 1974. Three stars."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Tuesday, February 27, 2007",
      "rating": 3,
      "text": "This album is an uneven example of CAMEL'S sound. CAMEL were at their best when they did not overreach themselves, turning subtle variations into an art form, but unfortunately in a couple of places on this album they push the music beyond their compositional limits.'Freefall' and 'Supertwister' are competent tracks, as is 'Earthrise', but the twin highlights for most listeners are the two longer tracks, the 'Nimrodel' and 'Lady Fantasy' suites. Both shine with moments of sheer brilliance, but unfortunately both are marred. 'Nimrodel' suffers from unutterably twee lyrics, while the last part of 'Lady Fantasy' seems tacked on to the rest of the suite. Shame, really; this is very nearly an excellent album.Fortunately, better was to come. CAMEL are an essential part of the collection of any lover of progressive music, but it is the two albums to follow this one - 'Snow Goose' and Moonmadness', especially the latter - that make them indispensable."
    },
    {
      "reviewer": "laplace",
      "date": "Posted Friday, March 30, 2007",
      "rating": 1,
      "text": "Yes, this album is very kitsch but to this reviewer's eyes, most of the attempted progressive experiments fail. When an interesting time signature arises, it is simply maintained for a while and then left behind, often without a satisfactory transition and never does an interesting melody get the chance to shine during such a sequence. A lot of the chord progressions are contrived and don't really make sense - that's ok, as this is progressive rock we're talking about, after all, but these experimental musical ideas are often buried underneath conventional solos which would still have fitted a traditional chord pattern.The fact that singing is sparse and stranded on this album leaves this reviewer at a loss, as it is patently obvious that every one of these songs contains lengths which could be greatly improved by a sung melody.All I can really say about \"Mirage\" is that it's more ambitious than music by most of Camel's rock contemporaries. Whether it actually capitalizes on its ambition is for you to decide; I say no."
    },
    {
      "reviewer": "NJprogfan",
      "date": "Posted Tuesday, May 1, 2007",
      "rating": 5,
      "text": "From beginning to end, this album is practically flawless, (Nimrodel has some flat singing). I use to have all their albums up to \"Nude\" on vinyl but didn't replace any on CD until last week with \"Mirage\". My GOD!, have I missed their sound. They are wholly original. The only time I hear any other bands sound in their music is during some keyboard florishes during \"Freefall\" and \"Lady Fantasy\" where they sound like \"Caravan\", especially at the 2:12 mark during 'Freefall\" where the song breaks into a gallop. Jeez, it's frickin' awesome! Latimer is the heart and soul of the band with his incredibly emotional play. Camel should have been huge, but I figure the band didn't connect with audiences as well as Genesis or Yes because of the lack of a strong frontman, because Latimer's guitar IS the center of attention. I'm not slighting the other members, especially Ward's excellent drumming, it's just that Latimer's guitar is comparable to Stewart's fuzz-organ play in Caravan, (plus he plays flute...he can do it all!). It just sticks out. If you're looking for another 70's band with an original sound, (I can see where ALOT of recent bands ape these guys) then start out with this masterpiece. Can't wait to buy another Camel disc...:-)"
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Tuesday, June 12, 2007",
      "rating": 3,
      "text": "Although I always enjoy listening to Camel I echo a sentiment that I have read in other reviews about the band. While Camel is very good and their music pleasant it sometimes seems to fall just a bit below the first tier bands in terms of substance, urgency, and prog-ness. It seems like in certain places their music can just blur into the background allowing your mind to drift from active listening. Not always, just sometimes. But like I said, I still enjoy them very much and \"Mirage\" is no exception.Andy Latimer is one of the most emotionally fluent, romantic players of guitar and flute. He may lack the bite of some of his contemporaries but he knows how to please that craving we have for graceful leads. The album opens with \"Freefall\" which is not my favorite Camel song by a long shot. Something about the vocals just bugs me and I can't explain it. Some nice guitar/bass work in the middle redeems things a bit. I enjoy \"Supertwister\" more with the amazing lilting flute and drums. The real meat of Mirage though occurs in the final three tracks, \"Nimrodel,\" \"Earthrise,\" and \"Lady Fantasy.\" There is a wealth of Camel magic in these songs. Rich and well played throughout they provide me with an enjoyable listening experience occasionally but again they are compositionally just not as stimulating as some of their contemporaries.\"Lady Fantasy\" is the album's highlight in my view with the most compelling writing. Absolutely love the melodic lead that kicks in early and crops up throughout. The vocals are reasonably good. There are nice periods of calm and there are some that are actually funky and driving. The track ends with the lovely lead melody heard in the beginning. Not exactly the \"Snow Goose\" but certainly respectable. \"Mirage\" is a recommended title for Camel fans and fans of lush, melodic 70s symphonic that is easy to get into, easy to listen to, and for better or worse not as challenging as other prog acts."
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Thursday, August 23, 2007",
      "rating": 4,
      "text": "Camel�s second CD, and first for the new label, is clearly a transitional album. It lacks the cohesive feel the band had in their original line up. That does not mean it�s a bad album. In fact, it includes what may be marked as their most famous song, Lady Fantasy. This 12 minute epic is a truly prog gem that makes everything worth it. Unfortunately the songs are not well balanced and they kind of spoil the overall sound throughout the CD.The guitars on Mirage are heavier than any other album the band did at this stage of their career (and after that too, as a matter of fact). The group seemed to be trying to find some new ways, maybe. Freefall to me is the weakest track and opens the CD. Not a bad song really, but very different and quite heavy by Camel�s style. Bad choice for an opener. Supersister on the other hand is a beautiful tune much in the vein of their first album. Nimrod is another fine epic, a very underrated track. Earthride is also very good.Conclusion: of the four first Camel�s albums this is the one I hear the least.The tracklist could be a whole lot better, but the songs themselves are very good at least. And production wise, this album sounds much better then their debut. I was temped to rate this album 3,5 stars, but that would be unfair. It is not a masterpiece, but an excellent addition to any prog music collection. Four strong stars."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Sunday, September 2, 2007",
      "rating": 4,
      "text": "This album was my introduction to Camel, and there has never been a second thought regarding whether my money was well-spent. The only downside is that this album set the bar so high that even some of their later quality albums would never be able to meet this high, rocking, creative standard. Here's a brief song-by-song breakdown:Freefall. The fact that this killer single was never introduced to me by classic rock stations only serves to further lower their usefulness in my mind. It's a shame, because hearing just this song earlier in life would have turned me into a Camel fan years earlier. Better late than never, I suppose. Latimer turns in a nice groove on guitar, and Ward SMOKES on the drums.Supertwister. A mellow, jazzy, flute-driven track to cool off after Freefall and set up Nimrodel.Nimrodel. Let the prog begin! A marching band mix leads into an easy mellotron intro, followed by the band kicking it up a notch with a rocking fuzz organ/keyboard solo, finished off with some spacey guitar over a groovy baseline. This was my first glimpse of Camel's ability to effortlessly switch tempos and time signatures without feeling forced--the music flows very well and is never repetitive.Earthrise. A jazzy intro leads to an absolutely rocking and frenetic middle section of guitar and synthesizer, followed by a mellow refrain to conclude. Basically all the positives of Nimrodel, with an extra rocking kick by the rhythm section of Ferguson on bass and Ward.Lady Fantasy. To be honest, I was expecting a bit more from this song, based on its length, the surprising quality of the songs that preceeded it, and the high praise heaped upon it by reviewers here. Not that this is a bad song by any means (far from it!). I just think it may get a bit more attention to the deficit of other songs on the album. A well structured song, with great melodies, and of course rocking sections that only Camel could offer. This may be the only part of the album where the vocals detract a bit for me, but the part where they really cut loose toward the end makes up for this liability and more!Varied, high-quality compositions, and performed by one of the tightest bands you will hear. Mirage is a solid listen throughout and ages quite well--this will remain in my changer for the forseeable future. If you prefer your prog to center around rock (and not pretentious themes or multi-layered arrangements), then Mirage is a must!"
    },
    {
      "reviewer": "ghost_of_morphy",
      "date": "Posted Sunday, September 16, 2007",
      "rating": 5,
      "text": "Make no mistake, this is a masterpiece of progressive rock and the best thing that Camel recorded in the Golden Age of Prog. Sure, they get more \"progressive\" in their next two classic albums, but they somehow seem to lose the \"rock\" in progressive rock. In this album, the mix is nearly perfect. Especially note the two instrumental tracks. \"Earthrise\" is a brilliant instrumental. It's better than everything on Moonmadness and just as good as anything on Snow Goose. But it's the WEAKER of the two instrumentals. Supertwister is an epic work, despite it's short running time. I'd be happy to listen to an extended version three or four times as long. My only complaint about it is the stupid sound effect at the end.The Tolkein based song (Nimroedel et. al.) is also a brilliant masterpiece. Add in two very solid outings in \"Freefall\" and \"Lady Fantasy\" and we get an album that equals anything that the best prog bands ever released. This is the Camel album that cannot be ignored! If you haven't heard it, get it!"
    },
    {
      "reviewer": "Fight Club",
      "date": "Posted Tuesday, October 16, 2007",
      "rating": 4,
      "text": "The beginning of Camel's excellenceIf one were to take all my feelings of what I love about prog and throw them into one band, that band would be Camel. They take all of the beauties and complexities of progressive music and combine them not like many other groups do. Combining washing keyboards and symphonic aspects of Yes with light improvisational jazz, they make quite a sound for themselves. It all began with their '73 self titled debut. While it demonstrated some good songwriting and melodies it wasn't untilMiragethat Camel became one of the top prog acts of the '70s.Mirageis an excellent addition to any prog rock collection if I ever saw one. There are long keyboard and guitar solos and two epics clocking over 9 minutes. One thing that makes me love Camel so much is their ability to write REAL songs while keeping them proggy. The music is always rather catchy and and has a good sense of \"groove\" to it. A good example of this would be the opening track \"Free Fall\". It starts with some twisting riffs and a great rhythm and could probably be a hit on the radio. OnMiragewe get everything from beautiful mellow jazz to time signature changing prog.The musicians playing is always very tasteful, never too pompous or overblown. They always keep things at a minimum, making sure not to play too many more notes than are necessary. Though there are a number of wailing guitar and keyboard solos they never ramble on for too long. The drumming and bass playing are very jazz influenced, only touching upon hard rock when need be.My only problem with the album is the singing. I'm not a big fan of Latimer's voice and I find Camel is at their best when playing instrumentals. Thankfully the majority of Camel's music is instrumental, but it's a shame this album would be stronger if it was 100% instrumental. It also feels as if it falls a little short. I've always been more into the modern method of making an album at least an hour so I can't help but feel that a lot of '70s stuff feels short. Considering that was the way music was made back then though, I won't let it reduce the rating.Overall, this is a pretty great album but not quite as good as it could be. If it was more conceptual and more instrumental it would be drastically improved. This is a problem Camel fixed with their next album,The Snow Goose, which in my opinion is their timeless masterpiece.Mirageis still an excellent addition to any prog music collection though, any kind music collection actually. It also ends with one of the greatest songs Camel has ever produced, \"Lasy Fantasy\". Drenched in excellent guitar and keyboard playing and a very epic finish. So, if you are looking for some pretty laid back classic prog rock with good melodies and no pretentious playing this album great for you.My rating: 8.5/10"
    },
    {
      "reviewer": "The Pessimist",
      "date": "Posted Friday, February 22, 2008",
      "rating": 5,
      "text": "This review is not of the bonus tracks, only of the main songs.As with many people, I was more than astounded with this recording. It is Camel's best work, with a harder edge than their other two memorable albums which I personally prefer. It's quite simply a master workings of symphonic rock.The better tracks on the album are Nimrodel - with its superb changes in rhythm and keyboard work, Freefall - the complex side of Camel, yet still remaining melodic, and finally Lady Fantasy - no need for description here, other than this: Camel's greatest song ever. All of these songs add to a splendid 10/10 for me. The remaining two are 9/10.To this day, the album abides as a very favourite album of mine. A tad better than moonmadness IMO. Recommended to Yes, Genesis and Flower Kings fans out there."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Thursday, March 27, 2008",
      "rating": 4,
      "text": "Camel�s second album Mirage is an improvement over their debut album. In fact Mirage is together with Moonmadness my favorite Camel album. Camel�s debut held some pretty strong Canterbury influences which are almost gone here on Mirage. The only Canterbury flavour I come across when listening to Mirage are some parts in Freefall, but these are only tendencies.The music is generally more symphonic prog now with lots of soloing. There are both guitar, keyboard and flute soloes ( or more correctly flute melodies).Freefall starts the album. It�s a very powerful tune that I really enjoy. In fact this might be the most powerful tune ever on a Camel album. This isn�t hard though as Camel isn�t the most powerful band in the world. They aim more at subtle and melodic playing.Supertwister is an instrumental song with beautiful folky flute playing.Nimrodel another favorite of mine is an epic track with a memorable vocal melody which is something that is a bit unusual for Camel. Their vocal melodies are normally not the most exciting part about their music. There are some great soloing in Nimrodel. I especially think Bardens solo is crushing. It�s really powerful. Then Andy Latimer also joins in with a great solo and after the mellow middle section with vocals the song becomes very dark and Andy Latimer plays a solo with bite which is something I was missing on the debut. There is lots of feeling in his solo play on Mirage.Earthrise is the least exciting song here for me. It�s an instrumental and it gets a bit too long without ever getting downright boring though. It�s ok and there is a great almost fusion part in the middle that I like.Lady Fantasy is like Nimrodel a great epic song. It is another favorite of mine on Mirage. Full of melodic sections and soloing.In the remastered edition from 2002 that I have there are four bonus tracks. The bonus tracks are not part of my rating but they are a nice addition to the original LP tracks. Supertwister and the two songs from the debut Mystic Queen and Arubaluba are live from 1974. There is a good sound on these songs. The fourth bonus song is Lady Fantasy in an original studio mix. I find this superfluous.The guys in the band have become even better musicians on Mirage than on the debut. As I mentioned before there is bite in their perfomances that was lacking on the debut. Andrew Ward�s drumming is powerful and with Doug Ferguson�s bass this makes a great rythm section. But I must say that it is Peter Bardens and Andy Latimer that have improved the most. The soloing is much much better than on the debut.The sound quality has also improved from the debut and it is one of those pleasant and warm productions that I love from the seventies. Drums just don�t sound like that anymore.This is an excellent prog rock album and it is highly recommendable. Sadly Camel didn�t make very many good albums, but you should try this one out even if you think you don�t like Camel. 4 stars is a matter of course for this excellent album."
    },
    {
      "reviewer": "apps79",
      "date": "Posted Monday, April 21, 2008",
      "rating": 5,
      "text": "Despite an exhausting 9-month tour following Camel's debut,the album did not have the level of success MCA Records expected and the band had to move on, signing a contract with Decca Records.In the meantime Camel had a good businness agreement with the cigarette company of the same name and their new album ''Mirage'' had a cover resembling to the classic packet of the Camel cigarettes.It was released in March 1974 on Decca's division label Deram Records.The album shows Camel definitely at their best.A hybrid of Psychedelic Rock, Symphonic Rock and Canterbury Prog, ''Mirage'' is a work, where mediocrity is an unknown world.''Freefall'' is a track, transforming Camel's sound from psych influences to superb Progressive Rock with old-school vocals but majestic musicianship with heavy energy.''Supertwister'' is a short instrumental and the first introduction of Latimer on flutes.Delicate organ/flute-driven Symphonic Rock, that sticks in your mind with its marvellous melody.''Nimrodel / The Procession / The White Rider'' contains straight references to ''The Lord of the Rings'' and it is one of the most beautiful compositions ever writeen by a Prog band.From its opening marching tunes to the lyrical organ/flute-based introductive melodies to the endless interplays and solos by Bardens and Latimer, this is first class Progressive Rock from the very first to the last minute.''Earthrise'' is another winner in the line.All instrumental, fiery, Canterbury-styled Prog with majestic keyboard work by Bardens on moog synths, a fantastic rhythm section and Latimer performing guitar solos in a complete madness.''Lady Fantasy'' became an all-time favorite of prog fans worldwide through the ages.13 minutes of diverse Progressive Rock with intense lyricism, haunting melodies as well as some incredible interplays, full of edgy organs, powerful guitars and complex bass lines.The first ever classic album by Camel is almost flawless.One of the most balanced albums ever written, containg a high level of technique but also series of mindblowing melodies.Extremely highly recommended, this comes as a no-brainer for the whole Prog audience."
    },
    {
      "reviewer": "kenethlevine",
      "date": "Posted Sunday, May 11, 2008",
      "rating": 4,
      "text": "The progression in attitude from Camel's debut is palpable here. Every aspect of their sound is bolder, and for the most part it works, in spades, even if the opener \"Freefall\", is rather clumsy and uninteresting.On \"Mirage\", Camel pushes lead instruments to the fore and backing instruments to the aft, resulting in a much less jammy setting, but one that still allows for considerable interplay between the members. This works very well in \"Supertwister\" which is the first piece to really show off Latimer's flute, and for the most part in the excellent lengthy suites, of which \"Lady Fantasy\" is the best known to this day. Even the vocals are somewhat bolder, even if they sound disturbingly like Jim Morrison of the Doors at times. \"Earthrise\" is an excellent instrumental with a catchy central riff and a break led by Latimer that gives us more clues as to his future orientation. There are parts of \"Nimrodel\" and \"Lady Fantasy\" that break out a bit too harshly instrumentally, as if the band has not quite smoothed out the edges. Of course, that it is not necessarily a negative quality.\"Mirage\" is the album that broke Camel into the big time and proved they would not dissolve into thin air on closer examination."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Tuesday, May 13, 2008",
      "rating": 4,
      "text": "Review 28, Mirage, Camel, 1974StarStarStarStarFrom my mini-Camel collection (the three 'classic' albums, at the moment), this is the one that I head for most often. Neither as artsy and inconsistent as The Snow Goose, nor as monotonous and lacking in testicular fortitude as Moonmadness, this album was my introduction to Camel. While I wasn't satisfied, really, with either of the follow-ups, I was with this album, even if I consider Earthrise a bit of a weak spot. Andy Latimer's vocals, the main caveat, I think, for Camel, satisfy on everything save Freefall ('sung' by Pete Bardens, instead), and the ideas are strong enough to keep interest throughout. Not a masterpiece, but a very strong effort, and worthy of any prog collection.Whirling keys lead up to the stabbing bass-and-bass-pedals of Freefall, with Latimer and Ward providing some various jabs in. The song breaks out with a rather acquired vocal from Pete Bardens, with a pleasant combination of clean and gritty guitar-work from Latimer. Bardens gives us a few rather random-seeming hums on his organ, while the rest of the band keep varying the song. We get a few gentler and even more whimsical sections before returning to the martial drumming and walking bass with soloing guitar of the main vocal section. A great track for Ward's drumming, not so great for the vocals. However, the live version on the remaster of The Snow Goose is far more powerful in terms of impact.Supertwister is rather more consistent for me, with its combination of bass, eclectic-drumming, flute, keys and organ gliding throughout a soft, sometimes slightly funky, sometimes beautiful 3.18 to a delightful end with a neat storm-in-a-teacup allusion. Great track.The White Rider, first of the two long pieces on the album, is an entertaining, and interesting track. Unfortunately, its inspired-by-LOTR nature and use of classy lines such as 'Wizard of them all/Came back from his fall/This time wearing white' may not be everyone's cup of tea. The first section, Nimrodel, begins with an eery atmosphere, constructed carefully by Pete Bardens' synths and Latimer's guitar. Presumably Procession kicks in straight away, as I can't think of a more apt description for the brass-and-military-drums-and-flute of the following section of music. Great flute solo. After this two-part, and two-minute, opening, we can delve into some of the album's real meat, with a gorgeous guitar-part, surprisingly listenable vocals (if you can at least partially block out the lyrics), soulful mellotron and a range of uplifting flute solos from the multi-talented Latimer. After the gentle beginning, we are transported into a heavier section, with excellent, fast-paced drumming and guitar, a capable synth solo. Another stellar guitar solo brings us back to a calmer repeat of the vocal ideas, but with a gentle acoustic from Latimer and a good rhythm section of Ward and Ferguson. A little of the block organ that everyone seems to love (well, I certainly do) takes us back to a more mysterious section reminiscent of Nimrodel, with Ferguson rather taking the lead and Latimer, Bardens and Ward hurling in some superb variations. The swirling outro reminds us of the intro.Earthrise begins with tingly percussion (the sort on Genesis' The Waiting Room or King Crimson's Formentera Lady) and a suitably wuthering effect. Masses of organ feature quite prominently on the song, as does an overly-funky and quite repetitive bass part. We get some very nice features, including a flamenco-esque tap from Ward, some rather capable rhythm section work, including a good, short drum solo. Several neat reversals of roles are included in the song, with Latimer and Bardens alternating between solo and rhythm playing, while Ward elephants (*coinage!*) all over the place. Some of the solos don't grip me, though, especially near the end and the start, and the track as a whole is the least interesting of the album.Lady Fantasy is the album's highlight for me, with a combination of biting, versatile percussion, whirling moog and surprisingly edgy guitar launching off unforgettably into Encounter. Ferguson provides some excellent bass as the song slows down a little, whirling up. The vocals again, aren't appalling, and a rather chattery rhythm section and acoustic guitar combination don't fail to hold interest and provide a launching pad for an extended guitar solo. We get some interesting electric piano (I think, though it could just be more moog) through to the end of the vocal section, and presumably kick into Smiles For You with what must be 'tron in the background and Latimer providing alternately emotional and rather whimsical solos, including the amazingly beautiful guitar melody that I remember this song for. A gorgeous guitar solo leads us deeply into the second, highly emotive vocal-and-acoustic section, backed up powerfully by the rhythm section. After the not-at-all-sappy 'Oh my Lady Fantasy...I...love you', Latimer and Bardens explode out into the stunningly high-energy Lady Fantasy with a burst of stellar guitar and moog, with Ferguson also standing out in his interplay with the two soloists. Ward crashes along behind them to bring the song back down to the main guitar melody and its gorgeous shimmering-mellotron conclusion. Just perfect, and managing to convey beauty and emotions while at the same time being good-humoured and even trivial. The Mirage in its purest form.On the remaster, we get a lot of bonus goodies, including a delightful (especially the flute) live rendition of Supertwister, live versions (very enjoyable, especially Mystic Queen, but I'm not acquainted with the originals yet) of Arubaluba and Mystic Queen (both from Camel, I assume), before an alternate, slightly slower version of Lady Fantasy. Normally, I'm not interested in a single song enough to want to sit through it two times in a sitting, but here I usually let the album continue through the bonus material, just so I can listen to it again without feeling bad about skipping tracks.All in all, a very, very promising effort, with enough daring and power to make the soft sections stand out (and vice versa). Latimer and Ward really manage to stand out, even if Bardens and Ferguson have a more mixed effect on me. The bonus material is extremely good, so doesn't annoy me, and Earthrise and Freefall alone provide some exposed underbelly for an otherwise extremely solid album. The two longer tracks are vital for a prog listener, so the album receives a well-earned four stars. Also, it's probably listenable enough for a new listener, and also will hold some interest for people like me who generally don't put too much stock in the other two Camel classic efforts, The Snow Goose and Moonmadness.Rating: Four Stars Favourite Track: Lady Fantasy"
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Sunday, July 20, 2008",
      "rating": 5,
      "text": "Camel fantasyIn my opinion Mirage is Camel's masterpiece. With this album Camel truly found their musical identity and all of the potential of the debut album is here fully realized. There are flutes here for the first time on a Camel album and that would become a trademark of their sound from then on. The keyboards are more varied compared to the debut and the vocals are much stronger. Indeed, simply everything about this album is better.But the most important factor that makes this a masterpiece is, of course, the great material. The album opens with a bang with the bluesy hard rock of Freefall. Supertwister is a flute-based instrumental that perhaps not would be very impressive standing on its own, but here it functions as a perfect bridge between two great songs. The flute sound is enchanting! The only annoying thing about the whole album is the strange inclusion of a sound of a beer can opening and beer being poured into glass at the end of Supertwister.The excellent Nimrodel/The Procession/The White Rider explores a theme from The Lord Of The Rings. The electric and acoustic guitar playing together is truly beautiful here. Earthrise is the track that reminds the most of the debut. A more Jazz-Rock/Fusion based piece that really rocks. Speaking of that, I think that Mirage rocks harder than any other Camel album, which is something I like.The album closes with the 12+ minute classic, Lady Fantasy. The best part of the song is, I think, the part that follows the line \"I love you\" towards the end of Lady Fantasy. Stunning! And before you know it the album is over. I always find myself playing it at least twice every time. I never do that with Moonmadness or any other Camel album.One of my all time favourites - a masterpiece of progressive rock."
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Sunday, July 27, 2008",
      "rating": 5,
      "text": "Superb album! I listen to it over and over again. It is much more completed than the first one, but it's also quite a different one. I was wondering about the the way the album was made. Everything on the album contains logical order. If someone ask me what I consider real progressive rock I would say Camel - Mirage. It is sample of absolute and pure progressive rock. I believe this album is one of the purest progressive rock albums of all time. I have the feeling Mirage was made to satisfy some professor of progressive rock music, that have written a book for progressive rock. It is full of excellent songs and compositions, especially Supertwister and Lady Fantasy: Encounter/Smiles For You/Lady Fantasy (which I consider as the best composition of whole Camel's career and one of the landmarks of progressive rock). Mirage is closer to jazz than most of symphonic prog albums. The perfect album for everyday use! I can listen to it whenever! A sample of the genre! 5 stars!"
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Wednesday, August 27, 2008",
      "rating": 5,
      "text": "I think the album cover is so cool. Funny that Camel cigarettes were actually given out free at their concerts, all because of this album cover. Anyway i'm one of the few I guess who prefers the debut record to this one, although it's so close I keep changing my mind.\"Freefall\" is my least favourite track on the album.To my ears it's a pretty straight forward song. The positive is the guitar that seems to relentlessly play throughout. \"Supertwister\" is more like it. This is a Bardens composition and one of my favs. I should mention that Peter Bardens was involved in composing every track except the third one (Latimer). I love it when CAMEL slows it down and plays that melancholic brand of music. It's almost haunting. This one is led by the beautiful flute playing of Latimer. A gem. And yes it ends with someone opening a beer and then pouring it. \"Nimrodel / The Procession / The White Rider\" was inspired by Lord Of The Rings. It opens sadly with synths before the marching style drums come in with flute for \"The Procession\" section. The best part is \"The White Rider\" that opens with mellotron and guitar 2 minutes in. Vocals follow. A change 4 minutes in as the tempo picks up as synths and drums lead the way. Guitar comes in at 5 1/2 minutes followed by vocals as it settles back down. It gets kind of spacey after 7 minutes as guitar starts to soar as drums pound away. Nice. Great ending.\"Earthrise\" opens with the wind blowing as organ comes in with gentle guitar. An uptempo section led by drums and synths takes over. Guitar takes the lead 3 1/2 minutes in before synths take over again. Excellent instrumental. \"Lady Fantasy\" is my favourite track on here. Love the drum intro with the synths and guitar. Impressive. It settles down a minute in and vocals follow. The organ is such a highlight beginning 1 1/2 minutes in. It always reminds me of THE DOORS. This continues until the tempo picks up 4 minutes in with the guitar leading the way. It settles down after 5 minutes. It calms down even more 7 minutes in. Vocals are back after 8 minutes. It kicks back in a minute later with prominant guitar then organ. It again calms down with tasteful guitar to end it.Amazing album from CAMEL, without a doubt one of their top three."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Wednesday, September 24, 2008",
      "rating": 3,
      "text": "\"Mirage\" most definitely has that unmistakable Camel aura about it but I consider it to be less sophisticated than their two excellent albums that came right after, \"Snow Goose\" and \"Moonmadness.\" Here the band comes off as a kind of poor man's Pink Floyd and I don't say that in a disparaging way. Whereas that talented group was so polished and so gifted that they could construct their songs piece by piece as they recorded, the tunes on this album have the earmarks of being cooperatively crafted during days and weeks of intense rehearsal long before they walked through the studio doors. They have an \"organic\" texture that only comes from an open, all-ideas- considered, creative commune of musicians that understand the concept of the whole being much greater than the individual components. In other words, these guys were a band in every sense of the definition.I like to think of them as an instrumental progressive rock group that reluctantly agreed to put vocals on some of their tunes in order to appease their record label. What I'm saying is that they weren't exactly fighting over microphone time, yet that's the weakest part of their sound, unfortunately. The opener, \"Freefall,\" is a fine example. It has a spacey beginning, then powerful accents draw you into a throbbing rock beat that's promising but the second they timidly start singing the indistinct lyrics the momentum drags. This situation doesn't last long, however, and soon they're buzzing off into a jazzy interlude with Andrew Latimer's bluesy guitar wailing and Peter Bardens' organ flowing freely. Harmonized, intertwining melodies between the guitar and keyboard is one of their trademarks and this number has plenty of that going on to keep things interesting. \"Supertwister\" is an instrumental piece that allows Andrew to showcase his fluent flute skills and he's no slouch on the silver stick. It's a light jazz ditty that starts out at a scampering gait before the tight rhythm section of Andy Ward's drums and Doug Ferguson's bass carefully slows the tempo for a smoother, more serene segment. After a return to the initial feel the song ends with the sound of a champagne bottle being uncorked. (Don't ask me why, though.)The Tolkien-inspired \"Nimrodel/The Procession/The White Rider\" is next. A slice of psychedelia featuring synthesizer and tremolo guitar at the beginning leads to some crowd noise stirring underneath marching drums, bugles and fifes. They segue from that into a Genesis-like section where they make another weak stab at crooning some words before they suddenly burst into a hyper-paced movement with Bardens turning in a decent performance on his synth. It ends with a strong bass/synthesizer line rumbling through as Latimer provides some cosmic but very predictable guitar runs. On \"Earthrise\" they once again back away from the mikes and lay down a steady rock groove as the organ and guitar provide the basic melody both together and in harmony. They then shift gears for a jazzy little deal that further evolves into another high-energy, frenetic rock motif. The backwards guitar lead is way too 60s for me but Peter's gutsy organ solo more than makes up for it.The epic \"Lady Fantasy\" provides a large-scale, big-time proggy charge out of the gate before they settle down into an easy-going trot where pleasant melody lines take over. Then they sing some brief lines again with the same disappointing results. Bardens' fiery Hammond organ break comes to the rescue in the nick of time, however, and Andrew gets to stretch out on guitar during the somewhat pedestrian jam that follows. A slower section with fat 12-string acoustic guitars ringing underneath is enjoyable but the rudely distorted, heavy clavinet/bass riff roaring beside Latimer's over-the-top guitar spasms at the end really puts me off. I might have dug it more in '74 but not now. No way.In this case the bonus tracks add to the value of the CD package. The live recording of \"Supertwister\" is pretty much a note-for-note rendition but the two in-concert versions of \"Mystic Queen\" and \"Arubaluba\" will save me from having to buy the group's debut album. Not that they're inferior tunes. Not at all. They just tell me all I need to know about where Camel was at during that stage of their development. The former has a cool Traffic-style atmosphere that's appealing and the latter is a controlled, mapped out jam that has some interesting characteristics. All three are well-performed and remarkable in their high fidelity. Alas, the alternate studio mix of \"Lady Fantasy\" contributes little to the original.\"Mirage\" is a snapshot of four dedicated musicians feeling their way in the competitive world of 20th century rock and roll, drawing on each other's specialized talents to build a unique group identity. Their intuitive arrangement skills and their propensity to come up with excellent melodic patterns were evident and would only get better with experience. It wasn't their fault that among them they lacked that essential vocal personality the public demanded for instant recognition. These four artists were obviously content with the band's makeup the way it was. But, nonetheless, it was the missing piece of the puzzle that kept them out of the upper echelons of 70s prog rock. And this album, despite its undeniable qualities and charms, displays the critical nature of that drawback to a tee. 3.2 stars."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Friday, November 14, 2008",
      "rating": 4,
      "text": "The next best thing to actually finding yourLady FantasyOf all the symphonic giants of the 70s, Camel seems to be the one most often forgotten about. While the progressive world is still sure to give these guys their due credit, even with their new albums that have been released into the new millennium (Nod And A Wink), the rest of the world has pretty much forgotten about Andrew Latimer and his band of merry men we can still enjoy their music to it's fullest. Camel's second album,Mirage, is a marriage of several things that made the classic progressive era so classic; Long and winding suites, gorgeous instrumentals, impressive technical playing and even some hard rocking parts. Describing any classic band's sound is pretty difficult, but drawing parallels between these guys and a harder edged version ofYeswith a lower pitched singer and more flute would no be too far-fetched. Needless to say, if you enjoy thatYesstyle of prog (as opposed toCrimson,ELPorGenesis) then Camel should probably appeal to your tastes.Home to a mere 5 compositions, it can be expected that every one of them be memorable and impressive. Of course this is the case, and it's due to a number of things, which make this album worth going back to for a number of listens. There's nothing weak on the album, not a passage or note that seems out of place, and the album flows incredibly well as it leap frogs between instrumentals and songs with vocals, including the suites. There's only one ''standard'' rocker song, and even that one is quite impressive.Freefallis the tune that kicks off the album and does so very well. If this is your first experience with the band you also get the sense kicked into you that this band is not to be taken lightly, because they are heavy! The riffs in this song along with the repetition of ''down, down, down'' really set the mood for the rest of the album, even if the rest of the album is a lot more eclectic and varied than just that first shade of the band.The instrumentals are probably the biggest thing to keep people coming back. If you've ever enjoyed an instrumental tune that's ripe with melody then you're likely to get a kick out of this album, and the success of these tunes is likely what led the band to compose the all-instrumentalSnow Goosedown the road.Supertwistseris an excellent piece that's led by an ear-catching flute melody that keeps things rolling over top as the rest of the instruments follow. The organs and keyboards on this song are also highly impressive, adding some contrast in their darkness to the serene playing of the flute. The other instrumental to be found on the album is twice the length of the criminally shortSupertwisterand a lot moodier too.Earthrisestarts out at a mild pace before deciding that they need to do something drastic. So, like Michael Myers of Halloween finding a big knife of some kind they come after you at full force with amazing guitar solos throughout the song, which only slow off to allow for luscious keyboards with come in here and again. It bookends with another calmer part at the end of the tune and then it's all over, leaving you wanting more.Where Camel really shows off their edge though, is in the album's two suites.Nimrodelis the shorter and less impressive of the two, but it still has a lot of charm. Starting with some creepy keys it eventually builds up to some war-march drums and then into excellent guitar solos that have a distinct melody to them. The voicing in this tune is subtle, but effective, and the dark keyboard riffs in the end of the song make for a fine conclusion. But it's the 12-minuteLady Fantasy Suitethat really takes the cake. Those sharp keys that open the album are just so memorable along with the heavy guitars that almost scream like a warning siren of some kind. This song is heavy, especially given it's time whenBlack Sabbathwere the heaviest people on the planet. Guitar parts give life to the song, especially in the actualLady Fantasysection of the song where they turn into a chugging machine that makes you wonder ifIron Maidenlistened to these guys a lot in their early days. Like any great symphonic prog band, these guys knew how to handle their suites.This is truly a classic album from start to finish, although it would be a hard press to call this one a masterpiece. The band certainly sounds a lot more raw here than they would on later works, but that's a big part of the charm for the album. It has all the makings of a classic prog album but lacks that final emotional 'erk' that makes your spine shiver whenever you listen to it. Still, that doesn't bring down the quality of the songs at all, and this one gets 4 Lady Fantasies out of 5. Definitely an album to own."
    },
    {
      "reviewer": "LiquidEternity",
      "date": "Posted Monday, November 24, 2008",
      "rating": 5,
      "text": "Camel's second release shows the band opening up to a world of exciting ideas, somehow playing a form of Pink Floyd-esque space rock while at the same time keeping a strong, adventurous rhythm and upbeat sense of straightforward rock, and this is no mean feat for a band to pull off.Mirage quite possibly best represents 70s Camel's blend of hard rock and classically composed prog. Contrary to what many may lead you to believe, the band's vocals are not horrible, are not just weak attempts at sounding like Pink Floyd. Camel is and has always been their own band, and in truth I rather enjoy the vocals on this album. Both Doug and Andy can not only hold a tune but truly sound actually sound like they know how to sing and that there's a reason they are stepping into the microphone zone. That common quibble out of the way, all that's left then is the album's music. And this is the kind of music that marked the peak of the 70s prog movement. Complicated rhythm section work, one part emotive and two parts technically brilliant guitar, keyboard sounds that actually have aged very well, and moods that perfectly describe the power and creativity of a young band playing whatever they want with wild abandon or careful deliberation.The album opens with the upbeat and rocking Freefall, a guitar-oriented piece with some aggressive (for Camel, that is) vocals and a interestingly syncopated rhythm section. The next track segues nicely from it, being Supertwister. Not far into this short track does the music change drastically: flute. Yes, Andy Latimer breaks out another instrument that he is quite talented with, and from this point forward the band will only increase. The song itself is quite pretty and yet, like the first one, upbeat when compared to Camel's other major albums. The bass work is also quite superb. Nimrodel/The Procession/The White Rider seems to me to be the weak track on the album, with some awkward segues and a general sense of lacking direction. When the song is moving forward, however, it sounds absolutely stellar, with gently probing guitar solos and dramatic keyboard soundscapes. A creepy and fast bassline breaks in near the end, finally lifting the song from its listing parhood.Earthrise starts up with an atmospheric intro, complete with organ. It builds in intensity and tempo for the first half before turning into guitar and keyboard solos. It closes gently. Of course, that's only a ruse, because the wild Lady Fantasy wraps up the end of the album. Starting off with a keyboard lick over some guitar that reminds me perhaps of Kansas, the song rotates between a luscious main guitar melody, proving here once and for all that Andy Latimer is a genius with his instrument. The song builds and ebbs, featuring a good number of solos and some good bass lines. The real magic occurs, however, at a little over eight minutes into the track, where the vocals return for a few lines, sounding melancholic and wonderful. A half second of silence becomes one of the most catchy and up-tempo bass lines the band has ever toyed with. A wild guitar solo that reminds me of Robert Fripp's power drill method (like on Fallen Angel) jumps right in, only to segue into a complicated keyboard lead. The instrumentalists show their respective masterful skills for a few minutes before finishing this song off with a band and a return of the gentle main melody.This album is not the high point of Camel, however, somehow, it will be surpassed by the following Snow Goose, but nevertheless Mirage stands as a splendid statement of the young band's creativity, energy, and raw skill. A must have for fans of good symphonic prog, and quite possibly the best place to start with Camel. The weak portions of Nimrodel are easily made up by the masterful construction of the rest of it, and I cannot but rate this as an absolute necessity of a prog fan's collection."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Tuesday, December 2, 2008",
      "rating": 4,
      "text": "Camel's second album was my introduction to the band. My initial response was to question whether this band was in fact symphonic rock- their early style tends to lead more toward jazz, even with the heavy synthesizer use. I think the drumming of Andy Ward is largely responsible for this, but there are so many times, on this album and on others, that I can just focus on his highly pleasing skill and ignore everything else going on. Overall, the album is a testament to the band's ability to produce great music. Even though it is not my personal favorite Camel album, it is highly proclaimed for a reason. Variety abounds on this album, as each song is very different from one another, and for that reason, there is no reason for a lover of progressive rock music to pass this one up.\"Freefall\" The album kicks off with pulsing bass and drums, with a crunchy electric guitar interjecting at various times. Keyboardist Peter Bardens, who wrote the song, takes the lead vocals here, and he does such a great job, it's a wonder we don't hear much more of him on other Camel songs. To be frank, much of the instrumental section of this song sounds like something The Allman Brothers would have played, which is by no means a bad thing (I happen to really enjoy The Allman Brothers). That bluesy sound of the guitar, paired with the keys, and the manner in which the drums and bass are played, give them that resemblance. It's a killer song, and one of their most energetic.\"Supertwister\" A brief instrumental (on the next album, Camel will demonstrate that this is one of their strong suits) follows the opening track. After a lovely introduction, there is a pretty cool section in 10/8 time signature. The song relies heavily on the flute, and Doug Ferguson plays a bass run (doubled by organ) that just makes the song even more interesting. The piece ends with the sound of a canned beverage being cracked open and poured out.\"Nimrodel / The Procession / The White Rider\" Inspired by The Lord of the Rings chronicles (and more specifically, the wizard Gandalf the White), this is a song with multiple stages, each with very distinctive sounds. It begins with a sad, murky guitar and a mournful lead. What follows after is the sound of a regal procession, complete with cheering masses. After that, there is one of the best compositions on the album. The various instruments are stellar, even though the composition is not very complicated. Following two verses, there is quite a bit of energetic soloing going on, mainly on the synthesizer, after which is a cool acoustic guitar and a singer chronicling the fall and rise of the wizard in question, Finally, there is a synthesizer-sounding bass riff and a heavily-delayed slide guitar section. Despite several dissimilar segments, the song flows smoothly.\"Earthrise\" Quiet at first, the song has an organ build up that jumps into its main theme just under a minute in. It is the second instrumental on the album, and does a fantastic job of characterizing this entire album, providing us with some great melodies. Ward even gets a short opportunity to show off his skill behind the kit. The guitar solo midway through exemplifies what Latimer is capable of as such a refined player. While it is a great instrumental, it is not even close to being one of Camel's finest.\"Lady Fantasy\" Incidentally, Camel's most celebrated song is the one I like least of all here. All the same, it is a great song with many memorable parts. The keyboard riff in the beginning is a little annoying, but Latimer's guitar work throughout completely makes up for it. The basic chords during the verse are standard jazz fare, but work well throughout this song. The piece suddenly stops to bring in the next part, consisting of a bass riff and fiery guitar solo. Much of the middle section is quiet, relying on Latimer for variety, particularly with his guitar. There is a wild organ solo toward the end before reprising the main theme. Not their best, but great anyway."
    },
    {
      "reviewer": "crimson87",
      "date": "Posted Tuesday, January 20, 2009",
      "rating": 4,
      "text": "This was one of the first rare (if you can call it that way) prog albums I have heard when entering to this site. At that time I was amazed with Camel's music and they still get some listening time.Often known as a second league band , Camel still manages to produce a signature sound. They music must be one of the jazziest symphonic bands you may listen. They also have in Andy Latimer one of the best axemen in business. This record , having heard all their output with the exception of A Nod and A wink is their most agressive , for camel's standards. Do not expect a full blown Ys or Brain Salad Surgery , since Mirage combines both gentle parts and some abrupt changes.As for the record itself. There are not weak tunes on Mirage( the only thing I can consider to be weak is Latimer's singing but that's not exclusive to this release) . However not even the much revered Lady Fantasy seems to be a mindblowing song to my ears. The main problem with Camel and this record in particular is that if you have heard lots of symphonic and jazz rock bands before , Mirage won't change your life for sure. There are lots of memorable melodies here and it's a very enjoyable album but nothing close to being unique.My rating: 3.75 stars"
    },
    {
      "reviewer": "Raff",
      "date": "Posted Sunday, March 1, 2009",
      "rating": 3,
      "text": "Though I am sure most of you think we do not need yet another Mirage review, for some time I have wanted to have a go at what most people hold as Camel's finest hour, and a masterpiece of prog rock. The forums are full of dedicated fans of the band, who see them as one of the best, most influential acts of the original prog movement - even better than such undisputed giants as ELP. Well, I am sorry to say that, to put it mildly, I do not share their views, even if I am quite familiar with the band's output. I do own a number of their records, and listen to them relatively frequently, since there are times when you'd rather not go for Univers Zero or The Mars Volta - but this is not really a compliment in my book, especially if you call yourself a prog fan.Don't get me wrong, Camel are a very proficient band in a technical sense, and have a keen ear for melodies and atmospheres. Their music is definitely pleasant and soothing to the ear, and flows smoothly without demanding too much from the listener. Andy Latimer is one of those so-called 'emotional' guitarists (much like Pink Floyd's David Gilmour) that go for the heart rather than for the throat, and the late Peter Bardens knew a thing or two about creating ethereal, moody textures with his keyboards. Three out of four members were adequate enough to take on singing duties, although the vocal department is the one in which Camel, in my opinion, are most lacking. It is really a wonder how, when the golden-voiced Richard Sinclair joined them in 1977, they didn't exploit him fully, having him share vocal duties with Latimer - who may be a great guitarist, but is certainly not the most gifted of singers.Seen the huge number of reviews posted before mine, I will spare my readers a totally superfluous track-by-track analysis, and go for the bare bones. The original edition of Mirage is comprised by five tracks, while the remastered editions contains an additional four tracks, two of them taken from their self-titled debut album (Mystic Queen and Arubaluba). Of the original five songs, two can be termed epics - the Tolkien-inspired Nimrodel/The Procession/The White Rider, and Lady Fantasy, probably the best-known offering on the album. They are both well-constructed, multi-part compositions, featuring vocals and instrumental flights in balanced proportions, richly infused with Bardens' atmospheric keyboards, and unfortunately Latimer's dull, droning vocals, as well as his tasteful guitar work. Personally, though, I find opener Freefall the most interesting song on the album, being far more energetic and dynamic than the others. The instrumental Supertwister is also a pretty nifty slice of music, further enhanced by the lack of vocals (always a sore point with the band) and the presence of the flute, also played by Latimer.Now, I'm sure many will think this is an overly harsh review. After all, if Mirage is in the site's Top 100 (and has been for ages), there must be some reason... As the saying goes, different strokes for different people. While I am partial to music featuring lots of melody, especially when my brain is in need of relaxation, I don't think Camel represent best what progressive rock is really about. Seeing them as one of the most important bands of the original prog movement may be a question of personal taste, but in my opinion means having a somewhat skewed view of the whole phenomenon. Prog was not meant to be inoffensive, or offer highbrow takes on elevator music. By all means, enjoy Camel, love them to death even, but don't come here and state that they are the best prog band ever. Even love should be able to look at things with some impartiality...That said, Mirage is far from being a bad album, and one that most prog fans can enjoy- at least when they are not up to anything more demanding. As for myself, I would give it three and a half stars, but since the half star rating has not been implemented yet, I'll stick to three. Nice music, but no second coming of prog, that's for sure."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Wednesday, April 1, 2009",
      "rating": 4,
      "text": "It may be my biggest musical regret not investigating this outstanding pillar of the genre's heyday earlier... because from the very get-go of the first trackMiragescreams excellence.Hard rock blends more excellently here with iconic symphonic rock better than anywhere else, with heavy guitars sinking their hooks into the listener so that intricate synthesizers can take their time to unfold vast tapestries of music. Latimer's guitars can positively cook, but also use smartly delicate textures to create mood alongside the equally varied keyboards of Bardens, whose solos and classic sound are incomparable to the business of Wakemen. The rhythm section is thankfully heavy, with strong performances by both drums and bass, giving weight to the atmosphere and especially the rocking sections.Expect thoughtful and varied compositions (including one about Gandalf... how can you go wrong?) which will appeal instantly to anyone who is a fan of the classic prog genre. For those who haven't heard anything by Camel yet, I can't recommend this one enough-- it has (almost) the virtuosity of Yes, played with a more Floydian/Genesis style... although it completely blows most anything by Genesis out of the water thanks to its combination of ambitious prog stylings and a hard-rock soul.Outstanding!Songwriting: 4 Instrumental Performances: 4 Lyrics/Vocals: 3 Style/Emotion/Replay: 5"
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Sunday, September 6, 2009",
      "rating": 5,
      "text": "Mirage is a long time favourite album of mine and the creative peak of the warmest and most emotional classic prog rock act ever. Be not mistaken, there's a lot of instrumental passages, organ solos, subtle touches of acoustic guitar and flute spicing up the proceedings but everything is done with so much class and inspiration that it never gets in the way of the songs. Of special note are White Rider and Lady Fantasy, both high up on my favourite songs ever list. Not everyone seems to appreciate Latimer's singing, but I just happen to be stuck on his restrained but warm and gloomy vocals. In my view, Camel would never match this album anymore, not even on Moonmadness."
    },
    {
      "reviewer": "friso",
      "date": "Posted Wednesday, November 18, 2009",
      "rating": 5,
      "text": "Camel's 'Mirage' album is quite an anomaly in the band's discography; it's their heaviest album by far and has this thick and moody heavy jazz (hard)rock sound. Of course there's the symphonic progressive rock side as well. This album is perhaps the closest to sounding like Kahn's 'Space Shanty' from 1972. On the track listing we find the track 'Supertwister', which actually is a wink to the Dutch Canterbury inspired group Supersister - which may explain the up-tempo jazzy rhythms 'Mirage' offers. Listening to live performances of these songs it becomes apparent this recording is quite different from the sound of the band at that time, but I don't mind; this is a perfect and unique sound. On this album the fast paced drums of Andy Ward are at its most impressive; tasteful, always fitting perfectly in the compositions and very tight. Doug Ferguson's bass pumps out some great heavy lines during the jammy parts, whilst adding warmth en texture to the melodic parts. Peter Bardens' collection of keyboards here would be a standard pallet for a lot of retro prog we now hear; think of Jordsjo (Sweden) or Malady (Finland). Andy Latimer plays beautifully on all his records, but here he seems to have been driven to the extremes by the breath of the performances. His vocals are still a bit drowsy and geeky, but on most of these songs they fit perfectly due to the great mixing. The album is one big high-light, but among point of interest are the nine minute 'White Rider', which is a Lord of the Rings inspired song. On side two the thirteen minute 'Lady Fantasy' would prove to be a fan favorite. Camel's 'Mirage' proves that progressive rock can benefit a lot from the high energy performances we get to hear way too little."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Thursday, January 7, 2010",
      "rating": 4,
      "text": "More prog than the debut, hence the slightly higher PA rating. This is due to the presence of two multi-part mini-suites, ''Nimrodel'' and ''Lady Fantasy''. Both are well played featuring a vast collection of keyboard sounds, hard-rocking guitar solos and a few theme changes that sound natural. The epics are symphonic in nature with ''Nimrodel'' scoring points for featuring what sounds like a festive orchestra in the beginning of the piece.The song ''Freefall'' is of personal importance to me because it was the song that helped invigorate my interest in Camel. I had thought they were a completely tepid, boring, lazy jazz- inspired prog group until my friend played me ''Freefall'' and my interest quickly changed. It sounds nothing more than 60's psych-rock leftovers, but if that one song re-energizes my interest in a band, there's got to some magic somewhere.The other two numbers are ''ho-hum'' jazzy instrumentals; ''Supertwister'' is interesting due to the flute playing, but that's about it. But overall, this is a very well-played, well-executed prog rock album that most fans of the genre should try out."
    },
    {
      "reviewer": "progrules",
      "date": "Posted Saturday, January 30, 2010",
      "rating": 4,
      "text": "There are a few questions coming up with this famous Camel album. First of course: is this yes or no a true masterpiece. Looking at ratings and reviews the crowd is divided obviously. Personally I will go along with Mellotron Storms rating in the end: 4,5 stars. So it's close but just not there in my opinion.Second question: is this Camel's finest ? Right now Moonmadness' rating is actually higher but this is just momentary. For a long time Mirage was clearly Camel's magnum opus. My secret fav has always been their debut but I agree that objectively the three successors are probably better. And if I have to make a decision I will proclaim Mirage as most impressive work.It will have something to do with the presence of a true epic of pretty high standard, my preferred style of progressive song. Such a track is missing on Moonmadness and The Snow Goose. The other four songs are all very much worth while as well as far as I'm concerned. So that explains the 4,5 stars. All tracks are between 4,25 and 4,75 in my opinion. But ultimately this is not enough for the masterpiece status I feel. So I will round down to 4."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Thursday, March 18, 2010",
      "rating": 5,
      "text": "Rating #401!Mirage is a Miracle! Every track banged the gavel down to make a statement of prog like no other album.The main drawcard of this dynamic album is the epic multi-movement suite 'Lady Fantasy' that seems to turn up in a live form on many compilations. The studio version is as good as any live version mainly due to Latimer's vocals and scorching guitar solos. The melodies are compelling and the epic flows from section to section seamlessly, bookended by Latimer's main lead guitar motif. Ferguson's bass and Barden's shimmering keyboards throughout each track are accomplished musicianship.'Earthrise' begins with howling wind effects and an ambience is created with keyboards and guitar. Then it launches into the main riff showcasing the keyboard talents of Bardens. The instrumental features some excellent drumming that compliments the piece and a very melodic refrain. The freakout section of fret melting guitar riffing and Barden's keys backed by relentless drumming is vintage Camel, never to be repeated on other tracks. The instrumental is reigned back in again with the main melody, but the fast paced drums from Ward are erratic and out of control. It then stops and a quieter keyboard chord structure ends the track. Wonderful.'Supertwister' is yet another instrumental with a pretty melody, and there is an upbeat time sig that locks in with beautiful flute soloing. At the end there is the sound bite of a can of lager being ripped open and poured bubbling with froth. Here's drinkin' to your health, Camel.Other quintessential Camel tracks include the fabulous 'Freefall' with its staccato stabs on organ and virtuoso guitar licks. It remains one of my favourite Camel tracks. 'Nimrodel/The Procession/ The White Rider' is a segue to the work they will cut on 'Snow Goose', told in multiple sections and blends three songs into one in about 9 minutes. It is also a concert favourite for good reason and appears on most compilations of Camel. A symphonic masterpiece that must be heard by every Symph prog addict.'Lady Fantasy' is the mini epic that ends the album on a high note. A tri-part work of genius that never fails to be compelling and astounding. Overall this is one of the albums that no Camel fan should be without. The enigmatic image on the cover has become part of the 70s imagery of great rock albums and indeed in the prog world. Camel surely deserve at least one 5 star album and this is it. *****"
    },
    {
      "reviewer": "EatThatPhonebook",
      "date": "Posted Tuesday, April 27, 2010",
      "rating": 4,
      "text": "8/10\"Mirage\" is certainly Camel's magnum opus.What a great album. Camel's second album is most definitely one of the best symphonic prog albums ever. Let me start saying how this is a truly \"classic\" prog album, with all the elements that define the genre such as the presence of suites, very frequent keyboards, interesting song titles and consequently lyrics, and a very low number of songs in the album. The five songs that form this album are all beautiful, some have a stronger feeling, some have calmer moments.\" Freefall\" is the opener. I usually tend to prefer the first song of the album, but this my least favorite, possibly because I'm not crazy about Latimer's vocals in this particular piece, maybe because they sound kind of childish provocation. But it is still a good song,\" Supertwister\" is a fantastic three minute piece based manly on flute, but the other instruments accompany it just as fine. Beautiful with a delicate melody( this sensation of fragility is given especially from the flute).\"Nimrodel\" is the first of the two suites of the album. The first part is probably the best moment of the album, with a beautiful melody, too bad it ends almost immediately. There's a quite moving part after that, played a lot faster than before. The part after that is another beautiful part, mainly based on vocals and acoustic guitar. Finally, an awesome synth part comes in, totally mind blowing if you ask me. Probably the best Camel song ever.\"Earthrise\" is a very nice song, very pretty in so many moments, especially in the beginning. It then is more rockish kind of, thanks to fast guitars and fast rhythm.\"Lady Fantasy\" is the song everybody loves. I too love it with all my heart, but I'm not sure it can beat Nimrodel. After the intro, there is a beautiful guitar riff, immediately followed by another keyboard riff. After it gets a lot faster, with a nice guitar part. Many fantastic moments, one of the best suites ever made, and also a great closer.Let me say as a conclusion that I really think it's a masterpiece of progressive rock,near perfection."
    },
    {
      "reviewer": "Peter",
      "date": "Posted Thursday, May 6, 2010",
      "rating": 4,
      "text": "MIRAGE, the 1974 sophomore release from 2nd-tier prog rockers Camel, is a strong, if not brilliantly unique slice of English \"symphonic\" progressive rock. By this date, a working prog template had been established by earlier and bigger acts like Genesis, ELP, King Crimson and Yes, and Camel break little -- if any -- new ground on MIRAGE. It's almost prog by numbers; too early to be classified as \"neo\" prog, yet belated enough to be largely a case of following in the well-worn footsteps of giants.Still, despite their lack of trail-blazing originality, my latter-day discovery of Camel was a welcome one. (I was introduced to them only a few years ago, via this site.) Camel made some worthy progressive rock in their heyday, and MIRAGE is a fine album. Produced by David Hitchcock (who'd already produced such prog landmarks as Genesis' FOXTROT and Caravan's IN THE LAND OF GREY AND PINK), the album is firmly ensconced in the prog milieu. After a short, spacey intro, \"Freefall\" gets the session off to a rocking start. The flowing lead guitar of Andy Latimer (who also handles lead vocals in a workmanlike fashion), and the keyboards of Peter Bardens establish the trademark Camel sound: that of a prog outfit able to convincingly rock out, while yet taking their music to more rarified, classy and complex heights. The second number, the instrumental \"Supertwister,\" gives us some beauty, with some nice flute from Latimer coupled with some jazzy electric piano from Bardens. Delicate passages are followed by rocking sections where Bardens switches to the organ -- yep; this is prog rock, no mistake. Next up is the first of the album's two highlights, the multi-part, epic-feeling (and fantasy epic-themed) \"Nimrodel/The Procession/The White Rider,\" which tells of J. R. R. Tolkien's Gandalf, \"the wizard of them all (who) came back from his fall, this time wearing white.\" As suits the subject, we get nine-plus minutes of mood-enhancing mellotron from the mythical mists of time, sorcerous synthesizers, delicate elfin acoustic, and evocative, escapist electric guitar -- better fire up the lava lamp! The fourth track, \"Earthrise\" is another instrumental workout. Like the gradual, deceptively peaceful appearance of our beautiful blue planet from the window of a lunar-orbiting Apollo spacecraft, this piece starts out small and slow, before building to a frantic pace -- as tired old mother Gaia presumably gets down to the business of another day with her milling multitudes of offspring. Finally, the album ends on another high, with the near-thirteen minute \"Lady Fantasy,\" a tripartite epic which seems to be a favourite of many fans -- your reviewer being no exception. Keyboards and guitar feature strongly on this prog paean to the titular object of unrequited love (who seems to be some sort of feminine ideal, goddess, or dream girl). It's of little import whether the words are aimed at an ethereal or earthly woman: the music plain works, especially during an up- tempo movement where the Camel lads really get smokin!Thus, MIRAGE is a very good album. I won't say that it's a masterpiece, or \"essential,\" but it would make a solid addition to any thorough collection of vintage progressive rock. If you haven't tried Camel yet, give 'em a go. Unlike the famous \"coffin nails\" of the cover art, this stuff won't kill you. 3.5 stars, rounded to 4."
    },
    {
      "reviewer": "stefro",
      "date": "Posted Wednesday, May 26, 2010",
      "rating": 5,
      "text": "After the low-key, psych-tinged symphonic prog of their self-titled debut Camel would make a triumphant and spectacular return with this highly-regarded follow-up. 'Mirage' is, without a doubt, the group's crowning glory, featuring complex instrumentation, darker themes and a more overtly progressive style than 'Camel', showing just how far the band had progressed in a relatively short space of time. Regarded by both fans and critics alike as one of the defining albums of the symphonic prog sub-genre, 'Mirage' is filled with outstanding craftmanship from a band cruising at the peak of the impressive musical powers. The line-up was still in place, featuring Peter Bardens(keyboards), Andrew Latimer(guitar, flute, vocals), Doug Ferguson(bass) and Andy Ward(drums), and the same line-up would, over the next few years, produce at least two more stand out long-players to complete a remarkable quartet of great symphonic albums. Up there with Pink Floyd's 'Wish You Were Here', Genesis' 'Nursery Cryme' and Yes' 'Close To The Edge', 'Mirage' is a stone-cold prog classic. STEFAN TURNER, LONDON, 2010"
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Monday, June 7, 2010",
      "rating": 2,
      "text": "Except for \"Moonmadness\", never understood why so many people loves CAMEL, I understand that liking a band is a matter of taste, but always found their music absolutely boring, repetitive and lack of energy, but reading the raving reviews decided to buy \"Mirage\" and must say that despite having listened it several times, my opinion hasn't changed a bit, being that each time I listen it I like it less.The album starts with \"Firefall\" a track that has a bit more of Rock than I usually find in CAMEL, but after a few minutes of this hybrid between soft Jazz, Symphonic and Rock, I want to take the album from the CD player, it's obvious that the band members know their business, but the absolute lack of energy and strength is unbearable, not even the guitar sections made want to listen it.\"Supertwister\" is closer to the CAMEL most people like but bores me, soft, bland and repetitive from start to end, again the performance is excellent, but the problem is in the music, seems that the band lacks totally of emotion and imagination, unexciting since the first to the last note.\"Nimrodel / The Procession / The White Rider\" is in my opinion the best track of the album, mostly because of the spectacular keyboard sections by \"Peter Bardens\", but as soon as the vocals start, the magic lost, again that tedious atmosphere and jamming that takes nowhere.\"Earthrise\" reminds me a bit of \"Moonmadness\", but without the versatility of the fourth CAMEL release, in this track the problem is the lack of variation, despite a few stronger moments, the track is so predictable that can't stand it. Again the individual performances are amazing, but placed altogether makes me shout of boring.Well, at last it's time for \"Lady Fantasy\", the track so many people consider CAMEL'S masterpiece, so with hope I listen the excellent introduction, seems like this is another band capable of making me applaud, but as the name of the album indicates, it's only a \"mirage\", because after the first minute, that boredom returns to me. Not an epic, only a long song that could had lasted 3 minutes and probably been better.Most surely the problem is in me, because the album has an average of 4.36 stars and so many Progressive Rock fans can't be wrong, but no matter how hard I try, will never understand this raving reviews.Don't dare to say that I don't recommend \"Mirage\", because most people seem to love it, so will go directly to the 2 stars rating, exclusively for the performance, because the music says nothing for me."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Thursday, August 26, 2010",
      "rating": 5,
      "text": "I began listening to Camel somewhere around the end of 2003 but my first experience wasn't all that I expected it to be. This had to do with me pickingI Can See Your House From Hereas my introduction to the band which basically repelled me from trying anything new Camel-related until two years later when the great reception of the band's early output here on Prog Archives convinced me to give them another go!By that time,Miragewas their highest rated album which was enough for me to assume it to be the perfect candidate for my re-introduction to Camel. Luckily all the praise thatMiragehad received felt very much in line with my opinion of this release. Not only are all these compositions very beautiful but we also have the two longer pieces that propel it to a higher echelon of enjoyment for me.Freefallis an unusually pompous album opener by Camel's standards and it's not that representative of what awaits the listener later on. Nonetheless, it does do an excellent job of kicking off the album and the guitar riff by Andrew Latimer is a real killer!Supertwisteris the quietest and probably the least memorable out of these five songs, but that doesn't mean that it's bad and would have easily made a minor hit on any other of their releases. There are simply too many highlights here that overshadow what could have easily been a memorable performance.Earthriseis the last of the shorter songs and it makes for an perfect transition between the two lengthier compositions featuring a very distinct Camel instrumental jam between the band members.Even though all of the shorter tracks are great, there's really no denying thatNimrodel MedleyandLady Fantasyis the bulk that makesMiragethe masterpiece that it really is! These compositions have a much spacier approach held together by Latimer's guitar and Peter Bardens' underlying keyboard arrangements. The results just have to be heard to be believed! Most importantly, Camel keeps these songs at perfect lengths without a single out-of-place moment in them!Even if I haven't heard all of Camel's releases I can still safely conclude thatMirageis probably one of their greatest contributions to the progressive rock movement. With tracksNimrodelandLady Fantasythere is just no way I can give this release anything less than the masterpiece rating that is truly deserves!***** star songs: Nimrodel (9:12) Lady Fantasy (12:46)**** star songs: Freefall (5:47) Supertwister (3:20) Earthrise (6:42)"
    },
    {
      "reviewer": "frippism",
      "date": "Posted Friday, October 22, 2010",
      "rating": 2,
      "text": "Ehhhhh 2.5 barelyI must say, that this is probably most overrated album on PA (Why of course 95% of you will disagree). Mirage is Camel's major step into the prog rock genre, and it's a pretty weak one. Let's get right to it:Freefall: Horrible. Worst song on the album and one of the most annoying prog rock songs in my opinion. The song tries to come off as powerful and intimidating, but it just comes off very weak and forced. I think the most fitting word is awkward. Latimer's guitar (Which is average usually) is just god awful. But the worst aspect of this song is the vocals. I know I know that the vocals aren't supposed to be the most important aspect in Camel, but if you want to sing, do it at least well! I believe that vocals are as an important as anything else (if of course there are vocals) and Latimer's vocals are so dull. It's just frustrating. The lyrics are also rather annoying.Supertwister: OK. Definitely an improvement over Freefall. A cute (emphasize on cute) instrumental. Nothing special, but at least it's pleasant enough. Some pretty good flute parts by Latimer. Harmless enough.Nimrodel: Definitely the highlight of the album. The marching band in the beginning is certainly a nice touch. The keyboards by Bardens are very nice, and Latimer's guitar has improvement a lot from Freefall. Now here the vocals, while not perfect, are certainly acceptable. Also the lyrics are very nice. The solos in the middle are also executed pretty well. Overall a great song, which is not a complete masterpiece, but quite enjoyable. Also worth a mention here is Ward's drumming which complements the song nicely.Earthrise: The return to the mediocre here. Quiet and pleasant instrumental, but the melodies here are too catchy. Pretty forgetful and pretty boring. Though, again, pretty harmless. I must say that Latimer's rhythm guitar playing is pretty repetitive. He's just playing that one chord. It's less of a backbone for the song, and more like annoying cricket that's just making enough noise to annoy you.Lady Fantasy: Great beginning part, which opens into a very cheese and schmaltzy guitar line. Bardens gives some pretty nice keyboard parts. The vocals are OK, but the how the verses are arranged are really annoying. It sounds like Easy Listening in many parts. The lyrics here are as bad as Freefall. When in the ending They sing: \"Oh my Lady Fantasy [Dramatic pause] I love you\" I really want to throw up from the schmaltz. That line probably makes the song a whole lot worse. At least Latimer gives an OK solo. The instrumental section is really nice. Ward's drumming is again pretty good.Overall, I'm really rather shocked to see all these positive reviews. Camel's sound in general in my opinion is very derivative as it is (but that's just my taste), but the songwriting here is also much worse than in Moonmadness or Snow Goose. I just suggest to stay as far away from this if you insist on listening to Camel.P.S. I must say that as a bassist I was completely unaware of Doug Ferguson's playing. It's really just there. I mean it's not wholly bad, but the only thing it does is provide the backbone to the song."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Tuesday, December 7, 2010",
      "rating": 4,
      "text": "After their unfocused,eclectic and a bit raw, but energetic debut, \"Mirage\" came as band's choice for future direction. Possibly, there could be different opinions, how good this choice was, but decision has done and on this album band really knows what they are doing.Still with some hard rock roots deeply under the skin, band plays heavily arranged symphonic prog. Differently of debut album, sound there is much better balanced, and even slightly polished. Keyboards became the main instruments from now, but compositions are still a bit too dry, not such soulful as on next release, \"Snow Goose\" (which I count as their highest point of career ever).In some compositions you can hear very \"Snow Goose\" -like moments, what shows band was on the first step inventing their \"classic\" sound, but on this album such pieces still are more marginal, just more illustrating their potential for next release.In fact, there are no bad moments on this album (as well as really great moments). Really quality album, with just some vocals (and I believe purely instrumental \"Snow Goose\" wins because of its absent of vocals as well. Good album (but hardly great).To be honest, only \"Snow Goose\" for me is Camel's album, better than just average one (possibly,because there the band plays what they know best - melodic beautiful instrumental symphonic prog, not too hard,not too bombastic and not too mellow, as on many later works). Still, Mirage is possibly their second best album after.Camel has its fame in some progressive circles. If you're new to band, start from \"Snow Goose\", if you really will like it - try \"Mirage\". If \"Snow Goose\" wouldn't sound attractive enough for you - just leave Camel for others.My rating is 3,5,rounded to 4."
    },
    {
      "reviewer": "octopus-4",
      "date": "Posted Sunday, December 12, 2010",
      "rating": 5,
      "text": "My love for Camel began with this album. I saw it several times in the shops, but the sleeve design made me think to a sort of advertising, so I didn't want to try them. Later I have discovered that the author of the novel on which The Snow Goose is based thought the same and this is why the album is officialy entitled \"Music inspired to The Snow Goose\".Some years later I was lazying between the ruins of an bandoned barn in a desertic area of the Catalunya (Spain) with some friend and a portable tape recorder battery alimentated and just two tapes. One was Mirage.Maybe because of the warmth, maybe because of other \"influencing elements\", the music entered in my mind and it's still here.\"Freefall\" has a spacey flavour, something that a Pink Floyd addict like me can only appreciate, then let's listen to how all the four guys contribute to the tracks. Doug Ferguson's bass is often underevaluated, maybe because he doesn't slap and his sound is always very clean, maybe because he doesn't add notes when they are not needed. Camel wouldn't have been the same without him, and the relatively poor albums with Sinclair are here to demonstrate it. Also Ward is for me one of the best drummers which I've listened to. Add the skill and the songwritig of Latimer and Bardens in the middle of their peak of creativity.After \"Supertwister\" the first of the two short epics of the album: Nimrodel. It was probably \"fit for purpose\" when I have listened to it for the first time, but the music is highly evocative and even if its duration is below 10 minutes I consider it an epic.The B side is opened by another spacey instrumental: Earhrise. It's a good track, but is obscured by what is likely the most beloved Camel's song for their fans: Lady Fantasy. It's an epic suite. It's organic. It never looses continuity even when the theme moves from a clean guitar melody to a keyboard riff, to warm singing and to the tendentially hard-rock finale. One thing about Camel's singing: many people thinks that this is their weakness. I think that the warm low-pitched voice of Andy Latimer is better than some of the people that he hired later to sing on his behalf. Compare how he sings Fingertips on Stationary Traveller and how Chris Rainbow sings the same song on Pressure Point.Mirage is \"Camel at their top\" and has a follow-up in Rajaz 30 years after. Both represent a trip in the desert (in my case literally) and justify the name of the band."
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Thursday, February 24, 2011",
      "rating": 4,
      "text": "I'm not a big fan of this band although I really like this, their second album. Until I heard this album I was very skeptical about why some would label these guys 'Canterbury'. Indeed, I can hear a little bit of a Canterbury influence, mostly in the keyboard work of Peter Bardens and the flute work of guitarist/vocalist Andy Latimer. At least one song, named after a Canterbury group, even sounds like Canterbury compositionally. But it's only on the first two albums where you hear a Canterbury influence; after this they are pretty much 100% Symphonic Prog.\"Freefall\" is possibly my favourite Camel song. I like the spacey beginning. The lyrics and vocals are sorta catchy. Love the sound of the organ. Latimer does some great guitar playing in this song. The switch to the jazzier section is almost flawless. The more melodic part that follows is great too. \"Supertwister\" is a great instrumental named after the Dutch band Supersister. Very Canterbury sounding. I like how the song constantly changes. There's so much going on in this song it seems longer than just 3 1/2 minutes. The sound of a bottle being opened and a glass being filled at the end.I like the crowd noises and the marching band music after the synth intro to \"Nimrodel\". The main vocal part of this track sounds like future Camel. The jam in the middle is good but nothing special. Love the synth after 7 minutes...superb. The guitar effects are cool too. The synth lines in \"Earthrise\" are really nice. Love the martial drumming mixed with handclaps and vibes and/or Rhodes near the beginning. Some real intense playing (for this band) later on. Reprises beginning section to end it.Everything is going fairly well until we bump into \"Lady Fantasy\". Many like this track, maybe because it's the longest on the album. I feel this song is very weak. I do not like the synth at the start; sounds like a cheesy 8-bit Nintendo game. The vocal parts sounds like '60s music, pretty dated sounding for 1974. The transitions between the sections sounds forced. The more laid-back middle section is pretty good. The more rockin' part after 9 minutes has a good riff on clavinet(?), doubled on guitar and bass. As usual at this point, the band reprises an earlier section to end the song; this type of thing is really starting to get old now.I like when Camel rock out. I think they are best at doing 5-9 minute songs. Latimer isn't the greatest singer, but this music doesn't require great vocals. Other than a handful of songs on their later albums, I don't really like anything they did after this. 3.5 rounded up to 4 stars."
    },
    {
      "reviewer": "baz91",
      "date": "Posted Thursday, April 7, 2011",
      "rating": 5,
      "text": "Surprisingly, this album is not a Mirage, it actually is THAT GOOD!After releasing their promising - though slightly naive and possibly directionless - eponymous debut album (whose review I wrote only yesterday), Camel followed it up by writingMiragewhich is regarded by many as their masterpeice, an opinion I wholly agree with. The artwork - a clever edit to the famous artwork seen on Camel cigarette boxes even today - is surprisingly NOT the first time a prog band were to use a cigarette box as their artwork! I am of course talking about Procol Harum'sA Salty Dog, released in 1969, whose album cover is very obviously a parody of the Player's Navy Cut cigarette box. But I digress. Mirage showed Camel maturing very quickly, both musically and compositionally, whilst retaining some of the sound and spirit of the first album, to become one of the most recognised prog bands of the 70s.The first track,Freefall, shows an uncompromising band. Despite the relatively low sales of their first album, they had chosen to continue in the style of writing on the first album, which was to keep lyrics to a minimum and instead execute extended structured instrumentals. There are a few time signatures flying around in this peice, and the playing is both technical and exciting. The instrumental is really complex, and very similar to the sound of their first album. As an opener though, I still preferSlow Yourself Downfrom the debut.Supertwisteris a very light brief instrumental, in which Latimer, having already proved himself as an exceptional guitarist, now proves himself as a very skilled flautist. To excite all you progheads out there, there is an extended section near the beginning in 5/4. This is a very underrated track, as it is just so beautiful! Camel don't take themselves too seriously though, as the sound of someone opening a beer can and pouring is used as a coda to this wonderful peice.The three part epicNimrodel/The Procession/The White Rider(though I usually shorten this toThe White Rider) is where the real meat of the album begins. This is another song to put on the long list of prog tracks based on J.R.R Tolkein's 'The Lord Of The Rings'. However, unlike the majority of these tracks, 'The White Rider' is extremely good. While most songwriters spend their time and effort trying to fit closely to the story within the song, Camel's opus is only very loosely related to the book.Nimrodelis the very first part of the track, which is a quiet keyboard solo by Peter Bardens.The Processionis another short piece, which builds in volume. It is based on a marching tune, and includes some more wonderful flute work from Latimer.The White Rideris then the rest of the track. The song starts with a short lyrical section, which quickly turns into a fast paced technical workout from the group. Afterwards, there is another lyrical section which clearly describes Gandalf the wizard, and finally an amazing 2 minute outro. All the sections of this song are absolutely perfectly composed and structured, with all the instruments sounding just right. This song leaves you wanting for nothing.Earthrise, the opener to Side 2, is another of Camel's signature extended instrumentals. The opening shows a more spacey side to Camel, a direction they would take more on the 'Moonmadness' album. However, some of the rocky energy heard on the first album is also heard in this track. It's very much a crossover instrumental. As you can probably guess, this track also features more fantastic technical playing from all members of the group.The White Rideris perfect, no question about it, yet it is not the best track on the album! This honour of course goes to the final song,Lady Fantasy, another epic that is labeled in three parts (although where these parts begin and end is mainly up to the listener). When I first bought this CD and played this track, it was love at first sight. While most tracks usually take me couple of listens to get into, 'Lady Fantasy' had me enraptured from start to finish. For twelve minutes and forty five seconds, all I could think was 'I love this and I can't wait to play it again'. That feeling followed me, and it quickly turned into one of the most played tracks on my laptop. While the novelty has sadly worn off, I still love this song just as much as when I first heard it. This was their longest song for many years, and definitely their most iconic and most well known song.So what is it that makesLady Fantasyjust so good? Firstly, I'm going to say listen and find out for yourself, as I really cannot do this magnum opus justice, but for those of you who want to see me struggle at it, here you go (you horrible people). Well I'd say the first thing that grips you is quite simply the intro, which is one of the heaviest sounds the band ever made. Fans of Yes or other symphonic prog groups will be turned on immediately. If your at all bored, this song will wake you up and make you start listening, and you start to wonder (or maybe even hope) that the rest of the song will be as good. I know I would have felt let down if the intro had been the most interesting part of this song, but thankfully this is not the case.After the heavy introduction, we are launched into a theme that is closer to the standard Camel style, with a beautiful guitar solo. Before long a lyrical section starts. These lyrics are just so memorable and increase the song's status as an important prog rock song. When the lyrical section ends, there are more instrumental pyrotechnics. This instrumental is very long, lasting around 4:30, but each second is sublime. Incredibly, the introduction is reprised during this instrumental, though in a lighter and more melancholy form. I have to say, I am a sucker for recurring musical themes. The instrumental is climaxed with a long quiet section augmented by an immaculate guitar solo, which leads beautifully into the second and final lyrical section. Again, the lyrics are perfectly memorable, and beautiful in their naivety.The band, having matured from their first album, learn the importance of dynamic contrast and suddenly raise the volume for a 3 minute extended instrumental that surprisingly (for Camel) feels like a lengthy jam. Astonishingly, this works well in the bands favour. The simplistic extended jam feel is a perfect contrast to the rest of the song, and will have you headbanging or air-guitaring or foot-tapping or whatever it is you do to such great music. The jam section itself consists of a lengthy guitar solo, followed by a lengthy keyboard solo, played over a really heavy riff. The length of this jam seems perfectly timed also; while it's always possible to get fed up of hearing the same riff repeatedly, the band know exactly how to maximise the listener's enjoyment before stopping and moving on. The track is coming to an end so, right on cue, Camel play an extended opening theme which was played after the intro. A beautiful ending to a spectacular song.What an album! I'd say that it is worth buying the album just to hearLady Fantasy, but even if that wasn't there, it'd be worth it just to hearThe White Rider! Two songs of this quality mean that this album is definitely worth your money! As with Camel's debut album, in nearly 700 ratings, 'Mirage' has not recieved a single one star rating, just proving how amazing this band, and in particular this album is! I have to say, I've always liked albums with 5 or fewer songs on them. This is the place to start for Camel newbies!"
    },
    {
      "reviewer": "colorofmoney91",
      "date": "Posted Monday, April 11, 2011",
      "rating": 4,
      "text": "Mirage is another Camel classic and is their first essential album! This album has the Camel style that later albums will embrace more fully,\"Freefall\" is a fast paced rocker with solid rock riffs and fantastic musicianship, but there isn't too much in the way of progressing until the last third of the track where things cool down a bit and reveal a playful and optimistic sounding guitar motif with a few variations, followed by a neat guitar solo.\"Supertwister\" starts with beautiful flute. This track is full of energy and surprises on first listening, but this is overall a flute dominated track. Short, but very nice.\"Nimrodel / The Procession / The White Rider\" is a very interesting suite with lots of different atmospheres all coming together. The themes travel from imperial marching to desert landscape sounding guitar dominated passages to fast paced space jam to acoustic beauty. It all seems to work, but if I pay very close attention it seems to lack some of the cohesiveness of later works, but that doesn't detract from the enjoyability of this track at all. Very dynamic.\"Earthrise\" is a playful sounding track with some great catchy synth melodies and is overall an enjoyable jam. I detect some randomness in the composition, but it is overall a jam, so precision in that era isn't truly important.The centerpiece, \"Lady Fantasy\", is without a doubt the best track here and has become one of Camel's signature tracks. Lots of area here for their desert/space sounding melodies to really develop in full. Camel's unique musical voice shines through proudly on this track. One band that I could liken this song to is a much more progressive sounding The Doors.This is absolutely one of Camel's best records, and it's terrific to hear a truly original symphonic progressive rock band. The music here isn't at all like Yes or Genesis; it has much more of an organic feel and as I've said before, it has kind of a desert feel or a feel of abandonment, and I don't think anyone could pull of this sound quite like Camel manages to. The symphonic style of Camel has always reminded me of earlier Canterbury scene bands. I highly recommend this to prog loving peers."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Tuesday, August 16, 2011",
      "rating": 3,
      "text": "1. \"Freefall\" (7/10) starts the album off showing a blues-rock/Canterbury side of Camel. Some nice, complicated tempo changes.2. \"Supertwister\" (8/10) has a bit more melody and mood to suck the listener in--almost too syrupy pretty--like a DEODATO or FOCUS song.3. \"Nimrodel / The Procession / The White Rider\" (8/10) exemplifies perfectly why I will never be able to grant a Camel album masterpiece status: the vocals and drums in the slow parts (and when does a fast part of a Camel song have vocals) are dull, ordinary, soporific. Much better drums once the tempo picks back up, however, Michael Giles and Ward are two drummers I've never really appreciated. Perhaps they make it sound so easy,so straightforward, that they sound boring.4. \"Earthrise\" (7/10) another Canterbury jam--one in which, IMO, the bass player stands out most. He's no Percy Jones, but he's good! othherwise, nothing so very special.5. \"Lady Fantasy: Encounter / Smiles For You / Lady Fantasy\" (7/10) let's me know that STARCASTLE wasn't only YES-inspired. Nice recording and mix of this DOORS-like song. As a mater of fact, if I didn't know better, I would have guessed that Ray Manzarek and Robby Krieger were sitting in on this one--a symphonic update of \"Light My Fire.\" I do like all of the song's shifts and changes--they do work rather well--or \"seemlessly\" as another reviewer here on PA wrote. The music, however, is lacking the stunning soli and/or melodic 'hooks' necessary to draw me in. I've tried listening to this song over and over and over and, save but for a few moments here and there, without emotional impact. The ending has got to be one of the poorest ever--especially after coming right off that hard driving rhythm section part.A band I like but don't love. Of the second tier of \"classic\" prog \"greats,\" I would invariably choose FOCUS, RENAISSANCE, CARAVAN or even SUPERTRAMP before I'd choose Camel. IMHO, \"Moonmadness\" is their best--and that not even close to being a masterpiece.This one is good, but certainly not essential. 3.5 stars."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Wednesday, September 7, 2011",
      "rating": 5,
      "text": "The better of Camel's two pre-Snow Goose albums - a louder, flashier, more bombastic era for the band - Mirage is also a classic symphonic prog album, one on which the talents of Peter Bardens and Andy Latimer are wonderfully showcased. Having rocked out wildly on Freefall, the band take the listener through a dramatic musical journey which culminates in the sweeping and majestic Lady Fantasy, with a brief stopover to worship at the altar of Lord of the Rings along the way (in Nimrodel/Procession/The White Rider). Alongside The Snow Goose and Moonmadness, this should be a listener's first stop in any exploration of Camel's music."
    },
    {
      "reviewer": "rogerthat",
      "date": "Posted Monday, December 26, 2011",
      "rating": 5,
      "text": "Woohoo, the camel is in full gallop here! This was one of the first few prog rock albums I heard and my first Camel album. Nothing else the band have done ever again made such a big impression on me but my adoration of this fantastic album hasn't faded a whit since. Perhaps, an aptly titled album, then?Nasty quips aside, I am quite fussy about originality in music. I don't demand something as fundamental as a new tone system to replace the one Stockhausen proposed. But I do want to hear bands present their thoughts, musically and lyrically (not so much), differently at some level. I generally don't suffer the generic end of most music genres too gladly. So, owning up to my unabashed love of Mirage is a bit of a self-goal!There's not much Camel do, broadly speaking, that you won't find on prog rock albums before. They draw heavily from Caravan and the Canterbury scene as whole, dropping a very big hint about their debt to Supersister. There's some King Crimson in the mix while Peter Bardens at times evokes Deep Purple. They even manage to sound like - and it is like, indeed and not the other way round - those magpies Renaissance. A passage in the middle of Lady Fantasy sounds like Ashes Are Burning but it is quickly forgotten as Andrew Latimer resumes vocals.But I am not too worried about all that when Freefall kicks off the album to a flying start. From that moment, it's literally a desert storm. Camel at all times sound graceful and capable of being gentle and becalming while rocking really hard at other times to give the album some serious momentum. You don't get much time to reflect on whether the track you just heard is really as good as it appears to be because there's another and then yet another strong track waiting to be digested. It's a simply flawless album all the way through. Not one track strikes a discordant or inconsistent note nor do the proceedings ever get boring.To accomplish this last aspect, Camel also take you through some delightful twists and turns. Latimer is at the very top of his guitar game, enchanting you with laidback, relaxed notes as sweet as Santana and crushing you with power that reminds you of Blackmore or Iommi. Overall, the band sound as if they are truly having a blast playing these songs. Note especially the solo Latimer plays just after he has finished his first few vocal lines. That passage, as well as others in the album, give the appearance of a jam-y hard rock workout and yet there are hardly an excessive movements in the album. If anything, it is overall one of the more economical prog albums I have heard.Camel also have one thing in spades that I have suggested was perhaps a bit undervalued in prog and that is emotional resonance. It is hard not to be drawn into those wonderful passages of music that hit you at several different points in the album. Mostly on account of Latimer's guitar but Bardens has his moments too. Subsequently, they got a bit too complacent and gave up too much of their rocking side for my liking but on Mirage their style is hard to fault and their execution just superb.As I already said, this is an amazingly consistent album but I'd pick Lady Fantasy, Nimrodel and Freefall as the high points. Five stars easily for a delightful prog masterpiece and one of the best albums to initiate listeners into prog."
    },
    {
      "reviewer": "Hercules",
      "date": "Posted Tuesday, September 24, 2013",
      "rating": 5,
      "text": "Camel's debut was a very promising start, showing their excellent musicianship, ability to play as a coherent, balanced unit and excellent compositional skills. It was let down a little by slightly dodgy vocals and raw production and sales were modest due to poor promotion.Mirage builds on their strengths whilst addressing the problems. They write two longer, multipart songs (the Tolkein inspired Nimrodel/The Procession/The White Rider and Lady Fantasy), both of which rank amongst the best things they've done. The other shorter songs are also strong, showing their instrumental prowess and their characteristically jazzy and melodic style. Bardens and Latimer write the majority of the songs, the first side as individuals and the second side as an effective team.Vocals are used sparingly but are much better than on the debut and the production and dynamic range are much improved from the debut. It sold well and established Camel as a serious commercial presence after the disappointing sales of the debut. Overall, this is a brilliant album which would be the star in most bands' discographies. But the next two Camel releases were even better!"
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Wednesday, May 21, 2014",
      "rating": 3,
      "text": "This album seems to be Camel's highest rated on the site. I'm not going to dispute that. But when you compare this servicable release with other albums of the same year (1974) by the established prog bands, you will see why Camel is often relegated to the second tier of seventies progressive bands. While this album is not bad, it pales behind contemporary releases, like \"Relayer\", \"The Lamb Lies Down On Broadway\", \"Red\" and \"Welcome Back My Friends To The Show That Never Ends\".On the plus side, Camel became much more obviously progressive with this release. OnlyFreefallretains the psychedelic jamming that made up the majority of the debut album. But even this track had some syncopated blasts that indicated a more adventurous style.SupertwisterandEarthwiseare both nice, light symphonic pieces, with the latter harkening back to King Crimson'sEpitaph(in a good way - do I hear a Mellotron?).Then there are the longer tracks.Lady Fantasyhas some excellent sections, and flows nicely between them. But too much of this song sounds like an imitation of The Doors (do I hear a Farfisa?) for me to really enjoy it. TheNomrodelsuite fares better. But I can do without theProcession, and the different sections just don't seem to flow well in transition. However, the slinky synth/bass jam for the last two minutes is simply superb.I know many feel this is a classic, but just a very strong 3 stars from me."
    },
    {
      "reviewer": "Isa",
      "date": "Posted Sunday, June 1, 2014",
      "rating": 3,
      "text": "[C+] Fun and light symphonic prog, though not particularly enduring.I must confess that my first impression of Camel's Mirage was not one of utterly timeless symphonic prog majesty, but rather of dated 70s sounding rock 'n roll with half-baked influences from the popular jazz-rock and prog bands of the time. While I haven't completely departed from this viewpoint, a fair amount of plays through the album have allowed me to really appreciate the many great moments of light-hearted beauty and the nicely balanced mixture of symphonic prog and jazz-rock influences. There is a high level of creativity with song-structure and instrumental layering in all of the tracks, with mostly successful results.The first track Freefall presents probably the heaviest side of the band's sound on the album, with jarring guitar riffs and an aggressive vocal part. This aggression is followed by some clever solo sections, leading into a a cheerful, proggy section with some 11/8 metered guitar and keyboard riffing, one of my favorite moments on the album. This leads back into the hard rock sounding chorus. The drumming on this track is particularly cool. Supertwister is an interesting track with several diverse sounding sections, some whimsical and soft, some energetic. The flute melodies and juicy keyboard parts are the best part about the track, I think. Nimrod / The Procession / The White Rider might be considered an \"epic,\" Nimrod being a short somewhat and somewhat strange, darker section. After this, The Procession is a sort of short Renaissance sounding march, leading straight into The White Rider. I sense that the first part of this section is highly influenced by Moody Blues, with the use of an oboe-sounding synth melody and once again whimsical atmosphere. The vocal melody is a bit lackluster sounding to me, however. This leads leading directly into a fast paced solo section, which is pretty fun and well done. I sense some Uriah Heep influence in several parts of the track, including the fantasy themed lyrics. Earthrise is an interesting, very prog-sounding track, with beautiful parts from all of the instruments, though I find it a bit long-winded sounding with the faster and thicker section toward the end of the track. The track ends very well with the slower marching tempo.Lady Fantasy is in most ways the best part of the album, and is the most diverse, cohesive, and expressive of all of the tracks on the album, with the most developed lyrics. The solo is very well done, and the singing a bit less so. I hear more Santana influence in this track than in any other, for sure, much more jazz-rock oriented throughout the song. Many solo sections throughout this multi-movement track. My favorite part of this track, and thus the whole album, is the reverse-fade guitar solo, just gorgeous. This leads directly into the soft, emotional lyrical section, and I love how the music reflects the mood of the lyrics, portraying the concept of being mesmerized by a beautiful, really majestic woman from a afar. Then \"bam!\" the hard-rock riffing and soloing begins, and it's just great. The crunchy keyboard timbre is just so juicy.In terms of the album as a whole, I have some complaints which are stumbling blocks for me giving this album a higher rating: there isn't much of a sense of lyrical drama or even instrumental expressiveness throughout the rest of the album, compared to Lady Fantasy. While the complex proggy sections are fun indeed, they almost all have a very narrow range of emotional expression, unlike what you might find in the music of Yes or Genesis, and thus always leave me wishing for more. Also, while each section of music in each song is very well done, it just doesn't create a memorable cohesive whole for most of the tracks, let alone the album as a whole. These are things that I find particularly crucial for a great work of artistic music, and in my view they are where Camel falls short with respect to this album.Mirage is a very good album which has clearly had much influence on the sound of the symphonic prog style. Any fan of this style should own this album for sure, though I wouldn't really call it crucial for progressive rock collection."
    },
    {
      "reviewer": "FragileKings",
      "date": "Posted Monday, August 18, 2014",
      "rating": 5,
      "text": "Camel was one of those bands, along with Gentle Giant and Van der Graaf Generator, that seemed like classic prog bands worthy of getting into. But, like the other two, it took me a few listens of samples before I found a song that really captured my musical taste. After purchasing and quite liking \"Moonmadness\", I left Camel alone for a while. Then one day I saw a song off their debut included in a heavy rock of the early seventies playlist on YouTube and I thought I might want to check out their older material. That brought me to \"Mirage\", and while it may not have anything that qualifies as true early seventies heavy rock, it is quite an impressive album.It opens with the very exciting, at times tension-filled rocker, \"Freefall\". Organ and guitar solos, rhythm changes, light and hard passages. A surprise after the softer \"Moonmadness\".\"Supertwister\" begins with a slow flute-led intro and soon changes to an up-beat, odd time signature piece with Camel showing off their ability to play interesting instrumentals with many rhythm and melody changes. The flute takes the lead throughout this slightly jazz- influenced number.\"Nimrodel / The Procession / The White Rider\" is about Gandalf of Tolkien's books. After a kind of spacey intro we here horns and fanfare, cheering. Then the main song commences, slow and mellow with Mellotron, a hint of Renaissance melody, and flute before the song abruptly changes gears for a snarling organ solo followed by synthesizer, and then guitar brings the instrumental segment home and with a cymbal crash we return to the main song once more. The conclusion is an exciting cosmic instrumental with an eerie, forbidding baseline, delayed guitar effects and an intense guitar solo with equally intense drumming. This is my favourite part of the whole album.\"Earthrise\", is introduced with tinkling percussion and a haunting wind, soon joined by guitar and organ. Presently, the music picks up pace and establishes itself as what is now to be understood as the signature sound of classic Camel. A well-composed and executed instrumental with many changes in tempo, time signature, and melody. And just listen to that high-speed bass playing during the main solo sequence. Great progressive rock from the seventies!The last track already and over 12 minutes, \"Lady Fantasy: Encounter / Smiles for You / Lady Fantasy\" begins with an almost heavy metal intro. Exchange the keyboard notes for electric guitar and you'd be in proto-metal territory. No worries if that's not your bag. The main song comes in nice and mellow but not really slow and features a scratchy, psychedelic guitar solo with some wonderful backing music on organ, bass, and drums. Then, true to every track on the album so far, we change gears and go to an almost funky, up beat instrumental bit for electric guitar. Camel exhibit a wonderful knack for combining psychedelic rock with jazz and funk. But before I can even finish typing that thought, we are back to the slower main melody and a keyboard solo, then wind down gently with electric guitar.I guess this is where the final Lady Fantasy part begins because a new melody is introduced with soft electric guitar, acoustic picking, and another haunting keyboard theme. \"Saw you riding on a moon cloud / Saw you walking on a whirlpool\" when the words \"My Lady Fantasy, I love you,\" are proclaimed the musicians, almost restlessly, stir back into a furious rocker for the organ instrumental, and once again flip the switch for the closing of the song and take us out with the slower main guitar melody.I simply cannot find fault with this album, unless someone wants to nitpick about the lyrics. I don't. The music is simply fantastic. It's not just blazing instrumentals but abrupt and often unanticipated changes, beautiful melodies contrasted by intense instrumental workouts, jazz-flavoured moments in one track and vivaciously kicking psychedelic guitar in another. I don't expect to find a Camel album as enjoyable as Mirage, though \"The Snow Goose\" just arrived in the mail today, so we'll see about that one. A firm five stars for \"Mirage\"."
    },
    {
      "reviewer": "Magnum Vaeltaja",
      "date": "Posted Wednesday, August 26, 2015",
      "rating": 4,
      "text": "Camel, Camel, Camel... what can I say? By 1974 prog had just about reached its peak. Many of the symphonic giants of the day who had released their Earth-shattering opuses just a year or two prior were reaching, or had long overstepped, their prime. Amidst the chaos, though, there was Camel, off in the corner, blissfully ignorant of all the fuss. Indeed, Camel always was one of the more modest and nondescript of the classic prog groups. So while their English contemporaries were forging darker, more aggressive, more experimental, more ambitious musical paths, Camel was content putting out what can best be described as archetypal symphonic prog. And the consistent simplicity of this approach can best be heard on this sophomore effort of theirs, \"Mirage\".I suppose I shouldn't sell Camel short. After all, while nothing on \"Mirage\" begs for your attention in the same way that some of the more ambitious prog albums do, its safety music-wise makes it unbelievably likeable. Listening to this album, it's easy to see why Camel has maintained its small but loyal fan base for as long as it has. \"Mirage\" is a simply a tastefully done production in every sense. Camel were the masters of smooth, succulent melodies, and never played a note more than the music asked for. Indeed, this album has aged incredibly well while still retaining its distinct 70's symphonic prog flair. And perhaps it's not even as cut-and-dry prog-by-numbers as I've made it out to be so far. This early period of Camel, along with their debut, actually did contribute an original take on the progressive sound of the day. What we have here is an interesting beast, a cool Canterbury/symphonic crossover who fuse the typical melodic, fantasy-themed tendencies that are definitive of the symphonic sound with light . It's a shame that they didn't continue to develop this sound on \"The Snow Goose\" and instead went the full-on easy listening route, because the ideas they put into \"Mirage\" really were a recipe for success.I won't bother going into a track-by-track as there are dozens of others reviews here already that can reproduce the album far more faithfully than I could. So instead, I'll just share a few things that I feel distinguish \"Mirage\" from the crowd. The first is the subtle eclecticism. Indeed, I touched on that when I was describing the mild Canterbury flavours to be heard, but there's even a bit more to the album than just that. \"Earthrise\" delves almost into space rock territory, albeit with an energetic, uptempo take on the style. And \"The White Rider\", a jewel of an epic, ends in a rather unconventional way for a track of its grandeur. While most of the classic symphonic epics would likely choose a drawn-out recapitulation of earlier themes (a la \"Supper's Ready\") to drive things to a rousing finish, Camel was wise here. Indeed, the \"White Rider\" suite is a more subtle, moody, type of epic, so what better way to end it off than with a psychedelic jam, with a hypnotic bass line for Andrew Latimer to paint all over with his slide guitar playing? Cool stuff. The other thing that draws me back to \"Mirage\" is Andy Ward. The man can't be stopped on this record! Just listen to how frantically how pounds away during the organ solo in \"The White Rider\", or during the jam in \"Earthrise\". Wow, I'd like to know what they put in his coffee before those studio takes, because he really pushes the whole band along and adds a really frenetic element to might have otherwise been a stale release.In all, \"Mirage\" is a very safe purchase for any prog fan. There's a reason why this is so highly rated on the site: there's just not really much to dislike about it. I've dropped its score from my earlier 5 star rating (back when I was in more of a symphoni-philic time in my life) on the basis that it's not much of a paradigm-shifter - it doesn't take many risks or make any bold or poignant statements. As I said before, Camel always was the modest one in the prog family. But while this kind of stuff is very unlikely to change your life, it's still an appealing, high quality release that wouldn't be out of place in any prog fan's collection. This Camel album isn't a must-have, but if you must have a Camel album, this is the one."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Friday, February 5, 2016",
      "rating": 5,
      "text": "Review N� 55Sincerely, I always considered that Camel is an underrated progressive band among the greatest bands of the 70's. Probably it was mainly due to the Andrew Latimer's voice. Latimer is the main vocalist of the band despite that is true that he never was a true vocalist and that he has a very strong and deep voice. Still, Latimer always knew it, and because of that, many of Camel's songs are mainly instrumentals. This was one of the things that made of Camel a truly unique band in the progressive rock scene. On the other hand, he was never considered one of the greatest guitarists of the 70's, which is, in my humble opinion, very unfair. Probably, he isn't one of the most virtuous guitarists, but he is, for sure, a guitarist who knows very well how to create a unique and unmistakable sound with his guitar. His guitar style is still appreciated by many other guitarists, even in our days, like Mikael Akerfeldt of Opeth.And now, a curious story about Camel and \"Mirage\". Camel was involved in some controversy with the American brand of Camel cigarettes. We can clearly see the similarities between the album cover of \"Mirage\" and a pack of Camel cigarettes. As the peak period of the advertisement of the brand cigarettes, that had a picture of a camel smoking, coincided with the peak period of the release of \"Mirage\", the album was boycotted by some anti- smokers.\"Mirage\" is the Camel's second studio album and was released in 1974. It became as one of the group's most acclaimed albums. \"Mirage\" is probably the album that best illustrates the main features of the band, already mentioned by me above, which are undoubtedly, quality, simplicity and beauty. This is the album where Camel begins to develop their own distinctive sound with some intricate rhythms and the wonderful and unpredictable instrumental exchanges made by the two mainly songwriters of the band Latimer and Peter Bardens.\"Mirage\" has five tracks. The first track \"Freefall\" written by Bardens is almost an instrumental song largely dominated by the Latimer's guitar and with nice musical moments performed by Bardens' keyboards, very well supported by an inventive bass and a dynamic drumming work. This song is influenced by diverse styles of music and the melody is excellent. The second track \"Supertwister\", also written by Bardens, is the nice and most peaceful song on the album. It's a great instrumental track partially dominated by a great flute work of Latimer. With this song, Latimer proved that he is a great flute player too. The third track \"Nimrodel/The Procession/The White Rider\" written by Latimer is one of the two multi-part epic songs on the album. This song is based on the book \"The Lord Of The Rings\" written by J. R. R. Tolkien. This is one of the best songs on the album with its frequent time changes and musical soundscapes, which carries the theme to an exceptional symphonic climax by the band. The fourth track \"Earthrise\" written by Latimer and Bardens is a very nice instrumental track with a frenetic middle section with Latimer's guitar and Bardens' keyboards. It's the second instrumental track of the album and it's probably one of the best and finest instrumentals ever made by them. The fifth track \"Lady Fantasy\" is divided into three parts: \"Encounter\", \"Smiles For You\" and \"Lady Fantasy\". It's the only track written by all band members and represents the other multi-part epic song of the album. Usually, this is the most celebrated song on this album and one of the most famous songs released by Camel. This track contains one of the most progressive songs made by them and is a very good example why Camel is one of the best and most respected bands in the progressive rock universe. Here we can clearly see how Camel has influenced Akerfeldt.Conclusion: In my humble opinion, \"Mirage\" is with \"The Snow Goose\" and \"Moonmadness\" the three greatest masterpieces from the group. But, despite I choose in the first place \"Moonmadness\" followed by \"The Snow Goose\", I consider \"Mirage\" the most simple, pure, na�ve and unpretentious of all Camel's studio albums. It might be even its best work. Every moment of every song on \"Mirage\" is to be treasured and every musical note is perfectly placed. The album is composed of two epics, but the seamless track flow, unifying theme, and harmonious sound, all make the album feel like a real masterpiece. The album showcases an uncanny ability for melody, in which the songs with no lyrics or words to them will have you creating stories in your own mind to fit the real mood. \"Mirage\" is an essential progressive rock classic album. With also the releases of \"The Lamb Lies Down On Broadway\" of Genesis, \"Relayer\" of Yes, \"Red\" of King Crimson and \"The Power And The Glory\" of Gentle Giant, only to mention some of the most important progressive musical releases in 1974, this was undoubtedly an amazing year for the progressive rock music. With \"Mirage\", Camel becomes one of the greatest and most respected progressive rock groups. If you really like of good progressive music and you don't have this album yet, do yourself a favour and get \"Mirage\" as soon as possible.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "ALotOfBottle",
      "date": "Posted Wednesday, February 17, 2016",
      "rating": 5,
      "text": "This would probably be my 1# progressive rock album! I think no words can describe this masterpiece. \"Mirage\" is a work of four outstanding instrumentalists. A true piece of art and a classic prog album!Camel did not achieve a great succes after their self-titled debut. It's hard to say that it influenced their sound because what they created on this album is something that just happens once, something that is not a shift from anything else. I don't know, maybe stars were alined in a particular way and that created some sort of increased creativity for these four young lads, I don't know really. What I know is that \"Mirage\" is a complete, unrepeatable collection of something more than songs. Epics... if you will! Nobody has ever created such a moody listening expirience!\"Freefall\" is a great a album opener, perfectly placed. It features Peter Bardens' beautiful vocal colour. Andy Latimer's guitar playing is out of this world. Keys, guitar and a groovin' rhythm section all pair up, creating a fantastic piece about... Well, a state in life - Freefall! Band shows off their jazz abilities with a swing part with a progression sort of in style of Soft Machine.\"Supertwister\" showcases Latimer's flute abilities in an unusual time signature scenario. A really enjoyable tune, placed perfectly after a very mature and intelectual sounding rock-out on \"Freefall\"\"Nimnrodel/White Rider/Procession\" is a three-movemental suite, lyrically based on Tolkien's Lord Of the Rings. This is in my opinion one of the most beautiful tracks in the history of prog rock with Andy Latimer's deep, bassy voice, creamy guitar tone and a wide plethora of Pete Bardens' keyboard sounds. The song ends with a very Floydian jam, with Andy Latimer making use of his slide guitar playing.\"Earthrise\" is a pleasant piece with a very catchy theme of a Moog synthesizer paired with Andy Latimer's guitar. Than, we can hear a beautiful, screaming guitar and a springy sounding Moog solo on a very fast jazzy jam. A pleasant, enjoyable tune.\"Lady Fantasy\" is what some (including me) consider an ultimate rock suite. It has three movements, all with different flows. A true masterpiece with beautiful, lush and smooth sounding keyboards and breathtaking guitar solos. It is a very relaxing one. The lyrics tell the story of \"A lady we all see, but never can hold\" - Lady Fantasy. This ends the album, with the listener completely overwhelmed with what he or she has just expirienced.\"Mirage\" is a true work of art. One of the best progressive rock albums in the history. \"Highly recommended\" is a brutal understatement, so I'll just leave you here with your own choice.Also, if I didn't mention, I quite like this album :)"
    },
    {
      "reviewer": "Modrigue",
      "date": "Posted Tuesday, June 7, 2016",
      "rating": 4,
      "text": "An hallucination? No, a real symphonic prog oasis!4.5 starsSecond studio album by CAMEL, \"Mirage\" truly marks the band's entrance into the progressive sphere. Compared to their debut, the compositions are a bit longer and more complex. If the musical style - mainly instrumental symphonic SANTANA-esque hard rock - hasn't changed much, the music is now more melodic and sometimes slow down to offer softer and breathtaking moments. Furthermore, the Minimoog made its first appearance and will become more and more present in the next records. Finally, the sound quality has also improved.One word on the cover art: as you probably see, it parodies the Camel cigarettes pack, which initially helped the band to become famous. However, it also made then bad publicity, as people thought the musicians were advertising for the well-known smoking brand. Let's now begin our journey.\"Freefall\" is a punchy and catchy opener, in the slight jazzy hard rock style of the first opus. In contrast, despite to what its title may suggest, \"Supertwister\" is delicate and enchanting. A nice invitation to travel to a mysterious land. In addition, Andrew Latimer's flute playing is pretty good. Then comes the best track of the disc, the Lords of the Ring-inspired \"Nimrodel / The Procession / White Rider\" suite. After a short aquatic overture, you know with the fanfare horns you're in for something special. The next part opens with an aerial majestic music, a genuine little melodic gem! Then, the song alternates alternates violent, calm and even spacey passages with numerous pace changes and various instruments. The haunting ending is also beautiful. Magic!I do not really enjoy the beginning of the instrumental \"Earthrise\", but the rest is overall quite good. Despite dated synthesizer sonorities, it contains great soft and fast epic rock moments. The closer \"Lady Fantasy\" may well be CAMEL's longest composition to date. The track can remind THE DOORS at times, mainly due to the organ interventions. Both gentle and rageous, rock and jazzy, calm and touching, it displays the band's talent and is one of their best mini-epic. The dark ending simply rocks!Although this album is classified under the \"symphonic progressive\" genre, The music here isn't at all like YES or GENESIS. Nonetheless, it still transports you to an imaginary world of fantasy, and that's the most important. The record has an overall constant quality, even if there are a few short passages I enjoy less.With a better unity and musicianship than their self-titled debut, \"Mirage\" possesses its own identity and magic. Top-notch and accessible jazzy symphonic rock, and undoubtedly CAMEL's summit! A treasure in the desert..."
    },
    {
      "reviewer": "patrickq",
      "date": "Posted Saturday, June 29, 2019",
      "rating": 4,
      "text": "For whatever reason, Camel's second album doesn't strike me as especially symphonic. Perhaps my understanding of the \"Canterbury Scene\" subgenre of progressive rock is faulty, but if Caravan'sIn the Land of Grey and Pinkis Canterbury, thenMiragestrikes me as at least Canterbury-related. The aspect ofIn the Land of Grey and Pinkthat's missing here is an elfishness, or perhaps cheekiness, that seems common to many Canterbury acts. And as it turns out, Camel's from a town three hours away from Canterbury.Mirageisn't quite at the level ofIn the Land of Grey and Pink, but it's very good. Its compositions aren't only good, they're consistently good from start to finish - - no duds here. Same with the performances. Camel's not going to blow listeners away with instrumental wizardry here, but perhaps that's because their goal is to work as an ensemble, and maybethat'swhy this group is classified as \"symphonic prog.\" Anyway, the playing is solid on every track. And the sound is great (I'm listening to the 2002 Deram issue).Interestingly, the songs onMirageare almost sequenced from most to least accessible. Apparently none of these songs were released as singles, but album-opener \"Freefall\" seems like the obvious choice. This is followed by \"Supertwister,\" an instrumental which, in effect, introduces the styles which will be used throughout the remaining half hour - - almost like a medley overture. Side One ends with a nine-minute suite related to�The Lord of the Rings. The complexity increases on Side Two, which is indexed as two tracks: the instrumental \"Earthrise\" and the closing suite \"Lady Fantasy,\" another three-part suite. The CD reissue adds three live tracks from 1974 and an alternate (and slightly longer) mix of \"Lady Fantasy.\"�Whether it's symphonic, Canterbury, or some (perhaps \"eclectic\") combination,Mirageis a very good album. Its quality is synergistic: I can't point to a single element which, taken independently, demands a four-star rating. But as a packageMirageis certainly an \"excellent addition to any prog rock music collection.\""
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Friday, January 3, 2020",
      "rating": 3,
      "text": "Camel, second album. Many persons thinks this is their masterpiece. Not me.1. Freefall (5:47) Very rhythmic, with a central guitar solo, changes of rhythm, good rock but without great variations between the beginning and the end. Rating 7,5/8.2. Supertwister (3:20) Instrumental, guided by the flute, pastoral. Rating 7,5/8.3. Nimrodel / The Procession / The White Rider (9:12) Slow beginning, then it looks like a march, the first piece sung is reminiscent of the earlier King Crimson; the second instrumental piece is guided by keyboards, conventional, Genesis style, in symphonic rock approach; then, the second piece sung, with which we reach the 7 minutes. The last two instrumental pieces are guided by a nice bass and an atmospheric guitar solo and they are the best part of the song. Rating 8.End of Side A.4. Earthrise (6:42) Instrumental piece of almost 7 minutes with sluggish and repetitive start, with electric guitar rock solo but never in the foreground. Rating 7+5. Lady Fantasy (12:46) - a. Encounter - b. Smiles For You - c. Lady Fantasy Mini suite with a relaxed beginning of keyboards reminiscent of Caravan, and in fact the Camel alternate music with relaxed ballad rhythms (in Caravan style) with more rhythmically sustained pieces; the suite becomes more rock towards 4 minutes, then moves to a slower, quieter atmospheric music, with voices from beyond the grave; it is descriptive and non-narrative music, then around 9 minutes a fast rock piece arrives, with solo of keyboards and around 12 minutes the initial melody comes back. Rating 8.Record without falls but without very high peaks, Camel settles on an average quality of the pieces that lack the flick of genius or melodic inspiration necessary to become a masterpiece, they are prog artisans, without virtuosity, which makes music not trivial but lacking the originality and the look of the author that characterizes the great ones, in this album.Rating 8. Three and a half Stars."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Sunday, August 6, 2023",
      "rating": 4,
      "text": "Despite the meagre commercial results of their eponymous debut album, Camel's proposal already showed more than interesting musical structures and an enormous potential to be exploited. \"Mirage\", their second album, is the reflection of a consolidated band that is much more focused on the construction of instrumental atmospheres in which the music transmits sensations by itself, without the need to verbalise too much and relying on the rock/jazz fusion as a fundamental pillar.It is in this context where elements are incorporated that envelop and nourish the pieces, such as the spatial beginning of \"Freefall\", the delicate flutes of Andy Latimer in the restful \"Supertwister\", or the tireless drums of Andy Ward in the jazzy and agitated \"Earthrise\". But above all, in the two pieces that stand out clearly, the Tolkenian suite \"Nimrodel / The Procession / The White Rider\" and its psychedelic textures and medieval rolls, and the extensive \"Lady Fantasy\", full of contrasting moods, between reflective and euphoric, where Latimer's guitars unfold without complexes and with enviable ease, in symbiosis with Peter Bardens' arsenal of keyboards, and which, after the first half of the song, leads to one of the memorable moments of the album and surely one of the most outstanding in the discography of the British band. A gem.The live pieces from the concert at the Marquee Club in London in 1974 added to the 2002 remastered edition of the album are not very different from the originals, except for a small extension in \"Arubaluba\", so their contribution in general is marginal.Beyond the curious and anecdotal skirmishes over the use of the slightly retouched logo of the famous cigarette brand on its cover, which forced the band to change it for the North American market, \"Mirage\" is a serious album that exudes maturity and flashes of brilliance, and by which Camel climbed several rungs on the ladder to the top of progressive rock in its most symphonic vein.Excellent4/4.5 stars"
    },
    {
      "reviewer": "A Crimson Mellotron",
      "date": "Posted Sunday, May 11, 2025",
      "rating": 4,
      "text": "Camel followed up their eponymous debut album with the brilliant 'Mirage', released in March of 1974 by the classic lineup of Andrew Latimer, Peter Bardens, Andy Ward, and Doug Ferguson. This second studio album seems to be following closely in the footsteps of the band's melodic and moody first album from one side, but from another it also introduces an array of new and exciting sounds, this time with an even greater influence from the Canterbury scene, especially Caravan and their jazz-tinted explorations. Composed of just five tracks, two of which are multi-part suites, 'Mirage' is naturally one of the more accessible and successful Camel albums, with its strong melodies and chiseled arrangements, through which the listener could appreciate the majestic interplay between the guitar work and the organs; just wonderful musicianship from a band that tends to focus more on melody, structure and mood, rather than technicality and flamboyancy, which might also be the reason why this recording lacks some of the bombastic and cathartic qualities associated with the progressive rock genre.The entire album flows evenly and is a rather enjoyable listen, starting off with the up-tempo rocking opener 'Freefall', one of the more straightforward Camel songs, definitely carrying great commercial potential. Yet the musicianship and the prudent playing on this track are never compromised. This one is followed by the first instrumental on the album called 'Supertwister', a song that sees Andy Latimer's enchanting flute playing, a nice addition to the sound palette of the album and a really mellow piece. The three-part suite 'The White Rider', closing off side one, might as well be the most exciting number on here, the instrumental work on this track is relentless and the gorgeous melodies seem to be in-tune with the aim of the song, simply an excellent work of prog. 'Earthrise' is the second instrumental off the album, a more ambitious and more complex arrangement here, that showcases the more experimental side of Camel's music. Finally, there is the iconic epic 'Lady Fantasy', seen by many as one of the hymns of 70s prog rock. A worthy piece of music, this three-part song carries some excellent and memorable sections as well as some of the most relentless Andrew Latimer playing yet. The entire 'Mirage' album is a very eclectic Camel release and an excellent one, too, but it also seems to be a bit one-dimensional and safe, always moody and never overly flamboyant - its strengths lie in the excellent songwriting and tremendous instrumental work, and despite the lack of experimentation, 'Mirage' remains not only a Camel essential but also a 70s prog gem."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album008c.html",
  "last_parsed": "2025-05-18T00:40:51.574185"
}