{
  "album_title": "THE RAVEN THAT REFUSED TO SING (AND OTHER STORIES)",
  "artist_name": "Steven Wilson",
  "artist_page_link_local": "artist8014.html?id=4135",
  "year": 2013,
  "rating_value": 4.32,
  "rating_count": null,
  "review_count": null,
  "genre": "Crossover Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/4135/cover_534681052016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Luminol",
      "duration": "12:10",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Drive Home",
      "duration": "7:37",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "The Holy Drinker",
      "duration": "10:13",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "The Pin Drop",
      "duration": "5:03",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "The Watchmaker",
      "duration": "11:43",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "The Raven That Refused to Sing",
      "duration": "7:57",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Deluxe edition bonus CD",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 1,
      "title": "Luminol (demo)",
      "duration": "13:06",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Drive Home (demo)",
      "duration": "6:57",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "The Holy Drinker (demo)",
      "duration": "9:37",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Clock Song (unused idea)",
      "duration": "4:31",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "The Pin Drop (demo)",
      "duration": "5:15",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "The Watchmaker (demo)",
      "duration": "12:26",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "The Raven That Refused to Sing (demo)",
      "duration": "8:00",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "EatThatPhonebook",
      "date": "Posted Wednesday, January 30, 2013",
      "rating": 4,
      "text": "8/10The Legacy Of Progressive Rock.\"The Raven That Refused To Sing (and Other Stories)\", released in 2013, is the third album by Progressive Rock artist Steven Wilson, most poplar for being the frontman of Porcupine Tree, esily one of the best Prog Rock acts of the last twenty years or so. After a few side projects such as Blackfield, and a few collaborations with other artists, Wilson started a solo career, and released \"Insurgentes\" in 2008. But it is with \"Grace For Drowning\", in 2011, that Wilson stepped up his game in a way nobody expected, and crafted one of the most beautiful and personal Progressive albums ever made. Some might consider such a statement far too much of an exaggeration, but this man, without being afraid of showing his influences, mixed the past with the present in an outstandingly sophisticated way; it's not an album that is destined to be an important point in musical history, but rather one that represents a complete portrayal of an artist, a swan song of his own.\"The Raven That Refused To Sing\" comes a year and a half later. Steven Wilson seems to have already expressed his emotions in the best and most complete way possible, so it is only natural that this new album doesn't have the touching melodies and the haunting, roaring emotions of \"Grace For Drowning\". Even though Wilson does tend at times to repeat his sound throughout his albums, he does have the common sense not to repeat them too often. Instead, \"Raven\" stays as distant from his inner feelings as possible: this is the tribute to vintage Prog Rock some fans were waiting for, and others were hoping not to hear. It is by far the Jazzier, musician-oriented album yet from this artist. The songwriting is more studied and a little more distant, but it is exactly what Wilson needed to do. He unleashes on \"Raven\" all the love he has for Progressive music, without even looking within himself. Although it does sound like a bad premise, the songwriting, song structuring, and musicianship are so, so good, that there isn't really much that feels missing. Everything that needs to be in such kind of album is here in the most complete way. It is, in other words, a fun record for whoever is a fan of the genre, and a not-so-good record for those who are not fans enough to love Progressive Rock in any form, of any era.What sticks out the most probably is in fact the musicianship: Steven Wilson surrounds himself with some outstanding players, including drummer fiend Marco Minnemann, bass player Nick Beggs, keyboardist Adam Holzman, flute and sax player Theo Davis. This ensemble all playing together do miracles, and Wilson himself has improved so much in both his vocal harmonies and guitar playing. With such a punch of virtuosity to the music, traces of Porcupine Tree's sound are at the minimum, unlike previous works by SW.With six tracks, three of them above ten minutes, the other three under ten, the Porcupine Tree frontman structures his work with great sophistication, making these two kind of tracks alternate, starting with eleven minute \"Luminol\", easily one of the best Wilson songs ever: the opening minutes are mouth-dropping, Jazz-rock influenced passages, while the core of the track softens a bit, until slowly the song picks up momentum until it closes stronger than how the track started. The several melodies and hooks repeated themselves at the right pace, at the right time. Same thing can be said for the third track, the even Jazzier and vivacious \"The Holy Drinker\", that with its frequent organ usage has somewhat of a Hard rock edge to it. The last of the long songs is \"The Watchmaker\" perhaps the weakest of them, because of its terrible resemblance, structure-wise, with Genesis' \"the Cinema Show\", but it's still a great track that boasts gentle, acoustic verses that give a perfect musical variety to the album's whole. Now, the songs that divide up these three titans: the second track, \"Drive Home\" is a nice and calm song that has some great solos and good songwriting, while \"The Pin Drop\" has one of the greatest hooks of the entire album, and some of the best musicianship as well on behalf of Wilson's playing. The final track, the title track, is for sure the one that sticks out the most of the shorter songs, for its little amount of drums and incredible atmosphere that closes the album with a vibrating tension you wouldn't expect to hear.\"the Raven That Refused To Sing\" is an excellent example of a modern Prog Rock album that tributes the past with newer, more elaborate sounds and great, lush production. Steven Wilson skeptics will be, for sure, multiply after this album, because of its nature, on the other hand, it might turn on some that never really were into Porcupine Tree, because almost all traces of the band's sonic characteristics are gone. Steven Wilson seems to be maturing, abandoning his roots more and more, straight towards a brave, new direction."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Tuesday, March 5, 2013",
      "rating": 4,
      "text": "Reading some of Steven Wilson's comments to his fans here ans at other sites, I get the feeling that he has never been too comfortable with being labeled as a prog musician. And that feeling causes me to wonder if on this album he is making or making fun of prog.We all know that Wilson has spent much of his time the last few years making remixed versions of classic prog albums by some of the greats, including King Crimson, Emerson Lake & Palmer and Jethro Tull. It could be that here he is just paying homage. If so, it is fine homage. If not, it makes me think of Mark Wahlberg's character in the film \"The Other Guys\", where he becomes very good at all sorts of artistic endeavors (such as ballet dancing), just so he can show the other kids \"how stupid it is\".Don't get me wrong, just like Ian Anderson's thumbing his nose at the genre with \"Thick As A Brick\", Wilson has managed to create an excellent album of original music. But some of the influences sound a bit too cliched to my ear, and almost gratuitous.Luminol, the opener, is a gem of a track, blending old school prog with modern prog metal. It has a fantastic funky bass line, and uses Robert Fripp's own Mellotron for that retro effect.Drive Homeis slightly reminiscent ofMoonchildfrom the first King Crimson album.The Holy Waterhas some organ playing that borrows from Keith Emerson's history. All of these have fine flute and sax riffs that bring classic Mel Collins to mind.The Pin Dropis the weakest song on the album. Instead of looking back at classic prog, it sounds to me more like Wilson's Porcupine Tree efforts, that have way too much of the alt-rock sound for my tastes.The Watchmakersounds like a nod toward Genesis, with some light opening verses that would sound very much like the aforementioned group if Wilson sang with a thin, nasal Gabriel/Collins-like tone (luckily, he does not. The middle section of this tune reminds me of King Crimson'sOne More Red Nightmare, before a Tony Banks-like arpeggio brings back the Genesis feel, but with some Yes (South Side Of The Sky) and even a Rush lick thrown in.And the title track at the end is a good, but not overwhelming crescendo for this album.There are a lot of parts of this album that bring to mind very specific pieces of classic prog, and some that just capture the spirit of those bands. But even so, Wilson has managed to come up with a wonderful collection of music.Steven, if you read this and I am wrong about your intentions, I'm sorry. But I still love the album."
    },
    {
      "reviewer": "Second Life Syndrome",
      "date": "Posted Sunday, March 10, 2013",
      "rating": 4,
      "text": "3.5 starsJust about every review thus far for Steven Wilson's \"The Raven That Refused To Sing\" has been praising the album as a progressive rock masterpiece; as essential prog fare for 2013; and so on and on. While I do not disagree that this wonderful album deserves a spin by every true prog fan, I'm not sure I can call it a masterpiece.Wilson outdoes himself in this album with an amazing sound mix. He truly is a wizard: The 70's vibe that he portrays here is masterfully mixed and well written. Indeed, I really love the concept of an album all about ghost stories. I think Wilson knocked that concept out of the park. Not only that, but the musicians really amazed me. The musicians are very tasteful and restrained here, but can shred when they need to do so. The bass player and drummer especially amazed me with their unique approaches, instead of trying to just drown out everyone else. And, as always, Wilson's vocals are above average.Yet, I cannot slap a 5-star rating on this album. I feel that Wilson tried hard to write plenty of instrumental passages (maybe trying to impress progheads? Not enough lyrics? Who knows.), but they usually come off as wandering and pointless. Take, for instance, the first track, \"Luminol\". This track begins with an amazing bass line and instrumental portion. Yet, it is the best instrumental portion in the entire album! It is to-the-point and groovy. But, as the song progresses, Wilson loses his focus. I feel that way about almost every song; too much filler.That said, this album is very well done. The title track is already in my Top 5 songs for the year, for words cannot describe how masterful it is. You see, Wilson's composition is focused, emotive, and spell-binding on the title track; something he just missed in most of the other tracks. If the entire album had been as amazing as the final track, I feel we would already have the album of the year. As it stands, this is a great album; yet I think it will be forgotten relatively soon."
    },
    {
      "reviewer": "ProgShine",
      "date": "Posted Wednesday, March 13, 2013",
      "rating": 1,
      "text": "With The Raven That Refused To Sing And Other Stories (2013) I decided to finish my hate affair with this musician. I don't like Steven Wilson's music, period. I tried far too much with many Porcupine Tree albums and now in his solo carrer. And that will not change with The Raven That Refused To Sing And Other Stories (2013), his new album.What everyone else seems to praise in his music I find annoying, derivative, boring and very, very average. And I'm still trying to understand why he's considered a great mind in the 'New Days Of Progressive Rock'. And if he is, we're definitely screwed.To begin with, I find his voice annoying and his composing dull most of the time and all seem to be too derivative. Everything was done before... and better.I must admit that Nick Beggs, the bass player, is someone to pay attention to, especially on the first part of 'Luminol', the opening track. But soon his playing is buried under Wilson's music. There's a bunch of nice flutes here and there, but Wilson ruined it with lots of ridiculous keyboards and a fake drum sound. And they call him 'genious of sound', I still wonder why!The opening track is the only exception of good moments in The Raven That Refused To Sing And Other Stories (2013) And it's quite obvious that Steven Wilson wrote this album while he was doing the 5.1 versions of King Crimson albums, that's for sure, cause it's almost a copy of their work, as with others of his albums. Solo, with Porcupine Tree or whatever he records.There are some nice moments here and there, but all in all the album is so... empty. There's nothing IN it. It's only an empty shell, it's only... posing. All for show. It's like Wilson was sitting with his notebook making a list while recording: - Mellotron - checked - Minimum 10 minutes lenght - checked - Late 60's atmosphere - checked - More mellotron - checked - Epic ending - checkedA VERY average album, and of course will not change my mind about Steven Wilson A forever average Joe in Prog World to me.But you cannot argue with one thing, Wilson is an amazing... seller. He'll sell his fans an empty box and they'll buy with a big smile on their faces."
    },
    {
      "reviewer": "Einsetumadur",
      "date": "Posted Thursday, March 14, 2013",
      "rating": 3,
      "text": "8.5/15P.This album leaves me helpless. So many decent ideas and so much talent here, but why does it all need to besostraight and perfectionist that even during the concerts the video clips are perfectly synced to the music?I still remember clearly most of the moments which defined and shaped my life. And I'm grateful that I don't only remember them, but that I'm also awarethatthese situations had a distinct impact on the course of my life. These situations include social ones, experiences connotated with different places, and - which is why I am here - confrontations with music I didn't know before, or music whosequalitiesI didn't know until a variable number of listens. For instance I attended a multimedial show in a planetarium when I was a child, a show in which they played back Pink Floyd music while presenting films made in space. The effect which this little show made on me is invaluable in retrospect. Many years later, in 2011, I first listened to the debut album by Caravan, and the massive organ carpets suddenly catapulted me into a higher dimension - or, to put it more factually, into a different understanding of music. At a different time I - having bought and decently enjoyed a lot of albums of that genre before - listened to Steeleye Span'sLowlands of Hollandon one summer evening somewhere in the fields. I had listened to this piece many times before, but on this occasion it opened the whole world of folk music for me, converting the unknowing enjoyment into a kind of spiritual connection to these sounds. Just as if I had been walking up a mountain in misty weather a thousand times, wondering why the people make such a fuss about mountaineering, then until one clear day when I finally see mountains at a distance of more than 200km. I also had a similar experience in February 2013 when Junip released their singleLine of Fire, which kept me confident that transcendental music did not die in 1977, but rather transformed itself into a different style along with the huge changes in society which occurred since then.Just looking at the credits and the artwork of Steven Wilson'sGrace For Drowningin 2011 I knew that this album could be a huge cornucopia of good ideas. Still, after a lot of listens, I cannot really manage to view and estimate that album as a whole; but especially the electronic parts, which remind me of Steven Wilson's early trip-hop excursions, and the ambient parts with Wilson's restrained multi-instrumental works (dulcimer, autoharp, harmonium etc) always keep me motivated to listen to this album again and again, each time hoping to find something new.I was pretty excited aboutThe Raven That Refused To Singwhen I pre-ordered it in vinyl at Burning Shed.Get All You Deserve, and especially Holzman's inspiring keyboard madness inLuminol, maybe didn't appear to me as a genuine musical masterpiece, but definitely as a step in the right direction - in a musical genre in which most of the time every step you make is a step into the past, a step closer to artistic insularity and musical fundamentalism....COMMENDATIONS...Let's start with the positive aspects of this albums - and there are quite a lot of them. Again, the maniac electric piano work by former Miles Davis collaborator Adam Holzman, stands out onLuminol. The electric piano is fed through distortion devices and a ring modulator, and in the end the intensity of this stuff equals Dave MacRae's (Matching Mole) and Steven Miller's (Miller/Coxhill) more furious solos. The bass work by Nick Beggs is similarly convincing - especially the tritone-laden solo riff is quite a treat. Okay, the 'key chords' of the song are slightly derivative of Soft Machine'sPig, but I don't really mind this. At the latest, the Porcupine-Tree-ish mid-90s breakdown with the strummed electric guitar and Govan's jazzy lead guitar is able to put the same kind of big smile on my face asThe Moon Touches Your Shoulderonce did.Govan's lead guitar in general is pretty good; he orients himself a lot towards Steve Hackett in terms of technique, but he might be the man in the band who puts the biggest emotion in hisplaying. He helps making the balladDrive Home, which wouldn't be out of place on Porcupine Tree'sThe Incident, being a perfectly good listen at least over the first 6 minutes - afterwards it tends to become a bit overlong. Many critics highlight this track as the least convincing track of this album, but it grabs me as a pretty great piece of wistful alternative rock - the genre Wilson (until now) had the greatest artistic success in. The second half ofThe Watchmakerheads into a similar direction and is similarly successful. In retrospect,The Incidentwas a pretty good album after all!Thetitle track, a sparsely instrumentated neo-classical piece with grand piano and dense string arrangements, subtly builds on the cold atmosphere which was already conveyed onGrace For Drowning. The accompanying music video, an unusually sinister and insightful cartoon, is able to add a new dimension to the story which depicts a topic which the whole album actually reflects: aged people looking back on a life of losses, lost chances or wasted time. FormerHatfield & The Northkeyboarder Dave Stewart is again aboard as the arranger, and although his work is harmless and quiet compared with his eccentric Northettes choir arrangements, the orchestral work is tasteful and well-conducted. In the finale of the track, performed by the whole band, the strings really cumulate and rise and create something like an uplifting coda of a mainly cold album.Alan Parsons' production is warm and absolutely good, but it ain't exactly imaginative. It's subject to the compositions - like quite a lot of aspects of this album. Although I enjoy Stewart's arrangements quite much, they mostly have the quality of film music. Don't get the album for Dave Stewart's participation, however, if you expect something likeMumps- he's more or less a studio musician here; no keyboards performed by him, of course....OBJECTIONS...In spite of these good (and sometimes great) moments, the first listens of theThe Raven That Refused To Singalbum, both in the studio version and in Wilson's Cologne live concert, however, were a bit disappointing. It's neither that I would call this album boring - boredom occurs when a musician has a lack of ideas, and this ain't the case here. Nor am I annoyed by the neo-prog plagiarism phenomenon - there are some moments which fit into this category, but Wilson has too much knowledge of progressive rock and craves too much for creating something of his own to simply copy an idea by a different musician.The problem rather is that I feel too comfortable in the consistently safe fairway of this album. When you listen to the tense Gilmourish introduction toThe Pin Dropyou know that some verses into the song Wilson is going to break into another tritone-filled dissonance, most possibly with fat guitars, mellotron or backing vocals. And, voila: at 1:14 the surmise proves true. I maybe would have expected this part to be mixed more differentiatedly (it's a bit of a mayhem), but whatever - it was pretty clear that something like this would come.The same case inThe Holy Drinker. When I saw that the song turned to quietness about two minutes before the end of the song, I knew that it was time for the big finale with metal guitars, dissonant counterpoints and busy drums. Go to 8:32 and listen to what happens. It's a biological fact that an immediate loud keyboard chord after a period of silence is a surprising moment, but too often it's hardly more than an effect here. Genesis'The Musical Box, for example, had a mighty finale which acted as the end of a big arc of suspense. I don't find this suspense onThe Raven That Refused To Sing- here it's more a kind of 'arc of structure' or (expressed a bit unfairly) 'arc of predictability' which keeps the pieces together.You might wonder why I have never mentioned Theo Travis in this review until now. Well, that's because he rarely attracts a great deal of my attention during the album. Not because he ain't able to do this - in fact, his tiny little flute lick inThe Sky Moves Sideways, Phase Twois frequently swirling through my head. As a part of the Steven Wilson Band Theo Travis is a part of the arrangement, subject to the songs and their structure. The same issue with Adam Holzman: a passionate jazz pianist with his rare glittering outbursts on electric piano and Moog - not only inLuminol, but also inThe Holy Drinker(0:28 onward, great) - but most of the time playing block chords and the occasional Hammond organ, the latter (sadly quite often) sounding like it always does on retro prog albums.I cannot count out that my way of listening to music is too arrogating - maybe Wilson's music isn't addressed to fools like me who raise foolish predictions how the next part of the respective song could sound. And I firmly believe that real musical progress is always bound to technical progress - this is how rock music came into being. At the moment, there's no current invention like the first synthesizer or the first electric guitar. Hence itdefinitelywould be arrogating to say that only revolutionary music is good music. And definitely this ain't how I perceive the nature music either.Those of you who have read some of my reviews may have noticed how much I like (mostly British and Celtic-based) folk music, which is arguably the most minimalist music ever in terms of composition. There might be songs which are sung a capella, and they might be absolutely striking and beautiful - without complex chords, without instruments, without any arrangements. With just a voice and a melody sung to the endogenous metre of the lyrics. What brings sparse (and often ancient) pieces like these to live is first and foremost the delivery, the performance.And this is the last aspect I'd like to point out about this album and my opinion of it - perhaps it's just a folly of my thoughts, but perhaps it's also a hint for some to listen to this record in a different way. A possible, and in my opinion plausible, explanation for my ambivalence towards Wilson's work is that he himself is an ambivalent musician. An emotional composer on the one hand, a cool performer on the other hand. The melodies and chord progressions themselves are absolutely inspired and filled with true sadness, anger and an occasional bit of hope. But, especially seeing Steven Wilson live as a performer, it seems he excludes the emotions as much as possible from his playing and singing - at least when these feelings threaten to disturb the structure of his work. I've already pointed out which aspects I complain about the music itself - but when played live the music is played in exactly the same way as in the studio (apart from some parts of the solos), perfectly synced with the music videos which are played in the background.The guitar playing on certain bits and pieces, for instance, slightly resembles Anthony Phillips' guitar work - arpeggiated 12-string-guitar chords, most clearly to be heard onThe Watchmaker. I don't really hear a clear hint at theTrespassmaterial, but more likely an appreciation of his solo work (Private, Parts & Piecesetc). But, again, I don't really care about this - the guitar playing is just fine. But the playing defines a certain mood, that special Victorian sound which Genesis later combined with the dark British horror stories. Wilson also has a horror story to fuse with this song, a story of an old man who kills his woman after many years of marriage. But when Steven Wilson's really smooth and clean voice sings lines like\"though all the cogs connected with such poetic grace, time has left its curse upon this place\", it feels too smooth and pathetic - especially when Nick Beggs' similarly clean voice provides the harmonies....SUMMING UP...My simple understanding of the development of Wilson's compositions is the following: Wilson's lyrics are stories of human imperfection. Stories which are later set to music and stylistic devices deducted from the (originally alternative and radical) progressive rock genre. The resulting music is then performed flawlessly, technically perfect and strictly according to Wilson's demos. Maybe the songs already determine how the finished album is going to sound before the members of Wilson's band have even gotten to know them.The first two steps are authentic - everything's alright until here.But this last step, the way of performing the music, clearly is the major inconsistency between Wilson's approach to music and my personal expectations. As I was standing there during Wilson's Cologne concert, in some moments I waited for some kind of variety, maybe even for some kind of revolution. I asked myself why Wilson doesn't do what all of his heroes did at some time - simply jamming and improvising around occasionally. His whole band would be able to do that. Many Canterbury Scene concerts of the 1970s seemed to be totally spontaneous (especially when Richard Sinclair was involved), with lots of lengthy improvised parts and unexpected guests. King Crimson used to mix up a setlist of strictly composed pieces (such asFracture) with different jams - some of which ended up in a mess, and some of which proved successful later on. Moments in which one band member just turns around, briefly stops playing and smiles because he's so moved by what another band member plays.But Wilson's band? It's in top form everyday, doing always the same (carefully set-up) setlist, the same encores, the tracks always in the same length, always professional, always tight, perfect timing. But seldom a moment of intense joy in any musician's face, rarely a cathartic moment, never a song in which the musicians subject themselves to their current feeling, to the feedback of the audience, to the state of mind which the musicians and the listeners share when they decide to spend an evening together in concert.I don't want to claim that Steven Wilson is an all-dominant band leader. Everyone who has seen Wilson working in the studio with the band or with Akerfeldt finds that he is a pretty cool guy during the sessions. But he is a perfectionist, and the musicians who surround him are more than sufficiently versed in terms of playing abilities to cope with his ideas.But maybe I still haven't found the key to this kind of music, just like it was the case with Steeleye Span - who I also would have rated 'good, but non-essential' a few years ago. Irrespective of how good this album is, it's quite unlike everything Wilson has conceived before. Instead, it gets closer to The Flower Kings, The Tangent and all the other bands from the retro prog realms. I'll surely give this album (and, of course, the more eccentricGrace for Drowning) more than just a few more spins, but I doubt thatThe Raven That Refused To Singwill ever enter the top40 of my personal favorite albums - contrary to the top40 of the ProgArchives which it has already entered by now (03.2013), just two mere weeks after its release."
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Saturday, March 16, 2013",
      "rating": 5,
      "text": "After what appeared to be an ambitious personal 2-CD album, a happier Wilson decided to go deeper into the progressive genre and write fictional stories involving the paranormal.Luminolmight be Wilson's homage to the genre of progressive rock, particularly Yes and King Crimson. You have an energetic overture, extended instrumental acrobatics, retro production, an epic mellotron solo, and so on. What's great about it is that it's very coherent and remains highly interesting throughout its 13 minute duration.Holy Drinkeris a fantastic song as well. It opens with a vibrant jazz-fusion jam, leading to the main portion of the song, which has a 70s hard rock vibe with a great usage of mellotron. An ambient, eerie section introduces a hellish heavy metal section with dissonant arrangements.The Watchmakeris my favorite with a storybook structure to it. It emphasizes melody but offers plenty of dynamics to keep it going. The sinister ending may be an acquired taste but I find it essential to the song's balance between light and dark elements.The shorter songs are of the highest caliber as well.Drive Homemight sound familiar, but the melodic choruses and the passionate guitar solo are still highly enjoyable to me.Pin Dropmay be short, but it has a powerful drive to it and offers great hooks and instrumental workouts. The movingThe Raven That Refuses to Singis the most minimalistic song in the album and is quite the tearjerker.It's unbelievable how someone can have the talent to produce music this close to perfection. This album reaches the quality of the finest 70s progressive rock albums."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Sunday, March 24, 2013",
      "rating": 5,
      "text": "Steven Wilson is arguably a modern genius of the prog community along with Mikael Akerfeldt, yet when they both came together for the Storm Corrosion project it had little impact on me. Wilson however as a solo artist has become intensely passionate about his music, and his solo albums are incredible masterpieces, especially 'Grace For Drowning' that floored me to the point where I had to obtain the deluxe version. Having to follow up such a brilliant album is not an easy thing but somehow Wilson has done so with a flourish that has heralded in the 2013 year in admirable style. Alan Parsons was on board to engineer this album so one would have to expect a high quality sound and it doesn't disappoint.The album cover is like a rash all over the net with the astonished moon looming full and iconic in the darkness. The artwork is simple but embeds itself into the conscious easily and thus does its job to gain attention. The rest of the artwork in the Deluxe Version booklet consists of line drawings, some colourful paintings of the dishevelled looking kid in dense locations, a miserable man looking into a beer glass, later drinking a shot, some disturbing scratchy drawings, darkened stairwells and window frames, creepy faces staring out, images of a house, a tree and the scrawny watchmaker at work as his wife looks on, frames from the 'Raven' video clip with snow falling down in the forest, and the shivering old man pursuing the elusive bird. The booklet is extensive and arty as one might expect, and ends with an amusing drawing of the band playing looking like thin men with Wilson headbanging away. The artwork on the CD is the Raven looking mystical and enigmatic, and of course if you did get the Deluxe package you also have a 7 song demo to indulge in and the album in 5.1 sound on a blu ray and a DVD thrown in with all the clips and interviews.'The Raven That Refused To Sing' has been promoted with film clips hovering about on the internet way before its release date and the film clip images that accompanies the title track are extraordinary. Wilson has reinvented himself again on this album, discarding the darkness of 'Grace For Drowning', and embracing a sound more akin to Porcupine Tree, oddly enough. The title track is masterful, and as it was the first track I heard initially I will start here. It is laced with beautiful keyboards and a pretty melody masking the downbeat lyrics that focus on the man's dead sister, that haunts the storyteller like the raven, and he misses her terribly and dreams of her to return to him; 'Just because I'm weak, You can steal my dreams, You can reach inside my head, And you can put your song there instead.'Lyrically the poetry in the song has a melancholy edge. The images on the clip of an old man in a forest encountering a raven and then pursuing it finally capturing it and then dying, have a profound symbolic resonance. According to Wilson, the songs have classic Gothic ideas interspersed with suggested dread, regret, loss and the fear of mortality, or impending death, thus the omen of the Raven. It is these ideas that create a very unique atmosphere on the album. The raven essentially becomes, in the mind of the old man, a reincarnation of the old man's dead sister, and in his own delusion he believes if he can capture the raven and hear him sing he can recapture the life of his dead sister. The music is stripped back at times to a piano reverberating in the stillness. Wilson knows how to build on musical ideas and surpasses himself with such tracks, the mesmirising and haunting beauty is superb.The album opens with 'Luminol' with a delightful pulsating bassline and reverb wah wah guitar splashes. Musically the album is faultless and the flute enhances the quality. There are some wonderful Yes-like multilayered harmonies for a moment and then the extended musical break dominates, with an odd time sig, an intense spectrum of bass, pounding percussion, floating flute, and Mellotron sounds. The electric piano runs have a 70s vibe especially when it builds with a shimmering soundscape, and utilising distortion devices and a ring modulator to good effect. At 4:35 it settles into a minimalist rhythm guitar and Wilson's vocals, in his reflective mood, with references to pop culture, 'the songs he learned from scratched LPs, stops in mid flow to sip his tea.' The lyrics centre on a protagonist who has died even in death continues to discover answers through reminiscing on the past or reflecting on a life that has faded; 'He strums the chords with less than grace, Each passing year etched on his face', is a reflection on how one might feel as we are 'born into a struggle, To come so far but end up returning to dust.' This ghost is a metaphor of fear and our obsession with mortality, according to Wilson in his online interviews.Wilson doesn't labour on grim themes or death however throughout, and this album has more rays of hope than the shadows of despair found on previous releases, and leaves one with a profound sense of fulfilment. The music is uplifting and energetic, infused with passion throughout and progressive ideas using all the musicians at Wilson's disposal. The flute playing of Theo Travis is exquisite, but I am a real fan of that grinding organ by Adam Holzman, and the way the guitar interplays creating those endearing melodies. 'Luminol' is a masterpiece of the album and a promise of things to come.Next is 'Drive Home' that opens with a sweet Neo-Classical melody that sounds partially like 'Castle In The Clouds' from 'Les Mesirables'. When Wilson comes in on vocals, the signature locks into a steady measured pace. All is held back like the old days of Porcupine Tree or the 'Deadwing' era. There is a remarkable beauty that emanates from the Mellotrons that sound like violins. The chorus is Wilson at his most melancholy with thought provoking lyrics; 'You need to clear away all the jetsam in your brain, And face the truth, Well love can make amends, While the darkness always ends, You're still alone so drive home.' The instrumental break is stripped back to a nice fingerpicking guitar motif, like Steve Howe, and Travis's achingly beautiful flute is layered over. The lead guitar break of Guthrie Govan that follows is incredible, soaring emotionally and adds so much depth to the overall atmosphere.'The Holy Drinker' is a glorious throwback to the eclectic prog of vintage King Crimson meets Van der Graaf Generator, with elements of jazz fusion and mind blowing dissonant saxophone blasts. It opens with the wavering keyboard sound heard on Van der Graaf Generator's 'A Plague Of Lighthouse Keepers', then breaks into a cacophony of sound like a jazz shop exploded. Theo Travis is master at the sax helm and Wilson is the commander as he constructs this disharmony of musical instruments. I adored this on first listen and it soon became the quintessential track of the album for me. After this outlandish intro, the song finds some semblance of structure and Wilson sings some odd lyrics that I don't want to think about too deeply; 'With shaking hands and blackened heart, The glass he pours, this time it's also the last, In rapt communion with himself, The Holy Drinker is going straight in to hell.' On cue the song breaks into extended soloing with some wonderful organ and chirping flute taking centre stage. I love how the organ has that Keith Emerson 'Tarkus' sound at 6:25, but a special mention goes to the sporadic drumming of Marco Minnemann and Bass of Nick Beggs that are always on target and played to perfection. The song settles into Wilson's echoing gentle voice at about 8 minutes in, but it feels ominous as though the jazz fusion will break out at any moment. Then a grinding Van der Graaf Generator organ sound growls viciously with a downbeat tone, joined by odd rhythmic guitars. This feels like the coda of VDGG's 'White Hammer' and it is ferociously off kilter enough to jar the senses to their most awakened state. AlI in all a furious blast of masterful music and one to seek out for those interested in checking out the best on the album.Thus far the album is astonishing, nothing less than brilliant prog, so I was looking forward to the next half. 'The Pin Drop' is the shortest song at 5.03, and has Wilson on his highest register tone singing; 'Carried away by the river that passes through bulrushes on to the sea, Dragged by the current to rest on the stakes of the breakwater shaded by trees, Beginnings and endings, love intersecting a rift that will break us apart.' The return of the sax is so welcome, and Travis lifts off with massive runs and haunting squeals of jazz ecstasy. The song moves into a Twilight Zone like atmosphere melodically, and feels again like vintage Porcupine Tree. The layered harmonies are exceptional and create a wall of sound, and all is augmented by the accomplished lead guitar solo of Govan. All this in 5 minutes, simply incredible work from Mr Wilson.'The Watchmaker' is another of the album's epics, and showcases Wilson's poetry in the lyrics; 'The watchmaker buries something deep within his thoughts, A shadow on the staircase of someone from before, This thing is broken now and cannot be repaired, Fifty years of compromise and aging bodies shared, Eliza dear, you know there's something I should say, I never really loved you but I'll miss you anyway.' The music is appropriately like a music box chiming, very Gabriel-era Genesis in fact, and is enhanced by dreamy flute embellishments. There is a glorious lead guitar solo, perhaps the best on the album with Govan taking on speedy licks effortlessly and the squeaky sax joins in and it suddenly reminds me of Pink Floyd. The song takes on a new format then with piano runs and Wilson's voice emanating thoughts of the Watchmaker who reminisces on a dark deed involving the murder of his wife who has returned from the grave; 'But for you I had to wait, Until one day it was too late.' The music and harmonies become more romantically intertwined utilising old school 'do do do's' and then finally it breaks out into an odd time sig and some glistening piano sparkles, a booming bass solo reminding me of Rush's Geddy Lee. Finally the next phase of the music becomes dissonant with weird off tones in a 7/8 meter, being used where they should not, creating a disquieteing effect. This is a complex piece of music and perhaps the darkest track on the whole album, more like the 'Grace For Drowning' themes than others on offer.It ends of course with the beauty of 'The Raven That Refused To Sing' and we are left with an astonishing album of dark haunting power as only Wilson knows how to create. This is certainly a different creature than 'Grace For Drowning' and did not impact me like that masterpiece, and yet this latest release is mesmerising on every listen. It is an album to listen to with unwavering focus, as is all of Wilson's work; music designed for headphones. It is hard to rate this album as everything is so well placed and perfect; Wilson throws in so many ideas that it is impossible not to enjoy this if your ears are attuned to experimental progressive ideas. It did not measure up to 'Grace For Drowning' for me, but still is a masterful album presented in a compact form of less than an hour. If you want more, the Deluxe version is ample enough though did not add that much musically, but more artistically. The experience is sheer joy when an album comes out that embraces all that is great about prog. The sax, the organ, the lead guitars, the rhythms; all are played to perfection. Wilson's voice is faultless and his ideas are poetically conveyed to precision.Perhaps it is too perfect and too calculating for some listeners and I can understand how this can be off putting, and why it has received mixed critical reactions. However, Wilson is nothing short of passionate about his music and every note is placed to generate a congenial effect to enhance the overall experience. This is a series of stories, as the album titles states, and each story has its own atmosphere and style though there is a consistency in the thematic juxtaposition of music and vocals. It is a far superior album to some of the earlier Porcupine Tree albums and indeed Wilson's debut solo. I would rank it easily among his greatest triumphs, and certainly it is going to be one of the albums of the year. An album this bold and inventive deserves full recommendation and thus far it is the best release in 2013, so 5 shining stars to a modern musical genius that continues to produce prog at its highest caliber."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Sunday, March 24, 2013",
      "rating": 5,
      "text": "Like Grace for Drowning, The Raven that Refused to sing finds Steven Wilson exploring a range of old-school prog textures and sounds, but this time around I think I can detect a few more influences creeping in from Porcupine Tree's indie rock-influenced phase (the triptych of Stupid Dream, Lightbulb Sun, Recordings), particularly on the plaintive Drive Home.The sessions were engineered by Alan Parsons, and on an initial listen I didn't feel this added much to the album - Wilson's projects are usually impeccably engineered whatever name they issue under, and it felt like Parsons' involvement was solely for the nostalgia-baiting name recognition factor - but after giving the album a bit more a chance it felt like Parsons' touch added an even more authentically throwback-prog sound to proceedings.In general, the album itself nicely develops on Grace for Drowning, mellowing its King Crimson-esque fusion jam sessions with more tranquil and gentle phases. On initial listening, I wasn't too taken aback, but it's grown on me significantly on subsequent listens. Though it doesn't quite have any piece as monumental as Raider from Grace For Drowning, it's also a bit more compact - it's a single-disc affair rather than a 2-CD epic - and by now I am entirely sold on it."
    },
    {
      "reviewer": "J-Man",
      "date": "Posted Monday, April 1, 2013",
      "rating": 5,
      "text": "Although following up a record as masterful as 2011'sGrace For Drowningis no easy feat, the multi-talented Steven Wilson has managed to craft yet another stunning masterpiece withThe Raven That Refused To Sing (And Other Stories). Released in early 2013, Wilson's third solo observation follows a progressive rock template similar to that ofGrace For Drowning, but it sounds like a decidedly more band-oriented effort. Wilson has recruited an all-star lineup to complete his vision onThe Raven That Refused To Sing (And Other Stories), featuring Guthrie Goven on guitar, Nick Beggs on bass, Marco Minnemann on drums, Adam Holzman on keyboards, and Theo Travis on saxophone and flute. It givesRavena vastly different feel from its guest-dominated predecessor, and while the album should not sound foreign to anybody well-versed in progressive rock, it sports a fresh sound distinct from Wilson's other offerings.The Raven That Refused To Sing (And Other Stories)is largely an exploration of classic progressive rock, perhaps in a more symphonic vein than anything Wilson has ever done - the lengthy, fusion jams inGrace For Drowningare replaced by more concise instrumental portions, and a few alternative touches in the vein of Porcupine Tree sneak their way into the mix, particularly in the goosebump-inducing title track and the surreal \"Drive Home\". That isn't to say thatRavenis without killer fusion sections - the firey solos in \"Luminol\" and the the strangely funky opening to \"The Holy Drinker\" immediately discredit that notion - but the focus this time around is more on tight band dynamics, rather than long fusion jams reminiscent of seventies' King Crimson.Whether or not that's a good thing ultimately depends on the listener; personally, I find bothGrace For DrowningandRavento be stunning masterpieces for different reasons. Tracks like the fusion-influenced \"Luminol\" and the wonderfully symphonic \"The Watchmaker\" stand as some of the finest songs in Wilson's vast catalogue, and the rest of the album is equally impressive. A fine example of a record with \"all killer, no filler\",Ravenremains strongly engaging throughout its full duration thanks to an abundance of captivating hooks and flawless execution. Though Wilson has worked with plenty of great musicians over the years, the ensemble here is possibly his finest to date. Similarly to Frank Zappa's definitive lineups, the group chemistry here is remarkable - Nick Beggs and Marco Minnemann make for one of the most dynamic rhythm sections in modern prog, and the strong lead instrumentalists (particularly Guthrie Goven's tremendous fretwork) make for an album that is as pleasing aesthetically as it is compositionally.As expected from anything Steven Wilson touches, the production is held to strict audiophile standards and is given a balanced, powerful mix. Industry veteran Alan Parsons was also brought along to engineer the album, and whilst Wilson would've been capable of doing a tremendous job without assistance, it's cool to hear him collaborating with a talented artist that was undoubtedly influential in his formative years.One could certainly criticizeThe Raven That Refused To Sing (And Other Stories)for being too faithful to the sound of classic seventies' progressive rock, but I think that Wilson's ability to stay within the confines of the genre while still maintaining a strong sense of style and originality is one of the album's finest assets. In my opinion at least,Ravenis a deeply emotional masterpiece from start to finish that will likely be a contender for album of the year 2013 for many listeners. Although the future of Porcupine Tree remains uncertain, this album is proof that Steven Wilson won't be falling off the radar anytime soon!"
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Wednesday, April 3, 2013",
      "rating": 5,
      "text": "'The Raven That Refused To Sing (And Other Stories)' - Steven Wilson (9/10)Although Porcupine Tree wasn't exactly a band known for narrow scope or resistance to experimenting, I've always appreciated Steven Wilson's choice to release some of his music as a solo career. Not only has it let him collaborate with a much wider range of musicians, it also frees listeners from many of the preconceptions they may have about his flagship band. As a result, Wilson's three solo albums to date have enjoyed a greater sense of risk and daring than much of Porcupine Tree's regular material. \"Insurgentes\" was impressive for its experimental nature and inclusive variety, and \"Grace for Drowning\" fleshed out the ambition with everything from finely crafted pop tunes to explosive jazz fusion. As with the last two, I don't think that \"The Raven That Refused To Sing\" would have struck such a note with me if it had been released under the Porcupine Tree banner. Although Wilson's staple production and flair for the melancholic are here in no short order, he takes this opportunity as a way to put a focus on his instrumental side that hasn't been often seen before in his career, solo or otherwise. The resulting focus on jazzy band dynamics and progressive rock tradition makes \"Raven...\" Steven's least varied but most focused solo effort to date. Also, it's a concept album, and that's pretty cool too.On \"Grace for Drowning\", one of the most peculiar tracks was the behemothic \"Raider II\", a twenty three minute, largely instrumental monster, taking King Crimson-esque rock musicianship and jazz-based improvisations together in equal measure. On my initial experience with it when the album came out in 2011, I interpreted it as a bold declaration that the work of Steven's solo career was a conscious step away from his Porcupine Tree material. Now, I see it more as a predecessor and hint of what was to come onthisalbum. Although Wilson gives longtime fans a dose of the classic PT sound with tracks like \"The Pin Drop\" and the cinematic title track, a great deal of \"The Raven That Refused To Sing\" focuses itself in on that prog fusion instrumentation. Whether it's a meticulously calibrated passage, or a mellow interplay between the piano and rhythm section, \"Raven...\" transposes Wilson's genius for composition into a realm that he has never dedicated himself so fervently towards.Possibly the greatest thing about \"Raven...\" is not even necessarily Wilson's writing and arrangement, but the musicians that he has chosen to surround himself with. More than ever, it feels like Wilson has fashioned himself a progressive rock conductor of sorts, letting some of the best musicians in the scene bring his vision to life. Most notably, Wilson brings on two thirds of the virtuosic fusion band The Aristocrats. Guthrie Govan (guitars) and Marco Minnemann (drums) are each masters of their respective instruments. Of the musicians involved however, the top accolades go to keyboardist Adam Holzman, arguably best known for work he has done with Miles Davis. Especially on \"Luminol\", his jazz improvisations are rich with detail, and his firm background in the jazz genre gives Wilson's music a different sound than it has had in the past. Steven Wilson's voice seems to be a love-or-hate-it case for many people. There is certainly a lesser emphasis on vocal melodies this time around, but his voice retains the same emotional depth I have come to expect. His overdubbed vocal harmonies are some of the best I've ever heard.Although it's certainly not the first time Wilson has done this, \"The Raven That Refused To Sing\" enjoys its status as a concept album. As the longform title implies, each of the songs here tells a different story, each about ghosts and an idealized notion of lost love. Of these, \"The Holy Drinker\" tells the most interesting story, about an alcoholic evangelist that plays a drinking game with Satan (spoiler: it doesn't end well). This dark subject matter is reflected musically by a constant exchange between catchy vocal segments and dark heavy instrumentation. \"The Pin Drop\" is another interesting piece, distancing itself from the album's lean towards longform instrumentation in favour of a more Porcupine Tree-esque song that seems to beg for 'single' status. Without a doubt however, the greatest piece on the album is the gut-wrenching title track and closing piece. \"The Raven That Refused To Sing\" (the song) is as haunting as Wilson's music gets. An eerie, filmscore-sounding piano piece plays under pensive vocals and ghostly synths. By the end of the song, it has built itself up to a thunder that hits the heart in a place only the best sort of music can hope to reach. To make it better, a fantastic music video was made for it that fits its ghostly subject matter wonderfully- well worth checking out, if you ask me.With the legendary Alan Parsons (whom you may know as the engineer for \"Dark Side of the Moon\") coming onboard to help on the production side of things, it's little surprise that \"Raven...\" is about as close tor recording perfection as one can get. Even during the album's most harrowing moments, every instrument comes through in full dimension, and are balanced with a mix that gods might praise. Despite this refined sense of calibration, the album retains a warmth and organic appeal that echoes many of the very same artists Steven Wilson has been influenced by on the record. While the classics of progressive rock are present in spirit here (with King Crimson taking the front seat on most occasions), many passages on \"The Raven That Refused To Sing\" sound very much like Wilson is also paying tribute to some of the more contemporary progressive artists he loves. There are many times on the album- particularly on the fiery groove of \"Luminol\"- where Steven Wilson sounds as if he's conjuring the style and scope of The Mars Volta. The lush title track begins as were it a Radiohead piece, but it eventually bursts into a life-affirming climax that instantly brings Anathema to mind. This mix of the old and new feels very natural given Wilson's tastes, and though the homages are often noticeable, no one influence ever takes over completely. With this being said, \"The Raven That Refused To Sing\" is widely defined by this sense of 'tribute' to other artists. In the past, many of Steven Wilson's bands and albums have had a staunch sense of personal identity and style. Here, Steven's voice is as distinctive as ever, but the instrumentation lacks that uniqueness and personal style that first made him part of the prog rock elite. Don't get me wrong; the music is excellent, but it keeps the album from having that life-altering 'wow' effect that struck me so much on \"Grace for Drowning\" and some of his Porcupine Tree albums.Steven Wilson's solo material has proven itself worthy to the point where I may be more excited for another album under his own name than something by his flagship band. Like Mikael Akerfeldt should have done when releasing \"Heritage\", the distancing from the name and style Wilson is largely known for has opened up so many new doors. With \"The Raven That Refused To Sing\", Steven has tried out something new and unexpected, fusing many of his favourite artists into something intelligent, classic and as musically proficient as a listener could hope for. Although it may not be the career-topping opus that \"Grace for Drowning\" turned out to be, this latest outing from Wilson doesn't show any signs of the multi-instrumentalist showing down. As a lifelong fan of Wilson's music, I can only hope for more of the same quality in the future."
    },
    {
      "reviewer": "Tony R",
      "date": "Posted Wednesday, April 10, 2013",
      "rating": 5,
      "text": "A Masterpiece Of Modern Progressive MusicSteven Wilson put Porcupine Tree on what seemed like permanent hiatus in 2011 and many fans were upset at the prospect of Steven's diversion into the solo path he started with Insurgentes. That album and Grace For Drowning were stirling efforts, with Wilson honing his prog chops steadily and absorbing the influences gained from re-mastering some classic Crimson and Tull albums.Then along comes The Raven That Refused To Sing (and other stories) brim full of the kind of confidence that critical success and fan worship brings. A settled band in place, Wilson reaches for the stars and delivers a masterpiece that deserves to be mentioned in the same breath as the classics of the genre. Every one of the six tracks on this album delivers, melding consumate musicianship with beautifully judged songwriting.I'm not going to analyse each track because they are all a tour-de-force in their own way. Beggs, Minnemann, Holzman, Travis and especially Govan bring Wilson's artistry to life with ensemble playing that matches any Prog could muster since its inception. Truly a spellbinding experience all kept together by the master conductor, Wilson. If he keeps creating masterpieces like this Porcupine Tree will be just a pleasant memory, the hors d'oevres to a stellar career.I'm astonished at some of the negativety directed towards this album, and Wilson himself. This is a genuine top class modern piece of progessive music setting the bar against which others must now be measured. Quite possibly the best progressive music album in the last 40 years. Yeah, it's that good!Highly recommended. 10/10"
    },
    {
      "reviewer": "kev rowland",
      "date": "Posted Sunday, May 26, 2013",
      "rating": 4,
      "text": "If I go through my music collection there are numerous albums by Porcupine Tree, No-Man (even a compilation with a song by No Man Is An Island Except The Isle of Man), Blackfield etc., so it can be said with some confidence that I am no stranger to the music of Steven Wilson, and it could even be argued that I am a fan. I also love many of the albums he has been involved with remastering, so why do I feel so strangely indifferent to this? There is no doubt at all that there are some fine moments on here, and it opens with some superb bass from Nick Beggs (who I like to think of as ex-Iona as opposed to ex-Kajagoogoo), yet for all its' complexity and cleverness it somehow leaves me strangely cold.As I write this it is the number one album of the year to date according to PMA, yet I would much rather play number 2 (Big Big Train), 4 (Comedy of Errors) or 5 (Riverside), but why? I have puzzled over this and the only conclusion I can come to is that for some reason this feels false. It is as if Steven is writing a prog album because he can, and knows all the buttons to press to ensure that it is raved over by fans and critics alike. There are wonderful harmonies, great swathes of keyboards, flute and mellotron, all being brought together to produce some wonderfully complex yet flowing prog but to my ears it all sounds somewhat contrived. Having read numerous reviews I have found it interesting to see that I am not the only who feels this way, although it is obvious that we are very much in the minority.What really irks me is that although I haven't enjoyed the album nearly as much as I wanted to, I can't bring myself to award it any less than 4 stars as it is such a clever piece of work. If only it contained a prog heart and soul it could have been so much better; although I am fully aware that most progheads will welcome this with open arms I'm just not one of them."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Tuesday, July 16, 2013",
      "rating": 3,
      "text": "Steven Wilson may have finally done it: He may have created an album that will stand, years from now, among the classic prog masterpieces of the 1970s. Though extracting many, many sounds, riffs, stylings, and themes from past masters, M. Wilson has woven together quite a tapestry of mature, masterful artistry. The opening song, \"Luminol\" (12:10), starts out part POLICE \"Synchronicity\" and part YES \"Close to The Edge\" (though, to be most accurate, more like WOBBLER's \"L6 Bealtaine\"). Once established, in high gear I am more reminded of YES' \"Tempis Fugit\" from Drama. Throughout the song it is the drumming that most attracts my attention, though the organ play is also pretty cool. The soft section at 4:50 is very nice--especially the FRIPP/BACHMAN electric guitar flourishes and, later, the flute play. From the 8:35 mark on they might as well be singing, \"But I fear tomorrow, I'll be crying. Yes, I fear tomorrow, I'll be crying\" (a la Greg Lake on KING CRIMSON's \"Epitaph\"), but the final two minutes again excels with its return to its original RTF \"Duel of The Jester and The Tyrant (Part I)\"/POLICE pace and outstanding collective instrumental performances. Like 2009's \"Time Flies,\" this is a great song despite its derivative sounds and parts. (9/10)2. \"Drive Home\" (7:27) begins exactly like a FOCUS/JAN AKKERMAN song (from Mother Focus? Or from Focus Con Proby?) before becoming pure Steven Wilson: plaintive singing voice, acoustic guitar, piano, light drums--a lot like \"Lightbulb Sun\"-era PT. Incredible melodies (including the AMERICA \"I Need You\" acoustic guitar picking foundation), great teamwork and sound mixing. The orchestration and clarity of mix make this a beautiful and powerful song despite its bucolic pace and soft-jazz feel. (9/10)3. \"The Holy Drinker\" (10:13) has an incredible RETURN TO FOREVER Romantic Warrior/Music Magic-era sound to it--including synth work reminiscent of Chick Corea, bass work reminiscent of Stanley Clarke, drumming reminiscent of Gerry Brown, and sax work reminiscent of Joe Farrell. Once the vocal section arrives the song has taken on a much more heavy element--kind of AYREON, THE TANGENT and NEMO-ish. I hear Andy Tillison- like keyboard play, Theo Travis's flute, and Keith Emerson-like organ play. The final section feels very ELP-like. Good song. (8/10)4. \"The Pin Drop\" (5:10) has an interesting OCEANSIZE feel to its first couple minutes--especially interesting considering the word \"pin\" is in the song title. Once the soprano sax solo takes charge, the song takes on a different feel--through the chorus, but eventually returns to the opening themes with multiple voices singing as if in some Mother Goose fairy world. The chorus section \"Love learned\" is stellar, and the \"I am tired of struggling\" bridge section is equally awesome. Really, with \"Luminol,\" this is a standout song for me. (9/10)5. \"The Watchmaker\" (11:43) begins with a kind of ANTHONY PHILLIPS/GENESIS Trespass-era feel (because of its 12-string guitars, no doubt). The vocal enters giving the song more of an AMERICA feel--doubly so when the multi-level vocal harmonies are used. The background pastoral flute solo is more like that of John Hackett on his brother Steve's first solo album, Voyage of the Acolyte. Yes, this feels strongly as if it is a Hackett/early Genesis reproduction. The upbeat turn treads more into the realm of WOBBLER's last album, Rites at Dawn--a carbon copy of the basic elements of \"L6 Bealtaine\" without the amazing vocal and vocal harmonies. The piano-led second part introduces some new themes and instrumental combinations along with some excellent multi-layered vocal harmony work--part Moody Blues, part CSN&Y, part The Association--followed by some awesome sax, bass, and drum soli. Chris Squire-familiar bass riffs precede a psychedelic, mellotron-enriched section a bit like UTOPIA's \"Still We Are Here\" part of \"The Ikon\"--evolving more into something like \"The Ikon\" finale with its own finale. \"Watchmaker\" is an awesome recreation/imitation of some of the best delicate songwriter- singers of the 70s, though, IMHO, not nearly as good as WOBBLER or BROTHER APE. Still, this a very pretty song of sensitive instrumental play and vocal work. (8/10)6. \"The Raven That Refused to Sing\" (7:57) is, to my mind and ears, the album's weakest song--and also its least derivative of the past masters. It has more of a RADIOHEAD-Post Rock/Math Rock construct and feel to it, which is, in fact, IMHO, its downfall in that I'm always waiting for some big denouement or dramatic shift. Instead, it slowly--very slowly--builds around a very odd, persistent, RADIOHEAD-like piano chord progression, eventually crescendos and then dies. (7s/10)This is an album of reprocessed, reused, recycled and repurposed musical sounds, riffs, ideas--mostly from the 1970s. Though it is an excellent production of very well constructed and incredibly well performed songs, it really is all too familiar. BUT, I recognize and value the fact that someone with an incredible reverence for the music of the past has made an incredible effort to meticulously weave together splices and bytes from the past into new songs. Genius? Yes. Masterful? Yes. A masterpiece? Perhaps. Raven et al. is definitely my favorite work from Mr. Wilson since Fear of A Blank Planet?and much better than Grace for Drowning. And definitely one of the best albums I've heard from Y2K13. Though it seems too early to judge whether or not this will go down as a \"classic\" or \"masterpiece\" I have to admit that it has the feel of a classic masterpiece--one that will be played, remembered and perhaps even revered years down the road.4.5 stars, rated up for outstanding production, performances, consistency, maturity and memorability."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Sunday, October 27, 2013",
      "rating": 5,
      "text": "Unique music and a masterpiece! ...Everytime I plan to write my views about this album I always refrain myself as I wanted to be ensured by myself that what I am writing is really representing the truth, ie. what I do really feel about the album. And to tell you the truth it's hard for me to do so as I was not certain about my views as it was quite contaminated with how I felt with his debut album \"Insurgentes\" that I did not consider as a good album in some ways. But then I was impressed with his second \"Grace for Drowning\" which for me was an excellent one knowing his debut was so and so. But with this \"The Raven\" I put many doubts about it despite my first positive impression especially the first time I heard \"Luminol\" that really struck my head heavily. But now .. I am ready to write my views having spun more than eight times in its entirety. and I have to admit that this album has become my regular playlist.The overall album represents good memorable tagline melodies for every song it contains. I can relate the melodies lean themselves from the music of Porcupine Tree (Steven's band). It also has some sorts of complexities from the musical segments it has from start to end complete with change of styles as well as tempo and also some excellent transition pieces in silent segments among the tracks. The harmonies the album produces are really great and sometimes I feel like I am in the middle of something that I enjoy and suddenly it changes to a different nature. Amidst different styles and tempos of the tracks or in fact within the track itself there are many changes in style, the album has solid structural integrity from start to end.\"Luminol\" (12:10) blast off the opening experience with powerful and solid basslines by Nick Beggs and brings the music into dynamic and upbeat tempo at start. It's like listening to a kind of progressive metal music with no guitar riffs but it moves excellently from one segment to another. The inclusion of flute work by Theo Travis makes the music is richer in textures. It's really a great and masterpiece track especially when it has changes of styles and temo as the music slows down into silent parts where vocal starts to enter. Oh man ... this is really great opening track! It's not an exaggeration when I say that I have never the kind of music like this Luminol. It's wonderful, really!\"Drive Home\" (7:37) is melancholic in style featuring ambient vocal line by Steven that makes the music is interesting to enjoy. The guitar that accompanies the singing line is excellent. It moves straight forward with the kind of Porcupine Tree music, I think. \"The Holy Drinker\" (10:13) is another energetic and interesting track and it has become my personal favorite as well together with Luminol. Time signatures that Steven plays with his vocal is excellent! There are silent segments that were made to create the rich textures of the music. It reminds me to the Porcupine Tree style.\"The Pin Drop\" (5:03) starts solo and melancholic with unique vocal quality of Steven Wilson. It again reminds me to Porcupine Tree. \"The Watchmaker\" (11:43) starts beautifully with acoustic guitar that later accompanies Steven Wilson vocal. I really enjoy the melody that Steven sings throughout the song. It serves like a musical break until the acoustic guitar fills play differently backed with flute and keyboards. Somewhat I feel like in the vein of early Genesis even though it's different and ...here they go ...!!! Theo Travis plays his flute wonderfully continued with stunning guitar solo. Oh my God ... this is really great! The song moves in crescendo wonderfully! It moves through changes of styles as well as tempo. The end of the track is a dynamic music combining bass guitar and guitar in the vein of King Crimson (a bit).\"The Raven That Refused To Sing\" (7:57) is like a requiem at the end of the album indicating ambient vocal line of Steven with piano work played softly. His singing style is really great. At approximately minute 5 the drumming enters the music but the tempo is still mellow and dark, maintaining the nuance of the first five minutes of the song. The mellotron-like sound also demonstrated at the end of the track altogether with piano.Overall this is a perfect album that deserves five star rating. Despite the musical excellence like I describe above, the performance of the musicians is also great. I love the bass playing by Nick Beggs and also drumming by Marco Minnemann. Theo Travis also plays wonderfully. It's highly recommended whether or not you love Porcupine Tree / Steven Wilson. Sonic quality of the record is also top notch! .... Keep on proggin' ...!Peace on earth and mercy mild - GW"
    },
    {
      "reviewer": "frippism",
      "date": "Posted Friday, December 27, 2013",
      "rating": 2,
      "text": "I guess I'll have to be the one to say it?For me, reviewing album's I don't like has always been an absolute uphill struggle. It very hard for me to review album's as it is, mostly because I feel I need to know them back to front before I can review them. What I'm trying to say is that I usually quite like the albums I review.Sometimes though I feel I need to write a review for an album I don't like in order to expose more light on albums which I bought and didn't enjoy them much, so that people who do consider buying an album can at least hear the naysayers. I belong to the naysayer camp. \"The Raven That Refused to Sing\" is a not a bad album but one that puts me in such a state of apathy and boredom I have almost come to hate it (saucyyyyy).So yes, I have never been a fan of Steven Wilson, or Porcupine Tree, or Blackfield, or anything he has made other than half of \"Fear of a Blank Planet\" and his beautiful cover of Cardiacs's \"Stoneage Dinosaurs\". I feel that his work is many times solid, but almost never remotely interesting, or refreshing and unique enough for me to actually give it more than two listens. I was tempted to buy the album, for pretty much one dumb reason alone. The album cover is one of the most beautiful I have ever seen. If it wasn't such a mediocre album I would've probably stared at it all day. That gothic-y :O face gives me the creeps and can bring up many thoughts.The album itself, as you probably understand, isn't worth the purchase though. It starts very positively with the awesome intro to \"Luminol\"- the intro is a ridiculously tight and groovy bass and drum thing and it's pretty sick. It's when the synth comes in which I was starting to re-evaluate my thoughts, but still had hope. It was when the quiet section came and then the mellotrons and Fripp sounding guitars started was when I started burning my own house. OK those parts are alright but then a really average and not really needed guitar solo comes in and kind of spoils the song for me. Things don't get much better with \"Drive Home\". It is an alright ballad with some pretty keyboards but the production on Wilson's voice is overbearing and not really needed in my opinion. On the other hand, \"The Holy Drinker\" opens with a pretty awesome fusion King Crimson style jam that's alright, but the hard rock verses are terrible, but are salvaged by their beautiful second part where the aural keyboards add a really nice touch. The jams are a deal breaker for me. I generally don't like solos, maybe because I'm a bassist and pay close attention to the rhythm section and feel that if they're just there to support some other guy's noodling I stop paying attention. \"The Pin Drop\" in my opinion the worst song on the album. The melodies don't really do anything for me, and the lyrics are awful (\"It was not meant to be like this/ Drifting off without a kiss\"?????.).Luckily \"The Watchmaker\" has some very strong instrumental parts with great drum fills that make the song very enjoyable, though it is too long. The final ballad \"The Raven That Refused to Sing\" is actually a very touching song. With powerful lyrics and a strong harmony, I can enjoy it as a good ballad. On the other hand, it is plagued like most of the album with pretty hallow production- something I didn't expect from Wilson. The piano is really weak and lacked I certain oomph I would've wanted.Well, as you can see, this is review doesn't much beyond skin deep. It is because I feel it impossible to dig beneath this albums fairly shallow surface, my apathy constantly pushing me away. Wilson continues to be irrelevant while being undeniably a very able musician and producer. He has not reached out of his or anyone's comfort zone instead creating a horrifically solid old-school progressive rock album. It isn't nearly enough for it to be worthwhile.I do hope that one day Wilson will take his very much existent talents to new and interesting places because I think he has the ability to create some truly mind-bending music. Currently though, he's pretty comfortable making albums prog-heads will bob their heads too.P.S.: Enough with the goddamn flutes already, I've had more than enough of them."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Sunday, February 9, 2014",
      "rating": 3,
      "text": "Nice but not greatBefore I start my review, must say that I don't care for STEVEN WILSON'S music, so would had never bought the album but it was a gift from a friend and decided to listen it before I threw it to the box of albums that I won't listen again?.But I was positively impressed, the album is quite good, not the masterpiece that most people talk about, but a cute release from the modest 2013.I can't honestly say what's my problem with Mr. Wilson, because the musicianship is impeccable and the composition pretty decent, but it leaves me cold, there's nothing that moves me, as a fact reminds me of SQUACKET, I knew it was good, I knew that I was supposed to love it, but there's no emotional connection with the songs.The album is opened byLuminol, a jazzy, electronic track that took me by surprise due to the excellent bass keyboard interplay that reminds me of early MAHAVISHNU, everything seems to work perfectly until we reach the 4:30 minutes mark, when an anti-climatic gap makes me sleepy. Around the eighth minute the band tries to retake the frantic and powerful entrance, but the magic is lost and the song ruined.Drive Homeis a shorter song, but seems to last forever. God it really bored me to the point of wanting to press the skip button. Again, the performance is excellent (except for the vocals), but there's no life, no strength and what is worst, no originality, a tedious ballad that repeats itself during seven endless minutes.The Holy Drinkerretakes the excellent bass ? keyboards interplay with a strong KING CRIMSON influence that keeps me at the edge of the sit until the seventh minute when STEVEN WILSON loses it again with another tedious interlude that invites the listener to bed. The closing section is better, but not enough to reach the excellent level of the first seven minutes.Most of the reviews I read seem to dismissThe Pin Drop, but in my opinion, it's one of the highest moments of the album. The oneiric and mysterious atmosphere is really captivating, and the vocals don't annoy me. The percussion and guitar performances are simply delightful. A wonderful song that captivates me from start to end.The Watchmakeris a hit and miss, great ideas, some vibrant moments, but others pretty forgettable and tedious, especially when the singing begins. Not much to comment, I take it as a filler and a prelude for the amazingThe Raven That Refused To Sing, a magnificent track with a brilliant structure that goes in crescendo from a sweet intro to a powerful ending...A great closer for a good album.RatingThe Raven That Refused To Sing (and Other Stories)is a real nightmare, because some passages are really good, while others can only be defined as boring, the musicianship and production are brilliant but the composition has too many weak moments that really bored me, so I had to go with three stars, an average qualification for an album that could had been outstanding."
    },
    {
      "reviewer": "lazland",
      "date": "Posted Friday, April 25, 2014",
      "rating": 5,
      "text": "There was once an album called The Incident, by a band called Porcupine Tree, a band above all others I regarded as being at the vanguard of the latest wave of quality progressive rock, taking the genre into the new millennium and beyond. It was an album that I loathed, and felt, well, pretty let down. It was derivative, and one long tangled mess, in my opinion. The love affair was at an end.As it happened, this was the last PT album released. I purchased Wilson's Insurgentes, the debut solo release, and found it quite excellentat the time, although, tellingly, it has not been played for a long time. I did not bother with the follow up. The love affair was most certainly at an end.However, when some pretty respected people on this site rated this as a masterpiece, with Tony R stating it was the best prog album of the past 40 years, and when more than a couple of friends whose opinions I rate highly, mailed me to insist that I got The Raven........simply because it was awesome, well I could not resist. This is the joy of this site, that sharing of opinion and influencing buying patterns.I took my time. This album was released in 2013, and made several critic's album of that year. The accolades are well and truly deserved, and, in fact, the only confusion I have over reading the myriad reviews are those questioning Wilson's motivations in making this album. Aside from being sweet nothing to do with us mere hacks, I believe the answer is fairly straightforward. The motive was to make a fantastic album which not only sounded rich, took his band forward, but also took into consideration the number of influences garnered from being deeply involved in remastering classic prog albums, and blending them with the modern rock movement of which Wilson is such an important part of.Opener Luminol is a track that has those influences right there in your face. It is so Crimson that it even utilises the Mark II Mellotron that belonged to Uncle Bob and cohorts. It is a track that features sumptuous use of said cranky old machine, and delicious flutes, sax, and clarinet from Theo Travis, who would surely have recognised the Fripp influence from his work with the great man. Also, a special mention here to the thumping bass par excellence by Nick Beggs, who excels throughout. Here, surely, is a man who, above all others, has well and truly escaped from his musical beginnings.Luminol sets the scene for all else that follows. Not in the influences, per se, but in the sheer breathtaking excellence of a group of musicians who lovingly back their leader's vision of a collective of clever, intricate, and sumptuous musical pieces. Take the second track, Drive Home, staggeringly described as boring by another reviewer. Well, if a delicious ballad, featuring wicked guitar lines and sympathetic vocals delivering a song of redemption is boring, then give me boring any day. I regard it as being quite exceptional, a word, by the way, which amply describes the incredible guitar contribution of Guthrie Govan.Those are the opening delights. I am not going to deconstruct each and every track, because to do so would, I feel, really take away the whole point of this album, a collection of interesting, really rather introspective, and, above all, intelligent songs that demand listening to as a whole, and burying yourself in the wonder of sounds that range from the symphonic, lush, early Crimson period, through to the jazzy, hard fusion of later Crimson, to some of the rather lush melodic PT sounds which drew me to that band in the first instance, and thence to very classy, and pounding, heavier passages. Most of all, though, this is the vision of a unique talent, one Steven Wilson. No two tracks sound alike. Contained within each track are passages which utilise the vision and myriad influences at play, and, it is fair to say, make this an album which demands careful listening, and repeated listening which brings its own reward. Naturally, of course, the production is top notch. Simply listening to the beautiful, Mellotron soaked, lush feel of the marvellous The Watchmaker's early instrumental passages on my brand new sound system, and every single note from every single instrument is so crystal clear.This is an album which should be in the collection of every single reader of this review who considers him or her self to be a progressive rock fan, because this album, quite simply, is the epitome of how this genre should sound in the second decade of the 21st century. A fusion of the best of the old and new, but tellingly unique, and a collective of great individuals at the top of their game.I love it. A masterpiece, fully deserving the full five star review. The love affair is back on, with a vengeance.Now, then. What was the name of that bloody album I really did not like too much.......?"
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Saturday, November 8, 2014",
      "rating": 4,
      "text": "The biggest shock for yours truly is that i'm not giving this a five star rating. After seeing all the five star reviews when this first came out and hearing Wilson himself saying that this is the best album he's ever been involved in made me assume that I, a Steven Wilson fanboy would be giving this five stars, no doubt about it. Then I heard it. Just to backtrack a bit, I feel that \"Insurgents\" is the best solo album that Wilson has released(although the live \"Get All You Deserve\" is possibly even better) with \"Grace For Drowning\" a close second when it comes to his studio albums. Hearing about the lineup and that Alan Parsons the engineer for \"Dark Side Of The Moon\" was going to put his magic touch on this recording raised my expectations through the roof. Oh, I wanted to also mention that the great Dave Stewart arranged the strings on this album just like he did on ANATHEMA's \"We're Here Because We're Here\" album.Before I get into the tracks themselves I have to say that there are passages on this record that are thrilling to say the least, plus I felt so much emotion at times, this is a really good album. My first listen to \"The Raven That Refused To Sing(And Other Stories)\" of course began with \"Luminol\" a song I was familiar with from the live \"Get All You Deserve\" record. My initial impression of the start of this song was \"Wilson has got into Math-Rock?\". What! Okay it's actually quite the instrumental display with that drum/bass solo to start but i'm still not into that intro. Love the sound of those keyboards that join in though from Holzman. Guitar and flute follow and check out the keys before 3 minutes. Nice. A calm 4 1/2 minutes in as reserved vocals arrive. I like the pleasant backing vocals that come and go. This is a beautiful section as the piano leads for a while. It becomes majestic sounding then the tempo picks up late. This song is about a man from Wilson's town who played and sang on the street for money but he had passed away. Good song but my least favourite. \"Drive Home\" is pretty much tied with \"The Watchmaker\" for my third favourite track on here. Tender vocals and gorgeous instrumental work during the mellow sections. It's simply gorgeous 1 1/2 minutes in(gulp). The guitar and mood before 4 1/2 minutes reminds me of OPETH's \"Damnation\" album.\"The Holy Drinker\" is my second favourite tune. Psychedelic keys to start as drums, guitar and bass join in. So impressive! Check out the dissonant sax from Travis then the mellotron joins in. Vocals before 3 minutes then we get a cool instrumental break with flute before 6 minutes. An eerie calm a minute later then it kicks into gear with power before 9 minutes, mellotron too. \"Pin Drop\" is okay and it's unusual to hear Steven sing in such a high pitched manner. It turns fuller as the vocals continue. Sax helps out and the contrasts between the powerful and mellow section impress. \"The Watchmaker\" is very mellow to start with reserved vocals. It starts to build before 5 minutes then settles back again with piano and backing vocals. Beautiful stuff. Killer sound 10 1/2 minutes in and check out Marco on the drums. \"The Raven That Refused To Sing\" is my favourite song on here. And that surprised me because it was a song I heard first as I watched the cool video that came with it. It reminds me of STORM CORROSION, at least it has that vibe. Piano and fragile vocals early in this haunting yet meaningful track. Sweeping orchestral sounds add to the majesty later on.So yeah a really good record that I will enjoy in the future, but for my tastes i'll take \"Insurgents\", and hearing that his new solo album will be more guitar driven really made my day."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Tuesday, March 24, 2015",
      "rating": 4,
      "text": "Having recently reviewed Hand Cannot Erase, I realized that I had yet to review this gem. Given that I focused that review almost entirely on the main man, I want to devote this review primarily to all of the musicians involved, and if there is ever a non-instrumental album to devote to discussion of musicianship, this might be it!Theo. I love his contributions in just about anything, from Steven Wilson to the Tangent. What I really appreciate it his versatility and ability to add to the texture without having to be cranked up to the max for solos every so often. This is clearly not the Theo Travis band, but this album--in particular the delicate and softer parts, but also not to forget the freaky crescendos--would not be nearly as interesting without his contribution.Guthrie. What a pro. He brings the blistering solos, the intricate picking, and everything in between. Again, and to his credit, I'm sometimes amazed to hear one of Guthrie's original and creative riffs and then hear the guitar gently fall into the background: usually when you hear something that interesting, it's only a precursor to later overindulding.Nick. I had never heard of this guy before, but shame on me for allowing that to happen. Steven really needs creative basswork to bring his music to life, and it's great how Beggs can work effectively out in front as part of the melody (Luminol) or resisting the urge to simply be a straightforward rhythm player when others might (the Watchmaker).Marco. Just like Nick, I had no idea of the quality of Marco's work...until of course I started reading reviews and heard over and over how much of a monster Marco is. It's all true, as he is a fantastic drummer, but I really appreciate his ability to add distinctive fills and patterns to already difficult time signatures.Adam. Solid throughout, and left me wanting more (which I'm glad I would eventually get with the subsequent album). The jazz influence is clear, but not as pronounced as I was led to believe based on previous reviews. The really remarkable quality of his performance for me here is creation of eerie and surreal soundscapes that are simultaneously reminiscent of Steven Wilson's best work but also not as all derivative.Steven. I suppose I should mention this guy eventually! Great creativity in songwriting, particularly in balance of instrumentals and orchestration. The one minor critique I would have about this album involves Steven's voice: he goes more often with his basic, thin technique, where a little goes a long way. My favorite vocals from Steven's work involve his work with vocal effects and harmonies to great effect, and perhaps a bit more creativity in this aspect would have brought this album over the top for me.Regardless, a solid album throughout--interesting, varied, and extremely well played and mastered--with bonus points for the haunting animated videos to the Raven and Drive Home to boot. I'm not ready to call it a masterpiece, but it's definitely at the very next highest level in my book, and a powerful and lasting experience."
    },
    {
      "reviewer": "Dobermensch",
      "date": "Posted Thursday, April 16, 2015",
      "rating": 4,
      "text": "It's plagiarism a-go-go with 'The Raven that Refused to Sing'.Despite this, it's an excellent and very emotionally pleasing album from Steven Wilson. The whole gamut of his forebears is on display from 'Yes' 'Genesis' 'Rush' ''Floyd' and in particular 'King Crimson'. Thankfully he brings his own particular brand of sound to the forefront, despite all his influences.What sets him apart from these artists is the beauty and distilled grandeur in the execution of most tracks. I'd far listen to this than any of the aforementioned bands (perhaps with the exception of 'Floyd').There's such a huge variety of sound at play and he even manages to make a flute sound cool in 2013 which should be an impossibility in itself. Wilson has that lucky fluke of nature where he sounds just perfect for the role with his pleasant, tuneful 'Proggy' vocals in this decade.The fact that he's the mastermind producer of the 5:1 surround re-masters of King Crimson's back catalogue should give you some idea of the kind of artist we're dealing with here. He has the perfect ear in defining musical dynamics. Crystal clear recording techniques and a wide variety of musical styles make this a very engaging album despite his continual 'hat doffing' to past artists.It's structurally near perfect, with so much space between each 'recording track' that it gives a feeling of depth and freedom that you're unlikely to hear elsewhere on the Archives.There are some true moments of sheer beauty on tracks such as 'Pin Drop' which has a succinct build up of layered sounds and delicate vocals quickly leading to a highly memorable chorus with swirling guitars and thudding bass that I find very difficult to get out of my skull after the finish of the album.I decided to write this after hearing ' Hand Cannot Erase' for the first time. Despite that album's multitude of plaudits, I for one find 'The Raven that refused to Sing' much more engaging, dramatic and emotionally involving than it's successor. To me this is the peak in Steven Wilson's discography."
    },
    {
      "reviewer": "FragileKings",
      "date": "Posted Friday, October 30, 2015",
      "rating": 5,
      "text": "I have been coming back to this album again and again with writing a review in mind. And now that it's October 31st in my time zone, I thought there was no better day to write about an album of six ghost stories.First, let me say that I have three Porcupine Tree albums and of those, two have a few songs each that I really enjoy from time to time. However, unlike some people, I still don't have Steven Wilson and Porcupine Tree in my blood and flowing through my veins. I like the music but I don't love it.When \"The Raven that Refused to Sing and other stories\" first began racking up the high ratings on PA, I was not immediately inspired to purchase a Steven Wilson album. It was the song \"The Raven that Refused to Sing\" and its video that hooked me. I watched the video several times and finally bought the album.A funny thing is that when this album first started getting reviewed on PA, I read so many positive reviews. Yet after \"Hand. Cannot. Erase.\" came out, many reviewers were expressing tired disappointment with \"Raven\"'s retro prog sound. Was everyone suddenly not a fan of this album or were there just different reviewers? Though the album has a very strong classic prog side, it is not all a 70's rehashing. It's been difficult for me to pinpoint exactly what or who the album sounds like what but I feel some of the bass lines could be Geddy Lee's work minus the repetition (Geddy never played the same wild bass lines over and over for long) and some of the slashing guitar chords sound like \"Signals / Grace Under Pressure\" era Rush. The flute would first make you think of Jethro Tull but the style is different, especially in \"Luminol\". There's sax which could sound a bit Pink Floydian but in \"The Holy Drinker\" the darker heavy parts with sax actually remind me of \"God Bluff\" by Van der Graaf Generator.Though the music does hearken back to 70's prog in style and composition, there's a lot of Steven Wilson's heavier and darker side involved, and some of the prettier parts could just as well suit any modern prog band. If there's one big difference here it's that the music does not sound like anything I have on a Porcupine Tree CD. Personally, I find this music here more engaging and enjoyable.The concept of six paranormal tales intrigued me the most, though. I love songs with stories and especially where I feel the music helps to tell the story. For the most part, the music here does work well with the themes of the songs. My two favourites are \"The Holy Drinker\", a song about an evangelist preacher who is a heavy drinker and loses a drinking contest to the Devil and \"The Raven that Refused to Sing\", a song about an old man on the verge of death who believes the spirit of his long ago deceased sister is embodied in a raven. The former is darker and haunting with some very heavy parts and the later has this sweet haunting sorrow about it, replete with a mournful string section. The video too is so wonderfully made and I have recently shown it to two advanced learners of English who are in junior high, after which I asked them questions about the images and characters in the video. \"The Watchmaker\" also has a darker and heavier sound, so that appeals to me as well. The other three tracks are also very good in my opinion but get fewer replays on my music player.If there's one place I feel the album's concept weakens it's on the opening track \"Luminol\". This track is by and large an instrumental showcase with lots of great bass, flute, guitar, and keyboards, not to mention the drumming. The song, however, feels inserted in the middle and doesn't sound like it fits in with the opening and closing instrumental parts. The beginning of the song, that rollicking, mostly instrumental part with a few sung lines does indeed make for an exciting introduction to the album.For a description of the song themes you can refer to the Wikipdia article, but I will say that each one is not only a kind of ghost or manifestation of evil story but also a look at the human mind and human relationships. The music is composed and played wonderfully. I would actually give this album four and a half stars but I personally feel rounding down to four stars is not worthy of this fine album. Not a personal favourite but definitely an album that still finds its songs showing up on my playlists when I am not listening to the complete album.Happy haunting!"
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Wednesday, December 16, 2015",
      "rating": 4,
      "text": "This lauded release by one of modern prog's best artists currently has almost 60% 5-star ratings here on Prog Archives. That's a lot of stars, and should tell you right away thatThe Raven That Refused to Singshould be taken seriously. This album is a focused collection of very strong compositions, stellar musicianship, ultra-high production values, and some surprisingly divisive opinions despite its high rating. I don't think that anyone can justifiably argue against the first-rate musicianship and craftsmanship that's on display by Wilson and company, but after listening again and again, now some years after it's release, I'm left with the same emotions I did when I first experienced it at launch: a sort of appreciation tinged with emptiness.For me this record is like an album that one may listen to in a music appreciate course: significant for a variety of reasons and very interesting, but with an obligatory feel that makes it difficult to resonate with.The album starts very heavy and complex with the largely instrumental \"Luminol,\" which is a bombastic showcase of the band's virtuosity. The execution is one of crisp professionalism, energetic dexterity, and a balls-to-the-wall attitude that throws down a prog rock gauntlet for the rest of the album to live up to. Wilson's band is so good that it almost makes me feel bad for the gang from Porcupine Tree. This song makes you go wow, and want to listen again and again in the same way that Rush's \"YYZ\" does.\"Drive Home\" is a down-tempo, dynamic, and lush ballad that builds to a shrieking and emotive guitar solo by Govan; a great moment. The lyrics are poignant and melancholy - typical Wilson fair, and effective if not approachable.\"Holy Drinker\" transitions to a dark, ominous, a disjointed place that again shows off the band playing very well and with a threatening tone. Even Theo Travis' flute solo comes off as sounding sort of menacing. The conclusion comes off curiously though, with a noisy build that doesn't seem to finish its idea.The next two songs are examples of where things seem to misfire for me. \"Pin Drop\" feels like an outtake fromFear of a Blank Planet. Using hot/cold dynamics interchangeably and without direction. The discrete textures and melodies are nice, but don't work when put together. \"Watchmaker\" is the standout extended track, which opens well with subtlety and restraint. We move from soft, lamentful textures and vocals into upbeat, jazzy passages that interchange melodies... then get to the final fourth of the song which sounds like something out of a horror movie. The juxtaposition doesn't feel genuine, and sort of spoils the tone the proceeded it.The closing title song combines slow builds, lush instrumentation, and sweeping sensations to great effect. A satisfying conclusion.By the end ofThe Raven That Refused to SingI could probably count on one hand the number of times I felt touched or engaged emotionally, but couldn't possibly count the number of times that I could objectively appreciate the skill and composition of Wilson and his band. This is an odd conclusion to come to, to find so much to like about an album... but in the end not really love it. For me, this release couldn't be judged any lower than a 4- star release, because it's simply so excellent technically, but it could never be a 5-star release, because it didn't connect with me on a deeper level. The overall tone is one that modernizes many of the prog-rock sounds from the great '70's releases, helping make the album a worthy purchase for fans and newcomers alike. However, I think that there is a fair-bit of fanboyism in the reviews.Songwriting: 4 - Instrumental Performances: 5 - Lyrics/Vocals: 3 - Style/Emotion/Replay: 3"
    },
    {
      "reviewer": "LearsFool",
      "date": "Posted Monday, September 12, 2016",
      "rating": 3,
      "text": "I love this album, and yet in 2016 it tumbles in my head, a portent, a plagiarist's opus, a guilty pleasure. For it I've invented the term \"popcorn prog\", a distillation of a lot of what makes its genre great into a satisfying if unhealthy sonic snack. It's well done, it's wonderful, it's not a true masterpiece. I turned it over in my mind whether to round up or down from 3.5, in light of my unceasing enjoyment, but I decided to be harsh.After three years and 85 reviews so far, you have a basic idea of what I'm going to say about the instrumentals, but the puzzle goes further than that. The sound is of course indebted to Crimson and Genesis to an amount far above its own GDP, but it's also the endgame of a lot of the sonics of Porcupine Tree and Swilson's early solo career - notably \"The Holy Drinker\" and \"The Watchmaker\" mixed together '70's Crim, \"Deadwing\", and Storm Corrosion. There is a truth that states that this album could only have been made circa 2013, but that's mainly because its creator was revving deeper and deeper into a rut that started five years prior, picking apart earlier successes for spare parts. Many listeners were able to tell with what would otherwise be psychic foresight exactly when and what instruments would come in and what they would play, a sign of cliche. It's cliche done far better than any other retro prog, though, with the driving, dour, epic instrumentals grabbing you by the ears and never letting go. There's virtuosity and at least some soul there, and in the moment most listeners, such as I, can't possibly complain. Plus, while \"Luminol\" bear hugs you, and \"Drive Home\" and the title track melt your heart, the aforementioned \"Holy Drinker\" really stands out as by turns enjoyable and spine-tingling, the SC elements put to fantastic use. Even this recycling still, perhaps for the last time, works.The real saving grace, however, are the lyrics. Lyrics generally aren't Wilson's strong suit, but they turn out excellently here. Fancy words uniquely anchor beautiful stories of mysterious musicians, jetsam of the mind, and ghosts and demons. It goes a long way to making this record so good.But of course, while I love this piece of prog pabulum, time has really shown it to ring a little hollow, one last hurrah on the road to \"Hand. Cannot. Erase.\"'s mediocrity, paved with tropes, staleness, and perfectionism gone wrong. In hindsight, \"The Raven That Refused To Sing\" sticks out as a warning and an important part of a downward trend for Wilson's career, if still a fun listen."
    },
    {
      "reviewer": "The Crow",
      "date": "Posted Saturday, December 8, 2018",
      "rating": 5,
      "text": "With Porcupine Tree definitely on hold and after two good albums which nevertheless failed to translate all the genius that this man showed with works like Deadwing or Fear of a Blank Planet, Steven Wilson finally released his masterpiece!!!Because The Raven that Refused to Sing is one of the best prog records of this decade, if not the best. An outstanding album from start to finish with very weak moments inside (maybe The Pin Drop is a bit weaker, despite being a very good song) and incredible musicianship.This time Steven Wilson finally managed to truly differentiate his solo career from the Porcupine Tree sound with a much more symphonic record, with roots in the 70's and tons of jazz elements but much more better integrated and not so boring as in Grace for Drowning.Best Tracks: as I said, I think than The Pin Drops is a bit weaker and more inconsequential than the rest the songs, which are marvelous examples of the best prog-rock imaginable.Conclusion: in my opinion, The Raven that Refused to Sing marked one of the clear peaks of Steven Wilson's career. A thrilling album, very well written, dark and complex. And he also managed to surround himself of the best musicians imaginable to help him record his best compositions since Fear of A Blank Planet and the result was another masterpiece of modern symphonic prog.Thank you, Steven! This is what we expect from a man of your talent.My rating: *****"
    },
    {
      "reviewer": "Kempokid",
      "date": "Posted Wednesday, January 2, 2019",
      "rating": 2,
      "text": "Despite repeated listens to Steven Wilson's third album, I've never been able to get properly into it, despite the fact that it has been praised as a masterpiece by many, as I find it to honestly be a tiring, somewhat dull listen. Almost all of the songs here are at least somewhat derivative of the prog giants of the 70s, often quite heavily, leading to a collection of songs that lack the same fire that the classics had, leading to a dreary bunch of songs that end up missing the mark to at least some extent. Furthermore, unlike with what normally happens with compositions by Steven Wilson, this contains a significant amount of extended solos and instrumental sections, which not only feel overlong, but also remove the emotional impact that is trying to be achieved in many cases.A big issue in the album is the fact that many songs have some strong ideas, but then drop the ball, leading to many songs feeling somewhat half baked. 'Luminol' starts off incredibly strong for the first 4 minutes, with a great, energetic bassline with various instruments being played over the top, including an impressive flute solo. This part strongly reminds me of 'Yes' with a bit of 'The Mars Volta' thrown in as well. Unfortunately, after the extremely promising intro, the song slows down considerably, invoking an atmosphere akin to a weaker version of the song 'In The Court Of The Crimson King'. this section drags on far too long and leads to the momentum that was being built up to become lost, meandering in mediocrity for a while, before trying to reclaim what was lost at the end. Both the songs 'Drive Home' and 'The Pin Drop' are extremely tiring to me, and end up causing me to lose any interest in continuing to listen to the album past those points. 'Drive Home' is quite beautiful, but drags on far too long, especially the 4 minute guitar solo, which while very impressive, is also quite boring by the end and feels like it could have been shortened considerably. 'The Pin Drop' breaks the mold of the album by just being quite poor all the way through, rather than just for a portion of it, sounding like a budget 'Porcupine Tree' song, with vocals that are quite weak. 'The Watchmaker' is by far the biggest example of wasted potential however, as the first few minutes are incredibly beautiful and full of powerful emotion, which ends up fading during a long instrumental break, which is a major shame considering how great I find the lyrics. 'The Holy Drinker' and the title track are both fairly worthy songs however, with 'The Holy Drinker' being a fun, enjoyable prog rock track, abandoning the attempts to make an emotionally moving song, instead having the lyrics be about a priest who loses a drinking contest against the devil. While the song undoubtedly carries on for a bit too long, it is not as big an issue as with the rest of the album, and sounds mostly great. The title track is by far the best song here however, successfully doing everything that most of the rest of the album failed to do, creating an extremely powerful, emotional song with good progression and tasteful instrumental sections. The crescendo throughout is extremely slow and subtle, with the climax only being slightly more eventful than the rest of the song, but it works absolutely perfectly, producing what I can easily call one of Steven Wilson's greatest solo songs, and saves the album from being rated even lower.Despite the immense amount of potential this album has, it drops the ball at almost every turn, and the exquisite production and interesting concept don't do enough to save the album. When it comes down to it, every track other than the title track needs to be cut in some way, since the album as it is happens to be quite bloated and uninteresting for the majority of its length.Best songs: The Holy Drinker, The Raven That Refused To SingWeakest songs: Drive Home, The Pin DropVerdict: An album with a great deal of potential, but despite each song having some great ideas, almost all of them drop the ball in one way or another, leading to a patchy record that is bloated and downright boring in places. Since this is such an acclaimed album, I feel like I'm missing something here, so give it a listen anyway if you enjoy Steven Wilson's music, you'll probably enjoy it."
    },
    {
      "reviewer": "A Crimson Mellotron",
      "date": "Posted Monday, December 13, 2021",
      "rating": 5,
      "text": "One of Steven Wilson's most ambitious efforts ever, and already one of the most iconic contemporary art rock achievements, 'The Raven That Refused to Sing' is not only among the most impressive released of its decade, but it will also certainly go down as one of the definitive records of the progressive rock genre. Rightfully crowned 'the prince of prog rock', Wilson delivers a 'love letter' to the genre's greats from the 70s, captivating the listener with divine musical passages, atmospheric nuances and enchanting soundscapes, severe emotional depth as an all-encompassing asset and thoughtful, cordial lyrics to top the already-exhaustive list of prerequisites to enjoy this fantastic collection of songs about stories of supernatural nature.The listener's attention is grabbed from the very first seconds of the album by the throbbing bass of 'Luminol' a 12-minute epic composition that borders both jazz fusion and classic prog, and a song that has become a staple for Wilson's live performances. The vitality of the sound helps it feel like a 6-minute song, as it drifts back and forth between the pulsating bass-led sections and the more ethereal passages. Then comes 'Drive Home', a tremendous effort in pure prog intertwined with deeply satisfactory and immersive tonal depth, arguably reaching its apex when the otherworldly Guthrie Govan guitar solo comes in to swipe the listener away; another excellent and emotive composition about a love story featuring a drive in the night that ends fatally with the surprising disappearance of the beloved wife. The third track on the album is the menacing 'The Holy Drinker', which is pure madness and maybe even raw power, a very classy composition that once again reminisces the fusion moments of 'Grace for Drowning', while winking to the keyboard wizardry of Keith Emerson, as we get a very flamboyant Hammond organ section right after the middle of the song; all the musicians perform exquisitely not only here, but on every single song on 'The Raven...'.'The Pin Drop' is the shortest song on the album, clocking in at five minutes, but it might also be the heaviest (although talking about heaviness on this record might not be too appropriate); its massive-sounding chorus blasts the listener, as a plethora of sounds unfold in front of their ears. Not to mention that all this is aided by the dreamy vocals and the somewhat grim lyrics that tackle the topics of love and identity once again. 'The Watchmaker' has to be Wilson's true 70s Genesis moment, as the acoustic guitars evoke some 'Selling England by the Pound' or 'Nursery Cryme' episodes. Truly beautiful and melancholic, this song impresses with its slower build-up and creative final section. The sixth and final composition on here is the title track, which can be easily described as one of Steven Wilson's most astonishing achievements. Rarely has a contemporary musician been able to present such a deeply emotional track, with its gradually unfolding beauty and uncompromising story of the absence of a loved one. Purely gorgeous.It is albums like this one that impress the most, and thankfully this gentle, sheltering masterwork is relatively well-known for what it is, as it can hardly be confused for something commercial and easily digestible. I firmly believe that the peak of one of prog rock's strongest periods (2010-2013) is 'The Raven' by Steven Wilson, a very well-crafted album, tremendously well produced and sufficiently original not to sound like an invocation of a long-gone musical genre, that is severely unfashionable. Nothing like it, this record is a true journey for the music lover, and one that is worth every single second."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album16cc.html",
  "last_parsed": "2025-05-18T00:15:49.009854"
}