{
  "album_title": "THE GRAND WAZOO",
  "artist_name": "Frank Zappa",
  "artist_page_link_local": "artiste2ef.html?id=1023",
  "year": 1972,
  "rating_value": 4.32,
  "rating_count": null,
  "review_count": null,
  "genre": "RIO/Avant-Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/1023/cover_264101362016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "For Calvin (and His Next Two Hitch-Hikers)",
      "duration": "6:06",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "The Grand Wazoo",
      "duration": "13:20",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Cletus Awreetus-Awrightus",
      "duration": "2:57",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Eat That Question",
      "duration": "6:42",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Blessed Relief",
      "duration": "8:00",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Monday, April 19, 2004",
      "rating": 5,
      "text": "The Frank WazooAfter the superb artistic success of Jawaka's longer and jazzier tracks, Frank returned to expand on those ideas and The Grand Wazoo is the result. And Frank really put in a gigantic effort and hired a big band guest list for this concept. Graced with a great Romans versus Assyrians front-cover and a mad spy rear-sleeve artwork, the story is developed in a text by Frank and there is an annex explanation to the \"mysterious horn\", presented all through the album's music, as he uses a brass section and a woodwind section in different roles. But the unsung hero on this album is Dunbar's incredible drummingThe opening title track is 13-mins+ milestone in Frank's career, maybe his crowning achievement (at least to this writer's eyes and ears), as the piece hops in the already cruising bandwagon, with Erroneous' bass and Ainsley's drum astounding us, the latter so brilliant that he almost eclipses the master's brilliant guitar work. Soon the wood section takes a first dip in the bath, but when the rhythm section breaks, it is the brass section that underlines in the low register Zappa's guitar?. Pretty soon the brass and woods are duelling for attention under Ainsley's direction and will rivet you from your eardrums right into your buttcheeks to your seat for the remainder of the track. Flabbergastingly jaw-dropping stuff. For Calvin has exactly the same line-up, but chooses to ride at half-speed and both the winds and brass fight it out in a much less civilized manner for your orgasmic pleasure.The short Cleetus Awreetus is a wind-laden fast piece that again has both antagonist factions battling it out in on a different ground, this time a very quick rhythm, but it is marred (but not that bad) by some silly scatting vocals. But the flipside's highlight is a great Eat That Question opening on a George Duke electric piano solo, but this is where Ainsley rules and soars in the stratosphere, reigning supreme of Duke's second brilliant solo, but the genius is in the slower mid-section, before it picks up again to end with the wind sections. The 8-mins Blessed Relief is another foray into jazz territory, almost a standard cool thing thingie. Some outstanding interplay again on this song.This album should be discovered after Jaka Jawaka (Hot Rats 2) as this is the big band version of that classic. The use of two wind sections (brass and woods) with radically different purposes is certainly groundbreaking (at least to me). As the first section is hovering above doing countless solos and embellishing the music, the second ones is providing a bass drone giving an extraordinary jumpy feeling to the music, a bit like Maupin was doing on Bitches Brew and in Mwandishi. At times it sounds like there is 30 musicians at the same time as this is so powerful. Zappa plays very quietly and oeuvres as the \"chef d'orchestre\", but here the most impressive player is definitely Ainsley Dunbar - who will leave Zappa to co-found, with excellent Santana sidemen, Journey (interesting jazzy prog rock for the first three albums and he will leave as they veer off to a disgusting FM - AOR - Mainstream crap). Dunbar who holds everything together with dazzling drumming. A must in Zappa's career, especially that he holds back on his personal sense of humour, to concentrate on the superb music. Too bad he didn't try this more often, really. This album should be included in the Hot Rats series. Essential stuff and more."
    },
    {
      "reviewer": "greenback",
      "date": "Posted Tuesday, April 20, 2004",
      "rating": 4,
      "text": "The brass instruments are omnipresent in this very jazzy record. Sometimes they are free and experimental (\"Cletus...\"), sometimes they are more catchy (\"Grand Wazoo\"). This record is loaded of drums, percussions, keyboards, bass and brass instruments. This record is very good ans it takes more than one listening to really appreciate it. A good rather jazz than fusion album of ZAPPA."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Friday, April 23, 2004",
      "rating": 4,
      "text": "This is a jazz-fusion album, with a classical orientation, which is quite similar to that one of \"Hot Rats\", although it is a bit lighter in tone, despite of containing such odd instrumentation like horns and woodwinds... well these latter were not present within \"Hot Rats\" and for this reason at last I prefer the present one (or anyway in some circumstances at least). The track \"Eat That Question\" is brilliant, but there are also other simply structured and remarkable songs. Sometimes this \"Eat That Question\" reminds me indeed of the memorable job at the electric piano and organ as well within some classic jazz albums, in the vein of George Duke; the whole job is filtered through a personal style of his own, thanks also to his wah-wah guitar-effect and some other strange tunes. The whole album is mostly instrumental, with a very few inspiring and less inspiring songs, such as \"Blessed Relief\", which concludes the album in a simplistic and easy listening manner , but it never minds...This work is recommended, even though it is not completely essential!!"
    },
    {
      "reviewer": "daveconn",
      "date": "Posted Tuesday, May 4, 2004",
      "rating": 5,
      "text": "The last of the great instrumental burlesques, at least until Orchestral Favorites surfaced in 1979. \"The Grand Wazoo\" was recorded during FRANK ZAPPA's recovery from injuries sustained following an on-stage assault (so much for soothing the savage breast), thus entering into the top of two rather select musical subgroups: the recovery recordings (besting both ENO's Discreet Music and Dylan's The Basement Tapes, to name a few) and program music dealing with the clash of different musical cultures (progeny of the classic cartoon that includes Patrick Moraz' eponymous effort and The Residents' Tune of Two Cities). Drawing musical dialogue from the classical and rock cousins of the jazz family, THE MOTHERS make the sort of music that'll just curl the toes of anyone who enjoyed the mock-classical adventures of Waka/Jawaka, Weasels and \"Burnt Weeny Sandwich\". ZAPPA has proved adept at writing program music (200 Motels, Joe's Garage, Thing-Fish), though \"The Grand Wazoo\" differs in its instrumental approach; only the opening \"For Calvin (And His Next Two Hitch-Hikers)\" features vocals, and it's not empty praise to point out this might be the most perfect amalgam of vocal and instrumental music in all of ZAPPAdom. The natural and seemingly effortless melange of instruments inhabit a unique world where rock, jazz and orchestral sounds meet in the middle of a saucepan and dance to the hot whims of the master composer in convalescence. Yet ZAPPA is careful to make sure that each of the songs retains a distinct flavor, from the seamy tones of \"\"The Grand Wazoo\"\" to the comic \"Cletus Awreetus-Awrightus\" to the epic riff that underpins \"Eat That Question\" (one I'd put on a pedestal with the closing theme to Gentle Giant's \"Three Friends\"). Anyway, I could go on for pages -- I'm that enthusiastic about this album.If I had to pick a favorite from FRANK ZAPPA, it'd be down to this and \"Hot Rats\"."
    },
    {
      "reviewer": "diddy",
      "date": "Posted Tuesday, June 1, 2004",
      "rating": 4,
      "text": "So this was my first contact with Mr. Zappa. What you get here is an almost instrumental album with a great big band sound. You woun't find this much guitar solos as you get on other Zappa releases but you will hear a lot of wind instruments, maybe more than on other Zappa albums, whereas Zappa always uses a lot of them. The overall picture is very jazzy and even without vocals really funny like many of Zappa's albums are. The main part of the album is for sure the 13 minute long title track \"The grand Wazoo\" wich I found very interesting and it stays it, so you can listen to it several times and it never gets boring. The big band sound is great and fits good on this album and especially on this track. I think that this one is a good Zappa album and is by all means a good one to start with Zappa, it worked good for me...even if this album is said to be a bit different from others I think it represents Zappa's style adequate...my favorite besides \"Hot Rats\""
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Friday, May 13, 2005",
      "rating": 5,
      "text": "This is one of my all-time Zapa faves - following in the same big band trend of its immediate predecessor \"Waka/Jawaka\" (another big personal Zappa fave), \"The Grand Wazzo\" goes to more bizarre places at times and also portrays a stronger dose of energy in various passages. Take the namesake opener, for instance (my CD copy starts with this one, contrary to other editions that start with 'For Calvin'). 'The Grand Wazoo' is an excellent exercise on jazz oriented jammed stuff solidly sustained by effective guitar chords and a fluid rhythm section: the use of wind instruments is alternated between orchestral textures and big band ornaments, with some expanding solos getting around without breaking the track's internal articulation. There is also a great (albeit a little too brief) guitar solo that rocks really hard. Then comes 'For Calvin (and His next Two Hitch-Hikers)', which comprises the most disturbing passages of the album - those are the bizarre places I was referring to at the beginning of this review. It starts with a bluesy section with some sarcastic singing incorporated: Janet Neville- Ferguson's interventions sound quite sensual, although her whispering delivers are meant to arouse the listener's sense of irony and not some other kind of sense (or sensation). After the sung portion, there comes a brilliant series of successive motifs (first led by the vibes, then by the horn ensemble), in which dissonance and unexpected shifts serve as the rules that provide and maintain a sense of cohesion in a most challenging manner. Beneath all this fiery, demanding series of changes and variations lies an intelligently complex structure. Regarding my personal experience, every time I listen to this piece I simply can't avoid feeling captivated by its radical weirdness, and it makes me wonder if this isn't where the RIO trend was born. hmmm. 'Cletus Awreetus-Awrightus' is another effective jazz number that starts and ends with a big band motif, and in between comprises an extravagant succession of melodic shifts cleverly incepted in a continuous whole - all this in less than a 3-minute duration. 'Eat that Question' is, together with 'For Calvin', my personal fave from this album: for this track, Zappa decided to explore the more robust trends of jazz rock, in this way establishing powerful interconnections with a very inspired George Duke - the martial closing section is an appropriate for such a fiery track. After all this awesome sonic display ends, the closure 'Blessed Relief' takes things down to a calmer, more relaxing stance. The ambience portrayed in this number is that of a jazz club, in an intimate moment when the band on stage plays soft melodies and couples dance in a languid trance: the pairing of acoustic and wah-wah guitar, complemented by the electric piano and adorned by some sax soloing is just mesmeric. As you may notice, there's a fair share of variety of musical sources cooking in \"The Grand Wazoo\", well integrated in the repertoire and exquisitely performed - IMHO, that's the main reason why this work is an absolute FZ masterpiece."
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Friday, July 8, 2005",
      "rating": 5,
      "text": "Utter masterliness by the master of the bizarre and out of the ordinary, Frank Zappa. With this album, he goes with a more big band approach, featuring an assortment of wind instruments. It has a jazz feel all around. Most of the album is instrumental, much like Hot Rats, and the vocal sections have a very majestic feel to them.Since most of the album is straight music, I'll talk more in depth about that. The opener is a 13 minute instrumental epic otherwise known as The Grand Wazoo. Opening with some superb guitar work, mainly a grand solo (containing a very watery guitar effect) by Zappa. Throughout the piece, the wind and brass instruments all get solos. Not to mention the superb keyboard work by George Duke and Don Preston, who give their instruments very precise runs. The bass and drum also work coherently and create a very laid back enviornment. The opener never gets loses interest despite its length, you'll always find something new with every listen. Janet Neville-Ferguson and Sal Marquez give very majestic performances on the only track with vocal For Calvin (And His Next Two Hitch- Hikers), a very operatic approach. The next track Cletus Awreetus-Awrightus features Zappa mumbling and singing incoherently, but it is done well and adds a layer of comedy to this other wise non-comical album. Eat that Question and Blessed Relief both are great instrumentals continuing the very laid-back style of this album, and they finish off what is easily my one of my favorite Zappa albums.Overall, this is an incredible effort from Frank Zappa, who added more originality into his catalogue of styles. I recommend it highly to everyone. A great introduction into Frank Zappa. 5/5"
    },
    {
      "reviewer": "Bj-1",
      "date": "Posted Monday, December 19, 2005",
      "rating": 5,
      "text": "My first real introduction to Zappa besides the crude but hilarious Joe's Garage and the relentless guitar jamming of Hot Rats, and it still remains one of my favorites by him. This album is similar toWaka/Jawakawith the big band sound that is very rich on the horns, though even more jazzy and weird at spots. Very good playing from the musicians on the album, notably from keyboardist George Duke and drummer Aynsley Dunbar. Clocking in at 37 minutes, there are no weak songs on this album, the whole thing feels concise without ever losing it's momentum. One of Jazz-Rock/Fusion landmarks! The title track is a fantastic 13-minute opener full of great solos and a very memorable main theme. The orchestra fits very well in that song too, making this album even more interesting. \"For Calvin\", a standout track here, is a slower and more Avant-garde tune and is the only track on this album with proper lyrics, albeit only a few words in the beginning, before drifting into more abstract and almost sinister territories later on. Unpredictable, very melancholic, but excellent nonetheless. In contrast, the humouristic \"Cletus Awreetus-Awrightus\" is the shortest and most entertaining track on the album; a playful tune with several wordless vocalizations and a catchy hook, followed by the brilliant \"Eat That Question\", which is easily one of my favorite Zappa tunes. It goes hard on the main riff and culminates into another brilliant guitar solo from FZ in the middle before it drops into a powerful brass rendition of the main riff. Another contrast is to be found in the last track \"Blessed Relief\", a beautiful laid-back conclusion to the album that I feel is one of Zappa's more underappreciated tracks. The Grand Wazoo displays great musicianship and variation throughout and is one of Zappa's most solid efforts from his earlier days with never a dull moment.Highly recommended to any prog collection with a taste for jazz-fusion with proggy leanings. Zappa fan or not. A necessary album for Jazz-Rock fanatics especially, and as Cyggie said in his review here above me: Masterliness!"
    },
    {
      "reviewer": "belz",
      "date": "Posted Wednesday, March 29, 2006",
      "rating": 4,
      "text": "4.2/5.0This is my favorite Frank Zappa album. Most of this album is instrumental, yet it is complete and imaginative, actively supported by a big band.When \"For Calvin (And His Next Two Hitch-Hikers\" starts, it starts with passion and a very entertaining original jazzy touch, which is there the whole song. \" The Grand Wazoo\" is probably the most experimental song on the album, but still there is a continuity with the first song and it may be a bit weaker, but still really good. Then, what to say about \"Cletus Awreetus-Awrightus\"? This is the shortest but the sweetest song! The rhythm is crazy with great percussion and keyboards. The rest of the album is clearly more jazzy than the first part. But this is great jazz; not the kind of music you would listen to in an elevator...Overall, this album is divided in two: the first two songs are really imaginative, entertaning, progressive and even experimental. The two last songs are more jazzy, melodics with a sound closer to acoustic music than electronic. And, stuck there in between, \"Cletus Awreetus-Awrightus\" is that big exclamation mark just waiting to be appreciated!This is a great album to start with if you don't know Frank Zappa. Not a masterpiece, but not far from it!4.2/5.0"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Sunday, July 2, 2006",
      "rating": 4,
      "text": "As far as Zappa's music concern I can consider myself as newbie. Yes I knew the name and (of course) his picture long time ago in the seventies - the glory days of rock music. But I knew only one album of Zappa and The Mothers at that time and now with the information power over the net finally I read a lot of news and stories about how unique Frank Zappa as person is (and probably \"has been\"). That's enough to draw a conclusion that he's definitely prog. Uhm. As my previous review of another album \"Hot Rats\" posted here couple of weeks ago, now it's time for me to digest the music of Frank Zappa through this \"Grand Wazoo\" album.Musically this album is at par excellent with \"Hot Rats\". Some of my friends reckon that this album even better than \"Hot Rats\". I can agree but I still consider that both are at the same quality. Personally, I consider the music of Zappa - especially this album and also \"Hot Rats\" - is the kind of music typically used atpasar malam(night market - it's not truly correct translation). This is a local term we use in my country on the seasonal market usually held at night with many attractions including acrobatic show by motorist (Harley Davidson and the like) and any other activities (haunted house, windmill, etc. etc.). Basically there are bits of everything offered in a typical traditional pasar malam. I enjoyed going to pasar malam when I was a child.So is the case with this album. Musically there a bits of everything here - almost all styles of music are blended beautifully here. Take an example of the opening track \"For Calvin (And His Next Two Hitch-hikers). There are many instruments used here with this track. Name any instrument - and I'm sure it's played here. From the woodwind and brass section like trumpet, trombone, baritone, sax to electric guitar, everything is played proportionately. Oh yeah, it's like a pasar malam where there are many stores offering different choices of attractions - even some of them are offering goods (clothing, children toys, etc) - where many instruments play together with individual chords and notes. The result is a music packed with different kind of sounds. It's nice and unique - at least for me because I never heard this kind of music before. I enjoy how the guitar fills are surrounded by brass section like a big band. This opening track is like an improvisation music and is NOT a song-orientated music.Track 2 is more jazz than the opening track, even the tempo is much slower. Vocals are added at this track. Sax and trumpet play roles as soloists. There are parts with simple to digest arrangements and there are parts with complex arrangement. As I have been listening to Frogg Caf� (a band inspired by Zappa music) I don't have any problem digesting this track. Track 3 is a short one with big band line-up like previous two tracks featuring brass section as lead melody. It's interesting track with similar approach like track 1.Track 4 starts off with keyboard solo, followed with full stream of music that combines rock, jazz and a bit of blues. It's an excellent track with keyboard improvisation. The music moves from simple arrangement to complex one maintaining keyboard as lead instrument. It's important to notice here on how drums are played as beat maker but at the same time serves a role as filler. Guitar then takes the lead after long keyboard role. It sounds like a jam session. So, again, it's not a song-orientated music. There is a break to a silent mode where guitar gives melody followed with big band music with drums played in marching style. It's excellent and really cool!The concluding track serves a style of slow jazz music with brass section dominate the composition. This track definitely fits with those of you who love jazz music even though this is not a pure jazz. But if you listen to the trumpet solo, it really sounds like a jazz composition. As far as rhythm section this track offers a constant style and only the soloist that differs one segment to another. After long trumpet section it moves to excellent keyboard solo and followed with acoustic guitar solo.Overall, this is one of Frank Zappa's best albums. The music is a blend of jazz (mostly), pop, and rock - performed in big band concept. Recommended.Keep on proggin' ..!Peace on earth and mercy mild - GW"
    },
    {
      "reviewer": "Alucard",
      "date": "Posted Wednesday, August 16, 2006",
      "rating": 5,
      "text": "'The Grand Wazzo' was released in 1972 and is Zappa's third solo record (even so the term 'solo' is to be used carefully, all Zappa records' Mothers' or not are in the first place Zappa records). 'The Grand Wazzo' presents the jazzier side of Zappa's music and forms a trilogy with 'Hot Rats' and 'Waka/Jawaka'. While these two records were featuring smaller groups 'The Grand Wazoo' features a full blown Jazz Rock Big Band. Most tracks follow the traditional solo/ensemble play in the frame of Zappa's twisted compositions. The rhythmic work delivered by drummer Aynsley Dunbar is stunning and allows Zappa a complexity, that was not possible with the the first MOI. Among the other featured musicians are Jack Bruce on bass (appearing for contractual reason as 'Erroneus') and George Duke who's funky keyboard playing and twisted vocals inspired Zappa a lot.On the remasterd CD the track-order of side one is inversed and the CD starts with the main dish of the record the title track 'The Grand Wazzoo', a masterpiece of Jazz Rock with a Big Band arrangement. The composition follows the classic theme/solo development with a breathtaking rhythmic interplay between solists and ensemble featuring Aynsley Dunbar, Toni Duran and Zappa on guitar. A second theme in form of a Fanfare appears towards the end of the track followed by a moog solo by Don Preston.The second track 'For Calvin (And His Next Two Hitch-Hikers' is dedicated to Cal Schenkel, a friend of Zappa and responsible for most of Zappa's early cover art,( including the cover of 'The Grand Wazzoo' that illustrates the story told by Zappa and reproduced in the inner cover) A track that presents the 'Vaudeville' side of Zappa's music; a slow rhythm introduces the theme, a mock opera vocal duette by Janet Neville- Ferguson and Sal Marquez, followed by a moog and a trumpet solo that introduces the theme of 'New Brown Clouds', that would appear on 'Greggary Peccary' and a reprise of the first theme.The second side starts with 'Cletus Awreetus-Awrightus' a short Soul influenced Funk track that prefigures 'Overnite Sensation', with Georg Duke playing honky tonk piano and a vocal duette by Zappa and Duke another track with stunning rhythm work.'Eat That Question' is the second 'serious' composition on the record, featuring heavily Gorge Duke's talents. the track starts with a funky Fender Rhodes intro by Duke, followed by the main theme on wah-wah guitar by Zapppa himself. The following development and interplay between drums and piano is breathtaking and among the most sophisticated rhthmic work in Jazz-Rock followed by a great Zappa solo, before the rhythm dissolves into a slow rubato reprise of the main theme.The record closes with 'Blessed Relief' a chillout track with a nice relaxed athmosphere alternating solo and ensemble sections, featuring Sal Marquez on trumpet Duke on piano and Zappa on guitar.A masterpiece of Big Band Jazz Rock with extraordinary rhythm work!"
    },
    {
      "reviewer": "fuxi",
      "date": "Posted Monday, November 27, 2006",
      "rating": 5,
      "text": "THE BEST POSSIBLE INTRODUCTION TO ZAPPA'S OEUVRE!If you've never listened to a Zappa album and wonder what all the fuss is about, give this one a try. It's mainly instrumental, very bright in a typically Zappa-esque way and simply irresistible! Great band, great tunes, superb solos for electric guitar, electric piano, trombone, moog and heaven-knows-what-else. And best of all: you'll never get tired of this one. Each time you play it, you'll discover more. A true classic.P.S. I never really understood why HOT RATS was so famous. Could it be that people - even proggers - simply repeat the views of others? In my opinion, THE GRAND WAZOO is a far more inspired and colourful collection."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Monday, September 17, 2007",
      "rating": 5,
      "text": "So if \"Waka / Jawaka\" is \"Hot Rats II\" then this must be \"Hot Rats III\" right ? To refresh your memories Frank was pushed off the stage and injured by an irate fan, and while recovering he recorded \"Waka / Jawaka\" and \"The Grand Wazoo\". I think one of the big differences between these two records is the bigger sound on \"The Grand Wazoo\". Having over 20 musicians involved will create that effect.\"For Calvin\" is an interesting song where we get a contrast between the guitar led passages and the horn led sections. Much more horns then guitar though in this jazzy tune. \"The Grand Wazoo\" is the only song with lyrics. Vocals, xylophone, horns and percussion lead the way with some dissonant sounds 3 1/2 minutes in. A big band sound follows.\"Cletus Awreetus-Awrightus\" is complex with a variety of sounds. The vocal melodies are so funny. \"Eat That Question\" is an uptempo track with electric piano, bass and drums. The guitar before 3 1/2 minutes is good. \"Blessed Relief\" is really a change of pace. A beautiful song that is both light and smooth. Horns, bass and light drums lead the way, with piano before 3 minutes.For me this is better than \"Waka / Jawaka\" and a close second to \"Hot Rats\" as my favourite Zappa studio record."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Saturday, October 6, 2007",
      "rating": 3,
      "text": "What's all the fuss? This album ranges from sporadic jazz meandering to some focused, genuinely interesting music. I'm definitely not going to overrate this album just because Zappa is Zappa. The fact is that the Grand Wazoo is a very uneven album.The Grand Wazoo. What a choice for the opener...in a bad sense. Maybe I just don't \"get\" what Zappa is attempting here, but after a few years of listening, I'm likely not to ever get it. It's weird, sometimes random, noodling.For Calvin. Now we have something that resembles music, and good music at that! A catchy horn melody sandwiches a series of percussion driven jams from the trombone and trumpet. Sure, it's overlong at 13 minutes and would fall flat on its face without the lively percussionists, but as it stands this is a very enjoyable listen.Cletus Awreetus-Awrightus. Here Zappa's vocal playfulness comes into play, and the instrumentation follows. It's upbeat and bouncy, though short and necessarily memorble.Eat That Question. The absolute highlight of the album, this tune starts with some keyboard meandering and builds in intensity and instrumentation to a blistering climax, to end with a clever variation on the main theme. Every player is at maximum rock here, and even Zappa throws in some of the great guitar that I keep hearing he is capable of (yet rarely hear). Fusion doesn't get much better!Blessed Relief. A complete change-up, this mellow yet encouraging song is wonderful. A great lazy melody of horns is accentuated by some dreamy keyboard riffs that place you in as tranquil state as you could imagine.I'm glad to have this album, but I'm not pleased with all of it. Overall, the music is enjoyable (excluding the title track), though not necessarily new or innovative for 1972. I'm sure Zappa fans love it, and non-Zappa followers should find enough to enjoy as well."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Monday, September 8, 2008",
      "rating": 4,
      "text": "The Grand Wazoo is the sister album to Waka/ Jawaka and it was released in 1972 the same year as Waka/ Jawaka. The music on The Grand Wazoo is also in the same mostly instrumental jazz/ rock style. The original LP has a different tracklist than the CD version which means that For Calvin (And His Next Two Hitch-Hikers) is placed as track number one on the original LP while it is number two on the CD version. I�m not sure what the reason is for that, but I guess it�s because the title track which is the song For Calvin (And His Next Two Hitch-Hikers) changed places with better represents the general style on the album than For Calvin (And His Next Two Hitch-Hikers) which is a very different song from the rest. I own both the original LP and the CD version but I�ll review the CD version as it�s the one I�ve been listening to the most.The title track starts the album and it�s a 13:20 minutes long jazz/ rock jam with lots of soloing from both guitar, keyboards and brass. There are arranged big band like parts in the song too.For Calvin ( And His Next Two Hitch-Hikers) is more in avant garde rock territory. Fans of Henry Cow would be pleased with this one. There are some eerie vocals and some great flute playing in the song and the part with singing is actually pretty psychadelic. The middle part of the song is in classical avant garde style. Very great challenging part. There is the typical Frank Zappa conceptual continuity in this song too. The avant garde part in the middle of the song is also a part of The Adventures of Greggery Peccary from Studio Tan.Cletus Awreetus-Awrightus is one of those silly Zappa songs that I just can�t help liking. It features some humorous vocal performances and some western salon piano parts. Lots of brass in this song too.Eat That Question is a jazz/ Rock tune with a great opening hard rock riff. Some nice soloing going on in this song.Blessed Relief is my least favorite on the album. It�s in jazz/ rock territory but it�s more subtle and features a theme that sounds a bit too close to the theme from M.A.S.H.The musicianship is excellent on this album and besides Frank Zappa�s great guitar playing there are also lots of brass and woodwinds throughout the album. One of the best performances on the album is Aynsley Dunbar�s drumming though. He is such a powerful drummer yet sophisticated enough to play the technical parts with ease.The production is very well done. Warm and pleasant.The Grand Wazoo and Waka/ Jawaka will always stand as two very different albums in Frank Zappa�s discography. You can call them his experiment with jazz/ rock with a big band sound. I think he succeeded very well. I prefer Waka/ Jawaka but The Grand Wazoo is also a great album and it deserves 4 stars even though I usually skip Blessed Relief."
    },
    {
      "reviewer": "LiquidEternity",
      "date": "Posted Saturday, October 11, 2008",
      "rating": 4,
      "text": "As the second of the conceptual and musical sequels to Zappa's widely regarded masterpiece Hot Rats, The Grand Wazoo is a bit weaker but still definitely worthy of attention.In comparison with Hot Rats, this album is much more built on cinematic layers of big band sound, rather than extended jams. Again, as with both Hot Rats and Waka/Jawaka (the second in the trio), vocals and lyrics are very rare and underutilized, at some points to the music's advantages and at others not. Here, the only song with singing is For Calvin, but it's similar vocal styles to earlier Mothers songs, not like the cheerful crooning of Captain Beefheart. Aside from that track, however, it's entirely instrumental and entirely something of a cross between big band sound and expansive progressive jazz fusion instrumentation. Though there are a number of points of high energy, this release is mellower and slower than Hot Rats or Waka/Jawaka. On the whole, nevertheless, the music here is cleverly written, dramatically orchestrated, and representative of the strange and expansive range of Frank Zappa's unique musical explorations.The album (or at least the CD version) opens with the title track. Most of the tune is built on a massive big band style, mostly brass but with the occasional beautifully crisp clean guitars like on Peaches en Regalia. The two main themes fit together nicely, the first being a sliding brass sound and the second being a rake-picked clean guitar that brings an indefinable energy to the track. From there, however, the track resolves into a long saxophone solo that comprises most of the central ten minutes of the song. During that long middle period, the song threatens to dissolve into experimental bits that detract from the glory of the beginning and ending but don't stop the flow of music here. A final reprisal of the main theme and clean raked guitars together at the end brings this song towards its conclusion.For Calvin (and His Next Two Hitch-Hikers) features the sole lyrical adventure on the album, but these are rather weird and haunting lyrics. A creepy beginning meanders forward, filled with menacing sounds and haunting vocals. About halfway through, the song dissolves into strange experimental noise bits, overlaying lots of instruments but just barely hanging onto musicality like Mothers often failed to do. In the end it's an interesting track, but probably the least impressive off The Grand Wazoo.Cletus Awreetus-Awrightus is the Peaches en Regalia of The Grand Wazoo, in its own way. However, rather than just being another song like its predecessor, it packs energy and vitality into a short little track. Quirky vocals reminiscent of Zappa's forthcoming One Size Fits All album add a human element to this odd piece of excitement.Next comes the well-composed Eat That Question. It begins with a more mellow sound, developing a melodic and intriguing main theme. It then turns to a long keyboard solo that works very well with the song. Throughout this whole piece, the drums are going about as crazy as can be expected, and are some of the best examples of rhythm work in Zappa's music probably until Joe's Garage. About halfway through, a quintessential Zappa guitar solo breaks in, returning us to the more jam-oriented feel of Hot Rats. This solo continues through a detonation of the song, building it back up with a reprisal of the main theme, which the band then rejoins and powers this song to its end.Blessed Relief is a mellow and beautiful track built around clean guitars and saxophones. It feels almost like a big band swing song, except the guitar and gentle horns take precedence. One Zappa's most friendly guitar solos fills in a lot of the middle section of this piece, ending in a reprisal of the main theme, fairly similarly to the title track and Eat That Question in terms of song layout.What this comes down to is a really nice album that is shot in the foot by a few poorly composed sections and a few ideas that just fail to properly translate. However, for Zappa fans, this is essential, and for people unfamiliar with Zappa, this will probably be album number two, as Hot Rats should come first."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Sunday, March 22, 2009",
      "rating": 5,
      "text": "Those of you who may not be aware of the vast musical universes excavated and explored by Mr. Frank Zappa have my pity. I'm no FZ expert by a long shot but I'm sure of this. If you think you know what he was all about you're probably wrong because he was and still is, by definition, an enigma. His genius had more angles than one of Buckminster Fuller's geodesic domes and not one of his many albums displays the exact same side as another does. Suffice it to say that he epitomizes the phrase \"one of a kind\" and, sadly, we will most likely never be blessed with an artist quite like him again. He was the ultimate rebel that broke every accepted rule while somehow maintaining the utmost respect and admiration from both his peers and the general public at large. He was, indeed, bigger than life. Frank was a living, breathing icon of progressive music and thought that was taken from us much too soon.During his early 70s stage he was able to staff his personal orchestra with the very cream of the recording industry because there wasn't a musician of merit in the known world that didn't consider it an honor of the highest order to work with maestro Zappa. Therefore one is compelled to listen in awe at the stature and quality of the sounds emanating from albums like \"The Grand Wazoo.\" Taking that factor into consideration, the astounding feat achieved by drummer Aynsley Dunbar throughout this record is even more impressive. If you've had a tendency to under-appreciate this bad boy's skills on the trap kit then this will be a real eye-opener for you. He is nothing short of flat-out amazing here and his performance alone is worth the price of admission.At first glance the thirteen-minute title song might seem to be nothing more than a glorified jam session but if you delve a little deeper into the track and pay strict attention to its fine detail you'll be richly rewarded. \"The Grand Wazoo\" employs a delicious, tantalizing shuffle groove to present its airtight case and Frank's coyly underplayed wah-wah guitar lead gently guides the listener into a sort of Glenn Miller-on-acid big band attack. This introduces the central theme plus its spawn in the form of intricate melodies that'll twist your mind into loose granny knots. Tony Duran supplies a piercing bottle-neck slide guitar solo, then the horn herd takes you through some more interesting complexities before Bill Byers dazzles you with his terrific trombone work and Sal Marquez blows you away on his trumpet. While this is transpiring you'd be wise to notice the intriguing incidentals that abound as they dart in and out of the background constantly. Eventually the whole shebang dissolves into wonderful chaos until stickman Dunbar reins the misfits back in and restores order in the court of Mothers. After a brief reprise of the main theme Don Preston tosses in a short but compelling mini-moog ride just before the sudden ending arrives. The undiluted joy that exudes from the musicians is contagious and won't be denied. This is the kind of tune that, if you're lucky enough to have a rag-topped automobile, is custom-made for cruisin' down the road with the stereo blasting. It's prog music you can feel good about sharing with the neighborhood.\"For Calvin (and his next two hitch-hikers),\" however, is the kind of song that progmen can get into but most jocks, girlfriends and wives HATE so be forewarned. Its sinister feel and Zappa's opera-house- gone-mad approach to telling the sparse but obtuse storyline initially comes off as woozy hangover music but when the weird singing stops it morphs into a Miles Davis meets eclectic rock conglomeration where a distinct and dignified modern jazz sensibility rules. This kind of confection personifies the core of Frank's unique vision. The music constantly evolves and mutates in directions impossible to predict and the apparent total group involvement where every one of the 15+ members plays a pivotal part in creating the whole panorama of sound is incredible and a testimony to Zappa's immense leadership talent. Non-proggers won't have a clue, though, and that's why, if you have nosy or annoying roommates who won't go away, you need only put this on and the pesky slackers will vacate the premises pronto. Guaranteed.The briefest cut on the album, \"Cletus Awreetus Awritus,\" utilizes more of a standard rock platform yet it's anything but ordinary. Following a furious beginning, keyboard guru George Duke delivers an upright acoustic piano lead (with a playful, saloon-style timbre) interspersed with hot saxophone jabs from Ernie Watts before Frank & George color the premises with some pompously sung rum-pum-pums and tra-la-las that take the number into another dimension altogether. Speaking of Mr. Duke, his wicked electric piano onslaught serves as the warm-up act for the heavy riff that characterizes the next cut, \"Eat That Question.\" As George's Rhodes ride pins your ears back pay special notice to what Aynsley is laying down on the drums as he alternately leads and follows the flow of the instruments around him. (Aspiring drummers take note: Great ones like Dunbar possess the unselfish ability to be acutely aware of what the players around them are doing, adding timely accents and kicks to heighten the effect of their bandmates' solos.) Zappa then makes a bold entrance with his sizzling, echo- drenched guitar that drives the group to a climactic, nova-like collapse. Frank's guitar slithers out from under the melee like a snake while the band reassembles and parades a gallant gladiator movie-type theme into the fade out. Never a dull moment.Next up is one of the biggest surprises in the entire FZ catalogue, the blissfully gorgeous \"Blessed Relief.\" This song shows a side of this artist seldom seen in that it unashamedly paints a graceful and beautiful watercolor setting that's on a par with the best in the cool jazz genre. The way the woodwinds and brass complement each other, Sal's tastefully delicate trumpet, Duke's tranquil electric piano and Zappa's understated but poignantly naked guitarisms all contribute pure magic to this soothing piece. The final ensemble section is prog heaven as it slowly slips around the bend and out of sight like a river in spring.If all you know of Frank Zappa is the comedic (yet extremely entertaining) \"Montana\" or \"Muffin Man\" aspect or as the sarcastic master of ceremonies of \"Roxy and Elsewhere\" then this album will open up a whole new vista in the way you view his artistry. He was not only able to take on most any sect of music and conquer it totally; he also applied his indelible stamp on them that, in one way or another, altered them forever more. He made us reevaluate everything we thought we knew. This album shows how he did that to jazz/rock fusion. 4.6 stars."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Friday, October 23, 2009",
      "rating": 3,
      "text": "I'm going to travel against the tide here. I found this very similar in style to HOT RATS, yet more disappointing in its execution. Like HOT RATS, THE GRAND WAZOO focuses more on lengthy, jazzy instrumental passages as opposed to lyrical humour. Much of the album attempts to be serious in its delivery, but it falls flat on some occasions.Without a doubt, the focus is on the 13+ minute title track; it doesn't take long before the brass section really hits you in the face, undoubtedly the most noticeable part of the track. The brass simply bellows, flourishes and squibbles all under a pumping rhythm. My only beef is that the track goes on a bit too long for my sake; there seems to be a dead spot in the middle.When the songs have energy, they're fantastic. ''Cletus Awreetus-Awrightus'' is a zany, cartoony thing with rather silly vocal passages that are simply delightful. And to follow that up, the almost rocking ''Eat That Question'' contains excellent electric piano and guitar solos.The downside is that there are two lazy numbers that I simply cannot listen to without dozing off, ''For Calvin'' and ''Blessed Relief''. Both are terribly lazy in instrumentation and just don't do anything at all (at least for me).Why I don't have patience with some of the album is beyond me. There are more brilliant moments on THE GRAND WAZOO than terrible ones, but it has too many dead spots for me to recommend this."
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Friday, January 8, 2010",
      "rating": 4,
      "text": "Uncle Frank and his Large BandTHE GRAND WAZOO is the third installment in the Hot Rats trilogy, which is the favorite Zappa era for many. Almost completely instrumental, this album represents Zappa applying his unique version of rock-jazz to a band complete with horns, multiple voices, and numerous percussionists. Unlike his later, more stripped down and complex outfit, this one sounds more traditionally jazzy than perhaps any of his other albums. (Extended trumpet and sax solos obviously contribute to this.) But Zappa also offers significant elements of his more refined compositional style, his taste for more avant-garde sounds, and willingness to stretch boundaries.Aside from the brief lyrics in \"For Calvin,\" this album is completely about the music. The sarcastic humor that is almost always part of the Zappa package is mostly absent on this album. I certainly don't mind this, for even the best humor loses its bite after multiple listenings. At the same time, this is not your prototypical Zappa album and one I would buy in the second round of Zappa albums.The rock-jazz here is very good. Rather than a typical jazz \"head\" or lead melody, Zappa has created multipart sections that are punctuated by quite tasty soloing. And like most Frank albums, Zappa's guitar is but one of many great solo instruments. While not as proggy or complex as ONE SIZE FITS ALL or ROXY AND ELSEWHERE, the compositions here are very well done. A mix of early and middle Miles Davis with funk and straight rock are thrown in with Zappa's signature melodic sense and love of craziness. On the title tracks, highly composed group sections will give way to low grooves with subtle solos to all out random madness and back to constructed melody. These melodic parts are among Zappa's best. Memorable instrumental hooks, each distinct to their song, make the tracks stand out despite elements of improvisation (and a little chaos) in each one.It should also be mentioned that the style here is firmly rooted in a 60's / 70's style that may seem a little dated to modern listener. To be sure, Zappa is giving his very own colors to the style, but perhaps the first impression a new listener is going to hear is how clearly this is an album of its time. Most folks on Prog Archives are more than comfortable with the music of the early 70's, but not of all of Zappa's work is quite this time bound. For this listener, born in the 70's, I enjoy the style as I do most jazz fusion. Zappa injects both more rock and more chaos into his fusion than perhaps anyone else, and I'm glad to have this album in my collection.I actually bought this album several months ago along with its predecessor WAKA/JAWAKA. Even then this was clearly the better album, but I was not as impressed with GRAND WAZOO as I had expected based on recommendations. Coming back to Zappa with some time separation, I am quite impressed with the quality of the music, and listening to this album 3 or 4 times today for the review, have gained some additional appreciation for it. I'm actually going to give a 4 star rating where I had begun the review expecting 3. It's worth some extra time and depth of attention. For anyone with a Zappa collection extending beyond 2 or 3 albums, this should be part of the library."
    },
    {
      "reviewer": "seventhsojourn",
      "date": "Posted Thursday, June 17, 2010",
      "rating": 4,
      "text": "There are some similarities between Frank Zappa's big band fusion album and the highly rated Hot Rats, but in my opinion The Grand Wazoo is the stronger album. The 13-minute title track is the album's tour de force with its large-scale exploration of the main themes. These are presented mainly by the winds and developed with the use of different tempos, solos and tutti passages. Although the album is arranged for large wind ensembles it's keys man George Duke who steals the show, particularly with his superb electric piano contributions on the last two tracks. EAT THAT QUESTION really showcases his dexterity on the keyboard although Zappa's wah wah guitar and Aynsley Dunbar's busy drumming match his nimble- fingered runs. BLESSED RELIEF is altogether smoother; it's more laid back and provides a nice contrast to the rest of the pieces. Duke's chiming electric piano alternates solos with winds and guitar, while Don Preston tantalises with some all too brief mini-Moog pulses toward the end. The only tracks to include vocals are the bizarre FOR CALVIN (AND HIS NEXT TWO HITCH-HIKERS) and the uber-catchy CLETUS AWREETUS-AWRIGHTUS, with its wordless vocals, barroom piano and squawking sax providing some rare humour to the album. Great stuff!"
    },
    {
      "reviewer": "tarkus1980",
      "date": "Posted Monday, August 9, 2010",
      "rating": 3,
      "text": "This is even more big-band jazz-fusion, with fewer articulate vocals, longer muted trumpet solos and a bigger disparity in appeal to jazz lovers and jazz non-lovers thanWaka Waka. Some of the actually composed portions are quite fascinating; for instance, \"Cletus Awreetus Awrightus\" smooshes a neat brass theme with some solid riffs, solid melody development, the most interesting mix of instrumentation on the album (that mid-section with the electric piano with the guitar scurrying underneath, giving way to the saxophones and organs that come later, is divine) and some amusing vocal sounds into a three-minute dose of goofy aural bliss. The opening title track, also, has a lengthy theme that both starts and ends the track, full of neat compositional ideas, mood shifts and moments that stand up to anything in Zappa's catalogue. But way too much of the rest of the album just falls into the background noise category for me; the middle section of the title track, for instance, bores me to tears, with a dull trumpet solo that seems to last forever and ever and ever.\"For Calvin (And His Next Two Hitch-Hikers)\" can't hold my interest for more than ten seconds at a time, and it just seems like a giant ugly mess to me. Fortunately, though, that's the only bad track here. \"Eat That Question\" has a great main riff, and while it gets rambling pretty quickly, it does so in a good way, and not in a sloppy way. And finally, the closing \"Blessed Relief\" is quite pretty. I keep feeling every so often like it's going to break into the theme of some 70's TV drama, and it threatens from time to time to get boring, but there are some really lovely electric piano and guitar meanderings that save it whenever it gets close to the edge, so to speak.This album bores me a little more than I'd like, but it only took a little bit of jazz training to get me to feel good about this album on the whole. The worst parts are pretty crappy, but the highs are higher than onWaka, and this is definitely a necessity for any serious Zappa collector."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Friday, August 20, 2010",
      "rating": 4,
      "text": "This album depicts an interesting era in Frank Zappa's career. After allegedly being pushed off a concert stage at a gig in London, Zappa sustained injuries that restrained him from performing live for most of 1972. This gave him an opportunity to expand the jazz fusion that has been touched upon with earlier albums likeHot Rats.The Grand Wazoowas the second and, generally considered, more successful explorations of big band fusion followingWaka / Jawaka. The music here is almost completely instrumental which makes it also sound less sarcastic and critical of anything in particular. This might have attracted some new followers to the Zappa movement at the time of its release. Even today I know a few people in my surroundings that generally don't find Frank Zappa's sense of humor charming, but after I gave them the opportunity to expand their minds withThe Grand Wazoothey became enthusiastic enough to proceed with their explorations of this versatile artist! This is basically me saying that if you've given up on Frank Zappa, there might just be hope for you here!The 13 minute album-titled suite is the main attraction since it takes up more than 1/3 of the total album space. I know that there are mixed opinions about this track's compositional values, mainly directed to the hefty middle section which sounds a lot like an improv jam. I can definitely see the concern raised here but can't say that it actually bothers me all that much. There's just never been a time where I felt the urge to put this music down just because I got weary of the jam portion of this performance since I usually have so much fun while listening to the different instrument interplays that I nearly forget the time and just daze into the experience.The followup number titledFor Calvin (And His Next Two Hitch-Hikers)is a lot less energetic and makes for a cool-off break after experiencing the title-track opener, which would explain why the two pieces switched places on the CD-reissue of the record. This is not really one of my favorites in terms of instrumental or the conceptual qualities of performance but there's enough nice ideas to keep the progression going, warming us up for the next instant classic! I'm talking about the complete genius of the three minute piece calledCletus Awreetus-Awrightus. This is where Frank Zappa manages to combine his radical approaches to humor and music on one and same piece by giving both just the right amount of time in the spotlight!Eat That Questionsinks the music into another slow performance which, just likeFor Calvin (And His Next Two Hitch-Hikers)before it, manages to maintain the natural progression of the music without either impressing or tiering our senses. The same can unfortunately not be said about the 8 minute monstrosity know simply asBlessed Relief. This composition tends to put me to sleep whenever I hear it and if that was the intriguing idea behind it then I definitely owe Frank Zappa an apology.As it stands today,Blessed Reliefis what ruins the overall impression ofThe Grand Wazoofor me. This basically means that I do like this album a lot but it just never reaches the higher echelon of my top favorite Frank Zappa releases. Still, there is certainly no way I can deny the album an excellent addition-rating that it deserves, even if this one is a bit more shaky than its predecessors.***** star songs: The Grand Wazoo (13:20) Cletus Awreetus-Awrightus (2:57)**** star songs: For Calvin (And His Next Two Hitch-Hikers) (6:06) Eat That Question (6:42)*** star songs: Blessed Relief (8:00)"
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Friday, October 8, 2010",
      "rating": 4,
      "text": "This big, dynamic Zappa release features a full jazz orchestra performing a combination of quirky and bombastic jazz-rock fusion to great effect. Zappa's compositions are catchy and deep, immediately likeable and possessing a wealth of instrumental enjoyment.Things start off with the excellent title track. Bold, upbeat, dynamic, and sweeping, \"Grand Wazoo\" features a tremendous symphony of fusion sound. Zappa plays a great wah-wah guitar throughout most of it, and the various wind instruments are spot on. Dramatic for most of its first half, this track dips into a lengthy jam-session during its middle section which will probably turn off listeners who aren't already onboard with Zappa's style of free-jazz, but it's still a lot of fun. Great trombone playing by Shroyer!The second track is probably the weakest, being a mostly slow, atmosphereic freak out, though there is still some fine instrument work to make it entertaining. \"Cleetus Awreetus...\" is playful and eccentric, with and enjoyable upbeat vibe. The second half ofGrand Wazoois probably my favorite, with the more focused \"Eat That Question\" probably being my favorite track. This song has a strong groove, purposeful soloing, and a jazzier vibe than the other tunes, with outstanding trap work by Dunbar. The album closes with the laid back \"Blessed Relief\", sort of an evening jam with a strong jazz feel-- crisp, clean, and a lot of fun.While not an epic masterpiece, or even my favorite Zappa album--Grand Wazoois very good, showing off Zappa's skill at big compositions and performing a more pure fusion sound than on some of his other releases. There are only a few moments throughout this whole album that feel like misfires or noodley indulgence, the highlights greatly outshining its few faults. This album is easy to listen to and easy to enjoy thanks to great playing and fun '70's grooves; a great place for fans exploring Zappa to start out.Songwriting: 4 Instrumental Performances: 4 Lyrics/Vocals: NA Style/Emotion/Replay: 4"
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Thursday, January 6, 2011",
      "rating": 5,
      "text": "Frank Zappa always seemed to excel in every musical style he performed in. He had been dabbling in jazz rock fusion for some time. On \"Uncle Meat\" he recordedKing Kong, a fusion piece that has been covered by a fair number of jazz musicians. On \"Hot Rats\", he began getting serious about the genre. On \"Waka-Jawaka\", he wrote some amazing fusion for a large scale fusion band, and here he perfected that form.The album opens with a few lyrics onFor Calvin And His Next Two Hitch-Hikers, giving the casual listener the impression that this is going to be another humorous vocal filled Zappa album. But the lyrics quickly end, with spectacular musicianship and orchestration taking center stage.Calvinis filled with musical themes that Zappa also used inThe Adventures Of Greggery peccary(which was written around the same time, but released years later).The Grand Wazoo, the longest song on the album, is a funky jam with great horn breaks intersperced to spice things up.Cletus Awreetus-Awrightusis a delightfully pompous number, andEat That Questionboasts some of George Duke and Aynsley Dunbar's best performances anywhere. The album ends withBlessed Relief, aptly named, as it is one of Frank's most peaceful and beautiful compositions.It's just an incredible album. If You know any fusion fans who hate Zappa because of the sexual references and silly humor, sneak this on sometime, and watch the reactions."
    },
    {
      "reviewer": "Anthony H.",
      "date": "Posted Monday, May 9, 2011",
      "rating": 5,
      "text": "Frank Zappa:The Grand Wazoo[1972]Rating: 9/10The Grand Wazoois Frank Zappa's second jazz masterpiece, withHot Ratsbeing his first. This is the second album recorded during the aftermath of Zappa's stage-fall. Thus, it is stylistically identical toWaka/Jawaka: a big-band jazz-fusion album with bombastic brass arrangements and alternating solo sections. However,The Grand Wazoois an improvement of its predecessor. Some of Zappa's greatest compositions can be found here. Virtuosity is combined with soulful composition and playing, resulting in a near-flawless fusion album.The Grand Wazooholds a lot of emotional significance for me, as well.\"For Calvin (And His Next Two Hitch-Hikers)\" begins the album in an abstract manner. It's centered on free-jazzy arrangements and quirky electronic sounds. It's certainly an unorthodox opening track. The title track follows. This is an absolutely perfect piece, with wonderful soloing and a legendary rhythm section. It's obvious that Zappa had become completely comfortable with the big-band setup at this point. \"Cletus Awreetus-Awrightus\" is a short and humorously upbeat track with fantastic harpsichord work and a fun main hook. The vocal section at the end is great, as well. \"Eat the Question\" contains one of the greatest hooks Zappa ever wrote. This simple hook manages to display just how brilliant Zappa was: he was able to turn a tiny, brief motif into something unceasingly brilliant and memorable. \"Blessed Relief\" is a very smooth and chilled-out track with yet another amazing main theme. The keys create a fantastic atmosphere here.I can't recommend this album highly enough, especially to fans of jazz-fusion. There are moments of compositional genius here that I can only describe as \"enlightened.\" The only problem I have with this album is that it's too short; I think it would have been better if Zappa combined this withWaka/Jawakato create a lengthy double-album. I'm splitting hairs, however; these are hardly complaints.The Grand Wazoomakes it onto my Zappa top-five without a doubt. Although not quite as flawless asHot Rats, this album is an essential masterpiece."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Saturday, August 6, 2011",
      "rating": 5,
      "text": "The promise of the big band jazz fusion lineup that Zappa experimented with on Waka/Jawaka sees its fullest expression on The Grand Wazoo, which I think is a bit more successful than its sister album. The sound of the big band is fuller and stronger here, the compositions are stronger, and the performances are technically dazzling whilst at the same time full of life. Zappa contributes some excellent guitar soloing too, and as a whole the album is a more than worthy successor to Hot Rats. In fact, I'd say both this and Waka/Jawaka represent a welcome return to form after the much more inconsistent Flo and Eddie period, and the two albums represent Zappa's strongest work since Hot Rats; not all Zappa fans will agree, but I think it's fair to say that The Grand Wazoo and Waka/Jawaka have broader appeal than the Flo and Eddie material.Either way, this album represents an excellent return to form for Zappa, as well as providing a firm new foundation for the next version of the Mothers to build on."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Monday, November 5, 2012",
      "rating": 3,
      "text": "Frank Zappa is best served up with his oddities of musical flair where musical instruments compete against each other and the time sigs are all over the place, and he allows soloists to unleash their fury in improvisations and jamming extended breaks. On \"The Grand Wazoo\" the band do just that and at times the music takes off out of the atmosphere. On a personal level it takes me some patience to get through this type of music as it is so intense and layered it is hard to latch onto but it grows on the ear over time.It begins with the stunning title epic that has the band exploding into a paroxysm of musical genius, or they may be just laying what the heck they like. I would hate to see the musical sheetnotes for this stuff. It is absolutely insane music and blows the doors of what might be musical boundaries. As far as Zappa was concerned, hang the rules and just play the way we feel. It really feels like a mess in places but it is a lot of fun to hear.'For Calvin (and his next two hitch hikers) is a piece of whimsy with that low groaning vocal that I am never a fan of, and then a freakout of musical crassness, and there is a chance for Zappa to shine on his accomplished infamous guitar runs.It is followed by the weirdness of 'Cletus Awreetus-Awrightus' where the jazz fusion is a prominent thread running throughout, especially on the scat vocals that are hilarious at times. The jazz becomes even more prominent on 'Eat That Question' especially the brass sounds that are simply astonishing virtuosos playing. Finally the jazz locks in nicely on 'Blessed Relief' with trumpet solo extraordinaire playing and a gorgeous keyboard solo; the relaxing jazz signature of percussion and bass is easily recognizable by any lover of jazz so it will appeal to the jazzaholic. The ending with swirling keyboard chimes, and clarinet with a smattering of horns over a nice acoustic and wah-wah guitar sound works well. Great music to kick up the feet and relax after a hard day.Heaps of reviewers rave eloquent at how brilliant this is, I will probably get lynched by the Zappa fan club, but overall I personally found that the album does not really have enough quirkiness and memorable moments as other Zappas such as the incomparable \"Hot Rats\", \"Zappa In New York\" or \"One Size Fits All\" for my taste. I was surprised at its serious tone in the second half in particular that was just a jazz scape, but it is nevertheless a seriously great jazz fusion album and yet another one to prize in the legacy of Zappa.."
    },
    {
      "reviewer": "darkshade",
      "date": "Posted Thursday, December 12, 2013",
      "rating": 5,
      "text": "Essential Jazz-Rock/Fusion from a man not usually associated with jazz. You can find jazz throughout Zappa's discography. This album, The Grand Wazoo, may be the best example of FZ jazz. It is the follow up and companion album to Waka/Jawaka, but where that album had its (few) flaws, The Grand Wazoo is near perfect. If you are familiar with Zappa's music, this is a must have. If you're not, but you're trying to have a great jazz-fusion collection, this album is also a must.My old version of this album has tracks 1 and 2 switched, so it starts out with For Calvin. But I only listen to the 2012 UMe CD, which has better sound due to the fact that it is the original analog recording.First thing's first, the only vocal track, \"For Calvin (And His Next Two Hitch-Hikers)\". The song is quite weird and avant-garde; just what you'd expect from Zappa. But from a fusion record? With lots of horns playing dissonant lines, and vocals that sound like a dying witch, it would probably scare off the casual jazz listener away. However, I have always felt that having it as the second track ruins the flow of the album. With For Calvin as the first track, as it is on the original LP, the album can be seen as starting out very chaotic in usual Zappa fashion, and gradually through the album becoming jazzier and more melodic.The title track is one of Zappa's best tunes, and contains some great improv over a shuffle beat. The song is kind of Third Stream Jazz in nature, but is totally rockin'. I enjoy how the band plays the composed sections and everyone falls into the solo sections quite nicely. What is a Frank Zappa record without a little humor?Cletus Awreetus-Awrightus is a short little pompous track, with full wind ensemble here; particularly trumpets and clarinets playing very fast lines, complemented by the drums. Eventually, a woman sings the first part of the main theme, followed by Frank himself singing the other half of the main theme, and it's quite funny. I always think of him sitting in the studio recording it. As the album continues, one notices the fact that it's getting jazzier.Eat That Question contains one of FZ's best rock riffs, and one of George Duke's best keyboard solos. Duke is one of the reasons this album is so good, as he brings a Herbie Hancock type sound to the table, making almost everything Zappa-related that he plays on, very jazzy.The album closes with the mellow Blessed Relief, which might be hinting at the trip one takes listening to this album and making it to the end. This is one of the most beautiful songs ever conceived by Zappa, with great solos by trumpet, keys, and guitar; Frank plays with that cool effect on his guitar, similar to what he used on Watermelon in Easter Hay from Joes Garage.As I said before, this album is essential listening for any fan of jazz-fusion. It's also unique in that it has all the trademarks of a classic 70s fusion record, but with the Frank Zappa strangeness (though most of it is not so strange by his standards). Don't let that turn you off though; your fusion collection is not complete without this album. One of the few fusion recordings that is excellent from start to finish. No solos are too long, and Frank doesn't go on and on about politics or sexual harassment in the workplace :)Be sure to get the 2012 Universal version, which is the original analog recording, and sounds much better than all older CD versions."
    },
    {
      "reviewer": "TCat",
      "date": "Posted Wednesday, April 15, 2015",
      "rating": 5,
      "text": "At the time of the recording of this album and it's following concert tours, FZ was recovering from an accident where he was pushed off the stage by a crazed fan. The albums and tours during this time period were mostly jazz fusion, and FZ toured with a variety of personnel which varied in size. For a short time, during what was called The Grand Wazoo tour, he toured with his largest array of musicians ever and performed this amazing style of jazz fusion. Frank was at a compositional peak at this time (he reached many of those peaks during his life btw) and it shows in the excellence of his music and compositions. If you are a lover of jazz fusion and almost completely lyric free (except a few instances) then this is the period in FZ's discography that you need to check out.There are a few albums that were released during this time and a few released posthumously that represent this period of time quite well. These albums are this one, \"Hot Rats\", \"Waka/Jawaka\" and \"Burnt Weenie Sandwhich\". The posthumous albums are \"Wazoo\" (which features the Grand Wazoo tour), \"Imaginary Diseases\" (featuring the Petit Wazoo line up--the smaller \"big band\") and \"Joes' Domage\" (this one features rehearsal sessions from the above mentioned studio albums). Those that love this music from FZ should put themselves in contact with these albums.The album consists of all jazz fusion pieces with very little lyrical content. There is no humor (not much anyway) or guitar soloing in these albums. It is 100% jazz fusion with a very large brass and woodwind ensemble. The music is excellent here and showcases FZ's compositional prowess and his ability to lead a jazz orchestra. There are two track listing orders for this album, the original with \"For Calvin\" first and \"The Grand Wazoo\" as the 2nd track. The 1990 reissue reverses the order of the first 2 tracks. All of the other tracks are in the same order. FZ okayed the reissue and the new order of the tracks.\"For Calvin\" features some lyrics, not many though, and the song is dedicated to Cal Schenkel who did a lot of album design for FZ over the years. The story behind the song is that Calvin had borrowed a '59 Jaguar from FZ (apparently it was Captain Beefheart's car) and was stopped at a traffic light, when two hippies came along and got into the car, thinking he had stopped to give them a ride. The hippies didn't talk or say where they wanted to go, so Cal took them to his studio and told them that the ride ended there. They stayed in the car while Cal worked in his studio and made themselves some bologna sandwiches, ate them then finally left. The song is dedicated to that incident, just as many of FZ's songs were dedicated to real life incidents. The song itself is more of an avant garde style of jazz with a lot of dissonance and strange off-kilter rhythms. A nice study in modern compositional style, except instead of classical, it's jazz. The centerpiece of the album is \"The Grand Wazoo\" which is a 13+ minute instrumental full of amazing musicianship and orchestration. There is a main theme that bookends the middle section which features both improvisation and structure in various segments throughout the piece. The end of the main them as it goes into the middle section is punctuated by a great boogie style, rhythmic driven foundation which serves as a great background for the soloing going on. This gives way to more modern stylings from time to time which revert back to straightforward jazz. This is an excellent example of mixing styles and FZ shows that it works very well here. Even with the mixing of styles, the song is solid and concise and is a great example of FZ's genius.The 2nd half of the album starts with a short mid-tempo piece which continues the same jazz feeling but it also has some wordless vocals. This is a short interlude piece that separates the more up beat songs with some softer midtempo songs. Following this is \"Eat that Question\" which according to FZ was originally called \"Eat that Christian\". Why the title changed is anyone's guess. This piece features George Duke and his excellent piano playing. On this song, the production value given to the electric piano is better than what had ever been heard before this time and thus this track stands out not only on this album, but in production also with the improvement of sonic quality for this particular instrument. Without going into detail, this track was instrumental in improving certain recording techniques. The last track is again a more laid back jazz piece called \"Blessed Relief\"This is definitely a masterpiece of jazz fusion and progressive jazz. It stands right up there with anything recorded by any jazz fusion great including Miles Davis. I don't understand why this recording doesn't get the respect it deserves, but I am happy to see that at least in the archives, most reviewers revere this album like it should be. It is one of Zappa's best line ups and is the album to have that shows his genius as a composer that was excellent in all of the genres of music that he wrote songs for. This is an essential recording, for collectors and jazz fans alike and should be a part of your progressive collection. 5 stars without a doubt!"
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Saturday, February 27, 2016",
      "rating": 5,
      "text": "This is by far my favorite Frank Zappa album that I've yet heard as it avoids much of the sophomoric humor that make other songs and albums \"old\" and abrasive after one or two listens (this despite the underlying compositional genius and instrumental prowess of FZ and his always highly skilled bandmates). The Grand Wazoo feels like FZ proudly and simply putting on display his admirable songwriting/conducting genius, even showing a little more of his \"humane\" side with ample freedom for expression (improvisation) given to the contributions of his bandmates. This is an album that I enjoy returning to time and again. There is brilliance and astounding sophistication in FZ's music and yet it is so often trumped by the lyrical jokes. On The Grand Wazoo you get all of the former, front and center, and yet there is still plenty of joy and humor in the music itself--especially in the Cleetus and Calvin songs. Though I love hearing Frank shred on the guitar, and this album on puts that side of him on display on one song (\"Eat that Question\"), I so much prefer this type of music from the Mothers ensemble that I'll gladly sacrifice some of Frank's instrumental flare for the collective masterpiece of songs that he's produced for us here. As my journey into Frank's world continues to unfold I hope to find much more music like this, for that is what it will take to make me a fan."
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Tuesday, October 12, 2021",
      "rating": 5,
      "text": "After having dissolved the Mothers of Invention, Zappa is back inspired with a series of records that bring to maturity his fusion of rock with jazz and classical music.In The Grand Wazoo Zappa decides to be the director of an orchestra of about 20 elements that churns out one of the most heterogeneous jam fusion in the history of rock.Side A1. For Calvin (And His Next Two Hitch-Hikers) (6:06) It's a sleepy slow-motion demential song. This is one of Zappa's masterpieces, enhanced by the vocals of Sal Marquez and Janet Neville-Ferguson. It is a very relaxed dissonant grotesque piece, driven by the trumpet and the trombone, which tends to slow down more and more in a ramshackle way, until it almost stops around three minutes. Then comes a cacophonous piece, a little clever (in this record the production sometimes exceeds the inspiration). It's a pity that the vocals don't return in the finale. Rated 8.5.2. The Grand Wazoo (13:20) The mini-suite The Grand Wazoo, in fact instrumental, offers a fluid, magmatic and flowing jam music with a blues guitar a fiatistic big band that crosses retro themes with exotic and Latin rhythms. The trombone solo emerges above a very lively funky rhythm (Dunbar plays with great inventiveness), followed by a phase of dissonance and then another solo of a wind instrument. Towards 10 minutes the rhythm returns to the syncopation as at the beginning and the piece closes more or less as it began. In fact it is a blues-jam with variations on the theme that range towards other styles. It lacks a climax, but it remains remarkable. Rated 8+.Side B3. Cletus Awreetus-Awrightus (2:57) Dedicated to a phantom emperor of funk, it is a short instrumental, band piece, characterized by the winds, sometimes distorted, by the jazz liquid piano, and by changes in rhythm and atmosphere. The mood, however, is the festive one of a goliardic party with a refrain that is a recurring musical motif alternating with variations on the theme. There is also a hint of a choir, unfortunately not developed. Notable piece 8+.4. Eat That Question (6:42) It is the most bluesy and aggressive piece on the album, starting with Duke's keyboards and continuing alternating Zappa's guitar with horns. After a break in the middle it resumes his rhythm, which is always pleasant. Rated 8.5. Blessed Relief (8:00) It is a slow, nocturnal jam characterized by a jazzy piano and trumpet. Liquid piano, but maybe it's the background because the bass and the drums perform some remarkable jazz phrasing, then comes Zappa's guitar. In the ending, the winds regain control of the piece. Rated 8+.Total Time: 37:03The Grand Wazoo is a predominantly instrumental disc of jazz-blues-rock fusion that is characterized by the orchestral arrangement, largely fiatistic that produces a hybrid with big bands and allows you to brush a great variety of themes (in this sense, this jam-blues album reach a prog dimension). It has the advantage of always being smooth, of having a perfect sound and a refined arrangement played by virtuoso instrumentalists. It is a masterpiece where the whole counts more than the single pieces, all notable although none exactly memorable in an absolute sense.Rated 9+. Five Stars."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album2ed1.html",
  "last_parsed": "2025-05-18T00:23:34.030521"
}