{
  "album_title": "GODBLUFF",
  "artist_name": "Van Der Graaf Generator",
  "artist_page_link_local": "artist8c00.html?id=343",
  "year": 1975,
  "rating_value": 4.46,
  "rating_count": null,
  "review_count": null,
  "genre": "Eclectic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/343/cover_339151142016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "The Undercover Man",
      "duration": "7:00",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Scorched Earth",
      "duration": "10:10",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Arrow",
      "duration": "8:15",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "The Sleepwalkers",
      "duration": "10:26",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Forsaken Gardens (live) (12:23) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "A Louse Is Not a Home (live) (10:26) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "* Live at L'Altro Mondo, Rimini (Italy) on 08/09/1975 - previously unreleased",
      "duration": null,
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Marcelo",
      "date": "Posted Sunday, December 28, 2003",
      "rating": 5,
      "text": "Peter Hammill is, in my opinion, one of the best progressive singers ever. In \"Godbluff\" he adds his incredible voice to the most impressive VDGG music, resulting an excellent album. Four long pieces are \"agressively\" beautiful, being my favorite \"The Undercover Man\".Even when VDGG wasn't a \"gothic-prog\" band (the best definition could be a \"vocals driven band\"), \"Godbluff\" is their first realisation from the second generation, this one darker and even violent and, IMHO, the best in VDGG history. A classic album in the whole genre."
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Wednesday, February 4, 2004",
      "rating": 4,
      "text": "After a two and half year break spent at different projects , but all four roads kept crossing each other's, the quartet reconvened and recorded a batch of songs that ill produce not only Godbluff, but also a good deal of the following Still Life. The batch off \"songs\" were actually shorter, mot as intricate, but certainly more aggressive (bar the opener of this album), but this was also fully intended as they were careful not making a \"son of\" Pawn Hearts, however disputable this choice might have been. One of the characteristic from this era of VdGG is that Hammill will gradually pick up more and more the electric guitar as the picture on the back-cover shows.From the absolutely stunning Undercover Man, a slow crescendo starting from an all too rare Jackson flute and drums, the progression is astounding as Hammill's voice and Banton's organs slowly fill the soundscape, until halfway through the track hit full stride with Jackson's sax, before slowly returning to the flute to the third track Arrow (the most aggressive), this album is a real stunner and would've been their best ever if the last track, Sleepwalkers (a fairly shoddy track with a completely out of place Cha-Cha-Cha ruining it further, yes colleagues I confirm this point of view ;-) had been substituted by any track from the almost perfect Still Life. But life is made out of choices, and Sleepwalker (still acceptable track, but not up to standards of the others here). If you'll pardon the pun, but Scorched Earth is also a real scorcher of a track, also full of constant tempo changes and Banton's organs pulling in its weight. Actually, Hugh Banton (for other projects were still pending) did not participate as much in this album and one can feel it. He also plays bass guitar on a track.Except, for the closer, an all too sober/bland artwork (as well as a single sleeve design) and its short duration (the only three flaws), the Godbluff album saw the Generator return in great form, and its remastered version is a must have as it has a few bonus live tracks from Hammill's solo albums (but played with the full VdGG line-up), which were actually played in the group's sets."
    },
    {
      "reviewer": "greenback",
      "date": "Posted Sunday, April 18, 2004",
      "rating": 3,
      "text": "Better than \"Quiet Zone/ Pleasure Dome\"; the songs are more epic. Some real jazzy parts. The keyboards are more present and better exploited. Compositions are better structured. Instruments are quite well played. But...But....the voice is, again, absolutely awful!"
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Saturday, June 5, 2004",
      "rating": 5,
      "text": "Even though my fave Van der Graaf Generator release is 'Pawn Hearts', I must admit that I enjoy their second era better, since at that stage the band was playing at its most cohesive and had reached a perfect level of sonic violence to match the passionate lyrical imagery and delirious melodic lines delivered by frontman extraordinaire Peter Hammill. 'Godbluff' was their comeback album... and what a comeback! Instead of taking off from the exuberant psychedelic forest created by 'Pawn Hearts', the foursome decided to get rid of the paraphernalia of mellotrons, ARP synths, multiple percussive instruments, and nightmarish electric devices on sax, in order to approach the new complex compositions and arrangements in a tighter manner. Even Hammill's singing feels more focused on portraying the contemplative nature of his lyrics and less interested in enhancing the pathetic-oriented twists on vocalizations: actually he doesn't give up on his expressionist essence, but now he's assuming his singing role as such. Banton's role keeps itself subdued i nterms of soloing, but is determining in the building of textures and clever chord progressions. Most solos are left in charge of Jackson's saxes and flutes, which he plays with a somewaht down-to-earth attitude. Meanwhile, Evans displays his jazz leaning more freely than ever before, and he does so with such fluency that he seems to want to hide the fact that being a drummer in a bass-less* band that loves to stick to complex rhythm patterns is not a hard thing to do. 'The Undercover Man' kicks off the album with full splendour: its crescendo entry and its delicate balance of wind/keyboard sonic display makes it a strong starting point, despite the fact of it being basically a 7+ minute ballad. 'Scorched Earth' is the most symphonically oriented number in the album - special mentions go to the majestic interlude and the awesome closing section: in many ways, this song is quintaessentially VdGG-esque. 'Arrow' is another introspective Hammill tune that eventually ended up as a jazz-rook infected tour-de-force, allowing the lyrics to expand their imagery's power. Finally, the closing track 'The Sleepwalkers' displays an air of ironic joy sustained over a martial-like rhythm pattern, also including some proper touches of latin jazz, as well as a R'n'B oriented instrumental interlude: Evans' playing on this piece is particularly awesome, but again, this is an owesome band... right? I give it a perfect rating since I consider it one of the most brilliant comeback albums in prog history, and it also qualifies as a brilliant work in itself.* OK, Banton plays some bass lines, and handles a mean bass pedal board as well... but you know what I mean."
    },
    {
      "reviewer": "memowakeman",
      "date": "Posted Sunday, March 13, 2005",
      "rating": 5,
      "text": "An obligatory masterpiece!Van der Graaf Generator is one of those bands that have released so many good albums, and like the other prog monsters their best albums are from the 70`s, anyway i love World Record, but i mean, when a band like thes has so many good albums, somewhere in the discography must catch your attention, to the grade of love the album or songs i dont know, with me it happens with Godbluff specially, i ike the other albums and maybe Still Life or H to He could be also masterpieces, but not my favorite albums, not as the same level a s Godbluff, because it caused an immediate effect in me while listening to it, so since then i took it as my favorite VdGG album, and i actually love it and think it`s a masterpiece.Maybe this band is not catchy to everyone, not maybe, im sure of that, and one reason could be Peter Hammill`s voice which i love and consider a very special and superb voice, dark, sensible and hard at the same time, anyone has not even an alike voice, so that fact makes this band so special and so different, also i know the music that VdGG offers is great , not totally symphonic, not totally jazzy but with hints of several genres, and all that mix and uniqueness makes this band a weird band and not everyone`s taste.Godbluff is a superb album for me, it has only 4 songs, but them all are great, starting with the emotional and weird vocals to the exquisite music, the sound of piano , bass and trumpets or saxes is simply great. Scorched Earth is my personal favorite song, but please check Arrow , greeeat song.. actually all are almost perfect , not a bad or weak point here, the music is so enjoyable for me, and musically i think the band is awesome.So i recommend it so much, 5 stars anytime."
    },
    {
      "reviewer": "Eetu Pellonpaa",
      "date": "Posted Monday, April 4, 2005",
      "rating": 5,
      "text": "I think this is the best album by this band, and I would recommend it to anybody who is interested of emotional progressive rock music. Their music is quite accessible on this record when compared to their previous records, and the overall feeling is sorrowful, dark and violent. The first side of the LP consists of two tracks which are merged together, \"The Undercover Man\" and \"Scorched Earth\". Lyrics are wonderful, the music is emotional and the compositions work wonderfully. The beginner of the B-side, \"Arrow\", is probably their best tune in my opinion. The last song is also OK, not good as the others, but not so bad that I wouldn't dare to give this album the full score. Get it for your moody winter nights!"
    },
    {
      "reviewer": "Bj-1",
      "date": "Posted Tuesday, April 26, 2005",
      "rating": 4,
      "text": "VDGG are back after a four year break with an even tighter, cleaner and more aggressive sound to them, with Hammill in particular delivering some of his most intense vocals yet, notably on 'Arrow' with equally forceful music to back them up with. After a more delicate start with 'Undercover Man', the rest of the songs are long, complex and intense, but also with a very good melodic sense to them and some really powerful climaxes, like in the massive finale of 'Scorched Earth'. Great build-up's all around. The bleak sound of H to He and Pawn Hearts is not as prominent here, that might make this a good starting point for VDGG's music, although they remain an acquired taste generally. Godbluff ranks among the bands best stuff, and to me is the strongest album of their later trilogy in the 70's. 4.5/5"
    },
    {
      "reviewer": "Trotsky",
      "date": "Posted Tuesday, June 28, 2005",
      "rating": 4,
      "text": "What a comeback! It was as if VDGG had never been away. And of course, in a way, they hadn't. The group broke up in 1971, only for Peter Hammill to be joined quite frequently on his solo albums by the other three VDGG stalwarts, David Jackson, Hugh Banton and Guy Evans. The lads eventually decided to reform and made up for \"wasting\" some of their best years together with this excellent album. The second coming of VDGG may have eventually petered out but every one of the four songs on Godbluff was an important addition to the band's canon.From its humble origins, The Undercover Man erupts into another one of the haunting, desolate VDGG ballads, with Jackson's fluttering flute and Banton's (ahem) enormous organ defining the sound while a certain Mr. Hammill wails and rails away as only he can. The song eventually becomes a monstrous rocker that sounds like the conclusion of some amazing rock opera ... except that in the case of Godbluff, the fun is just beginning.As The Undercover Man fades away, a new monster announces itself ... Scorched Earth is a rampaging tune, with Evans let off his leash. Halfway through this discordant angry track, a steady riff establishes itself allowing Jackson and Banton to really cut loose too.Arrow is a more basic beast that starts off with a bit of a psych jam before evolving into one of the most beautiful, sparse and haunting bits of music VDGG ever recorded (no mean feat, I can tell you!). For the most part of this lovely song, Hammill's vicious vocals are at odds with the pastoral playing of his colleagues. When the band finally breaks its restraint at around the 5:30 mark, the great riffs floating around the song convalese into a engrossing whole.The concluding anthem The Sleepwalkers is yet another stimulating work that's initially tied to a darting medieval melody played by jackson on flute. When, on the 1:30 minute mark, the melody re-emerges with Hammill sings a verse, it really takes my breath away. Then takes a number of strange journeys, with snatches of music hall, jazz and bossa nova, finally settling down into a breezy riff, which Jackson gradually takes over. Hammill then returns while the original flute melody is hinted at. I admit that I love that melody so much that I think VDGG underuse it, but it's hard to argue with such daring composers.One is tempted to think that Godbluff gets such rave reviews because VDGG fans were so relieved that the band hadn't lost it, but I do really think this is one of the band's finest acheivements. ... 83% on the MPV scale"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Sunday, August 7, 2005",
      "rating": 5,
      "text": "A True Masterpiece of Prog Rock!This album remarks the comeback of the band after a four year break from the music industry. The front-man Peter Hammill released quite a number of albums during that time. They came back to the studio and recorded this wonderfully crafted album (released in 1975) that I think it's a true masterpiece. I have to admit that due to this album, my appreciation on VdGG music had grown significantly and I started to appreciate their early albums which were too dark and too depressive in mood to my personal taste. Godbluff still project the dark mood but musically it's much more mature compared to their early records. I remember vividly when this album was released, a year later I got a cassette version on this and I talked to myself: \"Wow! This is the music that I'm looking for!\".Talking on a music spectrum, this album is heavily loaded with Hugh Banton's wailing organ work combined with multi-registered voice of Peter Hammill (Jeezzz!! I like his curved voice lines!) and . David Jackson saxophone work. Admittedly, I'm not a great fan of saxophone; but with this record? Oh man . this one must be treated differently! It's also the case with Dick Parry's work on Pink Floyd stuffs which I also like it. But, don't ask me to enjoy Kenny G's work man .!! No way!! Enuff .. enuff .. Back to Godbluff, the music is tightly composed with great arrangements and powerful songwriting.The album comprises four approximately equal-length songs that all of them project a uniformity in mood and style even though the melody is totally different from one song to another. that provides the semblance of a central concept, even if there isn't one that I can see. Jackson provides flute playing to \"The Undercover Man\" and \"The Sleepwalkers\" especially on softer parts which usually are very beautiful segments to my personal taste. Evans punctuates each Jackson sax burst with a sort of rapid-fire staccato that characterizes the music of Van der Graaf Generator. At first listening experiences I tended to put my best favorite track was \"The Sleepwalkers\" because it has powerful pondering vocals with high energy music that combines aggressive sax work by David Jackson as well as stunning organ work by Hugh Banton. But with some more listens I felt that \"The Undercover Man\" which has a floating melody and accentuated vocals was becoming another favorite of mine. The list did not stop there as the other two tracks \"Scorched Earth\" and \"Arrow\" did become my other favorites as well. So, what can I say if I love all of the four tracks? Is there any favorite? I don't think so because I love all of them, finally - with the passage of time, of course. That's what might happen to you if you are newbie to VdGG music. You might like only one track but with more spins it would grow. I'm sure on this. Try it.\"Godbluff\" (and \"Still Life\" - the follow-up that was released a year later) represents the band at their peak, with a tight composition, mature lyrical contribution from Hammill combined with the powerful songwriting the band members contributed. The combined creativity of the four musicians creates a wonderful music that uplifts our emotion whenever we listen to the album from the CD player or even whenever we sing the song inside our mind without playing the CD at all (like what I'm doing now when I'm writing this review withlabor of love). Some people mention that Pawnheart was the band's masterpiece but I think they should also include these two albums as well. VdGG was one of the bands that pioneered prog rock in the seventies. Highly recommended.Keep on proggin' ..!Peace on earth and mercy mild! GW"
    },
    {
      "reviewer": "Eclipse",
      "date": "Posted Monday, August 8, 2005",
      "rating": 5,
      "text": "Another masterpiece of VDGG, not so mighty as the amazing Pawn Hearts but much better than Still Life and H to He, Godbluff manages to show again the darkness contained within this band's brilliant music and lyrics in perfect shape, courtesy of the also brilliant Peter Hammill, one of the best writers and singers of all times.The cover says it all: this is dark, very dark stuff. The first track is a gentle intro to the crazy world showed on the following three numbers. Hammill with this not usual quiet voice that will soon range into a growl full with angst on \"Arrow\" opens the album together with some soft flutes by David Jackson - who is perhaps making his best performance here on both instruments (sax and flute) played by him. The overall mood of the song is a melancholic one, though. The singing sounds like a cry for help after Hammill stops whispering, but this apparent sadness becomes a sudden rage on the second song, \"Scorched Earth\". This track is the most upbeat one here, but soon it reaches a very dark and scary moment where Hammill begins talking in a low tone and the instrumentation gets quieter...soon getting louder and louder together with the voice bringing the upbeat section back with some more great sax work. The keyboards lead this song perfectly, and after the chaotic section we notice that Hammill starts growling...yes, i feel that in this album's first three songs we have quite a gradual development of the tone of Hammill's voice. On the first song, it is quiet, leading to some cries and his normal tone. At the second it starts normal and goes getting chaotic reaching full power on \"Arrow\", where the growling literally increases at each line sung. It is almost as if he was \"transforming\" himself during those minutes, from his most gentle side until his most angry full with angst one at the end of the third track. Sounds like an internal monster borning from the depths of your mind, reaching full power at the crying rage of the line\"how long the time seems, how dark the shadow, how straight the eagle flies, how straight towards its arrow / how long the night is, why is this passage so narrow? how strange my body feels impaled upon this arrow\". This song, \"Arrow\", is my favorite from the album, since it affects me a lot emotionally. At the ending words from the song's lyrics above quoted, i feel very moved inside - those lasting words sound like someone is feeling really disturbed looking for her/his freedom from the darkness that surround her/him. It starts with a great drum and sax jam, leading to the actual song with a rare appearance of the guitar. The song gets progressively faster and Hammill's voice follows the rhythm. A very chaotic jazzy number for sure, and the most emotional one from this album. And then we have the closing track, easily the weakest one from this superb group of four brilliant songs. But it doesn't let us down. If you are used to VDGG's surprises through songs, you won't mind the somewhat mexican section found here after some more chaotic keyboard work. It is the less accessible from the album, and even though it doesn't close it memorally like the ending of \"Plague\" on Pawn Hearts, it still deserves its merit due to its constant variation of moods making it perhaps the most prog of all acts here.Overall this is an excellent album that is very essential together with Pawn Hearts in any prog collection. In my opinion both form an amazing pair like Selling England and Foxtrot do for GENESIS and WYWH and DSOTM form for the FLOYD. Get this album as soon as you can, there's a remastered version released this year containing two extra songs. Buy it and enjoy Peter Hammill's world!"
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Tuesday, September 6, 2005",
      "rating": 4,
      "text": "After a 4 year hiatus, VAN DER GRAAF re-formed and began VDGG Phase II and did so with a purely stunning album in \"Godbluff\". Musically, the album is anchored on the heavy organ work of Hugh Banton and David Jackson's sax supported by the drumming of Guy Evans. Peter Hammill's lyrics and vocals are amongst the best he ever recorded with his deeply emotional pitch shifts and power. Without a question the one two punch of \"The Undercover Man\" and \"Scorched Earth\" will amaze all progressive rock fans. Dark yet magestic all the way thru, \"Godbluff\" is a riveting example of one of the ture craftsmen of this genre and IMHO an great contribution to music in general. Absolutely an essential album."
    },
    {
      "reviewer": "Alucard",
      "date": "Posted Wednesday, January 11, 2006",
      "rating": 5,
      "text": "After four long years the poet is back on the machine. So you pull the record out of the black cover and you feel, this is not going to be an easy journey.The needle sets down and an echoed flute plays a slow funeral dirge, soon joined by the slow pace of the organ and the poet himself \"you ask, in uncertain voice, what you should do, as if there was a choice but to carry on miming the song\"... Yes it's too late to turn back and you start to shiver and while the song fades away, menacing chords on the electric piano warn you and a drum roll announces danger.The sax and the organ start to howl and the poet spits out his anger and frustration \"charging madly forward, tracks across the snow; wind screams madness to him, ever on he goes...\", and you feel cold, black sweat pouring out of your body while you look over the scorched earth. And with one last feedback-scream of the guitar you cry for relieve, but it's too late... you can't move anymore, painridden you hear the whaling sound of the wah-wah sax and every note impales you deeper on the arrow and the poet screams and shrieks in agony, \"how long the night is - why is this passage so narrow? How strange my body feels, impaled upon the arrow.\"And the music builds up in a frenzy and when it finally stops you hear a dance tune approaching and people coming nearer, but when they come nearer in a twisted mockery dance you realize, these are the living dead, the sleepwalkers, \"the columns of the night advance, infectiously their cryptic dance gathers converts to the fold - in time the whole raw world will pace these same steps on into the bitter end.\" and suddenly you are invited to join in for a deadly foxtrott and when the dance finally stops you look to the sky and there is not much hope, but at least you are ALIVE.A masterpiece in poetry and music!"
    },
    {
      "reviewer": "belz",
      "date": "Posted Saturday, April 1, 2006",
      "rating": 5,
      "text": "4.6/5.0I thought I had listened to it all. After months of listening to 'new' stuff, I finally got to this album. Sure, I like \"Pawn Hearts\" and other previous VDGG albums, but WOW is the only word that comes in my mind after listening to \"Godbluff\".This is awesome what those 4 guys are doing on this album. This is a perfectly balanced album, with a great flow from the beginning to the end, with some 'flamenco' touch (Hughes Chantraine does not like the \"cha-cha-cha\" but I personnaly think this is quite refreshing and enjoyable) and lot of emotion. And even more emotion, and yet more... A very emotional album, with absolutely gorgeous lyrics coming from Peter Hammill's warm yet distant voice.I think this is a masterpiece of progressive music and a very important album to own if you like prog music. I never really understood all the buzz around Van der Graaf Generator before listening to this artwork.4.6/5.0"
    },
    {
      "reviewer": "Tony Fisher",
      "date": "Posted Thursday, April 20, 2006",
      "rating": 2,
      "text": "Try as I might, I cannot seem to see what others see in this band. The music is complex, at times even slightly discordant, with some very interesting keyboards and some wild sax and fine flute from David Jackson. Indeed, Hugh Banton emerges with enormous credit as a quite superb organ player; his introduction to Sleepwalkers is a quite brilliant little motif. Guy Evans is a metronomic drummer, providing the rhythm section single-handed, since there is frequently no bass and only Banton's bass organ pedals to back him up. The rot really sets in when Peter Hamill sings; I find his voice and vocal style intensely irritating. He has a habit of hitting a note flat and slowly sliding up to the correct pitch which sets my nerves on edge after a while and his aggressive and overdramatic means of delivery ruin what could have been fairly enjoyable. The four long pieces are all intricate, jazz influenced and certainly not typical of symphonic prog. Undercover Man is the pick with Sleepwalkers close behind, but if only they had left out the silly cha cha section.VDGG are undoubtedly an innovative and important band but their music is hopelessly flawed. Had this been instrumental, I would have given it 3* because the music is pleasnt enough, but the vocals drop it to 2*. Not recommended."
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Sunday, June 4, 2006",
      "rating": 4,
      "text": "One of the most challenging, inventive and cerebral bands ever walk on this planet. One of my all time favourits from prog music. This 4 gentlemans never stop to amazed me every time i listen to theyr records.Over the years they develop an unique style of composing and playing, that's made them to be unmatch in prog history. Weird or not you can still find the influences in some bands from today. About the album, i find it very true, inventive and damn good. The highlight for me is Arrow, but the rest are beyond average listner. This band is a must for every true listner in prog music. 4,5 stars, superb as allways."
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Thursday, August 3, 2006",
      "rating": 4,
      "text": "Van Der Graaf Generator's album in between the masterpieces Pawn Hearts and Still Life is somewhat disappointing when you compare it to the other two. It's not a bad release by any means, but it just feels like there isn't as much going on in past efforts and that the inspiration on this album was a lot less than other albums by this group. As always, the musicianship and the group is tight and cohesive, and the well structured pieces are performed with vigor and intensity (which is usually what goes into a Van Der Graaf Generator album), but there are little things that hurt the overall score of this album. Throughout the four songs presented on this album, the listener is taken through arguably the most agressive Van der Graaf Generator experience available, and for the most part I like it, but the album does have its faults.The Undercover Man opens the album with some quiet vocals from Hammill, almost too quiet. It soon picks up and a nice organ based theme comes in. I must mention this now before I say anything, it may be just my copy (which is an original issue of the album before it was remastered), but the audio on this album is a bit subpar, everything sounds a bit muddy and the quality isn't spectacular. But that's only a minor inconvenience. Hammill's dramatic vocals range from his uneasy falsettos to his jagged lower register vocals. Around the middle of the piece, Jackson comes in with a great saxophone/flute interlude that really helps the overall atmosphere of the piece. Scorched Earth follows, and the mood and atmosphere of the piece is much like the title, scorched and jaggedy. Some interesting lyrics and vocals from Hammill are augmented by an interesting organ/sax motif that has some nice drumming on the part of Guy Evans. There's also an underlying lead guitar rhythm, but it is lost in the muddy mix. There seems to be a lot meandering riffs that add some dynamics to the music, but I must say I'm not too fond of the vocals for the better part of this song (they sound distorted and multi-tracked, but they start at different times giving the illusion of an echo that doesn't really echo).Arrow has a bit of a jam feel to it with a solid rhythmic foundation and some saxes that have an improvisational feel (and they sound like they are going through a wah pedal). A spacey section before the vocals (that in my opinion doesn't really do anything except help fill a time void), and the song doesn't really pick up pace until around third minute, almost a third into the song. Hammill's vocals and lyrics are at their most biting and aggressive (but they sound too compressed and the organ is more dominant than the vocals themselves). It's not a bad piece, but it could have been shorter as that opening jam didn't really help the song. The ending, though, is great, with distorted and modulated organs with a raunchy sax solo on top creating a wall of sound that entangles the listener. The Sleepwalkers has some nice drumming from Guy Evans, who makes good use of the cow bell on this track. The organ arpeggios are also quite nice and fit well with the underlying saxophone motif. There's a nice middle section that offers a different atmosphere with a nice sax line until it breaks into more discombobulated and dissonant riffing. Again, there are some some sections that could have been abridged or edited, but in the end I feel it's a good ending to the album.So in the end, Godbluff is a good album marred by two things, subpar audio quality at points (but maybe that's just my copy of the album), and some songs that could have been a little more concise rather than having meandering riffs that do nothing except create longer tracks. It's a good album, but I wouldn't consider it Van der Graaf's best and there are certainly better albums than this from the group (Pawn Hearts and their next album Still Life). If you liked previous efforts from this group, you'll probably like this one as well so fans of previous VdGG albums will like this. And if you're not a fan of the group, I don't think this album will convert you. 4/5."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Saturday, November 18, 2006",
      "rating": 4,
      "text": "So close, yet so far.This is one of my favorite Van der Graaf Generator albums: in parts. Unfortunately, there's a section I just can't stand, and don't see how or why it was written, and I've also found Undercover Man a tad bland at times, a kind of \"boring\" prog if you will that competes with Genesis for utter dullness.The highlights here are Arrow and Scorched Earth, two brilliant and dark tracks which unfold beautifully and are some of the best pieces the band has ever recorded regardless of era. We have wonderful instrumental work and some of Hammill's best vocal work, which I have always loved with the style of music VDGG play. Arrow is especially good, as it is perhaps the darkest tune here and plays well into the strengths of the band.The ending of Sleepwalkers competes with Opeth's A Fair Judgment for the worst outro ever to an otherwise amazing song. To top it off, it's at the end of the record, making the mistake even more befuddling. It is of no surprise that a band like VDGG could make artistic mistakes given the peculiar qualities of their music, it's a style that can either produce something astounding or something very off-putting. Both styles are found in Godbluff. This is an amazing record, no doubt in my mind, but there's just those certain parts that I'd rather just skip over."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Tuesday, January 16, 2007",
      "rating": 5,
      "text": "This was my first VDGG contemporary album. I purchased it at the time of release (1975). Before this one, I got already acquainted with their work (I had their major three albums : \"The Least\", \"H To He\" and \"Pawn Hearts\"). But I bought them all in 1974 (after their release) at the age of fifteen.You can consider that I am a die-hard VDGG fan both generations, but I prefer the band after their first break (which is actually their second one if you consider that they broke already before the release of \"The Aerosol...\"). They will produce more accessible music, and two masterpieces of prog music, IMO.\"The Undercover Man\" is one of my all time VDGG fave (all periods). Light flute in the intro, \"peaceful\" vocals to start. Very melodious. The rest of the band then joins : first Hugh with subtle organ in the background, then Guy with very light percussions. Vocals then turns out to be incredibly sentimental while the band plays crescnedo and reaches full power. What a great track ! A pure beauty. The middle instrumental section is very strong but never enters into this weird trip so typical of VDGG first generation. Its finale is so emotional and beautiful. I remember that I was really charmed by this song when I got the album. An absolute highlight.With \"Scorched Earth\" we enter their more classical repertoire, less melodious, darker, intricated. It is a very well bulit song, with a very tortured Peter and some outrageous sax from Jackson. He is so skilled at his instrument that he (but also Peter) turned me into a fan of their music although I usually do not like sax at all. The finale is just great. Another highlight.\"Arrow\" is a very complex song, wild at times and difficult to enter into. Great drumming from Evans and very strong sax from Dave (this guy is really great). This is the most reminiscent track of their first era. This makes of \"Godbluff\" the missing link between \"Pawn Hearts\" and \"Still Life\".My second best here is \"The Sleepwalkers\" I really like it a lot. The intro is just nice and gentle, but when the vocals start, it turns out to be another scary one. We'll have a cha cha cha break for some relief before an incredible strong sax part and marvelous, melodious Peter. The instrumental break shows the whole band in its full power : Banton, Evans and Jakson accomplishing a great moment of VDGG music. Really powerful and almost sublime (really). These 10'31\" summarizes very well the second era of this wonderful band. Melodious at times, just complex enough during others (it would not be VDG otherwise) ! This track is so intense with the whole band playing at his best than I just felt in love with it.On the remastered CD, there are two bonus songs from Peter solo's repertoire (both from \"The Silent Corner & the Empty Stage\"). The sound quality is rather poor, but hey man, these are documents (they were recorded during a concert at Rimini (Italy) on August 9th, 1975) ! They are welcome since the original album was quite short (at least to VDGG standards).I would of course suggest you to buy the Godbluff DVD produced by the Belgian TV and recorded in Charleroi (not the fanciest place in Belgium for a prog concert). I will tell you more about it in my review for this work though.Five stars for this great come back and a must owned in your prog collection."
    },
    {
      "reviewer": "Andrea Cortese",
      "date": "Posted Tuesday, June 12, 2007",
      "rating": 4,
      "text": "After a three years hiatus (VDGG disbanded in 1972), Van Der Graaf Generator finally reformed and released some of the most important contribution to the world of progressive rock. And in fact, Godbluff is an almost perfect prog record, not very long running time, but with a strong selection of tracks, especially for the side b which is really astonishing! Side a with \"The Undercover Man\" and \"Scorched Earth\" are very good, indeed, but a little bit weaker than those two miliar stones as \"Arrow\" (the most favourite of mine) and \"Sleepwalkers\" with its memorable 17/8 time...and its peculiar and wonderfully unespected cha-cha-cha part.Hammil's voice is now rougher than he used to sing in Pawn Hearts. Just listen to \"Arrow\". Music is also harder but moments of high lyricism still remain of a fundamental importance for the band's musical conception.Very few words really. Only my great appreciation for this unique band.4.50 stars is my rating."
    },
    {
      "reviewer": "Kotro",
      "date": "Posted Wednesday, July 25, 2007",
      "rating": 5,
      "text": "PROGRESSIVE SUMMER RAMBLINGS 3As someone who prides himself in speaking his mind, regardless of the norms, and likes to denounce hypocrisy with a little wit here and there, I obviously feel a certain proximity with people of similar characters. That is why I enjoy watching and reading British motor journalist/funny guy Jeremy Clarkson. Clarkson is, as some know, an overblown, smug character, full of himself, capable of extremely unorthodox behaviour for a man his age. What saves him, making him a much better person than he looks, is the fact that he appears to be extremely self-aware of his character, and the first to ridicule his act, before he does so to others.His rants about the world in general, and of the motor industry in particular, crack me up every time. I enjoy good-humoured people, and boy, you can't get much more good-humoured than Clarkson - on the day the Oxford Brookes University awarded him an honorary engineering doctorate, some environmentalist prick struck a cream pie onto his face. Clarkson's reaction? \"Good shot!\" Now, that is almost as funny as the French aristocrat who, after tripping on his way to the guillotine, turned to his executioner and commented \"They say tripping is a sign of bad luck\".Obviously, I find Jeremy most at home in the showTop Gear, with colleagues James \"Captain Slow\" May and Richard \"Hamster\" Hammond (a proggy name!). Trailer destruction, rubber burning, environmentalist bashing. What else could a man want in a TV show? Playing conkers with trailers? Brilliant! Getting into fights over choice of car? Hilarious! And what breathtaking experiences must the races around Europe be! Sure they contribute to wreck the environment, but then again, who doesn't? (Let he - or she - who has not passed wind cast the first stone.)Still, there was one series ofTop GearI eagerly followed, in anticipation ofThe Stig'sPower Laps. Not so much for the power laps or the machines being tested, but for the soundtrack, nothing more nothing less than full blown progressive rock. We had Camel, Yes, Genesis, ELP, Pink Floyd, you name it. Clarkson is, as some know, a bit of a proghead. No doubt, most of these tracks were introduced into the segment by his finger, but it was also on one of thePower Lapsthat Jeremy lost a few points in my consideration, when he confessed he had little or no love. for Van Der Graaf Generator.Such revelation strikes me, in a way, as odd. For VDGG too are overblown, unorthodox, in fact most of the things that made Prog so despicable a genre to many. Yet they too are fully aware of their own faults and can make the pomposity ridicule - despite all the drama and apparent seriousness, Van Der Graaf Generator, to me, is essentially FUN band to listen to - and the purported \"dark\" and \"mystical\"Godbluffis probably their most histrionic work.Composed of four tracks all between 7 to 11 minutes long,Godbluffis a victory of eccentricity. Starting with a mellow tone, both in the piano and flute driven music, but also in voice,The Undercover Manit bursts halfway into the keyboard and sax passages that so characterize VDGG, while Peter does his part by adding some more mojo to his own special voice. Is segues quite discretely intoScorched Earth, a songs that adds a dark funkier edge to the album, with the omnipresent Jackson saxophone, the Banton organ and the quintessential vocal changes, just to finish in blissful cacophony, where we can even hear an electric guitar! (Peter's new toy at the time, if I recall).Arrowmight just be the more \"serious\" (if we can call that to any song in this album), a feeling much granted by the theatricality of Peter's amazing pipes. Musically it has ups-and-downs. The ending is especially disappointing, but then again, who cares about that once you begin hearing the fantastic pseudo-baroque opening ofSleepwalkers? This track, the longest and best on the album, is the epitome of fun. It is more than that. It is the epitome of Van Der Graaf Generator theirselves. Baroque followed by Cha Cha Cha followed by space followed by funk followed by metal? That's all of Prog in one song. Genius. Peter sings, shouts, cries, mumbles, hits just every possible register of his voice in this one. What a rush!Sleepwalkersalone is worth the purchase, but then again the remaining material is also extremely strong. If you're new to VDGG, this is the album to get. Bloody masterpiece, this is."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Monday, September 17, 2007",
      "rating": 5,
      "text": "The band broke up in 1971 after the \"Pawn Hearts\" tour because of simply too much pressure from their record company who also happened to be their managment (bad situation). Oh they still got along and they all played with Hammill on his 3 solo records he would release afterwards.That was really what got them back together, they knew it would work with different managment because they were putting out great music with Peter.\"The Undercover Man\" opens so quietly with flute and soft vocals. Organ and drums come in as the sound builds until it's full. The vocals, organ, flute and drums create such a beautiful sound together. Sax arrives 5 minutes in. \"Scorched Earth\" quickly builds as machine-like drumming jumps in and out of the soundscape. Hammill spits out the lyrics while the organ play is incredibly good. Check out the melody after 4 minutes and again 7 minutes in, simply amazing !\"Arrow\" opens with drums followed by some sax melodies. It calms right down after 3 minutes.Theatrical vocals from Hammill. Actually Peter's vocals are quite rough but the soundscape is so smooth.This song can be so chaotic and yet so tranquil. \"The Sleepwalkers\" is my favourite track on this record. It's like the organ melodies are dancing at the beginning of this song. Check out the funny instrumental section after 3 minutes. The sax and organ absolutely shine. Theatrical vocals are back 7 minutes in.4.5 stars and one of VDGG's best."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Monday, December 24, 2007",
      "rating": 5,
      "text": "The Generator is certainly an acquired taste, but perhaps the acquisition period is shorted for this album than others. The main reason is that the boys seem to have a need to rock on Godbluff, and every song (save perhaps Sleepwalkers) has a definite direction. The result is one of those all-too-infrequent moments when you know a band is taking you exactly where they want to go, and you submit completely, knowing that you'll be rewarded (even if the entire journey is not sunny and pleasant).The Undercover Man, Scorched Earth. Two separate songs, but one incredible epic when combined. It all starts ever-so-lightly, with Hammill whispering over echoed flute. Then things build until we reach the stately yet restrained meat of the song. Here Hamill's talent in penning a memorable phrase and delivering it with his unique cadence becomes delightfully obvious. His vocabulary is also quite impressive--How many other composers use words such as littany and fervent (just to name a few) that perfectly fit the context (and don't sound as if the lyricist simply opened up a thesaurus instead)? After the dignified opener, things really pick up steam with Scorched Earth. It begins with a menacing feel and ends with an absolutely rocking uptempo crescendo. The texture to the music, with Bantam's distorted bass pedals, Jackson's super-heavy sax, and Evan's feverishly fast drums is unique to this album (at least for me) and worth the price of admission alone.Arrow, Sleepwalkers. The second side drops in quality a bit, but not significantly. Arrow starts with some strange fusion improv, but when it settles down into the desolate and yearning theme, things officially gets going. Hammill's voice takes on an even assault-rifle quality, and he really pushes things past his range (some may love it, some may cringe with horror). Regardless, Arrow features a great melody as well as more great textured sound, and it's difficult not to enjoy. Sleepwalkers is definitely the oddball of the album, with some strange (and less-than-effective) plays off of familiar melodies, but the Generator put enough energy into the performance to make it all work in their own unique (and slightly twisted) way. The highlight for me is definitely the rocking middle section: they set up a killer groove, and when they segue into a new melody, Jackson comes in with an absolutely perfect sax line. Let there be no doubt--these guys can rock. I only wish they did more of this stuff.A unique and intense listening experience from beginning to conclusion, Godbluff is BY FAR my favorite Generator album. Some of the major flaws of their other albums, such as not being cohesive or wasting lots of time in mostly directionless, amusical rambling, is largely not to be found on Godbluff. A haunting, at times disconcerting, masterpiece of progressive rock."
    },
    {
      "reviewer": "LiquidEternity",
      "date": "Posted Thursday, April 24, 2008",
      "rating": 5,
      "text": "My favorite Van der Graaf Generator release by a long shot. Let's take a look, shall we? I don't know much of the history of the band or any of that whatnot, but I know what the music sounds like to me.Undercover Man is a deceptively quiet sounding song. I instantly started thinking to myself that this was the album's ballad or something, when it really isn't. It picks up substantially throughout, and motors along quite nicely. Hammill's voice does some inhumanly powerful things during the course of this nice track, the shortest on the album. And what's more, it's a perfect set up for the next song.Scorched Earth sits at the top of my list, for certain in my top ten, of favorite songs at the moment. There is so much depth to this track that I get chills every time I hear it. The lyrics really sound spectacular to me, very poetic. Hammill's voice, especially when almost overlaid with his own, adds such an aggressive factor to this piece. What's better, the drumming near the end always gets my blood pounding. And adrenaline surges on account of a piece with this thick of ambiance and mood is a very, very rare thing. Definitely a song worth listening to half a dozen times.Arrow starts out sounding like some sort of improvised jam piece, fading in from the silence gaping after Scorched Earth. The vocals are way, way more aggressive than any other place I've listened to with Hammill behind them. This track seems to carry a large amount of anger and frustration, but it really just flows out with the music. Great bass work on this one, too.The Sleepwalkers closes the album, and this was the one I had listened to before I actually bought the CD. Like Scorched Earth, an absolutely stunning ambiance. The vocals continue their trend of being ridiculously amazing. A great way to close an album, though perhaps it seems a bit weaker to me than the other songs here, but that might be because I'd heard it many times before I listened to it in context.This is one the most eye-opening, original, and unique albums I have ever bought or listened to. Just stunning, at risk of sounding redundant."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Sunday, May 18, 2008",
      "rating": 4,
      "text": "Review 34, Godbluff, Van Der Graaf Generator, 1975StarStarStarStarStarA few things to note about Godbluff:1. It's a comeback album, and it's as good, if not possibly better than most of the material released before the band's break-up. A renewed sense of purpose, particularly in Banton's bass pedals and Hammill's rather unique, if rhythm-based, guitar ensures that the new VDGG are just as vital, experimental and interesting as the old, and they certainly haven't become stagnant by '75... even up to '77/78 they were releasing, with a couple of line-up changes, solid material. 2. It rocks as hard as any guitar band I know. Absolute fact. 3. For a VDGG album, it's pretty accessible. aheh. 4. It was my introduction to my favourite band ever. I can't be expected to be impartial, but I still think, if you want an introduction to one of the most idiosyncratic, dark and forceful progressive rock bands, this is a bloody fantastic buy.The Undercover Man begins with something you didn't hear on Pawn Hearts... restraint. The energy-sapping, nervous bursts of flute lead, supplemented by minimalistic drums and organ, onto Hammill's low-key, careful and precisely arranged vocal, echoing out a set of haunting, insistent lyrics, with a very unusual arrangement/rhyme structure. With the vocal, Hammill, as ever, manages to pull off some very interesting emphasis, placing contrast and urgency and angst wherever it suits. At the line 'and hope that it all works out right/tonight' the instrumentation fills out with an Evans fill and a careful flourish from Banton, and from that extraordinary opening, the piece develops rapidly, but never carelessly, with some very pretty flutework from Jaxon, glittering organ parts and lush bass and piano choices. Hammill's rather excellent clean voice gets a full opportunity to shine in this part of the song. A menacing clavinet (I think) riff leads into a full bit of careful instrumental jamming, with some incredibly guitaresque licks from Jaxon and the ever-subtle Banton's talents brimming in the background. Carnivalian organ and sax, together with the world's weirdest harmony vocals, bring the song onto its intentionally dramatic climax, complete with a grandiose and bizarrely moving rhythm section. It's almost a parody in some ways, but even the parody is moving. A lush sax solo from Jaxon and more precise organ-work rounds the piece off to its incredible conclusion. Magnificent.Scorched Earth segues straight on from this with a formidable rock edge, blaring sax-and-clavinet (or possibly guitar... with Hammill, you can't always tell), rolling, destroying, martial drumming from Evans, who manages to remain stunningly non-static in this piece. He somehow manages to avoid often repeating much of his drumming part or keeping any really conventional style of a beat, but rather taking quirky drum lines and unfulfilled beats all over the place, particularly in the more 'rock' sections. As always, the sax and organ is phenomenally tasteful and extremely powerful, with Jaxon taking the occasional solo and Banton's not-quite-classical stylings blaring away in the background. Hammill, as ever, is fantastic. He does menace, he does not-sounding-like-anyone-else, he does a sort of vicious, distorted, growling cleanness (contradiction, but there you have it), he does whimsical sound effects, and all without ever cutting off interest. Banton pulls off the most thick and vicious riff he's come up with since White Hammer, and the band goes onto some very bizarre crescendoes. The lyrics are again, unusual, but effective in their own violent way. An absolute standout performance from Hammill and Evans in particular. The least gripping piece on the album, but still excellent. The really quite interesting calmed-down-then-brought-back-to-the-boil conclusion, complete with a bit of rather nifty, though not showy, guitar.Arrow was the song that grabbed me first time round. A squeaky, swirling jam opens it, with a wandering Banton bass part, some very sharp tinny drumming from Evans and a whirling guitar, drops into a phenomenal rolling, grinding whorl of textures, which then drops off to a desolate strummed guitar and splintering percussion. Menacing, howling sax and the repeated stress of bass-and-drum crescendoes build the atmospheric, Victorian tension up to the entrance of Hammill's ferocious vocal. Extensive vocal-sax-keyboard-melodies slowly create a ferocious, biting, teeth-grinding force as Hammill's vocals and lyrics grow increasingly dark and terrifying up 'til the feral release of his final, desperate and possessive scream. Simply incredible from an atmospheric point of view, and from a musical one, the Jaxon sax soloing has to be heard. Particularly striking lyrics here.Sleepwalkers is plausibly the most representative track on the album, and maybe the most accessible, although the atmosphere of Arrow outdoes the considerable musicality of the grand finale (Sleepwalkers) for me. Available as a sample here, I think, at the time of writing (listen to it a few times, I suggest... not many people get VDGG right away... I certainly didn't). Possibly the organ performance of rock in general, with some amazingly classical touches, an atmospheric swirling that only Banton in the British prog scene really achieves and a fluid but very, very sharply defined tone which Emerson and Wakeman should envy. His soloing over a sax riff is clear, defined and heavily rocking. Dramatic, and again excellent, vocals from Hammill fill out the music, with a matching set of wordy and yet extremely sharp lyrics. Evans takes on more idiosyncratic drumming, at times simply not adding a continued beat, at others, adding a throbbing pulse to the piece or a classical pomp to Hammill's feverish declarations ('make reason of the sensory whorl/if I only had time'). Great performances by all involved here, and a real masterpiece, including a bit of hilarious 'cha-cha-cha' rhythm which leads into a very dark version of the same. Jaxon contributes some rather unique sax, including a triumphant, liberating blare that could well be the band's most memorable moment. The band also manages to fit a 'jam' into the middle of the song effortlessly, not separating it at all from the content... basically, this is THE organ song, in my opinion, and a fantastic closer.Revisited:Original rubbish review replaced by the above slightly better one. One of my most listened to albums. Not one you should expect to appreciate fully on the first listen. I didn't. No idea where it falls in running order of the VDGG classics... below H To He, Who Am The Only One and above The Quiet Zone/The Pleasure Dome. A nod to the bonus tracks: both band performances of tracks from Hammill's solo album 'The Silent Corner And The Empty Stage' (worth picking up, by the way), and both exceptional songs. The sound quality is very raw, but the performances are full of verve and effect... an interesting inclusion. Depending on how you balance verve and sound quality, you will or won't like them. Anyway, great introduction to the band, great album, and a pretty much certain five stars from me.Rating: Five Stars, 14/15 Favourite Track: I'd select Arrow or Sleepwalkers if pressed, but I love them all."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Wednesday, May 21, 2008",
      "rating": 5,
      "text": "The fifth album from Van der Graaf Generator called Godbluff swept my feet away. I have been listening to and reviewing the first four album from Van der Graaf Generator during the last half year and except for Pawn Hearts I wasn�t that impressed. I gave the first three albums 3 stars and Pawn Hearts 4 stars, but after listening to Godbluff I�m sure there must be something I have missed during my listening sessions of those first four albums because Godbluff is a sure masterpiece in my book. It�s very seldom that I after the first time of listening to an album knows that I�m gonna give that album 5 stars but it happened with Godbluff. I�ve been listening with disbelief since that first listening session as this album just gets better and better. As a consequence of this awakening I will go back and listen to those first four albums again and make new reviews if neccessary.The first four albums were all released in the early seventies and after the tour for Pawn Hearts the band was fed up with each other and the record industry. As Peter Hammill says in the booklet to Godbluff: There were made lots of money but the band didn�t see any of them. Does that sound familiar ? Many bands in the sixties and seventies were cheated and never really made money of their hard work which is such a shame, but I guess you have to be an asshole to be a financial manager. The relationship between the members of the band were really bad on the tour for Pawn Hearts and the band members ended up driving in different cars between shows, which says it all. After the tour Peter Hammill told the other members of the band that he would quit and pursue a fulltime solo career. Peter Hammill made a lot of solo albums in the following years but still kept in contact with the other members of Van der Graaf Generator and they also on occasion joined Peter Hammill on stage. So the inevitable happened in 1975: Van der Graaf Generator was reunited and they started writing new material and touring to see how the audience would react to the new songs. After they had played the songs live for a while they went into the studio and recorded what was to become Godbluff ( and actually also some of the songs on Still Life).The direction of the music has changed a bit since the first era of Van der Graaf Generator�s career. They have always been a very heavy and dark band but with Godbluff you can include anger and despair. This is so far the darkest album I have heard from the seventies. It makes Red by King Crimson sound light in comparison. To a metal head like myself I can hear lots of the ideas from Godbluff in heavy metal and especially Peter Hammill�s theatrical paatos must have inspired a young Rob Halford ( Judas Priest). Godbluff is not heavy metal by any means though, so don�t let the above mentioned comparisons scare you away. This is seventies prog rock, but with a dark and angry twist.The album consists of four songs which lasts from 7 - 10 minutes. The Undercover Man starts the album and it�s probably the song from Godbluff that reminds me the most of the first era Van der Graaf Generator. It�s a really beautiful song which starts subtle and ends in a climax. Scorched Earth is where the aggressive playing and singing starts. This song is so dark and aggresssive that I am just blown back in my seat and the same can be said about Arrow. Peter Hammill uses his voice to the limit on those two songs. The Sleepwalkers ends the album and it�s a bit different and melodic when you compare it to the last two songs. Beautiful is all I can say.The musicianship is beyond outstanding on Godbluff. The performance these four musicians put on is inspired beyond my wildest expectations. They all shine equally. Peter Hammill with his theatrical approach to singing, Hugh Banton�s omnipresent organ, piano and bass pedal playing, Guy Evan�s diverse drumming and last but not least David Jackson�s sax and flute playing which serves as lead and solo instruments most of the time. I promise you that you will enjoy the interplay between these musicians even if you don�t like the music ( shame on you).The sound quality is definitely worth a mention too as it is one of the best seventies productions I have heard.I can�t get my arms down. I�m so happy that I gave Godbluff a chance as it has changed my view on Van der Graaf Generator. Now I understand the praises they get on Prog Archives. This is a sure 5 star album and so far one of the best albums I have heard from the seventies. This is essential stuff don�t let this pass you by."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Friday, June 20, 2008",
      "rating": 3,
      "text": "A four-year hiatus removed VAN DER GRAAF GENERATOR from of the front ranks of progressive rock, but this album returned them to prog rockers' consciousness, many relieved the band had reformed and had managed to stitch something credible together. In my view this is a solid rather than a remarkable album: gone is the over-the-top extravagance that endeared 'Pawn Hearts' to so many adventurous listeners. In its place is a tightly focussed band, far more competent musically, but at the cost of their point of difference, their crazy soul. Exactly the same tendency is exhibited in the lyrics, where the abundance of metaphor (sharks, lighthouse keepers, killers, lemmings) is abandoned in favour of standard prose.For both these reasons I find this period of VDGG's output, while extremely accomplished, far less satisfying. 'The Undercover Man' underwhelms, there is nothing scorching about 'The Scorched Earth', and 'Arrow' misses its mark, despite an excellent opening freeform section and some creative singing. Only during 'The Sleepwalkers' does the album awake, if only briefly. Much of the music here is subtle, particularly on the first side. VDGG doing subtlety? Fine - but I miss the raw intensity. Four excellent tracks adorn 'Godbluff', but I have never been able to shake the feeling of disappointment when listening to this album. And certainly it did not drag progressive rock in new and darker directions, as can be said for VDGG's early career.These four gemstones are polished, but they are only semi-precious. Worth listening to, but not a patch on 'Pawn Hearts', which is all diamond, though some of it is rough."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Tuesday, July 22, 2008",
      "rating": 5,
      "text": "Progressive rock seems to have peaked in the mid 70s for 1975 boasted some of the most endearing prog classics and Godbluff is one of them. Van der Graaf Generator, the pioneers of prog at its most dark and off kilter, made a massive comeback with this release and it is surprisingly as good, if not better than their classic early releases. The first thing one notices is the almost maddening patience the band has as it introduces each of the 4 tracks. But there are always moments of brilliance with each track the pace ranges from slow to breakneck, and the time signatures change throughout, not only with the instruments but with Hammill's incredible vocal delivery.'Undercover Man' is an instant classic and celebrated as a concert favourite. It begins with a minimalist approach of a single flute over almost whispered vocals. But it is not long until the saxophone and Hammond kicks in, interwoven with strange percussion patterns. At times the song seems standard but then moves into jazz fusion blended with staccato riffs and killer bass impulses.'Scorched Earth' is another of the great VDGG tracks. The percussion is notably off kilter as are Hammill's vocals: \"Just one crazy moment while the dice are card, he looks into the future and remembers what is past...\" The conviction in Hammill's tone is as definitive as ever, and he has not lost momentum as one of the leading prog vocalist legends. There is a great instrumental break with saxophones shining with weird time signatures where a beat is missing then replaced and then removed again. Then it all moves back to the original tune. Simply fantastic.'Arrow' is another reason why these progenitors of complex rock are infamous and highly revered as pioneers and visionaries. Hammill's vocals are more tortured and raspy on this track and are a surprising contrast to the smoothness on previous tracks. The track begins with a percussion and saxophone improvisation that reminds one of the early King Crimson years. The track relies highly on saxophone and Hammond but the understatement of the bass is admirable and knits it all together perfectly.'Sleepwalkers' is the sleeper on the album (no pun intended) and is not so much about somnambulism but about zombies, almost a precursor to the 'Thriller' film clip of Michael Jackson, or George Romero's \"Dawn of the Dead\". It is an energetic track that even features a bizarre Zombie Calypso, or a tango of sorts, certainly an ear opener and all the more chilling for it's content. We even hear zombie screams, and there are high pitched atmospheric keyboards throughout. An amazing track designed to awaken the dead. The lyrics include a jaded sense of humour as Hammill muses on \"the dancing dead\", but interjected within there are dark undertones as we are asked to, \"make reason of the sensory world, if I only had time, but soon the dream is ended.\" the instrumental break is hypnotic and jazz influenced, and it increases in momentum exploding into the chaotic climax. One of the highlights of the album.Overall the 4 Godbluff tracks are classic VDGG and a must for anyone interested in early dark prog and jazz inspired psycho spiritual music. It is as weird as it sounds and it is as brilliant as I have said. Wonderful headphone music and an essential purchase without doubt."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Wednesday, August 6, 2008",
      "rating": 5,
      "text": "Scorched earth. That's all that's left.Van Der Graaf Generator [VdGG] have always been one of the lesser known (to the outside world anyways) progressive mammoths of the classic 70s era. Their blend of darkness and chaos have long inspired young and upcoming proggers as well as forced listeners to take cover and/or run for their lives as the black clouds gather overhead when a VdGG album starts. This album came as a surprise to many since the band had broken up after their previous album,Pawn Heartswhich was deemed a masterpiece. This one, surprisingly, surpasses the previous album by miles! Even if it don't have a leviathan track to support it likeA Plague Of Lighthouse Keepersit does have four powerful monstrosities that will beat you up and leave you as a bloody pulp if you're not expecting it. But Peter Hammil and VdGG would have it no other way.For those who are not familiar with the band - these guys are very unique. to say the least. Instead of a guitar as the lead instrument they use their masterfully played organs and the killer saxophone of David Jackson to lead the fray. This makes for a very interesting listen if you're not used to anything but a guitar being at the front, but if you're up for something different this is probably the way to go. Also, as mentioned before, these guys are evil. Peter Hammil's malevolent voice is one of the main features of the band as he screams, shouts and serenades his way through the tracks. He's really got a way with instrumentation and conducts the band accordingly. When he wants you to be scared, you'll be scared.I'm sure there's been so much said about the four tracks on the album that I really couldn't add anything that would be unique, but here's a shot. The first side has the two shorter tracks, the somewhat calmUndercover Manand the cataclysmicScorched Earthwhich work in tandem with one another to create one coherent, solid side of vinyl. They play as yin and yang as the opener creates a false sense of security and the second punches you in the face with Hammil's screaming chorus. It's very true when Hammil screams, ''Scorched earth - that's all that's left when he's done!'' The second side is arguably the more powerful of the two, being that it hosts what could be called the two best songs in the VdGG catalog.Arrowis a maniacal powerhouse led once again by Hammil, driving the song as the song would once again suggest, ''As swift as any ARROW!'' As the song picks up after that line it's hard not to feel a chill down your spine. Sax and Organ mix into a fine paste and it almost sounds like a very powerful and distorted guitar for a moment, well, that's the effect anyways.Sleepwalkerscodas the album with VdGG's finest 10 minutes between the grooves. Chilling keys open the track as Hammil comes in once more, and as you can expect - things don't stay calm for long. This track is a furious maelstrom, which will never, ever die off. Fantastic! This is what Prog is all about.Being considered one of THE essential prog albums of all time in just about every progressive circle it seems redundant to say that this one is really, really highly recommended. 5 scorched Earths out of 5 - an amazing, simply amazing album. May this review go on the already very large pile of reviews praising this album as though it were some kind of God - It deserves every word of praise it gets."
    },
    {
      "reviewer": "progrules",
      "date": "Posted Thursday, January 1, 2009",
      "rating": 3,
      "text": "My second review of a VDGG album. First was Still life and I managed with all that's in me to give it three stars as I will never be a fan of this band (to say the least). Anyway, I will have to do everything in my power once again to find as many positive elements possible.Well, I'm not going to complain about Hammill's voice, I think that's a cheap shot. He obviously has a hate or like voice. Personally I'm not really fond of it but I have heard so many weird voices in prog through the years, I don't think his is so much worse. I will try to ignore it as much as possible and go more for compositions and instrumental aspects. What I always like about VDGG is David Jackson's contribution, what he is doing on most of the albums make listening to them bearable for me and on Scorched Earth I also like Banton's organ playing. I think the second half of the song is really great, I think all things considered this is my favourite song of the album. The opener, The Undercover Man, is quite good but less impressive.Arrow also has very nice \"wind moments\" but the song is less structured than Scorched Earth in my perception. Still second favourite to me of the original 4 songs.The Sleepwalkers is one of the many streamsongs of this band on PA and I listened to them often but never managed to get into the music. Sleepwalkers is not a good song imo. It lacks the fine instrumental contribution of the two previous tracks though second half of the song is much better than the sloppy, unimpressive first half. Forsaken Gardens is the first of the bonus tracks and I can't say this gives the album a boost really but that goes even a lot more for the terrible A Louse is not a Home, a song I already got to know by Peter Hammill solo and is one of the worst songs I ever heard in my life and is also partly responsible for my dislike for VDGG. It will probably the originality that determines the value of a song like this but it's wasted on me as for me personally melody is the main factor in music. Fortunately the band is better than Hammill solo and also this Godbluff release is not as terrible as I feared.I think it's even somewhat better than Still Life if we leave the bonus tracks aside. Still Life was three stars rounded up from 2,7 and Godbluff is a full three for me."
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Thursday, January 22, 2009",
      "rating": 3,
      "text": "I am a bit surprised that this album is so highly rated here on Prog Archives. It is not a bad album. The vocals are an acquired taste, but I think they are alright. You can certainly tell that Fish of Marillion had been listening to this band. The playing is not sloppy, but hardly impressive either. The music is very vocal driven. There are a few instrumental breaks, but the vocals are up front almost all the time. This can easily be seen in the lyrics sheet - very long lyrics. Unusual ones too.I can enjoy this from time to time, and I have given it many chances and it has grown on me. But I don't think it will grow any more than this. It is alright but it is certainly not a masterpiece."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Tuesday, May 12, 2009",
      "rating": 4,
      "text": "As a VDGG neophyte, I went into this recording knowing that, as a piece of classic prog, it was likely to be met with ambivalence over its musical merit/historical significance and a dated sound which comes across comparatively underwhelming when compared to contemporary stuff. WithGodbluff, each comes across strongly-- but the energy, uniqueness, and campy production make this one a true winner in the sometimes chances I sometimes take in mediocre '70's bands.For those thinking of investigating VDGG, be prepared for a tremendous amount of enjoyment mixed with one big, gigantic, noisy, mess of a singer. Peter Hammil seems to be equally hated and loved, and I think that ultimately one's enjoyment of this album will come down to the listener's opinion of his singing. Think of him as an even more out of control version of Fish; he belts out bizarre lyrics with an almost vaudevillian exuberance, which will make many cringe or roll their eyes. I, however, think it is the most delightfully goofy example of early prog campiness, so serious in its intensity that it becomes more of a joke than anything else. Just listen to \"Arrow\" and you'll see what I mean.As for the band-- top notch. Predominantly organ-led melodies and textures dominate, often shared with cool woodwind work by David Jackson. His is the one of the finest sounding saxes in the genre, and does a lot to make this album's sound unique. Guitars are present occasionally, but otherwise the listener should be prepared for synth/sax interplay. The group's songwriting is highly energetic and varied-- pretty much par for the course in terms of expectations for the genre, but is played distinctly.For those exploring classic prog, VDGG andGodbluffis a fine addition to one's library. Its technical and vocal shortcomings are made up by strong, complex playing and unique style, which makes it stand out strongly against the other big boys of the time.Songwriting: 4 Instrumental Performances: 3 Lyrics/Vocals: 4 Style/Emotion/Replay: 4"
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Friday, May 29, 2009",
      "rating": 4,
      "text": "Godbluff is another achievement for this unconventional quartet. While there is nothing particularly complex about much of the music, and with few instrumental segments, this beloved album from Van der Graaf Generator is largely a Peter Hammill affair, laden with lyrics as it is. While a relatively short record, there's plenty of creativity, and I think this album my be their strongest work musically. It's just that Hammill can be a real pest.\"The Undercover Man\" Scarcely audible pipes and Hammill's low, dark voice begin this first and shortest piece. The instrumental segment is one of the best moments on the album, with an excellent yet easy to follow riff and David Jackson's skillful saxophone playing. As usual, the hardest part to follow is Hammill's wandering voice, which rises to falsetto rather often. After several listens, though, the unnatural becomes natural, and his meandering vocals become an integral constituent of the work.\"Scorched Earth\" Continuing directly from the previous track with a dirge-like organ, this piece delivers a change of flavor, with a heavier reliance on Hugh Banton's organ, and a heavier feel altogether. Hammill's vocals are as dramatic as ever, with several great examples of his creepy lyrical mastery. Guy Evans' drumming is spectacular during the last few minutes, which is one of the best parts of the song. The noises that conclude the piece are perhaps artistically warranted, but hurt my ears. Overall, the music is dark, and it reminds me very much of the over-the-top segments of \"The Knife\" by Genesis.\"Arrow\" This is more jazz-oriented fare, with Evan's creative drumming, some intriguing bass work from Banton, and strange saxophone business courtesy of Jackson. It quickly becomes a melancholic piece, with mournful wailing and eerie bass playing. Hammill's denigrating voice is as vitriolic as I imagine it can be. The final instrumental moments are very good, if only because Hammill is no longer ruining it with his craziness.\"The Sleepwalkers\" The lengthiest track on the album opens with a highly memorable riff on organ and saxophone. Hammill loosely follows this melody. An unexpected Latin section is a strange inclusion in this spectacular piece of music, but it is fortunately short-lived. Banton's organ at almost halfway through is absolutely impressive, almost magical, as is Jackson's forceful saxophone. The last several moments are an artistic layering of hypnotic sounds."
    },
    {
      "reviewer": "The Sleepwalker",
      "date": "Posted Saturday, August 22, 2009",
      "rating": 5,
      "text": "After a four year break, Van Der Graaf Generator reunited to make more music in a way they had never done it before. Godbluff is very different from Pawn Hearts, released in 1971. Where Pawn Hearts has a lot of unexpected actions, Godbluff seems more controlled and a bit more straight forward. This doesn't mean VDGG has lost their unique style, as they are as exceptional as ever.Godbluff opens with \"The Undercover Man\", which is a song that could remind one of the earlier VDGG. \"The Undercover Man\" starts with soft flute playing by David Jackson, and is soon joined by Peter Hammill soft and emotional vocals. After this first section, the song starts to get more bombastic, as organs and drums enter and Peter Hammill delivers some striking and hauntingly powerful vocals. \"The Undercover Man\" is an exceptional song for sure. It is probably the most emotional and astonishing piece on Godbluff.A short interlude lead by Peter Hammill on the clavinet takes us from \"The Undercover Man\" to \"Scorched Earth\". \"Scorched Earth\" is full of power and anger, and is the most bombastic on the album. The song exists out of several very well composed riffs, all equally powerful and stunning, and has some of the best vocals I've heard from Peter Hammill ever. This brilliant piece of music might be a bit more straight forward than most of the other songs on the album, but it's a fantastic piece.The third song on the album is the anger laden \"Arrow\". The song starts with a short jazz improvisation, which is good, but doesn't really fit in with the other songs on the album. As Peter Hammill's vocals come in the song will become a frightening piece of music. Definitely the chorus is haunting, while at the same time being pretty catchy. Apart from Peter's extraordinary vocals, I find the instruments here a bit less interesting. They just can't seem to deliver the power that they do deliver in for example \"Scorched Earth\". In the end \"Arrow\" is a very good song, though not as interesting as the other music on the album.\"The Sleepwalkers\", where the undercover man becomes a lunatic, is the albums epic ending. The song starts with a catchy organ riff, and as Peter's vocals make their entry you'll know this is going to be a powerful song. After the first several minutes, the song goes from the powerful organ riff to absolute lunacy in the form of a cha cha cha part. Many people don't seem to like this part or they think it doesn't fit in with the other music, but I think this really does resemble the insanity of the sleepwalker. The second half of the song is much more bombastic and more straight forward, still excelent, though. \"The Sleepwalkers\" is an incredible song, it's the perfect way to express the insanity of the sleepwalker.Godbluff for sure has some of VDGG's best music on it. I don't think it's perfect, but it surely isn't far from perfect. Godbluff really is essential to the collection of a Van Der Graaf fan or any prog fan. The music isn't as extraordinary and memorable as Pawn Hearts, but it is a fantastic experience indeed."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Thursday, September 3, 2009",
      "rating": 5,
      "text": "After 4 years silence, VDGG came back with a mission and wrought one of the darkest and harshest album in progressive rock history. Needless to add it's almost one of my favourites.Following some of the experiments with punk on his solo albums, Hammill has adapted a gruff and aggressive singing style. Gone are the high and clean register he used 4 years earlier. The man means business now and sings as if life itself depended on it. The band follows in similar fashion, the rhythms are jagged, the organ heavy and stark, the saxophone almost insane.Also the songs have become more desolate, bare and uncompromising. Even when they have a go at a playful dance halfway through Sleepwalkers it still sounds menacing. All four tracks are instant classics and cover a wide and wild range of musical styles and moods. There's so much going on in fact that, even with a length under 36 minutes, the album doesn't feel too short at all. There's not much more darkness you can have in one go.If Pawn Hearts was VDGG's finest hour then Godbluff is certainly their most stirring. 'Fine' is a word that is completely out of place here. This is one of the best examples where progressive rock goes hand in hand with a disciplined performance and remorseless passion."
    },
    {
      "reviewer": "aapatsos",
      "date": "Posted Sunday, September 20, 2009",
      "rating": 5,
      "text": "Perfection in madnessLet me start by saying that, from a VDGG 'newbie's' point of view, GODBLUFF is an accessible album. I personally discovered VDGG from a few samples here in PA. As it usually happens in this cases, you visit a record store and - oh, what a surprise! - a record with the name GODBLUFF appears in front of you. You then remember those interesting samples and decide to give it a go.As most has been said about this record, I will briefly provide my two cents. GODBLUFF consists of four relatively long compositions which flow in slow to medium tempo. The presence of sax, flute and organ give the album this distinct touch that puts VDGG on a genre of its own. The strange, eclectic voice of Peter Hammill (irritating or even prohibitive for some) also adds to the unparalleled character of this album. Although GODBLUFF does not consist of extremely complex compositions and virtuosic solos, it radiates a feeling of maturity, patience and self-awareness.The elements that help rank this album high in my books are the striking melodies (although set in a mad, bizarre fashion), the overall heaviness in the sound and the obscure atmosphere. Saying that, there are moments where the music turns into jazz, fusion or funk which surprisingly changes the odds. The highlights and memorable moments are numerous, starting from the use of the instruments to produce novel melodies to whole tracks of monumental quality. Personally I feel that the main theme ofArrowis the most memorable moment withScorched Earthbeing the least observable, but not lacking in quality whatsoever.In terms of composition in overall,The Undercover ManandSleepwalkersseem to be the most complete. The opening track flows in a relatively relaxed tempo while the closing builds up as it progresses with fantastic saxophone work.To sum up briefly, GODBLUFF is one of those few eclectic progressive albums that can be classified as masterpieces. I could unreservedly recommend it to all prog fans and particularly to friends of heavy and dark prog rock and metal."
    },
    {
      "reviewer": "Marty McFly",
      "date": "Posted Wednesday, November 25, 2009",
      "rating": 5,
      "text": "OK, I'll pass. If somebody wonders why I gave (and will give) about 80% of 5-star ratings today, it's because I'm ruining old stash of my beloved records, desperately trying to seek for something well known (for me).As it's with this album. Funny thing is that for a long time, I though it's \"GOLDbluff\", but I know do know where truth lies. After all, it's easy, this album is masterpiece, that eases it all. Ever-present motif through the entire album is Peter Hammill's singing/non-singing, which is really unique (you know him). Also, first and last track are optimistic ones, second and third are more dark. Not bad, of course not.Undercover Man, its flute and nice melody suggest something beautiful and in some sense of this word, it truly is. But no way it's normal song. Nothing here is normal, as it's (for me at least) archetypal VDGG album. This means that this will be different from everything else. Not as Zeuhl, or RIO prog, it's still quite listenable and by my opinion very (VERY) accessible. There are things, little things through these songs that makes it more interesting (and so, repeated listens are very much suggested, something like necessary).5(+), to be honest, I first hated everything here except first song. But I learned how to understand it. How to feel it, appreciate, embrace it with all my senses (probably even with sixth sense that I didn't know that I have at all), even (mostly)Arrowis using all tricks of Peter's aggressive voice (which can be little bit terrifying for starters).Some albums simply stood the test of time."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Sunday, November 29, 2009",
      "rating": 5,
      "text": "PAWN HEARTS was my very first taste of Van der Graaf Generator; let's just say that album gave me more than my share of hissy fits trying to understand it. Eventually, the lyrics kind of guided me into how the music works. So here on GODBLUFF, I'm met with a similar predicament in a sense that Pete Hammill's lyrics are this dense poetry, lugubrious as ever with a requirement of dictionary just to understand what some of the words mean. I still don't quite get the lyrics.So why the masterpiece rating, you ask? The music.It didn't take as long for the music to sink in here. The one thing that impressed me here was how heavy this album is, almost hard to believe since I can't remember any instance of a guitar anywhere on GODBLUFF (though Hammill is credited with playing it). That really thick, heavy sound that comes to the fore on ''Arrow'' has to come from a keyboard instrument, not the first thing you think of when you hear the term ''heavy music''. That heaviness makes the music much more engaging to my ears.They also kept the compositions shorter here than on PAWN HEARTS, meaning that there isn't a whole lot of room to wander around. They try to wander on ''The Undercover Man'', but it's not for long and the band gets back into focus. All pieces have engaging bits layered with Hammond and saxophone, two instruments that will make any progster sleep better tonight, all under Guy Evans's subtle yet ferocious drum work.Don't let the bland cover lead you to believe it's filled second rate horror movie music; this is the real deal, a great masterwork of prog rock. It got me back on track with Van der Graaf Generator after a year of road construction (metaphorically)."
    },
    {
      "reviewer": "friso",
      "date": "Posted Wednesday, December 2, 2009",
      "rating": 5,
      "text": "Van der Graaf Generator's album prior to this one 'Pawn Hearts' was released in 1971, after which the band continued under the Peter Hammill solo flag. In 1975 the band came back with a new sound; more direct, less majestic, less symphonic and quite raw. On 'Godbluff' the band remained dynamic, emotionally involved and well-versed in extended song-writing techniques; of which the opening track 'The Undercover Man' is perhaps the best example here. On this track the band goes from the quietest opening to an ever growing intensity before arriving in the opening chords of 'Scorched Earth' - which is quick to pick up the pace. With its imaginative lyrics about the chaos of war and heavy chords sequences on the self-build organs of Banton this song is sure to get you on the tip of you seat. The double sax by David Jackson is fierce here and effective in creating both the brave and chaotic war atmospheres. Peter Hammill is as expressive as ever, but without the cloaking of that early seventies reverb sound his voice is way more direct and therefor more disturbing. This becomes even more apparent on the bleak (guitarless) heavy metal song 'Arrow', in which Hammill screams his longs out. Perhaps this song is a bit too psyched out confronting for most listeners and I wouldn't particularly recommend this song as your introduction to this band. The final track 'Sleepwalkers' is perhaps the most regular VdGG song here, with both majestic and fearful themes and quirky instrumental passages. It used to be my favorite, but these days I'm most impressed by the continual growth of intensity of the first side of the LP."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Wednesday, February 17, 2010",
      "rating": 4,
      "text": "After originally being somewhat discouraged by what I heard onPawn HeartsI still decided to giveGodbluffa shot. I'm glad that I did since it became my gateway to this quite spectacular band!It's interesting that Van Der Graaf Generator pretty much missed out on progressive rock's golden year's and still managed to regroup towards the second half of the 70's and record four more albums before splitting up. Just imagining doing all this in less than a decade is mind-boggling and still the result is right in front of us! On top of that Peter Hammill had his steady stream of solo material which has pretty much lasted up to the beginning of the previous decade, but I digress.When the band recorded this album there was so much creative magic in the air that some of it has even made it to the CD I have at home!The Undercover Manstarts things off nicely with the most atmospheric intro the band ever featured on an album. The whole piece leaves me screaming for more and fortunately the wait is not long sinceScorched Earthis almost as enjoyable as it's successor but with somewhat less momentum.The Sleepwalkersfinishes the album on another highlight and although the main melody section is quite repetitive I've always been a sucker for intricate melodic arrangements so I don't mind that it's repeated for almost 9 minutes straight!After all this praise I still hesitate giving this album my highest regards. This reason is based entirely on the fact thatGodbluffhasn't really grown so much over the years and although my first impression was spectacular I was hoping that the album would have opened itself up even more but surprisingly it actually had the opposite effect so far. A great introductory album but you should search elsewhere for the higher dosage of that Van Der Graaf Generator sound!***** star songs: The Undercover Man (7:25) The Sleepwalkers (10:31)**** star songs: Scorched Earth (9:48) Arrow (9:45)"
    },
    {
      "reviewer": "TheGazzardian",
      "date": "Posted Friday, May 28, 2010",
      "rating": 4,
      "text": "I couldn't really imagine what Van Der Graaf Generator could do after Pawn Hearts, an album which has since become one of my top albums of all time. In this sense, I consider us blessed that afterwards, the touring became too intense and the band decided to call it quits. Because this gave them enough space away from the music, enough time to mature without trying to top Pawn Hearts, that when they returned with Godbluff, they were saying something new again. (Not that Van der Graaf seem like a band likely to repeat themselves).So three years after the masterpiece that was Pawn Hearts, we receive this excellent follow up album that features the classic four piece lineup of Hamill, Evans, Banton and Jackson.The sound is both recognisable and changed. The band played the songs live and developed them, instead of using studio trickery to develop their sound. As a result, the music has a decidedly rawer edge. Fans of Pawn Hearts' dissonance, such as the studio effect of having 23 different VDGG recordings playing at once, will find that such effects are not used here - the rest can all take a sigh of relief. (That doesn't include me because I found that the dissonance in Pawn Hearts was part of what made it so magical).Despite the years between the last recording and this one, the band sounds at least as tight as they ever did. The 35 minutes on this album don't have a single dull moment. The album is full of sharp edges and aggression.While the album was selected from a series of tracks that were recorded together, including some that would later end up on Still Life, it feels like they all have a cohesive theme. References to war exist on the majority of the track, although The Undercover Man seems to hint at the feelings of isolation and insanity that made the previous two albums so intriguing.Highlights: Scorched Earth describes the sound of the track as much as it does the lyrical content, with dark lyrics that continue to hint at the aforementioned themes. (In many ways, it's not too thematically different from Emperor off of H to He). In Arrow, Peter's vocals reach a new level of intensity. Long gone are the sweet, high pitched sounds he made on Pawn Hearts, here we basically have screaming vocals, with an intensity that matches the song's content quite remarkably. The Sleepwalkers is probably the catchiest part of this album, and at least as enjoyable as anything else.There are really no downsides to this record, and it has earned its reputation as one of the best Van Der Graaf albums. It shows the band taking their music in a new direction, which they would continue for the next two albums. The only thing holding it back from reaching 5 star status is that, despite it's very sturdy foundation, the album doesn't quite reach the same heights as the best moments on H to He, Pawn Hearts, or Still Life."
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Tuesday, November 9, 2010",
      "rating": 4,
      "text": "A 'comeback' album for VDGG. Before Godbluff, there wasn't a clear seperation between VDGG albums and Peter Hammill's solo albums. Some of VDGG's earliest albums were originally intended to be Hammill solos; his early solo albums feature members of VDGG on them. Starting in 1975, with Godbluff and Nadir's Big Chance, there was a clear seperation of what was a \"Peter Hammill' record and what was a 'Van Der Graaf Generator' record.This album starts with the weakest song and ends with the strongest. Here you have the usual organ/drums/sax but there is also some clavinet and flute. The bass parts are played by keyboardist Hugh Banton. \"Undercover Man\" begins with some flute. This is the most accesible track on Godbluff. Later on there is sax and clavinet. \"Scorched Earth\" is the closest to sounding like Pawn Hearts. This is the only song not written by Hammill alone. The whole album has great lyrics but this song has one of the best lines: \"nowhere to turn, unless it's to stone\". Hammill's clavinet playing sounds like a guitar on \"Scorched Earth\". Before 3 minutes his vocals are modified by studio effects. Before 8 minutes the music gets more intense with some great drumming.\"Arrow\" starts with very jazzy drumming. Some weird vocals and jazzy sax. After the vocals start there is a nice clavinet/flute part. Things pick up with a steady drumbeat around 5 1/2 minutes. Peter does some of his most intense singing on this song. Some nice wah-sax here as well. \"The Sleepwalkers\" is the best song on Godbluff. Some good cowbell in this song; even VDGG could not resist the temptation of the cowbell. After 3 minutes there is a great part that doesn't last very long. What do you call this kind of music? Tango? Bossa Nova? Latin jazz? I don't know but it sounds great and works really well within the context of the song. Around 4 1/2 minutes there is some really great organ playing. This leads into a great rockin' groove. There are overdubbed Peters singing. At the end the clavinet almost sounds like an acoustic guitar.Although Pawn Hearts is their masterpiece, this or H To HE... would make a better introduction to the band. They would never make an album quite as strong as Godbluff again. The following albums are still great just not as great as this. 4 stars."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Wednesday, March 30, 2011",
      "rating": 4,
      "text": "It wasn't until my discovery of the VDGG album H to He, Who am The Only One that I was finally able to \"get\" Peter Hammill (to be honest: to get over my distaste of his voice/singing style). I'd been trying to get into/appreciate Hammill & VDGG for years--since 1977-8 when I picked up In Camera, The Silent Corner . . . , and Over. I always thought the song structures intriguing, I just couldn't get past my aversion PH's voice/singing. Plus, I am not a lyric-conscious music listener and VDGG/PH are definitely better appreciated if you get into the lyrics. So now I am finally able to go back and re-listen to the VDGG/PH discography in order to write some reviews.Godbluff contains two very amazing songs in the intense and emotional howitzer (though oddly engineered), 3. \"Arrow\" (8:15) (18/20) and the surprising, diversified, and instrumentally fun 'jam,' 4. \"The Sleepwalkers\" (10:26) (18/20)--a great song which does not give as much forefront to PH's vocal (it's actually mixed quite far back into the mix for a good portion of the second half of the song--and there is a lengthy instruments-only section in the middle containing many fun and even beautiful mood, style, sound, and instrumental shifts). The album's opener, \"Undercover Man\" (7:00) is just plain boring music (I get very tired of the church organ playing). (12.75/15). 2. \"Scorched Earth\" (10:10) (17.75/20) is somewhere in between--a step above because the clavinet and sax sound pretty good together. Also, I like some of the unusual vocal effects, layering and background vocals. I usually don't like sax--period--but it's actually okay in this mix--even the soli. I guess my main complaint here is the length and repetitious A-B-A-B-A-B-A-B . . .In summary: \"Arrow\" and \"The Sleepwalkers\" are definite masterpieces of progressive music; \"Scorched Earth\" is memorable; \"Undercover Man\" is a song for the 'torture your mother-in-law' bin. I guess it's and excellent addition to any prog lover's music collection. Maybe not every prog lover's music collection. 3.5 stars rated up cuz I respect the talent here and the choices of others.Total Time: 35:51The band feels more mature, more patient and thoughtful with its songwriting, but the overall effect fails to hold my attention much less keep me engrossed.B+/4.5 stars; a near-masterpiece of progressive rock music. As for its claim to being one of the Top 10-20 prog album ever made? I'm afraid it wouldn't even make my Top 500."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Saturday, April 2, 2011",
      "rating": 4,
      "text": "Not my cup of tea, but the music is outstandingI must be honest, after listening the first disappointing VAN DER GRAAF GENERATOR albums,, decided to give \"Pawn Hearts\" a chance, but even when I found it slightly better than the previous, it was only slightly above the average in my opinion.After all this failed attempts to like VDGG, when \"Godbluff\" was released, I wasn't ready to listen it with impartiality due to my prejudice about the band, so bought it, heard it several times (with little emotion) and send it to the box of albums that didn't planned to listen in the rest of my life, where kept gathering dust for a couple of decades.But last week there was a thread in the ProgArchives Forum asking us to compare this album with the GENESIS masterpiece \"Nursery Cryme\", my reaction was to vote immediately for the GENESIS album, but after a short debate, decided to give \"Godbluff\" a new chance, so after several hours re-listening the album, here I am trying to review it.The album is opened with \"Undercover Man\"and after a good dramatic soft vocal and keyboard intro, the band manages to wake my curiosity and keep my attention. My first impression is that I'm listening \"David Bowie\" singing something from his second album, not only because the amazing similarity between David and Peter Hammill's vocal range, but also a more than casual similarity with the \"Space Oddity\" track.But lets be honest the structure and performance is impeccable, the song goes constantly \"in crescendo\" generating expectation in the listener, with radical changes and an impressive keyboard performance by Hugh Banton in the organ. The vocal work is good, (hey I like Bowie) but excessively derivative in the vocal part despite the excellent lyrics. I believe it's a solid track to open the album, by this point, I'm far more interested than I ever was before in any track by the band.In \"Scorched Earth\" seems as we were before another vocalist, even when the range can't change too much, the style is clearly original and unique, sadly the song is not remotely as strong as the previous one, I believe \"Hammill\" and company decide to forget the melody in order to experiment more. Still the complex choral arrangements are simply amazing, unlike GENTLE GIANT, this guys have perfect control over the dissonances. A bit to over elaborate for my taste, but still good, and again Banton proves how good he is.\"Arrow\" begins with a jazzy drumming section that starts to morph into something extremely complex and very imaginative and frenetic, but around 1:37 minutes, the change is really dramatic. The music is incredibly mysterious and haunting (as I like) and the progression is just impressive. The guitar work and flute by Peter and Jackson are the stars of the song and the strong vocals are just breathtaking. From this moment the song doesn't change too much and the finale would be much better if they would not had used saxophone that seems out of place. But again a very solid track.The original version of \"Godbluff\" (ends with the outstanding \"The Sleepwalkers\", some sort of Medieval Jazz fusion, but after the first vocal section, you can expect almost anything, from Heavy Rock to elaborate Prog and Jazz. The best track I ever heard by VAN DER GRAAF GENERATOR.My version has two extra songs, but as everybody who knows me, I only review an album according to the original version, being that this is the way the authors created it.When I rate an album like \"Godbluff\", I always have the same problem. From the start I knew the only really fair rating would be 3.5 stars, but being this impossible in our system, I have to choose between 3 and 4 stars.In this case I was almost decided to go with 3, but after listening \"The Sleepwalkers\" and even when I still believe 3.5 is the most accurate rating, I had to go with 4 stars,. because despite the fact that i'm not a fan of the band at all, the album is extremely solid."
    },
    {
      "reviewer": "colorofmoney91",
      "date": "Posted Monday, April 11, 2011",
      "rating": 3,
      "text": "Godbluff is my third VDGG experience, and it wasn't as good as Pawn Hearts, but definitely better than H To He. Again, the music here is basically dark and gloomy jazz inspired progressive rock with insufferable vocals.\"Undercover Man\" is a song that doesn't really stand out to me. I've listened to it over and over again on repeat to find some kind of passage or anything at all about it that stands out, but it really does just seem bland. It's a very subdued, decently dark track dominated almost entirely by those \"interesting\" vocals. The music itself is slightly soothing at best, but not much more.The music on \"Scorched Earth\" starts off sounding like Camel, in my opinion, but that doesn't really last. There is a memorable dark jazz instrumental break in the middle section of the song that I find to be quite enjoyable.\"Arrow\" begins with a sound not unlike post-bop jazz, but of course it is darker, and eventually gives way to a dark King Crimson sounding passage. But, lo and behold, the vocals kick in and give me a headache. This track does have a nice groove to it, and has a powerful jazz feel that is really enjoyable, and this is probably the best track on this album.\"The Sleepwalkers\" is another track that sounds like Camel at its inception, but the goofy vocals are the goofiest since some of the vocals on H to He, sounding not unlike sing-alone bafoonery. There is a fantastic jazz and blues inspired instrumental passage near the end of the track, but everything besides just seems to be ultimately forgettable.Not quite as good as Pawn Hearts but definitely miles better than H to He, I'd have to recommend this mildly. Again, the vocals keep me from enjoying this album too much. If you can get past them, then you will find much to love here."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Saturday, April 16, 2011",
      "rating": 4,
      "text": "Never heard anything like this.In 20 years of listening progressive music, I voluntary never got acquainted with Van der Graaf. 'Why' you ask? I'm quite allergic to the 'mal de vivre' in general, and so caracteristic of Peter Hammill's work. Everytime I saw someone who really liked the band, they always had that point in common: a tendency to be depressed. No kidding, they all without exception showed signs of mood swings. Nothing to reassure me, indeed.But of course, that was a decade ago. Time changes everything, and I do (sometimes) appreciate the tension-releasing anger and screaming madness of VDGG. It's my first toe- tipping into this bizarre world and it's a disturbing record I must say. A blend of intense saxomofone, mental insanity and deep heartbreaks. Woah, your wife won't like it for sure.The poor guy looks like he's in a lot of pain, with a tortured (but pleasant) voice that recalls a satisfying cross of Peter Gabriel and David Bowie. It must be very difficult to sing an entire show like this, since the voice is going from here to there in many tones, always in a VERY theatrical way. The drumming is stellar, and I mean it like Giles-from-King-Crimson-good . Sometimes it reminds me of Gentle Giant, with a dirty saxomofone giving the bass an appreciable edge. On the rythm section, no big drum fills, but a solid use of ride, snare and bass drum. Not the most inventive or varied organ sounds around, but since the vocals takes so much space, everything is in place nor the less; but without those insane vocals, the music would be rather ordinary except for Sleepwalkers. I'm so speechless, this music is reaching something painful inside of me and tries to bring it back to the surface. Am I the only one feeling this? Addictive and disturbing!Stone me if you will, but the general feel is close to insanity: borderline-manic-depression- under-pressure, call it what you will; to me Mr. Hammill is not a well man. If it's part of his act, we have here a fantastic comedian!This is definitely a soundtrack for your nightmares."
    },
    {
      "reviewer": "Seyo",
      "date": "Posted Thursday, August 18, 2011",
      "rating": 5,
      "text": "After a 3-year hiatus, VDGG returned to the scene and what a return it was! The previous album \"Pawn Hearts\" was a studio-oriented ambitious work, which despite its obvious qualities I often considered a bit impenetrable. Although \"Godbluff\" is hardly more pleasant or cheerful to listen (indeed it is one of the darkest and gloomiest records I ever heard!), it is nevertheless more consistent piece of art. No wonder they extensively played \"Godbluff\" material on tours before setting in a studio to record the work. The performance of these 4 tracks is perfect in every sense, and you can feel a \"guiding hand\" connecting all of these into one coherent whole, although it is far from by that time already worn-out template of \"concept albums\".If I am correct, this is the first VDGG album featuring Hammill on electric guitar, besides his usual piano/electric piano instrumental contribution (here it is mainly Hohner Pianet but you can also hear many moments sounding like there is a Clavinet too). He was obviously still very shy playing it (in contrast to acoustic guitar) since it can be hardly detected on few moments on the B side of the record. Still, it is nice to see him holding a Strat on the back cover photo. Banton-Evans-Jackson trio is in full throttle providing a dense aural landscape filled with brutal heavy rock attacks, jazzy improvisation and extremely unconventional (even for \"progressive rock\") arrangements and melodies.Personally, I owned this album since 25 years ago and despite being a young fan of VDGG I could not always fully enjoyed it. It grew slowly over time with many listens and now I can safely declare it one of top 20 if not even top 10 of the best progressive rock albums of all time! So, in case you are a newcomer to \"Godbluff\", please keep this in mind.PERSONAL RATING: 5+"
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Thursday, October 6, 2011",
      "rating": 5,
      "text": "Refreshed after a break from recording and touring under the group banner, and having picked up a wild, aggressive energy during the recording of Hammill's punk-predicting Nadir's Big Chance, Van der Graaf Generator's official return to active duty is a dark, volcanic, furious ball of energy in the shape of an album. From the mysterious and foreboding opening of The Undercover Man (opening the album with some great flute from David Jackson) to the apocalyptic nightmares of Scorched Earth and Arrow to the existential horror of The Sleepwalkers, Van der Graaf Generator take the listener through a twilight world of demented saxophone, brooding organ, and impassioned vocals from bandleader Hammill. If the band needed to split up for four years after Pawn Hearts to muster the energy to deliver this unto the world, I say the wait was more than worth it."
    },
    {
      "reviewer": "FragileKings",
      "date": "Posted Friday, September 12, 2014",
      "rating": 5,
      "text": "VAN DER GRAAF GENERATOR are one of those classic prog bands that must be in any decent prog collection. I believe this now with affirmed feelings. Yet early on I had a difficult time finding something to appreciate in the music. Whenever I gave a listen, it was Peter Hamill's vocals that quickly put me off. The music may have had a genius quality but Hamill was more of a madman. How was that singing? He'd have done better by talking.Well, one day I noticed that I was slowly acquiring and enjoying most of the albums on the PA top 20 of all time and so I figured I'd just order \"Godbluff\" and give it a good listen. And well that I did.\"The Undercover Man\" begins slowly and the music is easy to get into because it is not weird and builds very nicely as the song progresses. Peter Hamill sounds like he's reading a book and singing the odd word here and there. If I had never been able before to imagine the concept of someone singing without a tune or melody then I sure can now. But soon I seem to get what Hamill is doing. He's singing poetry. And actually it's not that bad.\"Scorched Earth\" begins without me even noticing the first time because it seems to just be another part of \"The Undercover Man\". But the music turns more energetic and aggressive and there's a new twist to the sung poetry. This is getting interesting now. The song has edge and the music is pleasantly powerful. This I can dig.The album continues to impress on side two with a great drum and bass intro to \"The Arrow\". A saxophone comes in and I am trying to imagine what image this music can conjure in my mind's eye. I settle on ghost ships appearing through the fog. The song rolls with that keyboard sound and Hamill delivers the lines with a rough edge to his voice at times. All right. So two very good songs so far and one that's interesting enough to be worthy of repeat listens.And then we reach the climax of the album and for me THE VDGG song to have me hooked: \"The Sleepwalkers\". The song begins just as good as anything I've heard so far. I am really surprised that I am enjoying music without electric guitar this much. There's this wonderful bit that sounds like living room dance music for my dear grandmother's generation, with images of barrel-bodied seniors in brown pants and knit one- piece sweater/skirts dancing joyously in the living in the 1970's. Love it! Then the first part wraps up and morphs into a spacey organ bit that goes on a bit longer than I'd like. But that's OK because presently a serious rock section begins and my ears are soaking in all in. This is really good music. The sax and organs along with an acerbic Peter Hamill screaming the lyrics as well as any punk rocker is just bliss. And again I notice that there's no electric guitar and I am loving the saxophone. Fantastic!Based on the sheer joy of listening to the music on \"Godbluff\", I bought \"Still Life\" but was disappointed. Later I bought \"Pawn Hearts\" and though I like it now, it took some time to appreciate. But \"Godbluff\" is quite a package of music. It sure deserves it's place among the top albums of progressive rock. Certainly, VDGG is not for everybody and if the music isn't too hard to swallow then Peter Hamill's voice might be the clincher. More than a singer, I would call him a theatrical vocalist. But if you can \"get\" this then this album should really please. One thing I really appreciate is that I can listen to the whole thing through and keep my interest, and as well, I can pick two or three songs to put on mix playlists. These are two of the traits of a great album for me."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Monday, October 19, 2015",
      "rating": 5,
      "text": "Review N� 27Van Der Graaf Generator is a British band formed in 1967 in Manchester while their band members studied at the Manchester University. As all we know, the group still exists today, even after two interruptions in their musical career. The group's name was inspired in the electric equipment of Van de Graaff generator, which is a machine that creates static electricity. The group had also some changes into their line up over the years. Van Der Graaf Generator was always a different kind of a progressive band, in so many ways. They incorporate, in addition to the traditional musical instruments normally used by a rock band, the sound of saxophones and flute, which is one of the keys of their music. The other main characteristic of the band is the importance of the Peter Hammill's very intricate and personal lyrics, sung by him in a very personal, peculiar and unique way. The sound of his voice isn't for everyone.After the release of their fourth studio album \"Pawn Hearts\" in 1971 and due to financial problems within the group, Hammill left the band to pursue his solo musical career, putting an end in the group and making their first hiatus. After five solo efforts, Hammill re-formed Van Der Graaf Generator, and the band released their next three studio albums, \"Godbluff\", \"Still Life\" and \"World Record\", only in two years, between 1975 and 1976.\"Pawn Hearts\", was my first review of a Van Der Graaf Generator work. As I wrote before, when I made my previous review of that album, \"Godbluff\" is my favourite album still \"Pawn Hearts\" is, for me, their best work.\"Godbluff\" is their fifth studio album and was released in 1975. It's the first album that belongs to their famous trilogy, already mentioned by me. They maintained the same line up until the new breakup of the band. So, the line up on the album is Peter Hammill (lead vocals, piano, clavinet and electric guitar), Hugh Banton (keyboards, bass guitar and bass pedals), David Jackson (alto, tenor and soprano saxophones and flute) and Guy Evans (drums and percussion).\"Godbluff\" has four tracks. All the tracks were written by Hammill, except \"Scorched Earth\" which was written by Hammill and Jackson. The first track \"The Undercover Man\" is absolutely an astonishing piece. It begins with Hammill's voice in a low timbre, accompanied by Jackson's flute and Evans' drums. The track develops, with a slow crescendo of Hammill's voice and Banton's organ. In my humble opinion, this is one of the most beautiful songs ever created by the band. The second track \"Scorched Earth\" is a more traditional band track. It's much darker, aggressive and complex, than its debut previous track. This is a track with a great work by Jackson on saxophones, perfectly well accompanied by Hammill's aggressive vocal work. This is another great track and represents the closest track to the musical style on their previous album, \"Pawn Hearts\". The third track \"Arrow\" is the most aggressive musical piece on the album. Musically, it's a very complex and strong song, with a very aggressive vocal work by Hammill. However, \"Godbluff\" is an album full of great vocal passages. As with \"Scorched Earth\", this is another song more in the vein of the classic band's repertoire. For me, these two songs, especially \"Arrow\", make the transition, between the previous musical era, ended with \"Pawn Hearts\", and the new musical era started by \"Godbluff\", followed by \"Still Life\" and ended with \"World Record\". The fourth track \"The Sleepwalkers\" is undoubtedly one of my favourite songs of the group and represents the great highlight of the album. This is the lengthiest track on the album, and is also, in my humble opinion, one of the best songs ever made. When I wrote that \"Pawn Hearts\" is probably the great masterpiece from the band but that I preferred \"Godbluff\", I was just thinking only on \"The Sleepwalkers\". Definitely, this is the song that makes me to tend for \"Godbluff\". Sincerely, for me, \"The Sleepwalkers\" is a truly masterpiece by itself.Conclusion: As I said before, \"Godbluff\" is my favourite Van Der Graaf Generator's album. Despite I deeply love, practically all of their musical studio works of the 70's, it always had and always it will have a very special place into my heart. The only four tracks of the album showed a unity, coherence and a musical inspiration, which appear as having been cut from the same cloth. An attentive listening of the album show that the group had changed, abandoning the aesthetic of their earlier albums in favour of a more direct and streamlined approach. However and unfortunately, Van Der Graaf Generator never quite managed to make the same impact on the generality of the public of the 70's as Genesis, Pink Floyd and Yes, had done. They always differed from the traditional progressive rock groups. If we want to define the band, we can say that probably, they are the band that clearly defines the dark side of the progressive rock music. To finish, even if we can enjoy more or less the band, and if \"Godbluff\" is the best Van Der Graaf Generator's album or not, which is really truth is that \"Godbluff\" is one of the best albums ever made.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "Modrigue",
      "date": "Posted Friday, August 26, 2016",
      "rating": 5,
      "text": "The resurrection of Van Der Graaf GeneratorFans of alternative prog, rejoice! After four years of silence, Peter Hammill, David Jackson, Hugh Banton and Guy Evans unexpectedly reunite in 1975 and simply offer one of VAN DER GRAAF GENERATOR's best albums! \"Godbluff\" inaugurates the band's second era in the mid-70's and proves that miracles exist. After \"Pawn Hearts\", Hammill started a solo career and his works were a bit different from VdGG's style. Same goes for the other members, who released average jazz-rock albums, under the name \"The Long Hello\", without their singer. These three separation years thus demonstrates that Peter Hammill is not VAN DER GRAAF GENERATOR all by himself, and, vice-versa, that VAN DER GRAAF GENERATOR cannot exist without its lead vocalist.Composed of four mini-epics, \"Godbluff\" is their first self-produced opus, as well as their most accessible. Again, the music, somber depressive, tortured and dominated by keyboards and saxophone instead of guitars, investigates the depths of the human mind. This time, the atmosphere is maybe even more bitter and aggressive than on \"Pawn Hearts\". In addition of his raging and theatrical voice, Hammill makes an important usage of clavinet and Jackson's saxes are literally possessed here. Also featuring various changes and complex rhythms, the songs are perhaps a little less demanding than those of VdGG's first era, but still as interesting, creative and touching.Opening with whispering vocals and saxophone, \"The Undercover Man\" is sad and beautiful. Melodies to cry for. The tension then rises with the raging and somber \"Scorched Earth\". After its heroic overture, the music goes crescendo, stronger to conclude with a surprising distorted guitar section. A powerful track, driven by the organ and Jackson's demented sax.Do not trust the ambient free jazz introduction of \"Arrow\": this song is the most violent and darkest of the record, but also the maybe the most heartbreaking. A magnificent explosion of mastered wilderness! Back to calm with the more melodic \"The Sleepwalkers\" and its strange bossa-nova interlude. This ethereal ender contains also quite spacey keyboards and a grandiose finale. Epic!Out of time, \"Godbluff\" is much more than just the return of a major progressive band, it's a miraculous resurrection, a musical black meteorite darker than most other disc of the same time-period. Each track is superb and offers its own variety of ambiances. A little gem of tortured and frightening impressions, so human...Most accessible record from the band, this fifth opus is definitely the one to start with for newcomers. \"Godbluff\" is a masterpiece of depressive prog, VAN DER GRAAF GENERATOR's creative peak, with \"Pawn Hearts\" of course..."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Tuesday, January 22, 2019",
      "rating": 5,
      "text": "VAN DER GRAAF GENERATOR became quite the rage in the most extreme circles of the prog world in the early 70s having pushed the boundaries exponentially on their critically acclaimed combo pack of 'H To He Who Am The Only One' and 'Pawn Hearts,' the latter of which was so stuffed with musical mojo that even nearly 50 years after its creation still stands proud above the decades of recordings that have followed in its wake and requires some serious dedication to penetrate. So ambitious was the classic VDGG lineup of Peter Hammill (vocals, keyboards), Hugh Benton (organs, bass, bass pedals), David Jackson (sax, flute) and Guy Evans (percussion) during these years that the band literally caved in under the strain of an exhaustive workload that included not only incessant recording schedules but extensive touring that took them on the road in their native UK and across the entire European continent (with Italy proving to be their biggest success).Having completely burned out, Hammill, the undisputed leader of the band decided to call it quits which essentially dissolved the great VAN DER GRAAF GENERATOR and instead focused on his solo career and released a series of solo albums. Saying the band broke up altogether would be somewhat of a misnomer since the entire VDGG team played on Hammill's first three solo albums 'Fool's Mate,' 'Chameleon In The Shadow Of The Night' and 'The Silent Corner And The Empty Stage.' In fact, tracks like 'A Louse Is Not A Home' from the latter was initially intended to fit in on a VDGG album but adapted to Hammill's more intimate and less psychedelic band efforts. All was amicable. VDGG was not a band of drama and exuded a sense of professionalism rarely found in the music industry. And although the focus was on Hammill's solo career, recordings have emerged that were intended to be possible VDGG material from this era.After a few years off, the quartet was getting the VDGG bug again. The band's first phase final effort 'Pawn Hearts' was released in 1971, just as the prog rock scene was really getting started so the temptation to reconvene in the ever more crowded scene must've been irresistible especially since the band hastily broke up at their creative peak. While 1975 was a year that saw the prog scene beginning to wane, VDGG were just getting ready to begin the second chapter of existence. The year was spent crafting the first self- produced album and fluffing audiences in live settings to prepare them for the band's long-awaited fifth album GODBLUFF which emerged in October. Having decided to move on stylistically and create a second phase of the band's sound, the four struggled at first to reinvent themselves but in the end found yet another successful formula that was built around Hammill's singer / songwriter skills.It doesn't take too long to figure out that GODBLUFF isn't merely a continuation of 'Pawn Hearts' but rather more akin to the Hammill solo albums. Gone was the focus on the multitude of studio effects and psychedelic escapades and in was a more cohesive band sound that still focused on the melodic vocal / keyboard riffs as the main underpinning but found new ways to tease out the multitude of variations in an instrumental band effort that eschewed side long tracks divided into suites and instead created a strong collection of only four tracks that all hovered around the seven to ten minute mark. With the psychedelic and improvisational meanderings out of the picture, the emphasis is placed on Hammill's dark and mysterious lyrical content that tells the tales of tortured minds, ancient battles and fantastical progressive rock escapism in near perfect poetic deliveries.Perhaps the most psychedelic part of GODBLUFF is the very first notes of 'The Undercover Man' which insinuate a continuation of where 'Pawn Hearts' left off with an echoey flute oscillating into the limelight followed by Hammill's almost whispered vocals, however as the track continues it doesn't drift into psychedelic haze or completely unrelated musical motifs but rather takes the more commercial aspects of verses, choruses and bridges and puts them on steroids to create a revolving door effect of the various melodies that are teased out to the seven minute mark. Likewise the following 'Scorched Earth' finds a more feisty Hammill screaming the lyrics as well as adding those satisfying word extensions while the musical riffs create a repetitive cushioning for them to lay upon. While lyrically driven, the instrumental section finds brilliant ways to express their progressive leanings with time signature rich deviations and instrumental interplay.'Arrow' begins with a percussion rich jazz motif with resplendent sax squawks before ceding to the melancholic organ and piano melodies that slow things down considerably before Hammill breaks in with a series of call and response effects between the vocals and instruments. This track has an addictive melodic build ups that ultimately reach dramatic climaxes with Hammill finding new ways to torture the word 'Arrow' which reaches some of the most visceral emotional outbreaks on the entire album. The closing 'Sleepwalkers' is perhaps the most seductively sinister as the organ and sax riff slink around and create one of the most memorable tracks in the entire VDGG canon. Hammill's lyrics about some sort of zombie state of humanity manipulated by unknown masters finds his vocal prowess reaching new heights as the band effortlessly augments and outlines the main melodic drive in a progressive rock manner and sounds like no other. This track even adds the surprise of drifting off for a short while into some sort of cha-cha- cha Latin music.VAN DER GRAAF GENERATOR was back and proved that not only did this creative band still have yet another masterpiece in them but that these guys were able to create another chapter of their established sound without repeating the studio tricks and trinkets stuffed obsessions of the earlier albums. GODBLUFF not only comes off as more focused but also displays VDGG's ability to create lengthy tight-knit and well-crafted tracks that display the intricacies of Hammill's dark lyrical content into perfectly performed by the instrumental and vocal weavings. While a few naysayers like a review in the Lancashire Evening Post panned the album as being an inferior specimen compared to other similar acts and that Guy Evans couldn't drum his way out of a paper bag, GODBLUFF has stood the test of time and decades of accruing fans to the club. Castigating this album for its lack of Yes-like virtuosity or Pink Floyd lysergicism and not accepting the album on its own terms is missing the point as it is a vocal / lyrical driven album that takes the singer / songwriter approach into the realms of progressive rock. For many of us, this is yet another perfect album and VDGG couldn't have crafted a better followup to their brilliant 'Pawn Hearts.'"
    },
    {
      "reviewer": "patrickq",
      "date": "Posted Thursday, May 2, 2019",
      "rating": 4,
      "text": "Godbluffis not a Peter Hammill solo record, but the weirdness of his lyrics and the oddness of his delivery of those lyrics almost suggest a singer-songwriter album. Actually, there's more to it than that. There's a strange consistency in characterization across the four lyrical pieces. There are three principal characters - - me, you, and him, but often they're blurred to the point that they're hard to separate. 'I'd like to help you somehow, but I'm in the self-same spot,' Hammill sings on 'Arrow.' And on 'The Undercover Man,' he refers to 'you, my constant friend, ever close at hand.' Especially given Hammill's often-conspiratorial tone, the 'you' character seems not to be an unseen second person, butyou, the listener - - except when Hammill seems to be speaking to himself (i.e., 'me' = 'you'). Indeed, mental instability seems to lie beneath every other line. In the middle of 'Arrow,' after this passage - -'Sanctuary!' cracks a voice, half-strangled by the shock of its rejectionShot the bolt in the wall, rusted the keynow the echoes of all frightful memory intrude in the silence.- - we discover that the owner of that half-strangled voice isyou. Similarly, only at the end of 'The Sleepwalkers' is it clear that the protagonist is himself part of 'this mindless army' which 'advance(s) against the darkness.' Prior to this, he seems to be observing the fearful scene of murderous, unthinking zombies. And yet heis'an unthinking zombie, simultaneously thinking the thoughts we hear him sing? Or he is one of the 'converts' gathered 'to the fold'? Perhaps the lyrical kernel ofGodbluff'in encapsulated in this line from 'The Undercover Man:' 'When the madness comes, let it flood on down and over me sweetly.'The music onGodbluffis as mercurial as the lyrics, but within constraints which make it somewhat more consistent than that ofPawn Hearts, the band's prior effort. The standout here is 'Scorched Earth,' the only track not written solely by Hammill (saxophonist David Jackson is listed as a co-writer). The sound (I'm reviewing the 2005 Charisma remaster) is also very good.Godbluffis twisted, but I think I'm discovering that much of Van Der Graaf Generator's music is twisted - - or maybe it's just Hammill? For most listeners, Van Der Graaf Generator will be an acquired taste, and given the hundreds and hundreds of great bands and albums most of us have yet to discover, it makes sense to me that if you don't like it at first, you move on to something else. 'Appreciating' Van Der Graaf Generator isn't so important that anyone should have to keep relistening until they've acquired the taste. But there was something about the song 'Killer,' and then the albumPawn Heartsthat compelled me to keep listening to this weirdness.Anyway,Godbluffis a very good album, but not one I'd recommend to someone new to the prog-rock genre. Try out Yes, Genesis, Rush, Jethro Tull, etc. first. But if and when you're ready for something a bit off-the-wall but (mostly) self-serious, giveGodbluffa spin."
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Monday, September 9, 2019",
      "rating": 5,
      "text": "Van Der Graaf Generator disbanded after the Pawn Hearts tour, in 1972, they disappeared when prog-rock exploded, spread: the years 1972, 1973 and 1974 are dominated by progressive rock, and they are not there: they return in 1975, when the prog movement is now the straight of arrival, it is leaving the scenes to punk; as if primitive dinosaurs that appeared in the Triassic disappeared throughout the Jurassic and then returned to the end of the Cretaceous, just before extinction. VdGG returns in a more stripped-down robe (without the mellotron and synths and terrifying sound orgasms of the past), a drier, almost live sound, where the drums are too prominent, and with more linear but still prog songs that are long , with changes in time and atmosphere, and instrumental variations on the theme.GODBLUFF (1975)Side A. 1) The undercover man (8+): Slow beginning with a soft, very expressive singing, followed by a beautiful melodic progression dominated again by Hammill's singing (and here it feels like the complex sounds more calmly and more linear than in the past, according to the more classical schemes of a song), then finally comes the instrumental piece and the epic ending ? but the performance does not touch those very high expressionistic summits of pathos of the past.2) Scorched Earth (8.5/9): More gritty song than the previous, more expressionist, masterpiece of the album, with frightening sound passages reminiscent of the golden days. Hammill's voice does its part, it is the music that does not have the charge of the past, but is unleashed in the paroxysmal ending. Dark and hallucinatory atmosphere.Side B. 3) Arrow (8+): It starts with a beautiful jazzy instrumental passage (great Banton on the bass guitar), then comes the sound characterized by a rabid, almost snarling chant of Hammill. Throughout the record is missing the wonderful singing on the high, elegiac notes of Hammill, who prefers here to perform in a raucous rant that is not up to par. The atmosphere, in fact, is more of anger than anguish.4) The Sleepwalkers (8): Song with a sarcastic atmosphere, the only theatrical, with continuous changes of rhythm, at times ironic as a popular dance, sometimes obsessive. It's fine as a final piece to lighten the atmosphere and close in a pyrotechnic way; it is the longest and lightest piece of the album pleasant, even if it lacks a real direction.VdGG returned to the scene by churning out an album with a very different sound from the previous ones, as did King Crimson with LTIA, overall rough, sober and fuzzy, where Hammill's voice and Banton's keyboards are less prominent. The arrangements and melodies are all too homogeneous and paint a desolate picture of the loss of hope. The four songs all look a bit like each other in various passages. The pieces are all solid and more than good, if not excellent, and on them hovers an existential nightmare, especially in Scorched Earth and Arrow, and only the last song has slight passages. VdGG do not betray themselves, they reproduce with songs inspired and easier to access than in the past but they do not play and no longer sing with that existential urgency of the beginnings, and this partly affected the pathos transmitted by the music, which still remains well present (O God, compared to Yes, EL&P, Genesis the pathos is always very high) but it does not reach the heights of which they are capable.Average: 8.15, Rateing: 9. Great album, small masterpiece, five stars."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Thursday, June 29, 2023",
      "rating": 4,
      "text": "After the three-year hiatus and uncertainty imposed by Peter Hammill's solo career, VDGG returns to the arena in 1975 with \"Godbluff\", an album that continues with the lucubrations of the mind regarding human existence and its multiple edges, a recurring theme of the British.And this is how Hammill's voice, the main actor of the introspective \"The Undercover Man\", whispers and then almost shouting suggests that madness is a probable form of self-knowledge, supported by the correct accompaniment of the band, which prioritizes the group melody over individual brilliance. A similar thematic path runs through the intense and proactive \"Scorched Earth\", a song that proposes not to be tied to the past and move forward, with Hugh Banton very active on keyboards and above all Guy Evans, great protagonist with the drums, as in the jazzy beginning of \"Arrow\", followed by a cadenced rhythm that is repeated until its end with the rough and exorbitant sax of David Jackson marking the pace. Finally, the intricate and resigned \"The Sleepwalkers\" amalgamates medieval reminiscences, jazz elements and an unexpected and fleeting nod to Latin sounds, in the most versatile and progressive of the four songs on \"Godbluff\", closing it in grand form.Despite the rudimentary sound, the additions from the remastered 2005 album, \"Forsaken Gardens\" and \"A Louse Is Not A Home\", both live versions of Hammill's excellent solo album \"The Silent Corner And The Empty Stage\", are very interesting and could perfectly be part of any VDGG production.Excellent (one more...).4 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album53f2.html",
  "last_parsed": "2025-05-18T00:25:34.723399"
}