{
  "album_title": "IN ABSENTIA",
  "artist_name": "Porcupine Tree",
  "artist_page_link_local": "artistdc59.html?id=290",
  "year": 2002,
  "rating_value": 4.26,
  "rating_count": null,
  "review_count": null,
  "genre": "Heavy Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/290/cover_5047161952016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Blackest Eyes",
      "duration": "4:24",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Trains",
      "duration": "5:56",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Lips of Ashes",
      "duration": "4:39",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "The Sound of Muzak",
      "duration": "4:59",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Gravity Eyelids",
      "duration": "7:57",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Wedding Nails",
      "duration": "6:34",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Prodigal",
      "duration": "5:33",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": ".3",
      "duration": "5:26",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "The Creator Has a Mastertape",
      "duration": "5:22",
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "Heartattack in a Layby",
      "duration": "4:16",
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "Strip the Soul",
      "duration": "7:22",
      "is_sub_track": false
    },
    {
      "number": 12,
      "title": "Collapse the Light into Earth",
      "duration": "5:53",
      "is_sub_track": false
    },
    {
      "number": 13,
      "title": "Bonus video on CD-ROM section for PC / MAC",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 1,
      "title": "Strip The Soul",
      "duration": "3:47",
      "is_sub_track": false
    },
    {
      "number": 1,
      "title": "Drown with Me (5:23) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Chloroform (7:16) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Strip the Soul (video edit)",
      "duration": "3:35",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "* Recorded during album sessions",
      "duration": null,
      "is_sub_track": false
    }
  ],
  "lineup": [
    {
      "musician": "Steven Wilson",
      "instruments": "vocals, acoustic & electric guitars, banjo, piano, producer"
    },
    {
      "musician": "Richard Barbieri",
      "instruments": "keyboards (analog synths, Mellotron, Hammond)"
    },
    {
      "musician": "Colin Edwin",
      "instruments": "bass"
    },
    {
      "musician": "Gavin Harrison",
      "instruments": "drums & percussion"
    },
    {
      "musician": "Elijah Hibit",
      "instruments": "rhythm guitar (?)"
    },
    {
      "musician": "John Wesley",
      "instruments": "backing vocals (1,4,7), guitar (1)"
    },
    {
      "musician": "Aviv Geffen",
      "instruments": "backing vocals (4,7)"
    },
    {
      "musician": "Dave Gregory",
      "instruments": "string arrangements (8,12)"
    },
    {
      "musician": "London Session Orchestra",
      "instruments": "violins, violas, cellos & double basses (8,12)"
    },
    {
      "musician": "Gavyn Wright",
      "instruments": "violin, orchestra leader"
    }
  ],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Tuesday, February 24, 2004",
      "rating": 2,
      "text": "As good as the previous studio album Lightbulb ( I don't agree with the band's commercial policy of flooding their fans of those weird compilations or other releases so I only discovered the full fledge albums and will dicuss only those). I saw them doing most of this album in their last tour and I must say that this stuff has a life of its own on stage."
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Saturday, March 20, 2004",
      "rating": 5,
      "text": "Wow!.Now this album is a real stonker. I have loved PORCUPINE TREE for a long long time now and have pretty well everything they have released but I must keep saying that these guys get better album by album. \"In Absentia\" is a step on the harder side with some real \"crunchy\" guitar and mid section work. For those who follow PT then you will know that this album features their new drummer \"Gavin Harrison\" who delivers some real awesome chops throughout. As you would expect this album is still full of that PORC TREE- psychy mise-en-scene but just this time around takes a more guitar centric approach. Stylistically \"In Absentia\" still embodies the mystical-psych aspects layered over crisp percussion, bass and spacey keyboard work. On \"Lightbulb Sun\" I really noticed the vocal harmonies and this has continued with this album with the awesome voice of Steve Wilson. \"In Absentia\" takes the harder edges of \"Signify\" and \"Stupid Dream\" and layers ontop of songs not unfamilar from the \"Lightbulb Sun\" era. I can only hope the world opens their ears to this masterpiece which embodies all the goodness one could ever ask for in a band! This is really an amazing album."
    },
    {
      "reviewer": "Muzikman",
      "date": "Posted Saturday, January 29, 2005",
      "rating": 5,
      "text": "A frequent reminder of the sounds of vintage PINK FLOYD can make you comfortably numb, at least it does for those of us that have appreciated the group over the years. Going away . the impact and influence of that band on so many artists is beyond compare. PORCUPINE TREE takes a page out of their book but they have also managed to create a rabid following and maintained an awareness of developing their original sound unlike few artists that are actively recording today.With \"In Absentia\" their 2002 release, and first major label recording, they have proved that they are amongst the elite in rock music today. If you find the cover of this CD disturbing, that is only the beginning of what you will find in the music that is underneath the picture. While their music can be beautiful and full of pop polish with layers of instruments, it can also be dark, disturbing, and vicious. To me that is the beauty of what they are. Within one track, you will hear savage electric guitar licks tearing you apart at the seams, acoustic guitars strumming with lovely keyboards that will put you on a fluffy cloud, and then all at once it changes. Like the peeling of an onion, each layer of your sub consciousness mind unravels methodically with the music as you discover what has been lurking beneath those bubbling emotions. What you show on the outside shell of yourself is what everyone sees, but is it the truth? The music coerces you to find a truth even if it has to claw its way out. You see, this band does not care about making hit music, they are interested in art, music that makes a movie unfold in your mind, writing a song rather than banging it out with an expectation and sameness that sells records, and finally . evolving with each recording they make. They do all of that and come up with a classic for the ages along the lines of something that GABRIEL era GENESIS, MARILLION or YES was known for.My god, were do I start with all these great songs? Every one is. \"Strip The Soul\" is undoubtedly the most prolific, and after you listen to it a few times then watch the bonus video that illustrates the song, you will be . disturbed. The theme underlying the music's premise is the story of a serial killer, a cancer, or a sickness of a collective family. What I think they are pointing to is the human race in general, not just one particular deranged individual. Let's face it, society, as an entity, is dysfunctional. The music is simply sensational throughout this album, and the fact that they delve deeply into the human psyche and are able to set it to such provocative and completely organized mayhem in their music is a stroke of pure genius. This is music about you and I, who we are and where we are, and where we could be. Our thought processes, which are often filled with dark places that we would rather not talk about, can be visited thanks to brilliant artists like Steven Wilson. I tip my hat to him for having the courage to let the monster within loose for a while to play inside the music. Perhaps if we all unleashed that part of ourselves in a creative positive force like this band does with their music the world would then be a better place.Music and bands like this are popular and respected for a reason, they have an important message to share and their music is the most expressive vehicle for transmitting their thoughts and emotions. The most beautiful thing about the entire formula is that they are willing to share it all with us. Listen and enjoy."
    },
    {
      "reviewer": "FloydWright",
      "date": "Posted Thursday, February 10, 2005",
      "rating": 3,
      "text": "This is one of those albums I've been rather ambivalent towards since the first time I heard it, and I still haven't been able to decide exactly what I think of it, just as it might be hard to decide how to react to the weird cover art (I hope to God that was done in Photoshop). This is my first PORCUPINE TREE album, and I do have to admit the band has got some strengths...but I find myself wondering now if I chose the wrong starter album.PROSAlthough this section is a bit shorter than the Cons section in length, bear in mind that these are serious, very important Pros, and things I really cared deeply about when I heardIn Absentia. So, don't decide this album has more bad than good just because of the length of these sections in comparison to each other.All of the instruments are played quite well, the production is superb, and STEVE WILSON's voice is extremely soothing and pleasant to listen to, especially when he sings in harmony with himself. With the exception of a single song, I find that it flows beautifully to listen to. \"Trains\" does something very interesting, seeming almost like two different songs, and musically, the section with the strange banjo-like playing and \"hand-made percussion\" (for lack of better words to describe it!). Another real favorite of mine is \"Lips of Ashes\", which is perhaps the softest song on the entire album. It's incredibly difficult to resist singing along with the gorgeous harmonies, and that reverb-soaked stringed instrument (a hammered dulcimer?) is mesmerizing. But perhaps the best moment in the song is when the guitar solo kicks in during the wordless vocals...this is the kind of musical moment that can almost bring one to tears.\"3\", though, is the absolute highlight ofIn Absentia. Again one of the mellower songs on the album, this one pretty much has it all. The best part is the string section, which lends an amazing intensity to this song that you can hardly even manage with the blaring metal-style guitars found elsewhere on the album--yet simultaneously with a delicate touch. The lyrics are simple...but it may be the simplicity that spares this song the lyrical trouble that the other songs on this album have. And they are, of course, sung beautifully. The bassline, repeated in a variation in \"Strip the Soul\" is particularly catchy.Other notable songs include \"The Sound of Muzak\", \"Gravity Eyelids\", \"Blackest Eyes\", \"Collapse the Light into the Earth\", and \"Strip the Soul\", though I have a few caveats for the first two I mentioned. And now on to that stuff...CONSThe sense that this album is somehow derivative of other works has a tendency to get on my nerves as I listen. While people definitely do take influences from other bands, the trouble withIn Absentiais that I keep hearing itwaytoo often, to a point where I find myself wondering if PORCUPINE TREE evenhasa style of its own, or if its ideas simply come from rehashing other bands' works. I know the OPETH resemblance is a bit touchy to point out, considering that WILSON did indeed work with that band--but he first started collaborating with thembeforethe release ofIn Absentia, so I found myself wondering if he took even more fromthemthan he gave to their works. In fact, his drummer seems to be copying quite blatantly from the style of OPETH's MARTIN LOPEZ.\"The Sound of Muzak\", \"Gravity Eyelids\", and \"Strip the Soul\" are the ones where the OPETH influence is the most \"suspect\"...while they're good songs, they seem quite derivative. There are some other blatant instances as well--\"Gravity Eyelids\" seems to have taken amajorinfluence from PETER GABRIEL. Perhaps it was just an unfortunate accident, considering that both albums were released in the same year, but it sounds an awful lot like \"My Head Sounds Like That\" fromUp. And \"Wedding Nails\" seems to rip off PINK FLOYD in a serious way, copying SYD BARRETT's guitar technique from \"Interstellar Overdrive\" to a T. \"Lips of Ashes\" seems a bit similar to Crosby, Stills, and Nash's \"Guinevere\", although the two songs are quite distinct from each other. And unfortunately, \"The Creator Has a Mastertape\" seems to have borrowed from the absolute worst that RADIOHEAD has to offer; with its abrasively distorted vocals and guitar tones, it almost grates on my nerves as badly as RADIOHEAD's \"Myxomatosis\" or the B-side \"Transatlantic Drawl\". The song was, to put it simply, irretrievably ruined. Even thebestsong on the album, \"3\", seems to have taken a bit from the non-prog band Afrocelt; when I hear it, I am reminded of \"Sure-As-Not\".The other real con is that the lyrics are depressingly nihilistic--and not even very good in the first place. One is advised not to pay attention to them in order to avoid the urge to slash one's wrists.Overall...a 3? A 3.5? I'm not sure, but given the number of problems I've listed, I'll go for a 3 here."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Sunday, February 20, 2005",
      "rating": 5,
      "text": "A Great Space / Psychedelic Music!My prog mates talked about this album long time ago and for some reason I could only get this album just last year when IQ released \"Dark Matter\". Because I got a lot of CDs to spin, I spun this CD only occasionally. It's an interesting album, especially I like the quality of sound produced because the version that I purchased is aDVD Audiowith DTS surround 5.1 technology. I never regret to purchase this DVD Audio as it fulfills my expectation, you know ., Steven Wilson is a master in sound and recording technology; so any album of Porcupine Tree must have had excellent sound exploration. And when it is put in DVD Audio technology it would produce a remarkable sound. Yes! I'm extremely satisfied with this. The only problem with DVD Audio is that I can only play at home because it requires DVD player that I don't have it in my car or office or laptop (pity me, mine is the old Toshiba since 2002!). Fortunately, my good prog met mate, David, lent his hands to make a CDR copy of his double CD version. Thanks, David! Now, I can enjoy it everywhere I go; that's why my appreciation grows. But whenever I'm at home, I play it LOUD with my home stereo set. Ugh man .. What a superb sound! I still recommend you to buy the DVD Audio version because it's worth it: you get good music with superb sound quality! Buy it now man ...!!!!About the Music ..\"Blackest Eyes\" kicks off the album with an ambient guitar work followed with full stream of music when drum sound starts to roll! It shocked me with the fact that I turned my amplifier volume high in order to get great sound production of nice guitar opening. But when drum enters, the music sounds too loud. Never mind, I enjoy it very much. It's a very dynamic opening, I would say. The music flows in an up tempo style with obvious drumming sounds and guitar rhythm. Vocal enters very smoothly in a style of distance singing accompanied with and acoustic guitar rhythm and drum / bass guitar. In the middle of the track, there is a nice soft riffs that by way of beats reminds me to foxtrot style followed with a quieter passage. Excellent track and well positioned to open this album.It flows almost seamlessly to \"Trains\" with a simple acoustic guitar work followed with vocal line and some augmentation of keyboard work. After two paragraphs of singing, drum enters the music with keyboard (soft) and bass guitar in medium tempo. Acoustic guitar solo fills in the transition piece nicely. One thing I like most and it's sort of unpredictable to me is the inclusion of short piece in the middle of the track where acoustic guitar solo takes place in a simple melody accompanied with a hand clapping - what a nice piece man! The music returns to its original form and melody until it ends.\"Lips of Ashes\" starts ambient and spacey with a simple acoustic guitar sound augmented with keyboard effects in mellow style. The voice enters nicely in solo and followed with a duet; it's a very nice singing. Yeah, it reminds me to Pink Floyd - in a way. The electric guitar in a long sustain notes is very cool. No drumming in this track.\"The Sound of Muzak\" has weird time signatures especially if you listen to the drum beats - it seems there is a gap between guitar rhythm and the drum beats. The voice enters with a main rhythm of acoustic guitar. The bass guitar sound that follows has become a trade mark of Porcupine Tree as it reminds me to their previous song \"Waiting\", for example. The interlude is filled in with a stunning electric guitar solo. Excellent track!\"Gravity Eyelids\" opens with a catchy keyboard solo followed with a music sampling in the vein of Peter Gabriel's music. Very atmospheric and very nice! The voice line enters the music in a style of Radiohead singing style. The bass guitar line reminds me to Tony Levin's work in Peter Gabriel's albums. The keyboard department still plays its role as filler at the background and provides a spacey nuance of the track. When drum enters, it makes the music much more beautiful. In the middle, there is a soft guitar riffs augmented with piano touch and it flows in full swing with keyboard's sound effects. Oh man, this part is wonderful! It's killing me ... I have no problem if this track is made longer even though with the existing 8 minutes duration I'm already happy and satisfied. Wonderful track! Great sound exploration!\"Wedding Nails\" brings the music into more energetic mood with an upbeat tempo music started with an electric guitar work. The music flows dynamically in relatively fast tempo with great drumming, guitar rhythm and solo, atmospheric keyboard. Each instrument produces various sound textures that enrich the overall composition of this track. It has a simple structure but the combination of various sounds have made this track enjoyable. Wow! This track is SUPERB!!! I cannot afford not to increase my amplifier's volume when enjoying this track. Fantastic!\"Prodigal\" is a mellow and bluesy rhythm song composed in relatively flat melody but overall it produces an excellent music. Electric guitar provides its sound at background while the voice department shows his duty in singing. It has a stunning guitar solo and great drumming. What's interesting then is the follow up with the next track \".3\" when simple bass line enters followed with a spacey keyboard and long sustain guitar work. Bass line is the key for the overall rhythm. Keyboard sound increases gradually and until it reaches certain point it stops and continued with an acoustic guitar rhythm. The vocal then enters the music accompanied with acoustic guitar work. The music then returns with bass line as main rhythm accompanied with simple drum beats. The orchestration at the end of the track provides an uplifting mood.\"The Creator Has a Mastertape\" is probably the funniest song of this album. It starts with a combination of electric guitar effects and bass guitar with energetic drumming. It produces a funny music but it's very enjoyable. When the bassline and drum work together to provide rhythm for the vocal, the music seems so empty but it then followed with a blast of full music exploring the guitar effects, bass, drum and keyboard in a distorted fashion.\"Heartattack In a Lay by\" is a mellow song with nice acoustic guitar and keyboard / bass guitar line. It has a nice melody and sung excellently. Keyboard sound provides a spacey nuance. It's a kind of break after upbeat tempo track.\"Strip the Soul\" starts with a dynamic bass guitar work augmented with spacey keyboard sound followed with ambient singing. When drum enters the music, the mood lifted up and the music seems having a weird time signatures where the drum beats do not sound \"in sync\" with other instruments. It produces brilliant sounds to my ears, really! It reminds me to Bill Bruford drumming style. The guitar solo performed shortly and it alternates with rhythm section and spacey keyboard work. It's a great track.The concluding track \"Collapse the Light Into Earth\" opens mellow with a piano work that features vocal line. Keyboard sound fills at the background and it provides an excellent sound textures. The orchestration with string section enters gradually at the end of singing part. It ends up the album in a sad mood.The bonus contains \"Strip the Soul (video edit)\" and two bonus tracks.It's ahighly recommendedalbum. It has a tight composition with excellent sound exploration even though the music itself is not very complex. There are elements of space and psychedelic in its music. So, if you like both, you will enjoy this album. -Keep on progging!Yours progressively,GW - Indonesia."
    },
    {
      "reviewer": "Tristan Mulders",
      "date": "Posted Friday, February 25, 2005",
      "rating": 4,
      "text": "Porcupine Tree - In AbsentiaBefore I purchased this album by British space rockers Porcupine Tree, I only knew the few songs that were available here on ProgArchives to listen to. This might be the very reason I was quite surprised when I first listened to In Absentia; the songs available here were all very atmospheric and relaxed, whereas right from the start, In Absentia is characterised by its heaviness.Although I was quite surprised by this, it didnotscare me off. Already listening to quite a few metal bands at that time, I enjoyed this new perspective of Porcupine Tree's music. In fact, I loved it all so much that I decided to check out the earlier albums and piece-by-piece I collected all available releases by this unique band.I guess the more metal-orientated approach is a result of Wilson's collaboration as a guest-musician and producer with Swedish progressive death metal band OPETH. This album has quite a few of the trades that Opeth is famous for. For instance the heavy guitar riffs accompanied by the drum fills. But Porcupine Tree is not copying Opeth's style, they simply adapt a part of it. The music is a mixture of in-your-face metal sections altered with ambient or even acoustic interludes.There's not one song included that I would give lesser than a three star rating, if you could rate the songs individual. Although there are of course some standout tracks. For instance the experimentalThe Creator has a Mastertape, which is a rock song with spaced-out keyboards and a omnipresent bass guitar. The chorus consists of bone crushing guitar fills.But not only the heavy songs are great. There are several mellow songs included, alike the piano balladCollapse the Light into Earth, which is the album's closing track. This song is very uplifting regarding the overall dark mood of the album. The addition of a string section is rewarding. By far the most emotional song Porcupine Tree have written is the sombre balladHeartattack in a Layby. This song is the most quite track on the album and at the same time a warm break after the frenzy that is The Creator has a Mastertape. The multi-layered vocals are great and totally fit the fairly depressing but beautiful lyrics.There is one song included on the bonus disc with the European Version of In Absentia, which harks back to the music Porcupine Tree used to make around the Signify-era. This is the songChloroform. This mainly ambient song features great percussion and a well-played guitar solo.I have read somewhere that In Absentia actually is a concept album relating to the phenomenon that is \"serial killers,\" but I do not know what exactlyisthe concept. although it does explain the quite evil video clip for `Strip the Soul(which is included as an enhanced portion on the bonus disc to the European version of In Absentia)."
    },
    {
      "reviewer": "chessman",
      "date": "Posted Thursday, March 31, 2005",
      "rating": 3,
      "text": "This is another good offering from Stephen Wilson and the boys. Those expecting the gorgeous textures of 'The Sky Moves Sideways' though, may be in for a disappointment. There are a couple of tracks in that vein, but in general, this is a far more straightforward, rock/pop album, admittedly with superior harmonies and playing. 'Blackest Eyes' starts off almost the same as 'Show Don't Tell', the opener on Rush's 'Presto'. The guitar is heavier here though. Then comes an abrupt change into a song which could almost grace the charts in its melodic simplicity. A nice way to start. 'Trains' likewise is permeated with leanings towards jangly Brit pop, but again has a nice melody. 'Lips Of Ashes' is excellent, atmospheric, and almost a throwback to 'The Sky Moves Sideways'. Beautiful song with echoey, melodic backing. 'The Sound Of Muzak' returns to the chart style exemplified by the first two tracks. Again, it is nice but not extraordinary. This, however, is followed by one of the best, if not the best track on the cd. 'Gravity Eyelids' again harks back to earlier albums, with lovely backing and a slow, melodic groove. Classic Tree this one. 'Wedding Nails' is one of the two tracks I like the least on the album. It is too heavy for my liking really, although it is not an inferior piec of music. An instrumental, it powers along nicely, and I suspect the younger fans will like this. 'Prodigal' has excellent slide guitar work in it, and is again a slowish song, which is the type of song this band does best, for my money. Dusty roads came to mind for me when I heard this, and it is quite old fashioned in a way, harking back to the seventies. Very good though. 'The Creator Has A Mastertape' is quite weird in a way, neither the best, nor the worst song here. Nothing outstanding, but not particularly weak either. 'Heartattack In A Layby' is sparse, yet effective. Again, it is a slow piece, quite morbid really, yet it has a warm, almost choral feel to it. I like this one. 'Strip The Soul' is, as you may have already guessed, the other track I am not keen on. Too heavy for me this, and strangely lacking in melody. I applaud Wilson however, in his desire to experiment. I would rather he produced something like this than played it safe by becoming repetitive. 'Collapse The Light Into Earth' closes the album on a quiet, piano-led note. Slightly repetitive, it is still a decent offering to end with. I have the European Version, which comes with a bonus disc. 'Drown With Me' has nice acoustic guitar, and is quite good. 'Chloroform' continues in a typical Tree mood. The third track is, unfortunately, only the video edit of 'Strip The Soul'. Still worth having this disc though, if you can get hold of it. A good album, but a long way off their best. I hope they don't go too far down this louder, grungier road. It still has all the hallmarks of a top band however. A worthy disc for most collections."
    },
    {
      "reviewer": "FishyMonkey",
      "date": "Posted Saturday, May 14, 2005",
      "rating": 5,
      "text": "What do we have here? A little band called Porcupine Tree, as underground as it gets here in America. Having garnered a cult-like status among prog fans of late, I heard about this band a little before venturing into the deepest depths of prog (pretty damn deep) to hear bands like King Crimson, Yes, Rush, Genesis, ELP, and The Flower Kings. Enter Porcupine Tree with In Absentia. I downloaded \"The Sound of Muzak\" off this site and was blown away. It was unlike anything I'd ever heard -- one hell of a chorus, thoughtful lyrics, great acoustic work and drumming, everything wrapped in one cohesive package. It was a true work of art for me at the time, a masterpiece. About a month has passed since then. King Crimson, Yes, Rush, Genesis and others have all grown on me, as I started off a bit leary of them. Porcupine Tree, however, caught me from the beggining. I went and bought In Absentia, and man, what I got exceeded the epectations I had set based solely on Muzak. Now, enough of my rambbling, the review. I'll start with songs first.Blackest Eyes - Like Muzak, a simple yet attractive piece. Unbeknownest to me when I first heard it, this is probably PT's heaviest song, yet it stil lretains everything Steve Wilson is all about, with some nice spacey work with excellent acoustic and some heavy riffs thrown in. The lyrics are catchy too. The only weak point is the slightly repetative chorus, but eh. 9/10Trains - Now HERE'S a good song. Featuring some excellent acoustic with more heavy riffs, Traisn manages to blow me away like it's new each time I listen to it. I finish the song feeling like I just got done listening to an excellent album. My favorite part is when there's a little hand-clapping solo thrown in there with somehting that sounds vaguely like a banjo playing. Then, the acoustic guitar comes back in with Wilson singing some odd but effective lyrics with a very ctachy chorus. Overlal, the song is probably the most complete package on the album. 10/10Lips of Ashes - Starting out with some interesting sound effects, this one mainly focuses on Wilson's singing. Some light acoustic is on the background with an electric guitar solo over near the end. With Wilson's voice in there, the song creates a pleasant experience that never fails to entertain. Wilson's voice also works perfectly for this. Some excellent chord transitions here too. Well done. 10/10The Sound of Muzak - The song that started it all. Basic in itself, but has some bizarre drumming going in, oddly rhythmed. Effective, though. Catchiest chorus ever, great lyrics, radio friendly. Not too much prog in this, just like Blackest Eyes, but it still has prog influences in it for sure. Not much to write on this, good song all around. 9/10Gravity Eyelids - Throwback to old PT! Some nice spacey stuff here with good sound work all around. Not my favorite song, however, as it tends to drag. When it gets to the heavier part, it picks up, but even that gets old. Good solid work on the sounds, though. 9/10Wedding Nails - All instrumental here. Heavier, brisk pace. Like Muzak and Blackest Eyes, it isn't really an incredible song, but it's a good song to listen to on a 10 minute car ride or something. There's just other songs I'd prefer over it. Solid, but not awesome. 8.5/10Prodigal - Following theWORST opening chords ever known to man, the song actual becomes rather likeable with a good chorus and...uhmm,, bizarre lyrics. Not as bad as Mastertape, though. Some chords chosen here hurt it. Good chorus, though. 7.5/10.3 - Without a doubt, the masterpiece of the album. Excellent sound work all around. It's impossible to describethis song. It's more or less four minutes of variations on the same exact four or five notes ( a bass playing those, stuff going on around it), butthe way the song progresses is so well done, you just want to listen to it over and over again. Excellent work all around, THE BEST song on here. My favorite parts revolve around all the synth work done, it really shines and makes the song a masterpiece. 10/10The Creator Has A Mastertape - Ehh...quick fix if you need something to listen to and don't feel like devoting your listenign time actually listening and appreciatiing the genius in other songs. Whoof, that came out contorted. Basically, it's a good song, but nothing special. Not good, not bad, and some rather wacky lyrics that made me a bit skeptical of Wilson's train of thought when he was making this song. Not good, not bad. Fast, upbeat song with good guitars, but much like Wedding Nails, it just doesn't have anything about it that shines. It's still not bad, though. There really isn't a \"bad\" song on this album, thus the 5/5 rating. 8.5/10 (for the song)Heartattack in a Layby - Nice mellow song with some good keyboard work. Nothing bad, nothing awesome, but all around good stuff. Not much to say. 8.5/10Strip The Soul - Take Blackest Eyes and Wedding Nails, and you get this song. Catchy, good material. Nothing extroadinary like .3, but nothing I can say is terrible, bad, mediocre. Good effort all around, worthy addition to the album. 8.5/10Collapse The Light Into Earth - Hmm, I dunno baout this one. Mellow with a lot of violin synth work. Pretty song, but it's not awesome. Probably my least favorite, cause basically, Heartattack in a Layby, .3, Lips of Ashes and Gravity Eyelids (to some extent) all did it better. Ehh, probably my least favorite. Bummer to end such a good album on this. 7/10I'm tired, don't wanna type anymore. Go buy it. Now. There's nothing truly bad on it, a couple good, a lot of great, and one, maybe two depending on taste, true masterpieces. There's your reason. Don't pass this up.I'd like to add a couple things. Re-submitted review, fixed some typos, changed some scores aroud (10 for Lips of Ashes, every time I listen to it I discover something new and better baout it. Some other scores boosted too), spaces hopefully added. I'd also like to say sorry to the real Fishy for stealing his name, heh. Next time I'll post under a different name, but to overrate my other review, apparently I have to post underthe same name. I hope that's right. Also, I'd like to say that I'd probably give this album a 4.5, 4.7 out of 5, not a perfect 5. However, lack a concise rating system holds me from doing that, so I give it the closest thing to a 4.5: 5 stars. No the album isn't perfect, but albeit one or two not so awesome songs, the album really does stand out as something special. Thanks."
    },
    {
      "reviewer": "Fishy",
      "date": "Posted Saturday, May 14, 2005",
      "rating": 4,
      "text": "In 2002 it was announced that the latest Porcupine Tree effort would be a bit of a heavy metal affair and this worried me as I didn't want one of my favourite bands to be turned into a metal band. By then the previous effort of the band of Steve Wilson wasn't what I would call a great record even if other prog lovers believed it was. \"Lightbulb Sun\" wasn't bad as a solid melodic rock album but the progressive influence was getting too thin to my humble opinion. It was obvious the band was heading for a more accessible direction in order to broaden their audience. To listen to \"In absentia\" for the very first time was kind of a relief. Sure the album has a rougher edge than previous PT releases with the guitar chords on the front of the sound. Overall the sound of the band stays pretty much the same even more than it did on \"Lightbulb sun\". In some ways I would call this a return to form but not too much. Apparently we had to wait till the release of \"Deadwing\" to accomplish this task completely.The opening chords of \"the Blackest Eye\" do suspect this is heavy stuff but soon it is clear it is not. This track has lots of memorable melodies to offer. On the background one can notice lots of acoustic guitars and atmospheric keyboards. \"Trains\" is just a little lovely pop track and could have been included on \"Lightbulb sun\" : light, pop and harmless but I never would consider playing the record for hearing this song. \"The sound of muzak\" is another track to have an enjoyable melody. The dubbed sound of the vocals on the chorus are characteristic for the latest Porcupine tree albums. This aspect of their music is often reminiscent to The Beatles and off course Pink Floyd. \"Lips of ashes\" must be the oddest track of the bunch thanks to the use of some interesting sounds. This intimate track holds excellent melodies and sounds like a fairy tale. On \"Gravity Eyelids\" you'll find the best of what this band has to offer. Like an opening flower which opens gradually the sound of this song is growing bigger ; near the end it becomes a large landscape of guitars, keyboards and stunning vocal melodies. Like other highlights of the PT catalogue this track could be used as a soundtrack for a moment in a science fiction movie where a giant saucer is slowly launched into space. This track justifies the buying of this album. On \"Wedding Nails\" you can figure out why some reviewers found this version of PT too heavy. This instrumental track is driven by metal guitar chords. In essence this is just a natural evolution from the point where Wilson released \"Up the downstair\". All typical PT ingredients are still present under a sauce of heavy guitars. The atmospheric keyboards still are awesome to listen to. \"Prodigal\" makes up another excellent track. It starts off quite laid back with guitar lines which do remind me on those on \"Dark side of the moon\" and that's also the case for the vocals. In the second half of the song, the powerful chorus shakes the atmosphere and turns this track into something even more exciting. The strings take the leading role on \"3\" which gives the track a dreamy mood. To the end the pumping basses and guitar lines add some power to it. Definitely one of the highlights of this album. I found myself very fortunate to notice the band rediscovered its qualities in creating fascinating instrumental sections. Wilson's vocals are alright but there's so much to discover in the instrumental side of this band that most of the tracks hardly needs vocals. Like on Deadwing, Wilson uses a lot of sound effects for the vocals but it's not annoying it even adds some mystery. An artist got to adapt his sound to the time he's living in. Wilson may not have the most powerful voice in progressive rock but I always liked the sound of it : sometimes whispering, sometimes pastoral, sometimes harmonic. On \"Strip the soul\" the band creates a sinister atmosphere once again. The mood gets interrupted by violent guitar chords of the chorus. The elaborate guitar melody which is gradually developed is most enjoyable although this is one of the heavy tracks on the album. The closing track is a closing track in essence. You almost can hear Wilson singing goodbye if you're not listening to the lyrics. The orchestral strings are emphasizing the emotion which is quite odd for a band who is constructing its music very technical way.It's been 3 years since this album was released and I still listen to it every now and then. For me this is the proof that this is a decent album which concludes some highlights worthwhile of checking out. As I said for me this album meant a welcome back for the dark and spacey atmospheres of their first albums. Although it is obvious PT has become a rather conventional progressive band when compared to the obscure material from the past. Every sound you hear has been polished by 2002 studio techniques and this gives \"In absentia\" a better production. And now for the low points. Some tracks seem to be more of the same and don't add nothing new although not one track is weak, just less memorable. Another thing I regret is that the symphonic sound is not explored a lot more than it is. My final point of critic is that the album lacks a real long epic. But these are just minor critical points. Still I would choose this album above some other PT albums like \"signify\" or \"Lightbulb Sun\"."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Sunday, May 29, 2005",
      "rating": 4,
      "text": "May hurt speakers if instructions not followed.So much informations has been said about this album and it made tremendous ruckuss at lauching, and 3 years later, the hard edges, the distorded voices, the sublime drumming and subtle keys are doing the trick from 0:00 till the end.In Absentia will seduce the heavy rockers. It's hard not to react when your speakers are sizzling like a guitar soaked in a deep fryer. The emphasis on such a cracking, distorded guitar sound will convince you that Porcupine Tree IS the prince of the new generation in progressive music: a new approach based on today's production and tomorrow's writing. The songs are really easy to get into with mellow parts and jump starts of pure adrenaline fury.Call it nu-metal or neo-grunge, whatever, this is an album to play at people who'd like to get out of the same old radio-pattern of Linkin Park, Three Days Grace, Three Doors Down or System of a Down.Long live the new King!"
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Friday, August 5, 2005",
      "rating": 5,
      "text": "What is it? Porcupine Tree beginning to emprise heavy metal music as well as album-level musical narratives in the form of a concept album about a serial killer. This concept album is constructed while the band is going through a peak in creativity and cohesion.Voice (4.5 stars) ? Steven Wilson's singing is confident, hitting all the right notes and melodies and still within the technical limitations of the vocalist. As mentioned in other album reviews, we may not have the most technically proficient singer, but sometimes all a song needs is an inspired singer that fits the song's intent. The vocalist may have certain limitations, range of mood is not it ? easily fitting the various styles associated with a concept album.Sound (5 stars) ? The band sounds very inspired as well, but with the added benefit of extremely well crafted songs. While the structure of the songs do not allow as much freedom for extended displays of musicianship, the band members use a balanced approach of complex subtle layering, diverse sound palette, and the right amount of pauses and relative silence. This, with the incredible sound engineering skills of Steven Wilson, result in a record that is not only extremely coherent and free-flowing, but also simultaneously raw and polished. I believe this is what makes the album sound so organic and timeless.Song (5 stars) Their pop elements remain as refined as ever while their prog rock and metal characteristics are utilized in a better, more balanced fashion, maintaining reasonable song lengths and restraining themselves from unnecessary experimentation. This is a confident Porcupine Tree applying everything they've learned thus far while avoiding earlier missteps. Their ear for melody and earworms is prominent, with unforgettable hooks scattered through the disc such as the main refrain of 'Blackest Eyes' or the borderline embarrassing but tremendously catchy choruses of 'Sound of Musak'. The songs are memorable also because the music is drenched in mood. The band greatly succeeds at not only arranging these masterful set of compositions, but giving them the right amount of character to keep the listener engaged.The character could be the cognitive dissonance in 'Blackest Eyes or the simple joys in fan-favorite 'Trains'. It could be the haunting passages of .3 or Lips of Ashes sucking you into a trance-state. There's also the effectively disturbing nature of Gravity Eyelids, Wedding Nails, Creator has a Mastertape, and album climax Strip the Soul. But you also get the gorgeous soul-crushing 'Heartattack in a Layby' or 'Collapse the Light into Earth' which are both among the best melancholia ever put on tape.Key Tracks: Blackest Eyes, Lips of Ashes, Gravity Eyelids, .3, Heart Attack in a Layby, Collapse the Light Into Earth"
    },
    {
      "reviewer": "TRoTZ",
      "date": "Posted Friday, October 14, 2005",
      "rating": 5,
      "text": "One of the best pieces of work PORCUPINE TREE have made. With in Absentia, Porcupine Tree continues to reinvent their sound, incorporating more and more METAL (RUSH, TOOL, death metal ?) influences, though not sounding a metal band, creating a still melancolic, but more darker sonority, in the whole.The 3 main qualities of the album (which was made to be listened as a concept album) are the very CATCHY THEMES (there are no weak points or low-standard songs, all the songs are at the same level and each one has something different to offer) helped by a IMPECCABLE EXECUTION which i refer the solid work made by the new drummer Gavin Harrison (for me, one of the best drummers the world has) and the always cathy and mellow guitar solos by Steven Wilson; and the EXCELLENT PRODUCTION, proportionating glossy arrangements.This is a very solid album, from the very start with \"Blackest Eyes\", for sure a \"must\" song in every PORCUPINE TREE concert from this on to the last ever gig of the band, opening with prog-metal kick-off guitars and then entering in a mellower cathy melody, created by the usual vocal corus (helped by the sweet part of the voice of Mikael Akerfeldt from OPETH). \"Trains\" is another hotspot to mention, exploring even more the progressive rock territory with accoustic guitars a la JETHRO TULL and exploring spanish tradicional music in the interlude. \"Gravid Eyelids\" is another memorable song, in 2 parts, the first with a dark and sad atmosphere created by keyboards exloding in a metal-prog guitar ending. \"Wedding Nails\" is an instrumental guitar masterpiece, the most metal of the badge. \"3.\" is another instrumental song, but this time in a symphonic wave. The album ends quite well with the folk-blues-jazz-rock \"Strip the Soul\" and with the crying melancoly of \"Collapse the Light into Earth\".One of the most accomplished albuns of one of the best rock band of the present. The Aqualung of new millenium."
    },
    {
      "reviewer": "frenchie",
      "date": "Posted Saturday, October 22, 2005",
      "rating": 3,
      "text": "Once again I still don't \"get\" this band. As strong as this album is, it is just as difficult to appreciate as all the others I have heard. Steve Wilson can obviously produce some good tunes, but they lack excitement and emotion. I can recognise why PT have a big following, but there is nothing here to pull me into their music.I understand this one of the best albums, but they all get boring quickly for me and I often fail to be moved by the songwriting. Another 3 star effort for me."
    },
    {
      "reviewer": "Rivertree",
      "date": "Posted Tuesday, June 6, 2006",
      "rating": 4,
      "text": "The Sound of Porcupine TreeThis release was my first contact with PORCUPINE TREE. I somewhere heard the song 'The Sound Of Muzak' and from this moment on I started to be curious about their work. For me 'In Absentia' is the best studio output I know (and I know nearly all of them). First of all it is the great variety resultant from the great songwriting of Steven Wilson. Good to see that he remains resistant to the enticement of writing more mainstream music like he does with BLACKFIELD.Metalheads or Hardrocker can enjoy the strong guitar playing f.e. in 'Blackest Eyes', 'Wedding Nails or 'Strip The Soul'. A Neoprogger might love songs like the relaxed 'Trains' , 'Sound Of Muzak' with a brillant mix of acoustic and electric guitars or 'Lips Of Ashes' as a ballad with a wonderful melody. 'Heartattack In A Layby' on the other hand is minimalist melancholic psychedelic pur. 'Gravity Eyelids' is mixing up all this styles in a perfect way. The other songs (including the bonus tracks) are also good but cannot reach the height of the former called. So this album decreases a little bit on the run to the end. But don't get me wrong - I recommend it in any way as it is - an excellent example for making modern progressive rock music."
    },
    {
      "reviewer": "Fight Club",
      "date": "Posted Sunday, June 11, 2006",
      "rating": 5,
      "text": "This will be the first review I have submitted to progarchives as this is the one album that absorbed me directly into the genre. I think when reviewing this album one has to review it from the standpoint of someone who is just getting introduced to the prog genre. Since this is one of the bands that's up there in popularity I believe it will be one of the first bands explored by someone new to the site, so I won't go directly into how \"progressive\" it is. The truth that Porcupine Tree has a very distinguished sound. This was the first album I picked up by them after just hearing about it on a forum about a year ago. I listened to it one summer morning and was blown away. At the time I was into mainly classic rock not very much prog. I had heard Dark Side of the Moon, Images & Words and some others, but none really seemed to take major flight away from classic rock. Now this album was a very new and hard to describe sound. The mix is perfect. The vocal harmonies are are very nicely done and the way they switch off between acoustic and heavy electric blends so well you barely notice the transition. When I first heard this album I couldn't stop listening to it. The sound was just so rich and emotional and I just floated off to another place while listening to it. This is probably one of the first albums that made me realize that an album could be more than just a collection of songs, it could be an \"entity itself\" in Steven Wilson's words.Blackest Eyes - From the opening guitar riff through the melancholic vocal harmonies this a beautiful song. There's something so catchy and uplifting about the song, even though the lyrics are not meant to convey that. The thing is that it shows the character, in which In Absentia revolves around, feels alls these horrid twisted emotions, but it does not occur as twisted in his mind. This is a very catchy song and makes a really great opener.Next we move onto Trains - This is almost as close to perfection as song writing can get. Very emotional and well orchestrated. Every part of the song melds so perfectly into the whole, the final outcome is near flawless. The acoustic guitar with the synth effects behind it makes a great ethereal/spacey feeling. This song is proof that Porcupine Tree isn't a band where each member plays seperate instruments that go into a song. There a band where each seperate instrument makes one coherent sound.Lips of Ashes - This is the first track on the album that really sucks you into the trance- like state that keeps you absorbed in the album. Something about the surreal string arrangements that makes you feel like you're in a different world. A world called In Absentia. This is a very nice spacey track.The Sound of Muzak - This is an album highlight for me. The song has a very interesting arrangement between the time signatures and odd drumming. To anyone with limited musical knowledge the drumming would sound simple and unoriginal. However most people hearing this song hear all the complexities of Gavin Harrison's drumming. The mixing is very well done on this track as well. The harmonizing in the chorus is incredible. This is a song everyone can appreciate, from the emotional chorus to the guitar solo and then thru the outro this song is stunning.Gravity Eyelids - This song is even more of a trip than the last. The song opens with eerie synth effects and muffled drum tracks. This is probably the song that brings one into the eerie dark state of the album. Some ways into the track, a monster guitar riff breaks out into a complete tsunami of distortion. It's quite intense, with the layered riffs and keyboard effects piling ontop of one another. Then it suddenly loosens into the surreal state again and closes with some nice eerie slide guitar from Steven Wilson.Wedding Nails - This track was the first to blow my mind when I first listened to the CD. When I first popped it into my comp is was busy messing around and didn't quite pay attention to the tracks before this. They just floated into my head pulling me into that surreal state of consciousness without me even realizing it. This track awoke me. It starts off with a nice guitar riff then goes completely nuts. It really wakes a person up. I woke up from the trance and thought to myself \"holy crap, what is this sound??\" Just sitting there with my mouth agape. Then I went back and replayed the disc from the beginning and was astonished by the music.Prodigal - A very nice mellow track. Just as the others, the mixing is incredibly clean on this one. Definately one of my favorites off the album as the chorus draws in and then delivers 2 stunning guitar solos. Amazing song..3 - This is one of the first space trips I have encountered in music. The string arrangements and synth effects are done very well and convey all the right emotions that the band wants them to convey. Some parts put a nice chill running down your spine. Very nice song.The Creator Has A Mastertape - Here's another track proving Gavin Harrison's skill as a musician! This is a very bizarre song. I can hardly describe it except for saying that it's uhh... bizarre! Haha, well just listen. Definately a good song.Heartattack In A Layby - Very nice relaxing song. Depressing in a way. The guitars and vocal harmonies are very nice on this track and leads quite well into the next song.Strip The Soul - One can tell why this was a single off the album. Driving guitars and looping basslines galore. One of the first tracks where I noticed Colin Edwin's ability to make a bassline that sucks you right into a song. The only problem I can say I have with this track is that it's maybe a minute too long. Very nice though. Here you can tell that the album has gradually been getting heavier to fit the storyline. Nice work!Collapse the Light Into Earth - Now all the anger and chaos subsides into this song, Collapse the Light Into Earth. This is a piano oriented song and it serves well to illustrate the emotions at the end of this album. The vocals harmonize well once again and I think this song is a perfect closer for this perfect album.All in all, In Absentia is an experience for someone just getting introduced to prog. To someone who has been quite absorbed in the genre for some time it might not come off as amazing and original as it does to someone who is a modern rock/pop fan, but they can both agree on one thing. Whether you're listening to it for the complexities of the arrangements or the quality of songwriting; In Absentia is an incredible listen."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Monday, October 9, 2006",
      "rating": 5,
      "text": "Thanks solely to this website I have found another great album to enjoy for years and years to come. This band's great storehouse of musical influences are obvious throughout. However, unlike many other artists who end up creating music that just sounds like an inferior version of those original influences, these guys have produced songs that can more than competently stand on their own merits. If the first four songs don't convince you then you might as well trash the cd. They are brilliant in every facet. The production quality, the arrangements, the engineering, the composition skills and the musicianship are five star. If there is a low point at all it's on \"Wedding Nails\" which sounds like the riff to \"One Way Out\" by the Allman Brothers performed in the diatonic scale. It's not so bad, it just doesn't fit and sorta retards the momentum that has built to that point. But the following tune \"Prodigal\" and the gorgeous \".3\" raise the level back to incredible heights and it never lags again. One thing these boys understand is the concept of dynamics and they've learned well from Led Zep, Tull, Peter Gabriel and even Trent Reznor the art of never becoming predictable during the course of a song. While the whole album rocks, the tasteful use of acoustic guitars is so refreshing and the vocals sometimes bring to mind the experimental and haunting harmonies of Crosby & Nash on some of their work together. And few albums end as gracefully and hypnotising as this one with \"Collapse The Light Into Earth.\" It is beautiful in its simplicity. In essence, this cd epitomizes what I listen to progressive rock for. \"In Absentia\" may be my first excursion into the entertaining and exciting world of Porcupine Tree but I can assure you that it won't be my last. It doesn't get much better than this."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Thursday, October 26, 2006",
      "rating": 5,
      "text": "There is some heaviness on this record, but I think there is a nice balance. There are some \"Lightbulb Sun\" / \"Stupid Dream\" type songs like \"Trains\", \"Prodigal\", \"The Sound Of Muzak\" and \"Heartattack In A Lay By\". And songs like \"Blackest Eyes\", \"Gravity Eyelids\", \".3\" and \"Strip The Soul\" that either are heavy or have some heavy outbreaks. Aviv Geffin from BLACKFIELD and John Wesley both add some background vocals on \"The Sound Of Muzak\" and \"Prodigal\".\"Blackest Eyes\" opens fairly softly but that is blown away quickly by a heavy onslaught. Vocals before a minute. Man I love Steven's vocals.This song just moves me. Great chorus too \"...I got people underneath my bed, I got a place where all my dreams are dead, swim with me into your blackest eyes\". Riffs 3 minutes in followed by a calm, then the chorus comes back. This is one of my favourite PT songs, but then again there's a few of them on this album including the next one. \"Trains\" is simply classic and so tasteful. Strummed guitar and fragile vocals are so simple yet so emotional at the same time. An outbreak after a minute as Steven sings \"A 60 ton angel falls to the earth, a pile of old metal, a radiant blur\". Love the guitar after 2 minutes. This song is pure joy for me. \"Lips Of Ashes\" is psychedelic with acoustic guitar to start. Reserved vocals a minute in. Vocal melodies before 3 minutes followed by a melancholic guitar solo. Nice. \"The Sound Of Muzak\" opens with a good beat as the vocals come in. It has this amazing sing-a-long chorus too.The guitar solo after 2 1/2 minutes is fantastic ! Vocal melodies later. \"Gravity Eyelids\" is my favourite on here. I just get blown away everytime I hear the mellotron in the intro. A beat comes in then vocals as the mellotron continues. The chorus is emotional as piano and synths come in. After 4 minutes the riffs hit and run until we get a full attack. Amazing ! Check out the synths too.\"Wedding Nails\" is a rip snorting instrumental. Riffs with spacey synths after 2 minutes, and I love the guitar that plays over top. \"Prodigal\" sounds great and the chorus sounds even better.This is just a feel good song. One of my favs. \".3\" has this good bass intro as synths then drums and guitar join in. Nice rhythm to this one. A change before 3 minutes as the rhythm stops and a psychedelic haze follows.The rhythm returns 4 minutes in. \"The Creator Has A Mastertape\" opens with guitar and then a beat takes over. Nice bass. Processed vocals before a minute.The synths before 1 1/2 minutes sound great. A killer sound 2 minutes in as contrasts continue. \"Heartattack In A Lay By\" opens with the sound of cars going by as synths and guitar play gently. Vocals come in. Backup vocals 2 1/2 minutes in. Cars can be heard driving by as the song ends. \"Strip The Soul\" opens with an ominous bass line with synths. Drums then vocals follow. It kicks into gear before a minute.The contrast continues. Nice interlude 2 1/2 minutes in of drums and some atmosphere before it kicks back in. \"Collapse The Light Into Earth\" begins with piano as vocals come in. Mellotron 1 1/2 minutes in. Strings after 3 minutes.This is the first PT album I heard and it's still my favourite."
    },
    {
      "reviewer": "evenless",
      "date": "Posted Tuesday, November 21, 2006",
      "rating": 4,
      "text": "With the 2002 release IN ABSENTIA PORCUPINE TREE clearly moves into a different direction with their music compared to the 1999 album STUPID DREAM and the 2000 album LIGHTBULB SUN. Better? Worse? NO: JUST DIFFERENT! I guess that's why they call it PROGRESSIVE music. Because the band is progressing as well and exploring its boundries. Maybe that's why PT is so hard to be \"boxed\".All together IN ABSENTIA is another great PT album with some highlights, but also with some flaws. Highlights would be: Trains, The Sound Of Muzak, Heartattack In A Layby and Collapse The Light Into Earth. Flaws would be: Wedding Nails and The Creator Has A Mastertape. To bad those 2 tracks were not deleted or replaced. If so it would have been a 5 star album all the way. Now I rate it 4."
    },
    {
      "reviewer": "Chris S",
      "date": "Posted Thursday, December 14, 2006",
      "rating": 3,
      "text": "Ah...Porcupine Tree. Thanks to Prog Archives I ventured out and acquired a couple of their albums. What was everyone raving about? Well I have to say they are a great band and refreshing especially as Prog Music in the 90's/00's has diminished in terms of the commonality of 'big gun' bands being present,Steve Wilson is an incredible talent as is Richard Barbieri of Japan and Rain Tree Crow fame. The album itself I would classify as good but not excellent.Songs like ' Trains', ' Heart Attack in a Layby' and ' The Sound of Musak' are the album highlights. Porcupine Tree have a distinctive sound of that there is no doubt. I do find their music loses it's 'shelf live' more quickly than some early 70's prog bands where incredibly the music sounds ageless.I think Porcupine Tree did even better with Deadwing but still In Absentia is a very good album"
    },
    {
      "reviewer": "Eclipse",
      "date": "Posted Saturday, January 20, 2007",
      "rating": 3,
      "text": "This is probably my favorite album from PORCUPINE TREE. It is heavier than Sky Moves or Lightbulb Sun, since there is a stronger metal touch here. The music is moving and varied, though. There are heavier passages, like the wild instrumental \"Wedding Nails\", dreamy and spacey passages like the album's best track, \"Lips of Ashes\", and true rockers like the opening \"Blackest Eyes\", which flows very well into the moving \"Trains\". There's not a bad song here, and the band is here to prove that modern music can be decent too. It is nothing mindblowing, though, hence the three starred rating."
    },
    {
      "reviewer": "Slartibartfast",
      "date": "Posted Saturday, January 27, 2007",
      "rating": 5,
      "text": "This album was my first by Porcupine Tree. I was introduced to this band by AOL's progressive internet radio station. I ordered it from BMG's music club as one of my intro selections. I'm sure many of you diehard prog fans know these clubs are mostly a waste of time. They tend to have mostly stuff you already have and few things you want to get.When I first listened to this CD I became hooked on the band and promptly raided as much of their back catalog as I could get my hands on. Unfortunately in 2004 there was a lot of stuff out of print. But I like everything I've been able to lay my hands on.The first thing that impressed me was the CD booklet. It looks like some effort was spent on the art work. Of course, cool album art does not in and of itself enhance an album, there has to be substance in the music. My first musical impression was that the gunk gunk gunk, etc. heavy metal guitar bits were odd but interesting. There's also some Crosby, Stills, and Nash like vocals here and there. But the predominant sound I was hearing was progressive. It has a nice complexity and still retains a nice level of accessibility. (Not that I've been one to shy away from difficult listening music).The music and the musicianship was solid. The danger in becoming in a Porcupine Tree fan is that Steven Wilson is rather prolific. After you collect all the PT releases, there's an even more massive collection of other projects he's done.No point in doing a track by track here, 233 ratings and a smaller s-load of reviews. If you're a big fan of the \"old school\" prog, you're depriving yourself if you don't check the guys out. My favorite lyric on the album is \"One of the wonders of the world is going down.\" Just because I have a dirty mind."
    },
    {
      "reviewer": "Melomaniac",
      "date": "Posted Thursday, February 15, 2007",
      "rating": 5,
      "text": "Porcupine Tree's finest hour.In Absentia follows the logical evolution Wilson and company started with Signify. Shorter songs, strong melodies, a harder, heavier (borderline metal) sound (probably due to Wilson's producing stint with Swedish death metallers par excellence Opeth), sumptuous vocal melodies, great spacy keyboards, all packed in masterfully written songs and upgraded by an amazing production job only Wilson can deliver. It is to be noted that In Absentia is also Gavin Harrison's first album with PT, and he brings the band to another level with his amazing creative playing. Precise, tight and colorful, his drumsticks are like paint brushes coloring the percussive side of PT. Neil Peart's praise of Harrison's work says it all. Elegant indeed !Darker than any of PT's previous offerings, In Absentia is an album of contrasts. From the opening metal riff of 'Blackest Eyes' to the acoustic driven delight called 'Trains', Wilson and company never let up the creativity and diversity throughout the entire album. From brutality to beauty and back again.All songs are great, nothing remotely weak here, and the running order balances the album perfectly, allowing you to breathe when necessary and headbang when you need it. My favorites (though I love them all) are the mini epic 'Gravity Eyelids' and the wondrous 'Heart Attack In a Layby', showcasing some of the best vocal melodies and harmonies these ears have heard. I was amazed to find out they could pull this one off live, and I was mezmerized when I witnessed it.A cornerstone album, as important to this decade as was OK Computer to the 90's. An essential masterpiece, a must-have, I am short of words to say just how fantastic this album is. Get it, or suffer the consequences !Five Stars and you better believe it !"
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Tuesday, February 27, 2007",
      "rating": 4,
      "text": "Wilson goes heavy.This album introduced me to the works of PT, and although it's not my favorite or their most complete, it was intriguing enough to get me to explore more of the band. While this is very much a more commercial release than their earlier material, it is still quite good and the songwriting is nothing short of excellent, even if it is not as progressive as previous outputs.For a commercial album, it has the ability to be incredibly diverse, with a much wider variety than would be expected. The heaviness of the material I think is an apparent influence from SW's collaboration with Mikael Akerfeldt of Opeth. Don't be scared though, there's no growls. The album remains very melodic, insightful, and Wilson is still on the top of his game. It's really hard to distinguish the quality of the tracks, but I must say I do prefer Trains over the others, if not for the very simple yet intriguing guitar lines.If previous PT albums seemed to experimental to you, or you are looking for a more modern sound, In Absentia may be a perfect fit for you. The songwriting abilities are the best aspect of this band by far, as SW is the man when it comes to crafting music. Not their best, but certainly a fine little piece of music."
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Thursday, April 12, 2007",
      "rating": 4,
      "text": "Another Shift\"In Absentia\" is perhaps their most beloved work and represent another shift in sound. This album took on a more aggressive stance with the addition of more metal riffing and is also notable for the entrance of Gavin Harrison on drums. Harrison is equivalent to Neil Peart to many prog fans and his talents give PT a huge advancement in their sound. \"Blackest Eyes\" and \"Sound of Muzak\" continue the band's flirtation with quality modern pop-rock melody while \"Heartattack in a layby\" and \"Gravity Eyelids\" provide an eerie, borderline psych vibe that continues to evolve with each release, something beautiful and sinister at the same time. The combination of moods in the songs and styles in the approach are what make this band so successful, and the next two titles would continue to build on this one. While I was fairly luke warm on this album years ago, it has grown on me over time."
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Thursday, June 14, 2007",
      "rating": 2,
      "text": "This album is highly regarded among PT fans, if not their most well regarded, but it was a deception for me, because there are some great songs, but their tendency to become more and more alternative pop/rock. To be fair this is among the bands i can't stand. Sure is some good songs like Trains and Wedding nail, but the rest is boring, and i can't listen the whole album at once. I have and listened thousands bands who sounds and play better than this Porcupine Tree. I don't know what is the hype with this band that everybody is on fire when is hered the name. For me is not even in my top 100 bands. Sorry to diseppointing the fans but 2 stars i guess is to much for this album."
    },
    {
      "reviewer": "fuxi",
      "date": "Posted Wednesday, July 4, 2007",
      "rating": 3,
      "text": "This is a potent collection of rock songs which strongly remind me of classic Pink Floyd, of the Australian band the Church (with its nocturnal moods) and of the post-punk band Wire's most melodious moments. (Don't poke me, I KNOW that Wire and the Church themselves were influenced by the Floyd.) If I hadn't discovered Porcupine Tree via Prog Archives, if I'd heard this album at a party for example, I wonder if I'd have dubbed it 'prog rock'. Sure, the vocals tend to be in a Floydean vein; there are a couple of Gilmour-like guitar outbursts, some splendidly over-the-top orchestral moments and even a couple of mellotron effects, but there are no keyboard solos (hardly any keyboards at all really) and the music sounds no more complex than ACHTUNG BABY.If you take a look at the reviews this album has received, you'll notice that (as so often) this site's regular collaborators have mixed feelings, while SO many guest reviewers have awarded the album five stars that it has greatly benefited Porcupine Tree's position in the \"Top 50 albums\" poll. In the eyes of many, Porcupine Tree is the acceptable face of contemporary prog - and I'll admit IN ABSENTIA is more fun to hear than anything by Neil Morse or the Mars Volta. There are a couple of \"fortissimo\" metal-type moments on the album, which rather get on my nerves (inspired by Opeth, apparently), but they seem to be uncharacteristic, so I'll be curious to explore PT's earlier releases."
    },
    {
      "reviewer": "Dim",
      "date": "Posted Friday, August 10, 2007",
      "rating": 3,
      "text": "The great leap forward for the former ambient space rock band. Filled with metal, guitar solo's, spacy songs, beautiful ballads, and political messages. The only thing preventing me from giving this album a masterpiece rating, is it's lack of a phenominal song. Every song is quite superb, maybe except the creator has a mastertape, this album along with foabp, is the only PT album from Stupid dream plus, that is able to balance out the metal edge and the pshyc music, to where they compliment each other quite nicely. Besides the disapointing lack of a masterpiece/ epic song, the whole album is generally very enjoyable.I guess I will review every song, for this album intrigued me before I got it, and I wanted to know more about each song the more I learned about this famous album.Blackest eyes- I can imagine fans of the original porcupine tree cringing with digust after hearing the first minuete of the song. Pretty much a metal headbanger when there is no singing, and a smooth rocker with vocals. A good and exciting opener to me, but a bit to over the top to give it a super high rating. 4/5Trains- Apparently this is the famous PT closer when in concert. Very beautiful song, with some very pretty acoustics and a phenominal instrumental section. I'm not too keen on the whole love song thing though. 4.5/5Lips of Ashes- One of my favirote songs, Very harmonious lyrics, with a spacey rythym backround, and an epic guitar solo/ lead line. I wish it had a little more depth to it and more solo time. 4.5/5Sound of muzac- Another PT landmark, a political message saying that music is going the wrong way, that it will cease to entertain, but just neutrilze you for a while. If you are n avid prog lover than you know this song is true, I believe it, just turn to your mainstream radio station and tell SW he's wrong! Musically, sounds a bit new wavey, good guitar solo, but once again not to complex or chllenging. 4/5Gravity eylids- Great song, the first song on the album that has a lot of complex structure, and technology really does make this song sound like a pink Floyd song of the future. The song does kind of meander though, it's only seven minuetes long, so I guess it might just be my musicl tastes. 4/5Wedding nails- A good instrumental, but nothing compared to the old ones, too much metal and not enough structure... once again. Though this song does flow like normal PT songs, a single guitar riff, and everybody else flying around it. But I feel ther is too much guitar, maybe thats why this album is not the greatest, too much guitar, not enough anything else. 3.5/5Prodigal- Really cool instrumental bridge! Though, I'm not very fond of the pitty party lyrics, the musicianship is great. Sadly, the tree would try and reinact this song on Deadwing, but make those sons just soundlike wannabe classic rock songs. 4/53- maybe my favirote, because it reminds me of Sgnify, they're greatest album. It just takes a load off you mind as it flows very effortlessly, but they use a very annoying and distracting bass line throughout the song. (which they do in the creator has a mastertape and strip the soul, which are equally annoying) 4.5/5The creator has a mastertape- probably my least favirote on the album, too agressive, too dark, too not porcupine tree. Though I do like the use of the voice overs, which he uses in the next albums, where they sound good on those as well. 3.5/5Heartattack on a laybye- Not sure I understand this song, it reminds me of 3, but a little more pshycodelic, and trippy. Not very many parts that stand out, but it's better than the last song. 4/5Strip the soul- A fun song, kind of an aggressive song like creator, but sounds more like PT than some wannabe metal song. After some hard lyrics and harder music (including the annoying bassline),an acoustic part come in where SW sings the chorus a coupel of times, while THREE guitar overdubs come in, this album is overly drenched with guitar! Afterwards, a very silent part... then... the most bone crushingly heavey thing I have ever heard! For a non metal band, they can be quite heavy! 4.5/5Collapse light onto earth- Following the tradition of classic laid back porc tree closers, a very pretty song, that can almost bring tears to my eyes after being punched in the face by that last moment in strip the soul. THE PIANO IS BEAUTIFUL! 4/5Yuck, bad review, I'll need to fix this! 3 stars"
    },
    {
      "reviewer": "laplace",
      "date": "Posted Sunday, September 9, 2007",
      "rating": 1,
      "text": "Porcupine Tree decide to split the difference between nu-metal and alternative britpop-style rock and in our infinite wisdom, the resulting album shoots directly and deservedly into the prog consciousness. Wait, what? Are we the \"In Absentia\" market? Have we lost our collective judgement? I felt deceived the moment I pressed play but I bravely endured this godforsaken CD for the purpose of a review, only to discover music buried under a stampede of footprints from the '90s rock-world's worst culprits: Korn, Sevendust, Rage Against the Machine and many more.To be fair, during the quieter moments of the CD there are vague hints, only here and there, of a band that was once influenced and absorbed by psychedelic rock and the stadium Floydisms that were built out of it, and elsewhere you can hear the melodic contributions of Phil Collins to pop, recaptured in a harder rocking format. \"Lips of Ashes\" is a good example of these two moderately-benign influences being entwined to pleasant effect, then baptised in a dream-poppy reflecting pool. \"The Sound of Muzak\" does a passable RadioTool impression and although the chorus is irredeemibly awful, the textural quality of the song really is kind of neat - in fact, the musicianship is generally craftsman like, and Wilson's voice, though limited, has an endearingly frail quality to it that works well thanks to the downtrodden lyrical concept. That's all good news.The problem is that at least half of these songs are straightforward nu-metal or college rock cliche-athons, with only cursory attempts at concealing this unsavoury truth. The extended track, \"Gravity Eyelids\", claimed as the favourite of many previous reviewers, contains a \"down\"-section so disturbingly similar to Korn's verse trademark - what with individual trem notes hanging in mid-air, foggy with trip-hop beatdropping and random sci-fi chord collections - that I feared I might hear a distorted crunch and the trolled words, \"Bring it doooooown\"... and later still in the same song we get to hear a prime RAtM blues-crunch IQ-reducing rawk riff. NO THANK YOU.Wedding Nails promises a return to sane and relatively-prog-related music by throwing out a Voivod horn-throwing fourthy metal riff and then manages to ruin it by using funk metal as a substructure. Brilliant. And so it goes on, song after song exhibiting unwanted influences from the angst-peddling college crowd - Korn's legacy in particular recurs frequently. It truly makes me wonder how peopledon'tcringe through this album.I'm not going to write a conclusion to this review because it's obvious what I'm going to say. Instead, I'd like to close by saying that \"The Creator Has a Mastertape\" starts with a pretty funny swerve of the \"Super Metroid\" item room theme. Dorky, wasn't it. ;P"
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Monday, October 1, 2007",
      "rating": 3,
      "text": "\"PT\" is a very prolific band. Almost each time, they achieve good results and this one will be no other. But I would have expected more, actually. Wilson has collaborated with \"Opeth\" at different levels and you can hear this influence in several songs from this album. The other tendency will be to write more short-formatted pop-rock songs instead of true space-rock ones. As usual some acoustic moments will complete the whole.There are some tracks truely on the hard side like \"Blackest Eyes\" which is a very powerful song and the most commercial one here. Also one of my preferred one because of its nice melody. \"Wedding Nails\", on the contrary has no big deal to offer. Repetitive riff, aggresive but meaningless. Vaguely spacey for a while but more than anything improvised. Noisy and very much dispensible. And \"Prodigal\" doesn't really reach me. Average at best.To compensate these harder songs, some mellowish like \"Trains\" has to do the job. A folk ballad for most of it (except the very end). Not memorable, nor brilliant. Hand clap at the end reminds \"Ommadawn\" part I (also the closing section). \"The Sound Of Muzak\" is a more traditional \"Porcupine Tree\" type of track. Beautiful melody for the chorus, some pleasant background keyboard and lots of off- beat drumming. Good but not great.\"Gravety Eyelids\" is a combination of both. Spacey and melancholic for most of it and heavy beat during the last third of it; very much \"Opeth\" oriented. Just average IMO.The second very good song on this album is \"3\". Spacey opening (at last), hypnotic beat, melancholical vocals, emotional keyboards. A great combination really. It brings this album again in the good territory but it is unfortunately directly followed by \"The Creator\". This sounds very poor : a very noisy one, almost punkish at times and the heavy/funky \"Strip The soul\" is not my cup of tea either. So, even if there are no real bad song (maybe \"The Creator\") I can't say that I am submerged by enthusiasm listening to this album.I am of course not a \"PT\" maniac, but I can't rate this album over three stars. Two great songs, a bunch of good ones and several average ones. That' s my feeling."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Wednesday, October 3, 2007",
      "rating": 4,
      "text": "This album always leaves me a bit confused, as the sum doesn't seem to add up to more than the original parts. After the terrific opening four songs, the quality becomes very hit or miss for me, and overall In Absentia lacks a cohesiveness that I need for an album. Plenty of great songs, some average ones, and not especially well-linked. There's certainly nothing wrong with writing singles, but they need an overall diversity and quality that In Absentia doesn't quite deliver.Blackest Eyes, Trains, Lips of Ashes, The Sound of Muzak. What a way to open an album! Plenty of heavy rock, incredible melodies, beautiful harmonies, and fresh sounds. Obviously these guys have quite a lot of talent (both playing and writing), and it's on full display with this set of tunes. Harrison on drums is particularly impressive, and Wilson shows a nice diversity of guitar tones. Unfortunately the rest of the album can't live up to this quality.The highs: Wedding Nails, Prodigal, .3, Strip the Soul. First of all, none of these tunes are as good as the opening songs in my opinion. However, I find each enjoyable, from the heavy, unrelenting riffing of Wedding Nails, to the floating steel guitar on Prodigal to the spacey guitar and mellotron on .3. Also, once Strip the Soul gets going, and you immerse yourself in the lyrical content, you are in for one heavy, bleak ride.The lows: Gravity Eyelids, The Creator Has a Mastertape, Heartattack in a Lay By, Collapse the Light into Earth. There's nothing really grating or bad here, but these seem to be slow (except The Creator...) and uninteresting, though Gravity Eyelids does have a nice final half if you choose to make it that far.Given the high praise and success of this album, I'm very surprised that the Tree later made Fear of a Blank Planet, though I'm certainly glad that they gave the theme album and extended pieces a try again. Probably a good halfway point between prog and radio friendly material, In Absentia fails to really excite the progger in me."
    },
    {
      "reviewer": "The Crow",
      "date": "Posted Wednesday, October 31, 2007",
      "rating": 4,
      "text": "After recording with Opeth, Steve Wilson made his music harder... And I love it!\"In Absentia\" is diverse, like \"Lightbulb Sun\" was... But much more. The hard riffs are really harder than everything than Porcupine Tree made before... The psichodelic elements are here, and the typical Wilson's experiments and innovation... But the main innovation is the mind-blowing riffs in songs like Blackest Eyes, The Creator has a Mastertape, Gravity Eyelids, Strip the Soul... I love this mixture of the paceful Wilson's voice, with his mellow guitar solos wiht this savage guitars rythms... This fact make the Porcupine Tree's music ever more diverse than before, and really interessant to listen to.This new Porcupine's face would be really perfectionated in \"Deadwing\", better than \"In Absentia\" in my opinion, with a real and clear direction... While \"In Absentia\" its a little erratic sometimes. Some songs are just great, but is not a flawless album... Lips of Ashes is a little boring, a song in the style of the Steve Wilson's project No-Man; Gravity Eyelids is just acceptable; and other songs like 3 or Heartattack in a Layby don't leave a deep mark... I miss some long songs here too, a Wilson's speciality.Ok... But Strip the Soul is just great, Blackest Eyes is a perfect start, The Sound of Muzak has a great guitar melody and chorus, Prodigal mix pop melodies and heavy riffs in a sublime way, I love the Barbieri's piano in Collapse the Light Into Earth... The album has a lot of memorable tracks. Conclusion: a change in the Porcupine Tree's music... All the typical Wilson's elements are here, but the strong and heavy guitar riffs are a new thing, a fact that gives the album a lot of variety and makes it really enjoyable in my opinion. And this new way of making music, would be even better in later albums like \"Deadwing\"... \"In Absentia\" is not as good as this masterpiece, but it's really near... An excellent album.My rating: ****"
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Wednesday, November 7, 2007",
      "rating": 5,
      "text": "Like a rich banquet of sounds and emotions, \"In Absentia\" delivers musical delights which positively destroy expectations with powerful, dynamic songs, and flawless production-- all to the elegant playing of these four artists who have, in my opinion, created one of the finest recordings ever.There is not a single moment of boredom, clich�, or awkwardness to be found here-- the songs soar with meaning and poignancy. Creative, energetic playing and lyrics distinguish \"In Absentia\" even among the band's already distinguished works, and is the only album of theirs (to date) which I would say is a masterpiece. It has something for everyone, and is the finest example of Steven Wilson's talents as a musician and songwriter.An absolute must have, and a contemporary cornerstone of progressive music.Songwriting: 5 Instrumental Performances: 5 Lyrics/Vocals: 4 Style/Emotion/Replay: 5"
    },
    {
      "reviewer": "russellk",
      "date": "Posted Wednesday, November 28, 2007",
      "rating": 5,
      "text": "This is the archetypal second-stage PORCUPINE TREE album, the one on which STEVEN WILSON perfected the hybrid space rock/singer-songwriter meld. It is the album I loan to my friends curious about the development of progressive music since the 1970s, and without exception it stuns them with its scope and depth.Not because PORCUPINE TREE is a direct descendant of bands like GENESIS, YES, VAN DER GRAAF GENERATOR and GENTLE GIANT: clearly, it is not. Instead, the band has taken from many sources, progressive rock being one of them, and has put together something different. Something with feeling, with spirit, with superb musicianship, and something substantial enough to return to again and again. I see this album as 'Stupid Dream Mk III', and third time is indeed the charm. The brakes are off, the emotions grind and soar along with the guitars and synths, the messages hammer at us along with the rhythm section, and every interesting choice of arrangement or instrumentation simply serves to delight us even more.There are no mistakes here. Unlike 'Lightbulb Sun', the progressive moments aren't corralled into the latter part of the album. Unlike 'Stupid Dream', the album isn't pop-heavy. 'In Absentia' combines elements of the British pop legacy (THE BEATLES), the harmonies that infuse American West Coast bands such as THE EAGLES, the psychedelia of the late 1960's and its offshoot, the space rock of the 70s, along with progressive metal tendencies (WILSON's work with OPETH begins to surface in this album). Put plainly, it is a skilful amalgam of beautiful tunes, wonderful vocal work, stellar percussion and bass, with heavy moments and blistering guitar passages, all on a solid compositional base. A recipe for enjoyment.You get most of it in the first track. After a brief, gentle intro, 'Blackest Eyes' roars into action with a stellar riff, which gives way into a deliciously poppy verse and chorus. Lyrically outstanding, the song sets out the band's stall: look how comfortable they are here. Compositionally they hold the second appearance of the riff until two-thirds through the song, subtle rather than bludgeoning. The track winds up swiftly, a teaser, making way for 'Trains', acclaimed as a simply outstanding example of an acoustic-led song. The lyrics immerse the listener in nostalgia, and is filled with subtle touches - the haunting note at 4:42, for example (not in the demo) matches the mood of the song and evokes the subject. The acoustic and banjo solos are top-drawer: what musician would think of an extended banjo solo, anyway? The first chorus appears after two and a half minutes, probably the fourth or fifth genuine hook in the song. How could you not fall in love with this? WILSON is fairly overflowing with ideas: one can imagine elves with bowls running around catching them as they pour out of him. By the end the song is roaring at you, and you've hardly noticed the build, so engrossing is the music.I do think there's only one way not to appreciate this album, and that is to review it after one listen. There are too many layers here for a single listen, yet it's immediacy and hooks make it seem as though it can quickly be summed up. Not so. Listen to 'Lips of Ashes', the album's first downtempo number. The band has chosen a delicate arrangement: they could have gone with a simple acoustic guitar, but instead the song is awash with shimmering psychedelic instruments and precise vocals. Easy to dismiss at first listen, this song's subtlety bears repeated listens. 'The Sound of Muzak' is another attempt at the subject canvassed by 'Four Chords that Made a Million', but is much more convincing musically and lyrically. Again a wonderful vocal hook in the chorus draws the listener in, nestled in a complex rhythmical bed. Those who dismiss the song as 'too poppy' - as though being able to draw the listener into a song with a great hook is a crime - have failed to see the deliberate irony of the music and lyrics. And there aren't many pop songs out there with such a shiny guitar solo backed by a shimmering organ.And oh, joy, WILSON is confident enough now in his own identity to return to his work of the early 1990s for 'Gravity Eyelids', though the subject is definitely earthy rather than out there in the Milky Way somewhere. The earth moves sideways in these lyrics, rather than the sky. Keyboard-led, the song flows along until halfway, when distorted guitar chords raise the emotional tempo, bringing the song to - well, to a climax, from which it falls away gently. I can't see how this would fail to satisfy any fan of progressive music. 'Wedding Nails' is more disposable, a DREAM THEATER-esque track slightly out of context here, but WILSON seems determined to break the album up, and I'm all in favour of that. A sequence of splendid riffs see us through to an over-long finish, allowing the raw energy to dissipate. Deliberate, I'm sure, but it doesn't work for me. 'Prodigal' is a shimmering pop number with another of those trademark vocal chorus hooks: it's a measure of WILSON's compositional confidence that he now uses his voice rather than his guitar to shape his best tunes. Although he still has enough creativity to slip in a great riff! And when I say 'pop number', that's merely to contrast it with the more progressive work: there's no way this is a simple pop tune. Superior arrangement and musicianship builds something far more substantial than that. Listen to the FLOYDian slide guitars backing the song, for example.After this song the album takes a sombre turn. PORCUPINE TREE mine the depths of the soul in the album's last half hour. This is where time and care taken is rewarded. There's nearly a 70s double album of music here, all densely packaged, and it's common for the listener to run out of energy at this point - which is a pity, as the melancholy, multi-layered, bass-driven '.3' is an essential listen, a soundtrack for the next world war. 'The Creator Has a Mastertape' despairs of ever knowing the reasons why, a searing combination of acerbic lyrics and psychedelic instruments raising the paranoia to heart-attack levels. Speaking of which, 'Heart Attack in a Lay-by' is WILSON's obligatory suicide/death-song: every PT album has one. Excellent as it is, it merely sets the scene for 'Strip the Soul', as bleak a canvas as I've ever heard. Dysfunctional family, rejection, death, murder: 'A fire to feed / A belt to bleed / Strip the soul / Kill them all'. Don't go here unless you're confident of your own emotional state. The music claws at you like talons from the pit seeking to drag you down, darker and more chilling than any ridiculously posturing emo/goth/death metal band. The ponderous chords of the last two minutes bring the song to a chilling end. The album finishes with the cold end of the universe as a metaphor for life. A slow trickle of piano reflects a barely functional psyche, a listener worn out, ground into the dirt by the combination of music and lyrics. 'Collapse the Light Into Earth' must be listened to in the context of the previous thirty minutes. If you don't feel crushed by this music you haven't listened to it properly.No pop music here. I suspect many of the reviewers who criticise the album for it's accessibility never got this far.PORCUPINE TREE is undoubtedly the best band you never heard of. And, equally undoubtedly, their music will be appreciated long after most other bands have been forgotten. This album is the one to buy if you want to hear them at their best."
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Saturday, December 15, 2007",
      "rating": 4,
      "text": "\"The music of the future will not entertain. It's only meant to repress and neutralise your brain\"Continuing the trend of more recent albums, the tracks on \"In absentia\" are generally shorter than the lengthy prog pieces of their early albums. Love them or hate them though, for me there is no doubt that this album warrants the accolade \"prog\" in no uncertain terms. Gavin Harrison makes his debut on drums here, but this remains of course very much a Steve Wilson led project.The opening \"Blackest eyes\" is a heavy but commercial piece with a strong hook, very much in keeping with the direction for the band Wilson appears to have decided he is most comfortable with. The softer mellotron soaked \"Trains\" which follows has some fine acoustic touches including an odd hand-clap section.\"Lips of ashes\" must surely be the gentlest song recorded in the name of Porcupine Tree, the layered harmonies and lilting guitar being akin to something Crosby Stills and Nash would be proud of. \"The sound of musak\" offers a worryingly cynical prospect for the future of music, with lyrics such as those in the heading above and\"The music of rebellion makes you wanna rage, but it's made by millionaires who are nearly twice your age\".I am sure we can all come up with names for those Wilson is alluding to here. Ironically, the track itself is for me the weakest on the album.\"Gravity eyelids\" is a nod back to the band's earlier days, particularly the riff heavy latter part of the track. Initially, Wilson's high vocals suggest this is to be another soft number, but the prog structure of the track results in a reassuringly dynamic song which is drawn together nicely before it concludes.No explanation is given as to where the \"Wedding nails\" title comes from. The track is another nod to the past with some basic riffs being developed in a jam-fest of improvisation bordering on the indulgent. \"Prodigal\" is another commercial piece with a superb arrangement. Wilson adds some of his most dynamic guitar work here, providing the track with a grand conclusion. \".3\" segues straight in from \"Prodigal\", the track effectively being an instrumentalpart 2. Most unusually, the piece features strings, providing a highly atmospheric backing for what is undoubtedly a highlight of the album.\"The creator has a mastertape\" has the most obscure lyrics of the album, no mean achievement given the nature of some of the other lyrics here.\"He raised a proper family so he could tie them to a bed\"gives an indication of what to expect. Musically, the track is not one of my favourites, the distorted vocals andpunkguitar leaving me cold.\"Heart attack in a lay-by\" puts Wilson's vocals firmly up front of a soft reflective song which describes a train of though rather than an actual event. The track features some nicely constructed vocal harmonies. \"Strip the soul\" is only the second track on the album to breach seven minutes running time. The song has a heavy rhythm and the now familiar distorted vocals. Overall, the piece is slightlylooserthan its peers. The album closes with \"Collapse the light into earth\" another track which features strings. This delicate piano based song makes for a downbeat end to the album.The \"European special edition\" includes a second disc with two further tracks, and the video for a shortened version of \"Strip the soul\". \"Drown with me\" is another lightweight, rather inconsequential number with layered harmonies on an acoustic base. \"Chloroform\" is a slower 7 minute PT epic which is easily strong enough to have been included in the regular edition of the album.Overall, another fine album by Porcupine Tree, with a number of genuine highlights. While the band continue to refine and develop their sound, I rate this release slightly below those it immediately follows. It remains recommended though."
    },
    {
      "reviewer": "Blacksword",
      "date": "Posted Friday, December 28, 2007",
      "rating": 4,
      "text": "'In Absentia' was the second PT album I heard, after 'FOABP' Typically I tend to work backwards when I discover a new band! Like 'FOABP' 'In Absentia' was fairly immediate for me. The stand out choruses, and potent melodies are a powerful combination, and as I've since discovered with porcupine Tree, they are good at delivering this formula very effectively from 'Sky moves Sideways' onward.'In Absentia' opens with 'Blackest Eyes' A metal riff gives way to memorbale verse and chorus, as this excellent opener almost floats along to it's conclusion. Porcupine Tree have crossed the energy of hard rock with the the thoughfullness and ambience of Pink Floyd; Wilsons vocal harmonies as strong as ever. 'Trains' follows, and is among my favourite all time PT tracks. Its prog credentials are arguably thin on the gorund, but the emotion is in generous supply. Wilsons vocals and a superb guitar part make this song one of the bands most heartfelt. Good chord progression, well placed key changes, and a dreamy obscurity about the whole package make 'Trains' a masterpiece. 'Lips of Ashes' is PT at their trippy, ambient best. The brilliant vocal harmonies, set against the slow acoustic guitar part is remminiscent in feel of Pink Floyd, and make for a wonderful soundscape, charged with emotion and spacey ambience. 'The Sound of Muzak'picks up the pace again with a great contrast in feel between verse and chorus, but both memorable equally. 'Gravity eyelids' and 'Prodigal'continue in this vein, maintaining a consistantly high standard of song writing throughout the album. 'Heart Attack in a lay by' has an almost Radiohead feel. I can certainly imagine Thom Yorke singing those lyrics. Porcupine Tree are clearly crossing the divide between classic and more contemporary art rock on this album, and currently I cant think of another band who do this nearly as well.Only 'Wedding Nails' comes close to what I would call 'filler' A basic metal instrumental with unimaginative and predictable riffs and structure. Other than that 'In Ansentia' is an excellent album throughout; excellent song writing, emotional delivery underpinned by wonderful, crystal clear production. 'In Absentia' offers something for all PT fans, presenting a good and fairly even balance of rock riffs and brilliantly executed ambient soundscapes. 4 stars."
    },
    {
      "reviewer": "progrules",
      "date": "Posted Monday, January 21, 2008",
      "rating": 3,
      "text": "This 7th official studio release by PT is the first real hard rock/heavy prog album in their discography if I may say so. I'm amazed about the high average and high praise it gets. Apparently Trains is the stand out song but even that one hardly works for me. It's kind of special but a 6 minute song can't be very memorable to me. Ok, that's not really fair, the length can't be decisive for quality but strange enough to me it often is. If I compare the song to Anesthetize or Sky moves Sideways for instance (which I do consider masterpiece tracks) you'll probably get my drift.Trains is indeed the best song of the album, it's highly original and versatile and also very compact. To put so many different ideas in such a short amount of time is quite an effort. The album kicks off with Blackest Eyes and it's as if the band immediately wants to make a statement about the present style which is pretty different from the predecessor Lightbulb Sun. Blackest Eyes kicks ass so to speak, well at least in the first 40 seconds. One of the hardest moments in PT history no doubt. After Trains we get Lips of Ashes, a nice ambient track with a classy vein. The Sound of Muzak is just average PT I'm afraid, nothing special here. This song could easily have been on Stupid Dream where sound and style are concerned. Nice guitar around third minute. Gravity Eyelids makes a slight return to the spacy days. This one is more like what they did on Signify but it also has a lot in common with Don't hate me from Stupid Dream. With Wedding Nails they get back on the heavy track. Catchy song with nice tempo. I like this PT style much better than the slow dreamy style which is a bit boring to me. Same thing as with Riverside as far as I'm concerned. No surprise that this is one of my fav's from this release. Prodigal is an example of what I mean with slow dreamy style. Good song but it hardly moves me or warms me up in any way. It gets a different sound after two minutes where the song turns rougher and a guitar solo halfway lifts the song. 3 starts with nice bass and atmospheric sounds to turn into an orchestral instrumental. This could have been a Radiohead song (drumming!) where the first half is concerned but second half is ordinary PT again with vocals. Talking about shifts ! The Creator has a Mastertape sounds pretty original at first, finally some groundbreaking stuff on this album you would think but after 1 minute it gets more regular again. Pretty heavy after 1:40. Rest of the song is fairly standard PT. Hartattack in a Lay By is another ambient ballad, nice but I fear PT has done about a dozen songs like this. Makes me yawn a bit. Strip the Soul is again a return to Signify/Stupid Dream style with spacy elements. Come to think of it: this makes In Absentia sort of a transition album more than their first real heavy one. Slightly more heavy than spacy but no black and white case by any means. Collapse the Light into Earth sounds like a Coldplay rip off (piano !!)or who knows a tribute (!?). Or could it be Coldplay has been listening to this song and got inspired ? Anyhow, the resemblance is too striking to ignore.The bonus tracks Drown with me and Chloroform are also nice but don't really lift the album quality. The problem with In Absentia is not that it's poor or mediocre or even average. No, it's indeed far better than that. But to call it a masterpiece or even really excellent goes too far in my opinion. Maybe it's because I'm not a true fan. Because if you are I can imagine you love this one to death. It has a classy charisma over it but for my personal taste I can't go further than three stars. Or in other words it's a good/very good album (3,3)."
    },
    {
      "reviewer": "progaardvark",
      "date": "Posted Monday, January 21, 2008",
      "rating": 3,
      "text": "Porcupine Tree's seventh studio album, In Absentia, showed a significant change in the band's overall sound. It also marked the first personnel change for the band as drummer Chris Maitland departed and was replaced by Gavin Harrison. But the biggest change was the incorporation of numerous metal riffs into the Porcupine Tree repertoire. This influence has been attributed to Steven Wilson's producing of Opeth's Blackwater Park. To my ears, this change was sometimes good and at other times seems to ruin the song with senseless noise making it a harsh experience.Again, Porcupine Tree's music is as accessible as on their three previous albums. Clearly with each album, the band expanded its fan base. With the introduction of metallic elements, it would increase even further by reaching out to another large group of listeners in the metal community. Thus, In Absentia became the band's biggest selling album to date, selling over 100,000 copies in its first year of release and making the charts in several European countries.I must admit that at the time this came out, it really surprised me with this change in direction. I'm not as keen on new releases and what the members of the bands are up to, so I didn't know of Wilson's involvement with Opeth. I remember enjoying this for awhile during the 2002-2003 period (though I tended to skip the harsher songs), but since then it's hasn't seen the inside of my CD player very much. I'm not sure exactly why. The only sensible reason I can come up with is that the merger of the new sound with the Porcupine Tree foundation was not as smooth as many thought. Some songs are clearly Porcupine Tree (no doubts at all), while others sound like some other band was performing them. Make any sense?Whatever is the cause of my confusion, it's still a good album. But it's still a far cry from the band's earlier masterpieces. I would recommend starting with the band's first three albums and then moving chronologically forward through their catalogue prior to obtaining this. If you're more into prog metal, but looking to explore hybrid prog metal/prog rock bands, Porcupine Tree's In Absentia would be ideal. Three stars. Good, but not essential."
    },
    {
      "reviewer": "JLocke",
      "date": "Posted Wednesday, January 23, 2008",
      "rating": 5,
      "text": "Porcupine Tree Delivers with 'In Absentia' (Please note: I originally wrote this review on Epinions.com; I did NOT steal this, it is my own review.)The first time I heard the name Porcupine Tree mentioned, I was unsure about giving them a listen. I knew two things: they were considered Progressive Rock by my fellow Prog fans, and the community was split about them. Some people said they were a great band, others said they were merely ripping off past greats. So imagine my curiosity when I discovered that my best friend and fellow music fanatic had begun to listen to them.Finally, I was approached by said friend who told me that I had to listen to them. So he gave me his copy of In Absentia, and I was on my way. Since I had never heard even one second of music from this band, I was fairly anxious to give this disc a spin, so I stuck in my car's CD player and the first song started to play.First and foremost, In Absentia is, as what it is now called, a 'concept album'. The story that is told here involves a serial killer's telling of his life from childhood, through lovemaking, to the ultimate gruesome ending. Steve Wilson, the band's mastermind, has said many times that he does not consider his band to be progressive, but what he isn't realizing is that the type of structure his band's albums are built around screams prog to those of us fortunate enough to have experienced this extraordinary genre firsthand.The album's opening track, Blackest Eyes, seems to be a song of reflection and summary of everything said main character has done throughout his life, as the lyrics make referrance to key events that happen later on along the course of the story's timeline. This song, like every other song found on the record, is always subjective and open for interpretation, but in my take on it, the killer himself is narrating the story, and he is very proudly proclaiming his worth based on all of his past deeds, good or bad, he doesn't seem to care. The musicianship found on this track is excellent as always, and Wilson's vocals always give me chills as he sings unabashed the lyrics: I've got a wire loose inside my head, I've got books that I've never, ever read, I've got secrets in my garden shed, I've got a scar where all my urges bled, I've got people underneath my bed, I've got a place where all my dreams are dead, swim with me into your blackest eyes . . . . This song has many mixed emotions in it, with a very odd, slightly unnerving opening lead, which suddenly changes into the crunchy, relentless, heavy main riff, which then immediately switches gears again to become a pleasant acoustic guitar chord progression. All of these opposing feelings colliding together beautifully relays the sense of frantic and twisted confusion that is our main character's mind. It serves as a great overture for what is to come.Trains. Ah, what a wonderful song this is! It was as I listened to the main riff for this track that I knew I loved Porcupine Tree as a band. It's so simply, yet so genious, and I find myself compelled to listen to this song more often than any of the others, which is saying something, since they are all fantastic. In fact, this particular riff actually finds itself reprised two albums later on the masterpiece: Fear of a Blank Planet, but we will discussthattreasure at another time. As I was saying, though, as I listened to this song for first time, and as I heard it build and build, I truly couldn't believe what I was hearing, as I had thought no band could make music completely new for me all over again, but with that one riff, it was done. I gleefully followed every beat, every vocal flourish, every time signature change, waiting for what next would come. This song features a very emotional guitar solo as well as what sounds to me like a banjo-driven bridge section that somehow fits the rest of the song perfectly. The band is at it's best in every respect with this one, truly a gem of a song. I could go on, but since the entire review could be made up of my praise for this single track, I had better move on. I only have one other aspect of the song to comment on: the lyrics. Wilson's way of expressing thoughts through words and music is magical. The words are or so poetic yet nothing to snicker at, and even if you or I have never done the horrible things our main character in this tale will ultimately do, I can still relate to this song, as the lyrics do tell a story, but at the same time remain vague enough for anyone to find something familiar there.Lips Of Ashes is the 'spaciest' track so far, with a very surreal, haunting quality to the way Wilson plucks away on his acoustic guitar. Richard Barbieri's keyboard work also lends a hand here, with a feeling of ghostly memories clinging to the words that our star speaks. The song is told in present- tense, but I get the feeling personally that he is reliving a memory rather than simply experiencing something for the first time. The song becomes almost a ballad as our first genuine guitar solo is heard here. The singing ability here is way above par, as double-tracked harmonies add to the haunting, surrealistic nature of the track.The next track kicks off with a very catchy base line from four-string-maestro Colin Edwin, accompanied by a riveting drum pattern brought in by (at the time) newest addition Gavin Harrison. The song's title is Sound of Muzak, and while I feel the first half of this song is considerably less interesting to hear after the first listen, the second half makes up for it with a very funky but enjoyable guitar solo. The rhythm guitar sections brought in by Wilson are very fun to play along (or simply mime along) to if you yourself are a musician. and the complete finished product definately brings a smile to my face and a jig to my hip whenever I play it.Track five, Gravity Eyelids, is potentially my second favorite song on the album, because it is really the song that changes the most throughout it's course, as it starts quite sweet, sensual, and possibly erotic. Clearly a love scene (at least in my interpretation), this song begins with a very soft melody, almost like a lullaby, speaking directly to the one the hero of the story is making love to. Once again a song that boasts very poetic lyrics, it manages to convey the idea of a physical relationship with another, while not becoming overly graphic or needlessly flamboyant. Then, just as the act is over, the song does a complete 180, and the listener is blown away by the heaviest riff on the record yet. I still haven't found myself able to remain completely still whenever I am listening to the record and this part of the song comes along; I can't help it. The song has such raw energy in it that I find myself completely engulfed by the power of it, and it doesn't let go of you until after the track ends. Plenty of odd time signature work here as well, for the more prudish of prog fans.Wedding Nails is an off-beat, wacky, completely aimless instrumental song that shows (in my opinion) the main character's mental degeneration, as I myself feel like I'm going mad every time I hear this enjoyable, but uncomfortably short musical sojourn.Prodigal Is a very uplifting, meaningful track featuring yet another catchy main guitar riff and solo. Also present is a wonderful display of vocal interaction that reminds me a bit of early Pink Floyd, but not uncomfortably so. No, this song is still very original like all the others, but the familiar feeling I get when I hear it I think is part of it's charm. The bass lines present in this song are also very memorable. In terms of where we are in the story at this point, I think it is more-or-less a time of self-searching and confusion for our lead character. Ultimately the choices he makes are the wrong ones, but here, it seems to me that he is actually looking for another way around his issues, and apparently none were to be found in his point of view. This song is the last feel-good titles on the record.Song number 8, titled simply .3, is a venture into the darkest depths of the mind, and from what I can hear, the song is primarily effects-based, as the keyboards are the most prominent instrument in the whole track-- that is until Steve Wilson comes in with his acoustic guitar rhythm. I always love that moment in the song, as I can just feel his presence at that moment entering the song. His playing is followed closely by the chant: Black the sky, weapons fly. Lay them waste for your race, which he sings over and and over again in a sort of absent (pun intended) slave's mindset. At this point, I think our story's lead part has chosen for good what he will do, which is why this song has a sense of boreboding, no matter how beautiful it is instrumentally. Fantastic listen, though, especially through headphones (which by the way, is really the only way you should be listening to music like this, because without them, you miss so many layers within the song that make the music as good as it is.)The Creator Has A Masterpiece is indisputably the strangest and indeed most disturbing song on this record, which grows increasingly darker as the story unfolds. From the moment you hear the out-of- key six-note guitar intro until you reach the dramatic end, you may possibly find yourself checking over your shoulder around your house, if music effects you as strongly as it does me. No matter; the more disturbing,the better. Right? This track also reveals the origin of the 'scar' that is first mentioned back in track one, but I won't spoil it for you here. Experience it for yourself, as from this point on the record does not let up once.Heartattack In A Layby is a very sad, moving piece that leaves the killer in reflection with himself, while at the same time pursuing his next goal. The mood of the track is not happy by any means, yet has some of the most emotional sections out of the entire album. The amazing use of vocal rounds and alternated harmony is potentially the most beautiful thing Porcupine Tree has ever done, and it is here than I find myself singing along the most, just because of the sheer majesty the voices on this track seem to portray. The piano playing here is superb, and the solemn tone maintained throughout makes this also the most consistent track on the record thus far. While I like both progressiveandstraightforward song structures, the latter fits this particular part of the story better. So, you aren't going to be getting an insanely long, always changing song experience here, but it does move you. And it works well. Very well, indeed.But what is a tale about a killer without blood and gore, Kain? you ask me. Well, my dear readers, fear not, for there are still two more songs to go. This one, Strip The Soul, has a very heavy, cool guitar riff that sets the mood for this killing-spree-of-a-song. It's not necessarily the most graphically described violent scene ever told on a rock record, but it certainly does the job of getting under one's skin, especially if you didn't realize up until this point what exactly the end of the story was going to be. This machine is there to please, strip the soul, fill the hole, are some of the lyrics spoken on this track with great execution on Wilson's part. They are not gone, not gone, only sleeping . . . he continues, as his deed has already been done. I may be wrong on the band's personal intention here, but to me, that is what this song is about: a man going out of control, and the inner self witnessing these terrible things and being unable to stop them from happening. The denial in which our star seems to find himself in is not so different from our own moments of denial; refusal to believe the truth. In this man's case, however, he has done far worse than most of us ever will. Even though he is fictional, this character speaks to me on the album, and Steve Wilson's brilliant story-telling abilities really makes me believe in this story-- this concept, if you will, about a man who started out so well, and ended up in such a bad way. I suppose it is because things like this really do happen that I can relate to it more. A fire to feed, a belt to bleed, strip the soul, kill them all . . .This flawless effort from Porcupine Tree ends with a bitter-sweet feeling track in Collapse The Light Into Earth I get the sense here that our story's main character has somehow managed to find a sense of peace with what he has done, not by necessarily admitting and wrong, but rather by talking to those he once loved in his own head, promising them that they will not be forgotten. Once again, this review of mine is only one person's interpretation of an intentionally vague story told through the form of this amazing music, so if when you listen to the record, you come to a different conclusion, who is to say you are wrong? That's what I love about these kinds of bands and, indeed, about the Progressive genre in general, because we the audience are left with enough empty space to find our own things to relate to in everything, which makes each and every song a personal experience for us. With this album, I was impressed by how well it moved me when I had gone in with so little expectations for this band called Porcupine Tree. Now, they are one of my all-time favorite bands. It is rare when a band can make me feel emotions I have never felt before as I listen to their music, but Porcupine Tree did it with this album, and I haven't stopped loving their music since. I suggest pick this album up, and if you find yourself drifting off to another place and time, then you are much like the star of the featured story, and have gone somewhere completely different in your mind, at least for a little while. For a record to do that is frankly amazing to me, and even if you end up not being as affected by this record or indeed not even interested in the story, that is okay also, as while some of us are more hardcore music fans, the rest of us are just experiencing life and music 'In Absentia'.Pros: Superb musicianship, top-notch song writing, and original presentation.Cons: NoneThe Bottom Line: An excellent musical journey for anyone interested in discovering new original bands."
    },
    {
      "reviewer": "ProgBagel",
      "date": "Posted Thursday, April 10, 2008",
      "rating": 4,
      "text": "Porcupine Tree - In Absentia 4 starsThe most important album in Porcupine Tree's modern career does not equal best, but still an excellent album.This marked Porcupine Tree's biggest transition album.of all of their transitional albums. The work of being a producer of a few grandiose Opeth albums might have played a part in Steven Wilson wanting some metal put into his music. He combines it perfectly. The album sounds fresh, unique and exciting. The only problem I have unlike almost all of their albums is that there are some weak songs on here, among Wilson's worst. I find it very hard to believe somebody can find every song to be outstanding on this album with 'Wedding Nails', 'Strip the Soul' and the utter, most terrible Porcupine Tree track, 'The Creator has a Mastertape'. Otherwise, there is a collection of some great tracks with an abundance of Porcupine Tree's best works 'Blackest Eyes', 'Trains', 'The Sound of Muzak', '3', 'Heartattack in a Layby' and 'Collapse the Light into Earth'.We also see a new light.Gavin Harrison. A powerful drummer and a master of dynamics. Gavin never overpowers, he establishes control and then really shows his technicality through his smooth style, keeping it varied and above all else, fluency. Other then the drummer change, we have the same guys here.A hard rock approach is the most dominant in this album and it will be received right away with the opening track 'Blackest Eyes'. The effects are a constant as well. They are mostly in the background, filling in the gaps and sometimes are at the front of the music itself. Steven Wilson has also become a much better and more unique guitar player. His dynamics on the acoustics seem to have been mastered beautifully, especially when he comes in on the song '3'.Besides the lack of good interplay on some of the tracks.I can highly recommend this album to anyone. Don't expect this to be the best of the band as people make it out to be. They have done far better. 4 stars for an excellent album."
    },
    {
      "reviewer": "LiquidEternity",
      "date": "Posted Thursday, April 24, 2008",
      "rating": 4,
      "text": "This album flirts on the edge of a five star rating, but it lacks the definite punch of their masterpiece Fear of a Blank Planet; though clearly it is a strong release from the band.Stepping up from the more pop-rock oriented Lightbulb Sun, In Absentia features noticeably more metal, a fair number of more uptempo songs, and a return to early Porcupine Tree's sense of creepiness and dark mood. New drummer Gavin Harrison has joined the fold, and while Chris Maitland certainly is talented, Gavin's chops (though shown very conservatively throughout this release) definitely can add much enthusiasm to the music. A random prog passerby might notice this album and comment on the non-prog song lengths and so forth. True, the general strictures of \"prog\" are mostly absent. There are a few different time signatures, a few strange melodies and chord progressions. Nevertheless, this album really is progressive. Wilson has pushed his band forward from the initial humorous druggie psychedelia of On the Sunday of Life, through the careful atmospheric rock of Signify, through the melancholic pop of Lightbulb Sun, and out into the realm of hard rock and some metal. There are still acoustic elements, there still are gentle songs, there still is the impressive Wilson restraint. But this is not Porcupine Tree like Porcupine Tree was ever before. The band has remade itself again, and In Absentia is a strong debut for a changed band.It opens with the rockerBlackest Eyes, which kicks the album off to a melodic and yet energetic beginning. The live favoriteTrainsenters next, built on a unique strum pattern. The lyrics are the closest Wilson has ever come to writing a love song in a Porcupine Tree effort, and the music matches with a nostalgic, almost happy quality. An odd track for the band, to be sure, but certainly a beautiful tune--one that also has its share of rocking out towards the end.Lips of Ashesis a creepy, crawling tune budding with atmosphere and haunting vocals. Next beginsThe Sound of Muzakin 7/4 time, though with such a drumming pattern by Harrison that it flows as naturally a standard 4/4 tune. Well-harmonized choruses lamenting the loss of public interest in quality music leads to a splendid guitar solo and a rather laid-back track overall. Clocking in at almost eight minutes, the longest on the album, is the sleeper trackGravity Eyelids. Beginning with a fairly creepy atmosphere and a drum machine, the song gradually adds piano, vocal layers, and drums for the first three and a half minutes. Then it all backs off for a strange plucked noise and some heavy guitars. Soon the song gets a bit wild with a touch of metal. A thick middle section then returns it to what it once was before, with the vocal layers and piano, except the distorted guitars subtly remain in the background.Wedding Nailsis an instrumental track, perhaps the most energetic and straightforwardly rocking tune on the album. Based mostly on several guitar riffs, this turns what many prog bands would make a noodle-fest into an interesting exposition of horror music. After the last minute or two of keyboard-produced ambiance,Prodigalenters the album. A strong bass line and some distorted slide guitar push this song to a likewise lush and well-written chorus. The post-chorus is the strength of the song, however, as after the second run through, distorted guitars kick in with a very memorable riff. A solid guitar solo towards the end drives the song to a worthy conclusion. The mostly instrumental.3also is powered by Colin Edwin's powerful bass, layering melancholic atmosphere and featuring several short lyrics about the horrors of war. Continuing in the dark and moody vein,The Creator Has a Mastertapeis a quirky song with a few of possibly the album's wildest guitar moments.Heartattack in a Laybyis a gentle, soft track with more of Wilson's clever harmonies tying it together. Next,Strip the Soulclocks in with its second longest status. The opening bass riff is fairly reminiscent of the opening of .3, though soon the song dissolves into darkly heavy metal and horrifying lyrics. Lastly, the translucentCollapse the Light into Earthwraps up the album. Most of the music here is piano, though some wisely used strings back the melody. Wilson's voice softly and morosely turns this track into a beautiful, refreshing conclusion.For a number of people, this is the best place to begin with for Porcupine Tree. Fear of a Blank Planet is a stronger album, but the melodies and riffs on In Absentia certainly qualify it as a smart place to look."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Saturday, May 17, 2008",
      "rating": 4,
      "text": "Stupid Dreamdone the heavy wayReturning from albums that represented a large switch in the music Porcupine Tree [PT] had previously released from psychedelic flavor to a more commercial and almost metal route,In Absentiarepresents another shift which still holds the same musical styling of their newer (at the time) material. A very unique album, when looked at in hindsight sounds like the previous albums the band had recorded fused with the latterDeadwing. The songs are shorter and more accessible to wide audience but without the fun late 90s (almost satirical) feel that others such asStupid Dreamseemed to have. Instead the album takes a turn for the heavy and the dark. As evident from the first track (and indeed the cover art) this is going to be an album that shan't be taken lightly. What we have here is the construction of darker soundscapes as Mr. Wilson seems to have found further reason to find fault with the world. In any case, this will be PT's darkest and heaviest album to date.From the evil lyrics and dark riff that starts off the excellent opener,Blackest Eyesit's clear that PT is a whole new beast. With a structure more conventional than the band is normally used to the song presses on. Not without musical merit, as Steve Wilson can never be attacked for, the song shows the band as more approachable with material that is probably what attracted the following of fans who would later be lyrically showcased on the albumFear Of A Blank Planet. This is, of course, not a bad thing, but those who are expecting a PT album ripe with long spacey instrumentals and zoned out tones had best look somewhere else. Songs like the beautifulTrains, the fast and broodingThe Creator Had A Mastertapeand the industry conscious rebellion ofThe Sound Of Muzakfollow more in this conventional style while still appeal with their heaviness and lyrics.Trainsespecially is a beautiful song with some wonderful lyrics and a very haunting delivery.The other songs on the album range in effectiveness. The longest song on the album (reaching a 8 minutes) is the chilled-outGravity Eyelidswhich unfortunately fails to make a large number of waves with it's promising build that never turns cataclysmic as PT so often do, while the other longer trackStrip The Soultakes the term ''brooding'' to a whole new level and destroys the audience's comfort with some excellently evil lyrics and dark instrumentation..3is a nice little pseudo-instrumental, but the real instrumental - the bombasticWedding Nailsreminds listeners of a moreSignifyfeel of the band while taking the track faster and heavier than ever before. Meanwhile, the more toned down tracks such asHeartattack In A Lay Byand the goosebump yielding closerCollapse Light Into Earthstill retain a darker feel while still making sure the audience gets a lull of some kind.Ultimately a very good album with some very worthy moments, this one is definitely an album for those who like their prog heavy as the band's current sub-genre suggests. Those who like the band's later works likeDeadwingwho want to hear the style mixed with their other work such asStupid Dreamwill get a mondo kick out of this one. Strangely enough, the songs on this one that are worth repeated listens are actually the more conventional ones - something very strange indeed for a PT album.Well, at this point in writing I still haven't assigned a star rating to the album yet as it's one that requires a good amount of thought. Ultimately I think that excellent addiction is the right mark. The highlights of the album are so incredibly memorable and really smooth out any minor flaws the album has. Not conventional prog as the album has a lot of commercial leanings, but a very excellent album in the end. Worth your time - Recommended!"
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Wednesday, July 2, 2008",
      "rating": 4,
      "text": "This album marked my introduction to Porcupine Tree!Back in the day it was often considered to be the crown achievement of the band's new era/second era which began withStupid Dream. Although the material here is of great quality I never really enjoyed this release as much asDeadwingdue to the excessive playtime this album entails. I'm usually able to play this album all the way toGravity Eyelidsbut once that track begins with its hypnotic flow I almost fall asleep. It's definitely wasn't the best placement of this type of composition since it makes the rest of the material difficult to digesting in one go.The second half of the album features another great set of compositions andCollapse The Light Into Earthis probably the best conclusion an album of this caliber could ever wish for. OverallIn Absentiais a great introduction to Porcupine Tree and an excellent addition to any progressive rock music collection!***** star songs: Blackest Eyes (4:23) Trains (5:56) Wedding Nails (6:33) Collapse The Light Into Earth (5:52)**** star songs: Lips Of Ashes (4:39) The Sound Of Muzak (4:59) Prodigal (5:32) .3 (5:25) The Creator Has A Mastertape (5:21) Heartattack In A Layby (4:15) Strip The Soul (7:21)*** star songs: Gravity Eyelids (7:56)Total Rating: 4,22"
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Tuesday, October 7, 2008",
      "rating": 4,
      "text": "One of the greatest example of neo-progressive rock by arguably the best in the business. Porcupine Tree have triumphed with their unique blend of soft acoustic melodica merged with heavy crunching killer guitar riffs. Wilson's voice is mesmirizing on every track. Barbieri's keyboards are a beautiful touch that permeate the album from beginning to end. It is a masterfully produced work that deserves all the attention it has garnered. Streets ahead of previous Porcupine Tree material and the best was yet to come following this album. But 'In Absentia' is an excellent way of being introduced to this important heavy prog band. They are complex in parts but never over excessive. And the melodies remain in your head well after the CD has ended. The production and art work are worthy of note too, a juxtaposition of sound, visual images and symbolism to paint a picture that is powerful enough to remember.Highlights include the wonderful 'Blackest Eyes' with the inspired riff that propels it to its sudden conclusion. The time signature shifts are classic prog rock.'Trains' is an excellent acoustically driven track that even sounds at one point like a train on a track, especially the ending. A lot of this track,and others, sound curiously like Pink Floyd meets Yes. There are undoubtedly huge influences from classic prog bands in this music. 'The Sound of Muzak' has a very catchy melody and Wilson is in full voice, as are the harmonies from other band members. Check this song out for a great example of melody and awesome musical interludes. 'Collapse the Light Into Earth' is a mesmirising slow moving track that uses techniques of minimalism and a huge wall of sound builds up to a crescendo. The track sends you to another place, and has the power to entrance the listener. Close your eyes and let it take you. It is as relaxing as anything the band were producing in their early days.All the tracks are unique, inspired and demonstrate the musical complexity that is essentially Porcupine Tree. Many tracks appear on the live DVD 'Arriving Somewhere...' but the studio versions presented on this album are the best versions.A real surprise! I was blown away by the musical dexterity and depth of this album. Following this was 'Deadwing' which is even better! Both are recommended!"
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Monday, December 15, 2008",
      "rating": 3,
      "text": "It surprises me how this album is many heavy progressive rock lovers' favorite album by Porcupine Tree. There are no epic tracks, few progressive arrangements, and no overall theme. Nearly all of the songs have a pop structure, and aside from a few atmospheric cases, this album is really Prog Related, not heavy progressive rock. The borderline metal aspect of recent Porcupine Tree is rather apparent throughout. For the most part, the last half of the album is not as strong as the first, but the music is still highly enjoyable. I would recommend this album to everyone new to Porcupine Tree, especially if they enjoy alternative rock.\"Blackest Eyes\" The introductory guitar builds into a thrashing wall of metal, which in typical Porcupine Tree fashion, gets mellow to make room for Steven Wilson's meek but distinctive vocals. The chorus has one of the catchiest melodies Porcupine Tree ever recorded.\"Trains\" Acoustic guitar and nostalgic lyrics form the foundation of one of Porcupine Tree's greatest treasures. It is easily the best song on the album. From the hard-rocking verses to the banjo-led interlude, and from the acoustic guitar solo to the melancholic lyrics, this song is full of homesickness.\"Lips of Ashes\" Eerie strings and an acoustic guitar playing an odd riff for a 4/4 time signature, with electric guitar in the background, create a creepy musical effect, especially with the layers of harmonious vocals. It's a hauntingly beautiful but sadly static song, and therefore one I'm likely to pass by.\"The Sound of Muzak\" One of the very first Porcupine Tree songs I ever heard, I was initially convinced by this that the band I was hearing was more conventional than progressive, perhaps like latter-day Rush. Even though the verses are in a hardly noticeable 7/4 time signature, the song retains a decidedly pop structure. Like that of \"Blackest Eyes,\" the chorus is extremely catchy. But like \"Trains,\" it happens to be one of my favorite songs on the album. The lyrics always make me think of how a lot of young people are not exposed to more than popular music (despite how readily available other music is these days). The trendy way to listen to music is through a personal device, an mp3 player, perhaps, and people often download only certain songs rather than full albums. So not only do they lack exposure to other (arguably more interesting) artists, they forgo many of the tracks on the album of the artist they are hearing.\"Gravity Eyelids\" Opening with a Mellotron's choir and a faded out drum loop, Wilson begins singing \"Gravity Eyelids\" with a meek and at times falsetto voice. After the first verse and chorus, the bass and the real drums enter over the loop. While, like \"Lips of Ashes,\" I enjoy this song a great deal, it's a bit boring, even when the thrash guitars enter. Quite honestly, a new vocal melody over the heavy section would have given life support to a somewhat dull but pleasant track.\"Wedding Nails\" This is a heavy metal instrumental that honestly does little for me. Like everything on this album, it isn't bad, but it's merely something I tend to pass over.\"Prodigal\" The slide guitar gives this song a southern rock feel even though it sounds more like mainstream alternative.\"3\" Starting with a deep bass riff, spacey sounds fade in with mellow electric guitar and drums on this otherwise straightforward song. The ambient strings layered over the top make this one sound like something that could easily belong in the soundtrack of an action movie about urban drug lords. Wilson doesn't begin singing until three minutes in, over strings and acoustic guitar. Not bad, of course, but it is bland to a degree.\"The Creator Has a Mastertape\" Distorted guitar begins this one, just before a fast-paced bass riff comes in over a beat. The vocals are distorted also. Most of the music is noisy and unpleasant; it's grating, really, making this by far the weakest track on the album.\"Heartattack in a Lay By\" By far the best track on the second half of the album, this one is calm and has a definitive melody, especially in the chorus. The thick Mellotron and bass sit in the background, letting the song, and the counterpoint melodies in particular, breathe.\"Strip the Soul\" Just like \"3,\" this one begins with bass and airy noises, but soon becomes more of a metal song. Even the heavy acoustic sections are aggressive. It's an okay track, but not as strong as many of the previous ones.\"Collapse the Light into Earth\" For nearly six minutes, Wilson employs the same basic chord progression, hammering it out on the piano. But it isn't just the music making this one wonderful, it's the vocal work. The strings are lovely, and the only distorted guitar creeps in toward the end. The song is beautiful, and sounds like something from Coldplay."
    },
    {
      "reviewer": "Raff",
      "date": "Posted Tuesday, February 24, 2009",
      "rating": 4,
      "text": "As one of the people in charge of Heavy Prog, I felt it was my duty to write at least a review for one of the most representative bands in the subgenre - something I had not yet done. On the one hand, the sheer number of reviews written before mine (many of them by some of the very best reviewers PA has to offer) kept putting me off my task. On the other, I knew I wanted to add my own opinion to the avalanche of rave reviews so far received by Porcupine Tree's 2002 album, In Absentia.Don't get me wrong, I do not dislike PT by any means. I'd much rather listen to them than to the likes of Dream Theater, and I find their music interesting at the very least. That said, I cannot for the life of me understand why so many people see them as the 'second coming' of prog. They are a very tight, technically proficient outfit, and have in Steven Wilson a superb songwriter, musician and producer. However, when it comes to analysing what counts most - i.e. the MUSIC - I have to wonder at all the hype. Let's face it, what you can hear on In Absentia is definitely not what would have been called prog in the Seventies, or even later. There are bands and artists around (some even languishing in Prog-Related) that - in terms of musical structures - are much more progressive than PT. The Mars Volta may not be (and are not) everyone's cup of tea, but there is little doubt as to their authentically progressive approach to composition. Conversely, PT surround their music with progressive paraphernalia, but it all remains on the surface - if you delve a bit deeper, you will find rather conventional pop-rock songs, with very simple time signatures and a mostly chorus-verse-chorus structure. This is not a crime, of course - Rush have been doing that for twenty years, but they are not hailed as the saviours of modern prog: on the contrary, they have often been accused of selling out.Given the sheer number of very detailed reviews already posted on the site, I will avoid a track-by-track analysis, and just offer my general impressions. As it is customary nowadays, the album is VERY long (close to 70 minutes) - which means that, by the time it reaches the eighth track or so, it has somewhat overstayed its welcome. The twelve songs alternate between crushing guitar riffs (this is the album where PT's sound started to turn definitely heavy), rather catchy choruses (like in album opener Blackest Eyes a deceptively upbeat tune about rape and stalking, or the iconic The Sound of Muzak), and psychedelic soundscapes reminiscent of the band's earlier output. The instrumental Wedding Nails takes the band into decidedly metal territory, while Gravity Eyelids and album closer Collapse the Light Into Earth show the softer, more atmospheric side of PT's sound, the latter with a vaguely Radiohead-ish vibe. On the whole, Trains comes across as the best offering on the album, bringing together all the threads that make up the band's music.When it comes to rating In Absentia, in spite of my misgivings about the album and the band, I cannot ignore that this is probably the most influential recording by PT, and the one in which they showed their full potential, as well as Steven Wilson's charisma as a musician and frontman. Therefore, I will take a leaf out of my dear husband's book, and rate it 4 stars for the site, and a solid 3 for myself. As I stated at the beginning of my review, not really anything ground-breaking as such, but a good album nonetheless, and one that many prog fans will enjoy."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Wednesday, March 4, 2009",
      "rating": 4,
      "text": "In Absentiais the Seventh full-length studio album by British progressive rock actPorcupine Tree. The band has gone through quite a development in sound since their debut releaseOn the Sunday of Life..... (1991). Starting out as a one man bedroom recording project playing psychadelic progressive rock and growing into one of the most influential and succesful modern progressive rock bands is quite the achivement. I haven�t been much of a fan of the early releases from the band even though most were good efforts ( nothing outstanding IMO though).In Absentiahas totally changed my view onPorcupine Treethough and finallySteven Wilson & Co.have created a sound that fully captures my attention.While the music is still unmistakablyPorcupine Tree, a couple of new elements have been added to their sound.Steven Wilsonhad acted as producer for progressive death metal actOpethon their 2001 releaseBlackwater Parkand onDeliverance (2002)andDamnation (2003)both of the latter was recorded during the same sessions as documented on theLamentations (2003)DVD release. Maybe the Swedes have had an impact onSteven WilsonbecausePorcupine Treehave surely gotten a lot heavier than they used to be. Especially compared to the two more mainstream oriented and polished predecessorsStupid Dream (1999)andLightbulb Sun (2000). There�s an emphasis on beautiful song melodies but there�s certainly also an emphasis on experimenting with song structures and genres. The music is not overtly complex though and the experiments never take away the melodic focus in the songs. The heavy element which is heard in songs likeBlackest Eyes,Gravity EyelidsandWedding Nailsis only a new added element in the sound not a dominant feature in all songs so by all means don�t expect this to be a heavy metal album. There�s some excellent mellow and beautiful songs on the album in addition to the more experiemental and heavy songs. Songs likeThe Sound of Muzak( which has one of the most infectious choruses I�ve ever heard), the ambient.3( which reminds me of the Dutch pop/ rock actHooverphonic) and the closingCollapse the Light Into Earthare all good examples of the more mellow side ofPorcupine TreeonIn Absentia.The musicianship is fantastic. Excellent and tight performances by all musicians involved. I really enjoySteven Wilson�sbeautiful vocals ( even though he has quite an anonymous voice he really knows how to use it to full effect) and his occasional fierce guitar playing. The rythm section is outstanding too and ex-JapankeyboardistRichard Barbierihas a tasteful style to my ears.The production need a special mention as it is fantastic. Absolutely wonderful clean and modern production. Some people might miss a bit of organic warmth but I couldn�t wish for a better sound.In Absentiais by far the best albumPorcupine Treehad released when it came out and finally an album by the band that I enjoy for the whole duration of its playing time. There was always something on the earlier albums that I found dull or superfluous and that annoyed me every time. WithIn Absentiathe band have cut away all unneccesary and disturbing elements from their sound and what is left is an almost perfect album of progressive rock. As close to a masterpiece as you get without being awarded the 5th star by this reviewer ( and I might change my mind in the future). A BIG 4 star rating it will be and a recommendation from me that this is a must hear album."
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Thursday, March 12, 2009",
      "rating": 4,
      "text": "'In Absentia' - Porcupine Tree (8/10)'In Absentia' is the Porcupine Tree record I've always found to be overshadowed by it's two counterparts of the same era, 'Deadwing' and 'Fear Of A Blank Planet.' Both were complete and utter masterpieces, but what of 'In Absentia' itself? There is certainly masterpiece-quality songs on here, alot of them at that. But there is little to no flow that ties the songs together. If I was rating this simply based on it being a random collection of songs, sure, I would give it five stars. But I'd prefer to mark it based on how it fares as a complete work.The only songs that I wouldn't consider amazing are 'The Creator Has A Mastertape,' 'Lips of Ashes,' and 'Strip The Soul' which don't really appeal to me, especially the first mentioned. Everything else is fantastic Porcupine Tree worthy of the band's reputation of creating high quality and uncompromising music.But how can I listen to something that doesn't feel like it should be listened to from start to finish? Sure, the first few times I listened to In Absentia, I went from start to finish and didn't really mind the fact that the songs don't match up and form a whole... But it really got to me after about five listens, and I decided to pursue a different course, which would be to listen to songs out of order in my preference, seeing as it didn't really make a difference due to my lack of appreciation for the set-up of the album.As always, the sound quality and production is up to a traditional Porcupine Tree standard of excellence. The song 'Heartattack In A Layby' remains one of the most beautiful songs I've ever listened to...'In Absentia' is great for the music itself, but in terms of what a really effective album should look like, it's a bit upsetting that such a potentially masterful work could have been detracted so much by a relatively easy to remedy issue. However, for the songs themselves, this is certainly an excellent addition to any prog collection, and it's a definate worthy buy, especially if you're not too concerned with album structure.By the way, if anyone can justify why the album is rated as Porcupine Tree's best, feel free to message me and we'll talk."
    },
    {
      "reviewer": "progkidjoel",
      "date": "Posted Thursday, April 30, 2009",
      "rating": 5,
      "text": "Porcupine Tree ? In AbsentiaReview by ProgKidJoelPorcupine Tree's \"In Absentia\" is considered to be the best the Tree has delivered to date; A great mix of rock, prog and space rock help to make this as memorable as it is enjoyable. This is the album which got me hooked on the fruit of the Porcupine Tree, and is one of my favourites the band has released to date. Offering listeners a deep venture into the many worlds Porcupine Tree has to offer, this one takes some time to sink in.1. Blackest EyesOpening with one of Porcupine Tree's best riffs to date, this is an incrediblely solid opener for the album, and is a fan favourite. Incredible sonic quality and musicianship make this track special, and also make it a stand out. A metal intro and an alternative-rock chorus and verses, this track is nearly as interesting as it is addictive. The guitar section is easily the most impressive and innovative on this track, and supplies a solid base for the rhythmic section to work around. One of my favourite from the album, this track is nearly as horrifying as it is uplifting.5 out of 52. TrainsMy favourite track from this album, this is easily one of Porcupine Tree's best tracks. Also one of my all time favourite songs, and indeed, one of the best the Tree has to offer, this track in unforgettable. A flowing acoustic melody give this track a great life, and its solos are as refreshing as they are melodic. In my completely honest opinion, this track makes the album worth a purchase on its own. A fan favourite in Europe, its easy to see why one could fall in love with this song. An inspiringly beautiful lyric is what makes this track extraordinary. If you haven't heard this track, you haven't heard one of the best Porcupine Tree have to offer. Once again, the musicianship Steven Wilson shows in his guitar work on this track is amazing, specifically acoustically. The beautiful ambience of Richard Barbieri's synth work is another highlight, providing a brilliant contrast and overtone to this brilliant song.5 out of 5 (I would give it 6 if I could)3. Lips of AshesAnother amazing track, this song reaches back a little farther into Porcupine Tree's psychedelic routes. Amazing acoustics lead this track, and layered vocals add another dimension of beauty to what I thought this track could bring after the amazing \"Trains\". Eventually leading into an amazing melancholic guitar solo, this is another highlight from the album, and is a track no-one can miss. Amazing musicianship is the obvious main attribute of \"Lips Of Ashes\", and it does not disappoint on this (Or any other) front. Melting into an eventual silence, this track truly will give you shivers down your spine. Another unmissable from IN ABSENTIA, I can't stress how much you need to check this track out.5 out of 54. The Sound Of MuzakA track about the death of true music and the commercialism of money-making scams, AKA 90% of recent pop music, this is another stunner on the album. Guitar work is on yet another high here, and once again, the heaviness works more than perfectly with the drum track and the ambience provided by the keyboards during the chorus, as do the once again overlaying melting vocals of Steven Wilson. This is a truly brilliant track, and it contains one of my all time favourite guitar solos. Once again, technical and artistic musicianship is on a high here. A truly iconic masterpiece, and another track with no PT fan or prog fan can miss.5 out of 55. Gravity EyelidsOnce again, Porcupine Tree prove that they can still space out with the best of them! This is more than likely the track which inspired the somewhat shocking album art, and it's easy to see why. This track is obviously not a technical thriller, but artistically, this track will take you on a truly horrifying ride. Richard Barbieri shines here if he ever does, and even though through ambient sounds, this is what make the track special. Mr. Barbieri's piano work at the chorus is also truly beautiful, as are the overlapping vocals. The percussion in this track is incredibly rhythmic, providing an incredibly bass for a build-up which can be described as nothing less than epic. At around 3:45, this track takes a turn for what is even better than I thought was possible from this track. Reaching a much heavier rhythmic approach than originally expected, this track is somewhat similar to Porcupine Tree's 2005 track from Deadwing, \"Arriving somewhere (But not here)\". Gavin Harrison proves, perhaps for the first time, that he has some incredible chops as a rock drummer aswell as a light jazz player. Closing in the same way that it opened, it stands as one of the most solid and interesting tracks Porcupine Tree released up until that point, and provided a solid center for the album.5 out of 56. Wedding NailsMy least favourite track from this album, Wedding Nails revolves around technical overture. Although proving that Porcupine Tree are excellent musicians, this instrumental is very repetitive and does little justice to either side of Porcupine Tree. Its six minute length also seems a little unnecessary, considering this is basically a repetition of the same riff. By no means terrible, the only reason I can't say this track is a standout like the five which preceded it is because it doesn't really do any justice for the abilities of Porcupine Tree. Closing in another ambient melt, this track isn't bad; its just not great.3 out of 57. ProdigalA great track in its own right, the chorus seems heavily reliant on Pink Floyd's obvious influence. Once again, the echoing vocals provide an excellent contrast to the somewhat poppy feel of this track. A great rock n' roll riff brings this track to life, and makes it highly replayable and interesting. \"Rain keeps crawling down the glass; The good times never seem to last.\" Although only a small sample of the lyrics, its clear Steven Wilson put a lot of thought into this track, and indeed, into this utterly astonishing album. A nearly balladic rock song, this is another stand out on the album, which provides a lovely contrast to the two tracks which preceded it.4.5 out of 58. .3Another somewhat melancholic and psychedelic song, this track is really interesting. This is where Colin Edwin begins to shine on bass for IN ABSENTIA, and from here on in, he doesn't disappoint. Mr. Barbieri's amazingly ambient keyboards once again play a leading role in the harsh gravity of this track, which, if listened to directly after Prodigal as was intended by Porcupine Tree, provides yet another bleak and fascinating contrast. Eventually reaching an interesting vocal and acoustic guitar melody, this track always reminds me of \"The Moon Touches Your Shoulders\" from \"The Sky moves Sideways\". Similar to Gravity Eyelids, this track closes in the same way it began, albeit somewhat anti-climatic.4.5 out of 59. The Creator Had A MastertapeA very dark track, the musicianship is amazing on this track, particularly in the rhythmic section. Colin Edwin and Gavin Harrisson gel brilliantly for the first time here, and it provides an insane contrast to the use of stereophonics and great guitar work. The chorus is a bit? Shocking? More thrash than conventional metal or prog, the chorus is composed of incredibly distorted guitar chords, but not in a good way. Another quite boring track, this is hampered by a mass of repetition, much like Wedding Nails. Once again, this is not an outright bad track, but it is rather uninteresting compared to the other many greats on the album. The lyrics, however, are something to behold in this track; Telling a dark, shocking story whilst playing perfectly over the track.4 out of 510. Heartattack In A LaybyAnother excellent track, this is once again reminiscent of old-school space rock Porcupine Tree. A lot more quiet than the track that preceded it and the track that comes after it, I love this track to bits. The lyrics are once again amazing, giving us an interesting flow with the highly muddled guitar and keyboard work. Layered vocals are what making this track so amazing, especially in the outro. At around 2:35, this track changes to an incredibly beautiful layed vocal track, which is easily my favourite moment on the latter half of the album, and gives out an incredibly melancholic and pseudo-relatable feeling.5 out of 511. Strip The SoulAnother somewhat repetitive track, this is by no means bad, but just does not really appeal to me as most of the other tracks on this album. Highly rhythmic vocals make this track interesting, as does the lead into the chorus. Eventually, you may grow bored of this track, although you will hear something different on nearly every listen of this song. I can't say this is a favourite, although it is quite interesting and provides another amazing contrast to the track which came before it. Eventually this track flows into about 4 guitar overlays, each one as amazing as the other, and the guitar solo is particularly interesting here. Although not the most interesting solo, it works nearly perfectly with the track and helps to add depth and replayability to what is an otherwise rather stale track.4 out of 512. Collapse The Light Into EarthA beautiful piano led track, this is one of the most perfect album ending tracks I've ever heard from any band. An amazing progression helps this track come to life, and provides something that is nothing other than f**king amazing. I can't stress the brilliance of this track; its just simply perfect. Vocals are on a high here, as is the ambient playing of Richard Barbieri. Entering into a more than perfect flow of symphonic violins, this track couldn't be better. I find it hard to express the perfection of this track; the vocals, lyrics, simplicity, complexity, context, emotion provoking ability, I don't truly understand what makes this track so amazing; it? Just is. The violins and vocals work in a perfect tandem, which is nothing other than pure emotion being thrown forward from the minds of prog's young shining stars. So brilliantly climatic, I don't know what else I can tell you about this track, other than you perhaps won't see what's so amazing about it unless listened to in order with every other track on this absolute masterpiece. Please, do yourself a favour, and here this track in surround; it will make you think differently about this band forever. Closing in the same piano riff which opened it, this is simply inspiring on a level above human comprehension.5 out of 5 (Once again, 6 if I could)Closing comments: This album is much better than its parts, although they are all amazing in their own right, the fact that they are compiled and have such an amazing flow. Possibly a concept album, Steven Wilson, as a believer of self-interpretation, gives very little hints to the inspiration and/or backing story to this masterpiece.This one is unmissable; Porcupine Tree fans and new listeners alike will see the brilliance of this album, and I hope you do too!Just buy it! 5 out of 5; Absolutely perfect. -Joel"
    },
    {
      "reviewer": "EatThatPhonebook",
      "date": "Posted Monday, September 7, 2009",
      "rating": 5,
      "text": "9/10\"In Absentia\" has a new, explosive, change of sound for Steven Wilson and his band!\"In Absentia\" was most definitely the heaviest PT record at the time, and certainly completely different from all the previous albums. In an interview, now available as an eleven minute track in the EP \"Futile\", Steven Wilson, PT leader, explains that during this period he was listening to some Extreme prog metal bands such as Opeth and Meshuggah, and that they were his main influence for writing all the heavier songs. The style of the album is, other than having some new, heavy moods, has. Like many previous albums, some pop, prog, jazz at times, ambience and psych. It is, stylistically speaking, PT's most eclectic album to date. The structure of the album is kind of different: no short songs ,as well as no excessively long songs (not longer than seven minutes), and there twelve songs, even though this amount of tracks isn't new for the band. In this way, you can't really feel the album as a journey that you must listen to all the way through, but more like a collection of songs, which isn't necessarily a bad thing, like in this album.\"Blackest Eyes\", \"Trains\", \"Sound Of Muzak\" are three very big hits for a prog band, mainly because they're very melodic, catchy, and at times exquisitely heavy. \" Lips Of Ashes\" finds itself in the middle of these three hits, and it's probably the weakest song here. \"Gravity Eyelids\", however, is a masterpiece, seven minutes of an increasing climax, and before you know it the song explodes from a calm keyboard driven mood into a fantastic heavy riff. \"Wedding Nails\" is a great instrumental piece, almost all of it guitar driven, unlike other PT instrumentals. \"Prodigal\" is a beautiful song, very underrated, a lot of soft and dreamy moods. \"3.\" Is a spacey, keyboard driven song, almost all instrumental, but with many great moments. \"The Creator Has A Mastertape\" is kind of odd, with a heavy bass driven verse, and has generally speaking kind of an energetic feel to it. \"Heartattack In A Lay By\" is a soft, beautiful song, with a very melancholic and sad sounding melody. \"Strip The Soul\" is another heavy masterpiece, with plenty of great moments that you won't forget. The last song \"Collapse Light In the Earth\" is another calm song, but very beautiful, with a heartbreaking melody that warms you up everytime you listen to it.In conclusion, \"In Absentia\" is an album that is essential if you like progressive rock music, since it did go down in prog history as one of PT's best and most complete albums."
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Sunday, October 4, 2009",
      "rating": 3,
      "text": "The Prototypical PT AlbumIn Absentia regularly gets the highest marks among PT albums, was the first album of theirs I bought. I've been putting off this review for along time due to ambivalence, taking the time to review the new Incident prompted me to go back to this classic. And like that album, I'm torn between giving the album 3 and 4 stars. Two things contrast the album in mind: In Abstentia's stronger pop songwriting, and its overscrubbed production. Part of me enjoys the individual songs on In Abstentia better, as they're just more hummable and singable. But this album really is more of a crossover prog album, using prog elements to enhance what are essentially pop songs.Steven Wilson's depressive, sarcastic lyrics appeal perfectly to the teenage goth set, but don't hold up much to scrutiny for an adult. The snipes at modern music on \"The Sound of Muzak\" satisfy a certain itch, but the irony is that Wilson himself is guilty of creating modern Muzak as much as anyone else. Truly tasty musical choices are rare, including the banjo on \"Trains\" or the Mars Volta-isms on \"The Creator has a Mastertape.\" I also miss the crunch of later albums, seen here only in very small doses. The repetitive psychedelic sections are okay, but really only perk my ears when more exotic or spooky tonalities are used.The biggest problem with this album is that it just seems too deliberate, too careful, too nitpicked. On \"Wedding Nails\" the main riff is quite stiff and it's not until the second guitar comes in that a groove finally starts. The second section using the Ministry-like two note riff is much better, but still struggles to maintain the raw emotion of Jorgenson's outfit. I know this is a prog site, but I just want to scream to Wilson to let his heart out a bit and not think so hard. At the same time, my favorite song on the album is the relatively straightforward melancholy dream-pop of \"Prodigal.\"Most of this has been pretty negative, but one thing is clear. Steven Wilson is very talented both as a musician and as a producer. He has one of the best left brains in the music business, and this album was made at his peak in that regard. Wilson's mastery of sound, his sense of melody and rhythm, all of the fundamentals and more are here. The music is enjoyable, and seems like work that would appeal to a relatively wide audience compared to much of the music on this site. I find myself turning to this album only once in awhile, and rarely for its entirety.This still remains a 3+ album, a worthy addition to any fan of modern prog. The skill level alone makes a lower rating seem false, but this in no way reaches masterpiece level. My choice of a 3 rather than 4 has more to do with my taste than anything else."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Friday, October 9, 2009",
      "rating": 3,
      "text": "According to PA it's most popular and the best PT album. Whenever I really liked their Stupid Dream, I purchased that one as well. And was disappointed!You can read tens of reviews for this album there , mainly very positive. I don't know, what is the reason, may be it's just question of taste. So, I can't see the reason to repeat all good or bad opinions in detail, just will try to make some comments.First of all, the album is a bit ... different. Different not only from Stupid Dream,for example, but different from what I understand as prog-rock in general. For sure, they use many prog elements ( mainly used by other great prog musicians before), but common musical platform is something different.When I want to listen to brit-pop, I can do it without using PT ( to be honest,I hate brit-pop). There are for sure many bands playing this style music better (Oasis,at least). If I want to listen to progresive brit-pop, I can take Radiohead ( and some their songs are really better, than this PT imitation). If I want to listen heavy music, I can take one of hundreds perfect heavy rock albums ( you understand, that it's no even reason to compare PT with best heavy bands in their field of music). So - what the reason to purchase this PT album?If only I want to save my money, and instead of buying 3-4 excellent CD's of perfect musicians ( each in their own style), I will buy this mixed cake under the name \" music style: whatever you want\"? I believe, that using that trick PT got much wider audience ( let say true - number of buyers), but is it enough reason to name this album excellent? They stole part of cake from Radiohead,Opeth, some indie bands, so hope it gave them good additional income. But what did it give to me, as to prog-rock fan?Not everything is so bad. Album is long ( I own european edition with 3 bonuses), so they filled all possible CD space for money paid. Second part of the album includes more prog songs ( less indie,less brit-pop,I mean). And if there are not big masterpieces, at list that part is more listenable. Can I listen this CD? Yes, but not too often . Do I like it ? No way! There for sure are better PT albums in this world!"
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Friday, November 6, 2009",
      "rating": 2,
      "text": "I used to believe that the older a person gets and the more music we listen, the less capacity of surprise have left, but as I age it has increased, still I'm able to find fantastic music where I didn't expected, and strong disappointments when I believed I would be before a great album, \"In Absentia\" is one of the second cases.After reading countless reviews that describe this album as a masterpiece (even from reviewers with whom I share common taste and others I respect a lot), bought this album in 2005, and my first impression was very negative. Being that is common for me to acquire the taste for a Prog album after some time, waited four years until I wrote a review, but sadly my opinion hasn't changed. With this I'm not saying all the reviewers are wrong, because maybe the problem is my personal taste, but I believe \"In Absentia\" is one of the most unexciting albums I ever listened.People talk about a Heavy Prog album with Space Rock elements, to be honest I only find an alternative album with some Hard Rock elements, but very little of Space Rock, and less of Prog.\"In Absentia\" starts with \"Blackest Eyes\", and after a heavy introduction based mostly in distorted guitar, comes an endless display of Alternative Rock without the imagination of RADIOHEAD, but all the characteristics I dislike of this sound....Repetitive, downhearted vocals, lack of emotion and seems extremely long because the lack of versatility (despite it lasts 4 minutes), incredibly the next song \"Train\" reinforces my opinion, I can't understand why they bothered to make two tracks, when easily they could have made a monotonous epic of almost ten minutes, because both songs are absolutely similar.Saying that \"Lips of Ashes\" is different could mean something positive, but not in his case, the song is slower, more repetitive and tedious than the previous two. I won't deny that the introduction is nice and spacey with a mysterious use of keyboards and guitar, but as soon as the vocals enter they fall again into that gloomy sound so common in Alternative bands.When \"Sound of Muzak\" started I noticed immediately we were before a very good song, with nice variations, excellent drumming and at last vocals that don't induce to suicide, but it's also obvious that the influence of RADIOHEAD is more than casual, specially to \"Paranoid Android\".After the first minutes of \"Gravity Eyelids\" I was tempted to press the skip button, because it seems as they are playing the first two tracks again, but around the second minute, a nice Mellotron made me continue even when the structure kept being as boring as in the beginning of the album. The second half of the song is much less depressive, specially because the heavy guitar, but not enough to save it.In the beginning of \"Wedding Nail\", PORCUPINE TREE at least gives signs of life, the excellent guitar - keyboard interplay is enough to place me in a better mood, because a couple more songs like the previous and I would probably need Prozac. Around the middle, the experimental interplay between guitar and spacey keyboards (really jamming), places this rack as the most Progressive Rock oriented until this point. Interesting and nice to listen.But nothing lasts forever, \"Prodigal\" is another slow and repetitive Alternative song with vocals trying to sounds like COBAIN. Even when the choirs are interesting, the general atmosphere is so lack of energy that a depressive person could blow his head. Again at the middle an instrumental break makes us think that things are going to change, but after some seconds, is more of the same.\"Dot Three\" starts with an interesting but short bass intro that leads to another space Rock oriented keyboard passage, the drumming is so mechanical and weak that had to check the credits twice to verify if the drummer was human.Despite this fact, Richard Barbieri does an outstanding job with his oneiric synths, an Steve Wilson supports well with his acoustic guitar...But when he opens the voice, my need for Prozac increases exponentially. I wonder if this band wouldn't be much more solid if they only played instrumentals.\"The Creator has a Mastertape\" intro reminds me of STEVE HACKETT later albums, and that's already something, at least this time the vocals are so distorted that sound alm9st decent despite the lack of variations.The instrumental breaks (1:57 and 2:55) are so violent and unexpected that reminds us we're not before a band of zombies, this guys are alive, sadly they seem to forget it most of the time, after a couple more instrumental breaks in the same vein, the song fades down in an extremely beautiful Mellotron coda.As usual after a good track, the band returns to that sad, nostalgic and low-spirited atmosphere, as if they were not enjoying what they do, and the result is one of the most uninteresting songs in history.The album ends with \"Strip the Soul\" and \"Collapse the Light into Earth\",mention both together because the sequence repeats, a strong vibrant song and another saddening tune, at least \"Collapse the Light into Earth\" has a nice piano and better string arrangement at the end, but not enough to rescue the album.Believe it or not, I would had loved to listen a great album and rate it with 5 stars as most of the reviewers, but I would be lying if I did so, \"In Absentia\" has one excellent song, two or three good ones and the rest is average or less, so I have no alternative to rate it with two stars.As in the beginning I have some questions...Are the other reviewers crazy when rating this album with 5 stars?....Am I incapable to find a beauty that is so evident to others?....I believe none of both, it's simply the personal and God given taste.I know I'm going to receive a lot of negative feedback from the fans of PORCUPINE TREE, but that's the price you have to pay when yo don't like a high rated album and give your honest opinion."
    },
    {
      "reviewer": "The Quiet One",
      "date": "Posted Thursday, May 6, 2010",
      "rating": 3,
      "text": "Prog Rock is Absent, Alt. Rock is PresentWell, that title is false, just trying to make a relation with the wordAbsentia with the style of the album. However, it is true that this album has a lot of allusions to modern day's rock style entitled Alternative Rock: a genre that can rock pretty hard and does not contain extremely lame lyrics so as to be considered today's Pop, though it has the basic structure of verse-chorus-verse-chorus.Porcupine Tree certainly were a full-blown Prog Rock band back in the 90's, however they changed radically with the release of Stupid Dream, playing more melodic and simple music, and to confirm that they were taking that path they released Lightbulb Sun the following year. The psych/electronic roots were clearly leaving, while a catchier and melancholic style of rock was approaching, it's worth saying that it's a very unique approach to Alt. Rock with Pink Floyd as an obvious influence.The album is full-filled with either hard rocking tunes with well-thought catchy choruses or moody songs with great atmospheres reminiscent of Pink Floyd. Sorry for the lack of originality, but for me the best songs from In Absentia certainly are Blackest Eyes with its infectious metal riff and it's great moody contrast, Trains with it's lovely acoustic-feel allthrough and .3, this last one being a magnificent spacey semi-instrumental, the atmosphere created with the keyboards and strings is absolutely brilliant.The rest of the album is okay-ish, definitely well-composed songs, but nothing particularly memorable; some mediocre metal riffs (Wedding Nails and The Creator Has a Mastertape) and the melancholic/poppier tunes just seem rehashes from the better and more memorable ones from Lightbulb Sun and from Stupid Dream (Heartattack in a Layby and Collapse the Light Into the Earth).Good bunch of ideas, and it's really something great if it's put aside with other Alt. Rock releases, but In Absentia per se is not really such a big deal, especially considering that A) Stupid Dream had already done most of this 3 years before, and B) It's definitely Porcupine Tree's most famous release among Prog fans, yet it barely has any Prog substance, though this latter won't affect the rating.3 stars: Its flaws don't harm the album that much to consider it a poor release, but it's a borderline good album. Mind you, Porcupine Tree did much better before and after in the same vein: Lightbulb Sun and Deadwing."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Wednesday, May 26, 2010",
      "rating": 4,
      "text": "In Absentiais the album that drew many new fans to Porcupine Tree. Steve Wilson had just finished the production duties on Opeth'sBlackwater Parkand a part of that fanbase followed along to check out the music of that Wilson guy that had upgraded their band to the best on the planet. Older PT fans were of course curious to hear which effect the collaboration with a \"Death Metal\" act would have on PT's sound.Actually, the difference with the two preceding albums isn't all that big. There's still a focus on verse-chorus rock songs with lots of acoustic guitars and superb keyboard atmospheres. If there's any difference at all, it's in the guitar sound. Mike Akerfelt must have shown Steve how to crank up the distortion gain of his guitar amplifier and rock out! The guitars are a lot louder and the riffs are much heavier then ever before. It brings an extra dimension in PT's sound that does magic where it works, but that falls short of PT standards where it doesn't.I'll abstain from a song by song overview here, there are too many of them and I'm too lazy today. Let's just pick out a few.Lips of Ashesis an often overlooked track. As far as I know they haven't even played it live. It's quite similar to the atmospheric tracks at the end of Anathema'sA Fine Day To Exitand an obvious favourite of mine.Wedding Nailsis a bit of an odd PT instrumental, taking influences from industrial and math metal. Meshuggah comes to mind during the guitar solo, and the spooky atmosphere can sure be traced back to Wilson's admiration for industrial bands like Nine Inch Nails. An interesting experiment.Drown With Me. This track was referred to the 2CD special edition of this album. I really cannot understand that choice. It's one of their strongest cuts of the entire album. Love the forceful bass guitar that drives this song forward.In Absentiais a very long album and it falls prone to the typical missteps on such endeavours: average tracks.Prodigalis an ok song but has rather dull verses and the chorus is too much of a Pink Floyd ripp-off to be fun. The album would have been stronger without it. The same goes for.3, which is a lengthy improvisation on the bass riff ofStrip The Soul, which is by itself already a too lengthy Tool exercise, where the constant use of heavy guitars doesn't reach the usual versatility of Porcupine Tree songs.In Absentiamarks an important step in PT's evolution from freely flowing space rock to meticulously structured heavy rock. I believe PT kept improving this style on subsequent albums soIn Absentiaisn't an essential album of modern prog, but it's sure a very good one and it makes for an excellent introduction to the band."
    },
    {
      "reviewer": "jampa17",
      "date": "Posted Saturday, May 29, 2010",
      "rating": 2,
      "text": "My mind was absent, all the way down to hit the stop button.I'm not a Porcupine Tree fan, don't ask me why. Their hard rock riffs and their space rock should be enough for me to like them, but I always get to their albums expecting the ultimate alternative rock-pop-prog piece and I just give up. Really. This, being the most beloved album from them end up being one of the most boring experiences I have lately.Now, I really don't want to be mean or bash them, no. I do come with open mind to their music trying to find what is so exciting about them, as there are legions of fans all over progarchives.com, but again I felt disappointed. To the point, what we have here: A lot of heavy guitar riffs, well made and very catchy, some atmospherics themes, most of them pointless and soulless, some kind of catchy lead vocals, the most weak thing about PT because Wilson is very lame at that and long arrangements that let me wonder what is the point that a good sequence that last a minute they always take it farther and end up been totally pointless, without direction. I'm not criticizing the musicians, all of them are quite good really but most of the songs get lost somewhere, like the ideas weren't well developed at the end.The only song that really shines in this album is Wedding Nails, the rest of songs have it's good moments but boring in most of the rest. In the first listening I thought this would be another 3 star review, like Deadwing, but as long as check out more and more the album went down the hill and I think it's a 2 stars review. Only for fans, I keep wondering what people hear in this album to consider it a prog Masterpiece. I think it's fanboyism, because this is not a strong prog album, maybe a good alternative rock album with catchy songs, but far away of a masterpiece. One of the biggest disappointments I have suffer so far."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Thursday, November 4, 2010",
      "rating": 4,
      "text": "This was my first Porcupine Tree album, other than a tape of one of the early albums that a friend gave me. And I must say, the songs themselves just don't thrill me. On the other hand, Steven Wilson's arrangements just blow me away. Every so often, when listening to this album, I find myself thinking that this tune sounds too much like plain alternative rock, or that song just doesn't interest me. Then, something thrown into the mix just strikes a chord with me, and I find myself really liking the song that a moment ago seemed to be going nowhere. It appears that Wilson has an encyclopia-like knowledge of different musical styles, there's that much in there.After many listens, the only song that doesn't grab me isProdigal, which, for some reason, evokes Bob Dylan'sLay Lady Layin my mind."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Monday, January 10, 2011",
      "rating": 3,
      "text": "What does it mean when PT gets heavier as it ages? The former master of PINK FLOYD imitation and prog revivalist has now decided to try to carve his own sound. With drummer extraordinaire Gavin Harrison, and seasoned keyboard master, Richard Barbieri, he has a great foundation to build upon.This is the most universally acclaimed PT album has never quite grabbed me. The production is amazing but the dynamics are all over the place and the melodies are sometimes blotted out by the instrumental play--or they're just plain boring. While I appreciate Steven's efforts and creative drive, most of the songs and dynamics on this album do more to bore or alienate me. I find myself only going back to three songs: \"Trains\" (10/10), \"Blackest Eyes\" (10/10), and \".3\" (9/10). 'nuff said."
    },
    {
      "reviewer": "Andy Webb",
      "date": "Posted Thursday, July 14, 2011",
      "rating": 5,
      "text": "The sound of music fills the hallsPorcupine Tree is a name well known in the progressive community. The band started in the late 80s as a solo project for multi-instrumentalist Steven Wilson. His facetious and obscure recordings eventually culminated toOn the Sunday of Lifein 1991, which exemplified Wilson's early, silly recordings with the quirky, psychedelic atmosphere of the album. Eventually Wilson formed a full band and released two more albums in the first of Porcupine Tree's three distinct eras - this one being the Delirium era. With little transition space, the band flew into the Snapper era withSignify, which had a much more straightforward rock sound with little to no psychedelic elements remaining, which was a far cry from the previous album, the spacey and trippyThe Sky Moves Sideways. This era lasted again for two more albums, and in 2001, with the release of Porcupine Tree's 7th studio albumIn Absentia, the band flew full force into the Metal era, if you will, with the music being exponentially heavier and more eclectic than previous eras. The album, blasting forth with the killer \"Blackest Eyes,\" shows Wilson's obvious willingness to expand his band's diverse sound, and the next track, the significantly lighter \"Trains,\" shows the Wilson is not willing to bore the listener with just one sound on this record. Even through a near paradigm shift of this band's sound,In Absentiaremains a fan favorite, and easily on of the band's better albums.As I've stated above, this album is an extremely eclectic blend of Wilson's musical ideas, tastes, and abilities. Whether it's the sound of a crushing metal riff, peppy acoustic strumming, or the spacey illustrious notes of an Appalachian dulcimer, this album has its share of diverse musical influences. Switching lanes constantly throughout the album, the music fails to stay constant and keeps its diverse pulse throughout the entire album. Different from their previous sound although it may be, the album's diverse and inviting new sound has me, and it should you, captivated by the sounds that captivate this album.One thing I enjoy about a good portion of Heavy Prog is the lack of emphasis on virtuosity (don't get me wrong, I understand quite a number of HP bands have an emphasis on virtuosity as well, and I love virtuosity, but a break at times is nice). Porcupine Tree is one of these bands. From their psychedelic roots, Wilson has obviously developed an appreciation for atmosphere, which this album is full of. The feeling brought out by Wilson strumming or the essential filling that Richard Barbieri creates with his ambient key fills, based upon his experience in ambient and new wave bands, is essential to the Porcupine Tree sound. Colin Edwin's steady bass lines lay a fantastic foundation for the band, and the new guy on this album, stickman Gavin Harrison's skillful and precise drumming mesh together for a spectacular new sound for the band. The new era is truly an amalgamation of Porcupine Tree's diverse influences and feels.In the end,In Absentiapresents itself as a wild change in direction for the band. Whether you are a fan of their Delirium or Snapper era won't really make a difference of whether you'll like this album because it is so diverse and far reaching of influence virtually everyone will like some piece of it. The band still has the distinct ability to make not overly complex but complex enough music to keep most progressive fans listening, and the composing power of the great Steven Wilson is enough to keep many fans listening still. From the heavy metallic songs to light folky songs, the album is easily one of Porcupine Tree's most diverse and easily one of the best they've released to date. 5- stars."
    },
    {
      "reviewer": "memowakeman",
      "date": "Posted Wednesday, July 20, 2011",
      "rating": 3,
      "text": "A good Porcupine Tree album, and that's it!It has happened to me several times, albums such as Rush' Moving Pictures or Focus' Moving Waves that are often categorized as the band's pinnacles are just average albums to me, with excellent songs and a great structure overall, but nothing outstanding. With Porcupine Tree's In Absentia happens the same to me, since the very first time I listened to it (at least five years ago) until today my love for it has not changed, I like it and enjoy it when I listen to it, and really love a couple of tracks, but as an album, as a whole, it is just one more in my collection.The reasons are simple, this album did not click with me as others did (subjectivity) and also despite people use to call it as Porcupine Tree's best, I believe it does not even show an improvement to their previous works. Here we can find catchy tunes and commercially speaking successful tracks that people passionately love, such as \"Blackest Eyes\", \"The Sound of Muzak\" and \"Trains\" , songs that everyone know and want to sing, but that (objectivity) do not represent the band's best or finest compositions, not at all.What I like here is that In Absentia offers a diverse amount of styles, because we can listen to progressive rock, alternative rock, spacey moments and even some heavy prog ones. All the tracks are good, well composed and performed as usual, but I believe the album as a whole is not that strong, it has highs and lows. Besides those previously mentioned \"commercial\" tracks (which I like but not love) I would highlight \"Heartattack in a Layby\" which is a wonderful soft song with amazing backing vocals and spacey hints; and the closer \"Collapse the Light into Earth\" which is one of the best ending tracks I've ever listened.The 68 minutes that runs here are not that pleasant to me, in fact, there are moments when I get tired and bored, tracks such as the same \"The Sound of Muzak\" or \"The Creator has a Mastertape\" can be easily skipped. Honestly, this album does not even enter in my PT's top 3, I know it may have been a landmark, but it does not have that heavenly effect in me that albums such as \"The Sky Moves Sideways\" or \"Lightbulb Sun\" had in me, albums that I truly enjoy from start to end. So my final grade for this well-known album is three stars.Enjoy it!"
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Friday, March 9, 2012",
      "rating": 5,
      "text": "Porcupine Tree's In Absentia certainly caused a stir when it came out - some prog-heads even going so far as to suggest the time Steven Wilson spent with Opeth had rubbed off on him - but listened to in the context of their whole discography it's clear that it's an evolution of their sound, not a reinvention of it. You can still just about hear the spacey psychedelic prog foundations of the band (which they'd never really given up) and you can also still hear the Radiohead- inspired indie rock/prog rock crossover of the triptych of Stupid Dream, Lightbulb Sun, and Recordings.On top of this, there's an injection of a heap of hard rock, heavy metal, and heavy prog (a la King Crimson - see, for instance, the opening of The Creator Has a Mastertape) influences which add a third new layer of musical genetic material into the rich mixture Porcupine Tree habitually offer. And to be honest, this isn't even the most prominent feature of the album - sure, there's a big dose in the lead track, but there's also several gentler songs which wouldn't have sounded out of place on Lightbulb Sun.And come to think of it, the title track of that one had some fairly hard riffing on it too, didn't it? Just like I said: evoltuion, not revolution. But what an evolution!"
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Wednesday, August 22, 2012",
      "rating": 3,
      "text": "I've been slowly trying to go backwards into the Porcupine Tree discography to catch up on what I had been missing out on before I got into prog rock. IN ABSENTIA was the launch pad for many to discover the group, and it's not hard to see/hear why fans of the album have latched onto the band ever since.What IN ABSENTIA is, is a carefully blended mix of pop (mostly of the indie and dream variety), prog rock (mostly Floyd-isms), and heavy metal. Frontman Steven Wilson mentions (briefly in the thank-yous of the liner notes) getting into Opeth and Meshuggah around this time, and the result is mostly in the volume of the heavier tracks. Those heavy tracks like ''Wedding Nails'' and ''The Creator Has a Mastertape'' are indeed heavy.Much more of the album is reliant on catchy pop hooks, jangly acoustic guitars and near straightforward arrangements. New drummer Gavin Harrison doesn't sound like the Harrison that can't say no to any proggy metal project just yet. There are parts of the album (like in ''Gravity Eyelids'') that have a 5/4 metre sound almost forced, as if the song would be just fine without the random odd time in there; this is in contrast to the flow that ''The Sound of Muzak'' provides in seven.The attempts at making longer songs unfortunately get tiresome. ''Prodigal'' and ''Trains'' outstay their welcome on second five; neither riff sounds inviting nor neither carry the length weight that they do. ''Strip the Soul'' is a better stab at it due to the bassline. Even the instrumental (or near) attempts get tiresome mainly due to repetitiveness or the band not quite sure how to extend the song length.One other huge aggravating gripe I have is Steven Wilson's voice; it may work with his lyrics, on the quieter tracks and on the indie stuff, but he hasn't quite figured out how to incorporate his voice into the harder stuff yet (see BLANK PLANET for where his voice does work). Overall, he lacks dynamic power, as if his voice is completely nonchalant.Oddly enough for my tastes, the ballads/softer tracks are the best ones. ''Lips of Ashes'', ''Heartattack in a Layby'' and ''Collapse the Light Into Earth'' are tear-jerkingly moving, and the spots on the album where Wilson's voice is meant to work well.I must have had a better impression of IN ABSENTIA when I first listened to it with the heavy song and ballad song contrast really impressing me. I now find too many nitpicks to highly recommend this. That, and its near seventy minute length is about overkill."
    },
    {
      "reviewer": "CCVP",
      "date": "Posted Tuesday, November 20, 2012",
      "rating": 2,
      "text": "What a man needs to do in order to avoid the negative media onslaughtFor years, decades, after progressive rock fell from grace among the mainstream media (big newspapers, television and communication networks), many (if not all) artists linked to that genre of rock music have been subject to some kind of attack, which criticized and looked down on their qualities and strengths, as if they were something to be ashamed of. As a result, some have changed their musical direction (Yes, Genesis, Gentle Giant, King Crimson, Jethro Tull, Rush, PFM, Banco Delle Mutuo Soccorso, Mike Oldfield, etc), others have halted their musical output completely (King Crimson, Van der Graaff Generator, Focus, Magma, etc) and, surprisingly, a number of artists even started to deny they were ever connected or ever produced progressive rock in any way; that last option is the case with Steven Wilson.After releasing two of the best space rock albums since a very long time in the mid 1990's (Up the Downstairs and The Sky Moves Sideways) and getting some attention from the press, probably negative, Wilson and Richard Barbieri decided to move towards other musical territories which were more widely accepted at that point in time in the UK, the britpop. It was a very smart move because that genre allowed them to have some musical liberty with the psychedelic elements in their sound, because britpop incorporated some (light-aired) degree of psychedelia. Indeed, from Signify on to In Absentia Porcupine Tree downgraded their musical abilities and stopped challenging themselves in order to excel in writing great music because, after all, the objective was to put out pop sounding albums, with some progressive songs here and there. All these years amounted with In Absentia being their least impressive, most boring and less inventive album in Porcupine Tree's career after their debut, but with one fundamental difference: on their first album, Steven Wilson was trying to do the best thing he could musically.Here, the music recorded has no fundamental difference from their two previous albums, Stupid Dream and Lightbulb Sun. The songs here are in fact so generic that it is possible to interchange almost every song from any of these two previous albums with In Absentia and there would be little noticeable difference to how they sound, if there is a difference at all. There are, however, some exceptions: the opener, Blackest Eyes, is quite an unique song and seems to be some kind of prelude to the new musical direction the band would take in the near future, despite still retaining the simpler, more pop-inclined sound so characteristic of this PT's era; Wedding Nails also is a nice breath of fresh air, having a similar tone to Blackest Eyes, but having a more experimental edge to it; and the duo made by Prodigal and 3, with their clear psychedelic influence, are also a positive deviance from the overall musical sameness this album is. After 3, however, the album spirals down to a low I wished the band never were, even though the last track manages to avoid the album from ending in such a terrible place.The poor result this album has to my ears can be blamed on, to some degree, the fact it is what can be considered a transition album: it is the bridge linking the band's previous era with its next. I mean, it (mostly) retains the pop-directed rock from the late 1990's, it has the return of the spacey elements Deadwing and Fear of a Black Planet would bring back (even though this element was also present in Lightbulb Sun) as well as brings something new (the newly acquired heaviness) to the table. Still, Signify was also a transition album and it managed to be miles better than In Absentia.Besides the forgettable songwriting, this album also has another problem which I find relevant. On mostly all of Porcupine Tree's albums, the keyboards play an important part in the band's overall sound, specially because Steve Barbieri is the main songwriter besides Steven Wilson, but here they are put in a background position, giving place to the guitars and drums, giving the album more of a rock and roll feel than progressive rock feel. OK, I know Gavin Harrison is an phenomenal musician with abilities way above average and that Steven Wilson writes the majority of songs, but is that enough to kill, to throw off the window the entire atmosphere the keyboards create in progressive rock? Again, another of many poor choices made in this particular album. Some songs still retain the keys as an important part of their sound, which are, not coincidentally, Wedding Nails and 3.Rating and Final ThoughtsIn spite of definitely being the lowest point in Porcupine Tree's discography and not having that many good moments, In Absentia manages to have just enough songs in it to keep me from giving it the lowest rating possible. Bad songwriting, forgettable songs and bad choices in mixing the instruments together are some of the most clearly seen flaws here. I'm just glad they moved on from this."
    },
    {
      "reviewer": "Roland113",
      "date": "Posted Wednesday, August 13, 2014",
      "rating": 5,
      "text": ". . . In my not so humble opinion.\"In Absentia\" is an essential prog masterpiece. Every respectable prog collection should have this album in it. Porcupine Tree is one of the most popular prog bands of the nineties and this century and \"In Absentia\" is the best, most complete album front to back in their catalog. When my Dad asked me about modern prog music, this is what I played for him, and he loved it. This album hits you from the very beginning of \"Blackest Eyes\" through the soulful end of \"Collapse the Light Into Earth\".For starters, the song writing by Steven Wilson and company is phenomenal, \"Blackest Eyes\" mixes the heavy and the acoustic almost interchangeably, the contrasts between the differing sections grab you while the dark, brooding lyrics sink into your soul. \"It's so erotic when your make up runs . . . \" \"Trains\" is one of the catchiest songs Mr. Wilson's ever written, the chorus sticks with you for days, while \"Lips of Ashes\" is almost entirely Richard Barbieri atmosphere. \"The Sound of Muzak\" again features a wonderfully catchy chorus.Each and every song on this album has a notable moment to it from the progression at the end of \"Prodigal\" to the groove and atmosphere of \".3\". This album has been reviewed by countless people at this point, if you haven't listened to this album yet, do yourself a favor, go find yourself a copy of \"In Absentia\" and enjoy it. Every aspect of this album is fantastic. Easy five star rating from me."
    },
    {
      "reviewer": "Wicket",
      "date": "Posted Wednesday, March 25, 2015",
      "rating": 5,
      "text": "I've found as I've gotten older as a musician, a composer and a fan of listening to music in general, I've found my tastes in music change. As well as pretty much everyone does at one point in their life or another. Ever so slightly, but they do change. The most notable of mine which takes the form of moving slowly away from the more symphonic prog (Yes, Flower Kings, etc.) and moving more into more digestible, shorter tracks, but still filled with emotion and juicy stuff. I've hoarded onto Haken's entire discography for quite some time, yet haven't truly listened in depth to their stuff until just recently, and am also currently on a Porcupine Tree binge.I've never been a fan of pop music, yet I'm always a sucker for a catchy lick, a cool lyric, and maybe once in a blue moon, a high pitched falsetto. My sheer addiction to electronic infused indie pop and rock music can attest to that, but PT fills that niche as well, believe it or not. I've had \"Trains\" on my driving playlist for quite some time, and it's become one of my favorite tracks ever. The beautiful simplicity to it, the complex rhythmic and yet completely accessible structure, and maybe just the overall mature sound of it is just hypnotic. It's the same case I've made for \"Piano Lessons\". Both are mature examples of a British prog pop sound.... I think. Or I could just be making stuff up, I'm not sure.After all, the opening sentence of PT's bio on this site sums them up nicely; there is no one word to describe their sound or genre. Maybe it's just the smoothness of which their music is composed and performed. Or maybe it's their British accents. I am, after all, a sucker for British accents. Or maybe that's just to do with my love for famous British automotive television shows (RIP Top Gear).Either way, Porcupine Tree as a subtle way with inserting catchy and sophisticated songs in between straight up hardballs with a subtle and rhythmic complexity that prog fans adore. Part of it falls to Steven Wilson's masterful composing skills, and part of it lies with the extraordinary drumming of Gavin Harrison. I personally believe as a drummer, Harrison is underrated. Each drummer strives to create their own unique sound: Bernard Pretty Purdie for the \"Purdie Shuffle\", Mike Portnoy with his chest-crushing bass sounds out of his set, Terry Bozzio with his 5-million tom drum set (or is it 5-million and 1? he might have added a few more, I'm not so sure). Point is, in every facet of life, you have to stand out from the crowd with a distinction completely unique to your self.Harrison's greatest contribution is his ability to fool you. He doesn't focus on blistering solos around the kit or furious double bass onslaughts. He doesn't try to be clever and throw a 12/25 polyrhythm in 5/8 bar. His style is much simpler than that, yet is still clever. He throws accents on the offbeat, displaces it, relies more on syncopation. He'll play, for example, in 9/8 on a track in 3/4 and fool the listener it's just a standard 3/4 groove. You can never play in time with him because every time a rhythmic cycle turns around, he'll throw the snare on a different beat, add in an extra bass hit, throw in another fill, displace the beat not once, but TWICE in the same measure.In short, it's genius, but subtle. Very subtle.I recently bought his books \"Rhythmic Illusions\" and \"Rhythmic Perspectives\" for drumset, and it's both a fascinating read, and great to practice. First off, unlike most drumset methods books, he introduces every excercise or set of excercises with explenations on how to perform it and what illusion it emits or what it's supposed to convey. You get a feeling that he actually wrote the book himself, rather than just let the publication company rip off some of his beats from PT tracks and simply stuck his name on it. And that philosophy really echoes in his drumming style. You get a sense that he isn't just \"rocking out\". He's creating a groove, and then playing with it a bit. An extra snare hit here, a displace bass drum hit there. All resulting in a groove that you can feel and bounce to, but you can't air drum to it, simply because no two grooves are ever the same to him.This frankly is what upset me with the disbandment of Porcupine Tree. Wilson and Harrison are like Yin and Yang, Lennon and McCartney, Hall And Oates (ok, maybe scratch that one). Point is, both cannot survive without the other, and yes, while I do still like Wilson's solo stuff, the drumming tends to be more static and less interesting sometimes, luckily without detriment to most of his music, but it still isn't the same. Harrison's solo stuff hasn't fared that well, where you stay for the drumming, but ignore everything else.Maybe this is why I've been listening to more Porcupine Tree. I've had this stuff for so long, yet haven't listened it so much until a few years ago. Maybe it's for nostalgia's sake, I don't know. But In Absentia is one of those rare albums where you can't quantify it into a singular sound or motive, yet it's so distinctive and pronounced, you'd never be able to mistake it for anything else. Yes, it's a bit heavier than their previous work, less psychedelic and less jam band-y, but tighter, more focused, more concise, more mature.This album really does have everything. From the ballad-like \"Trains\", to the instrumental \"Wedding Nails\", from the ethereal \"Lips of Ashes\" to the grunge-echoing \"Strip The Soul\". It's album that's a testament to the time of its recording, yet manages to be so much more that it's still a fresh and inviting listen each and every time, even 13 years later, and when you come across music like that, you know you've found a future classic right there.Faults? The drums do sound a bit tinny at times, and the heaviest sections on the album, such as on \"Strip The Soul\" and \"Wedding Nails\" have a bit too much bite, and not enough sound, more of a gut punch than musical phrasing. Apart from that, the composition and songwriting is just mesmerizingly brilliant.Now, is it for everyone? Admittedly, no. No prog album can be recommended to every prog fan. Even fans of progressive rock are divided in styles. Most fans of traditional symphonic prog will probably find it too depressing for their tastes. Some people I know actually loathed Porcupine Tree for phasing out of the psychedelic phase, to which I responded \"Well, that's what happens when you mature; your tastes evolve\". And frankly, I don't think there's any better evidence of maturity than In Absentia. It finally caps a superb trio of albums with Stupid Dream and Lightbulb Sun. Sure, In Absentia isn't the most accessible album. In fact, Stupid Dream has the most pop-like songs that PT has recorded. Yet, it's still a complete piece of music that just can't be ignored by any fan of music in general. It's unique, it's catchy, it rocks hard, and delivers a unique listening experience every time.I may regret comparing Wilson and Harrison to Hall and Oates... or Lennon and McCartney.At least I didn't compare them to Pinky and the Brain."
    },
    {
      "reviewer": "TCat",
      "date": "Posted Monday, June 8, 2015",
      "rating": 5,
      "text": "This is the first of the louder and harder PT albums. It is also one of the best of one of the greatest current progressive bands in the biz. Personally, my favorite is \"Deadwing\" which is the release after this one, but this one is so very close to being the favorite. It has been reviewed on this site so many times already, so there is really nothing new to say that hasn't already been said. So, I'll keep it short and sweet, but I still have to add my 2 cents worth since I'm PT junkie. If you are a progressive rock fan, then you should have heard this album by now, and if you haven't, then you have some work to do. While it is true that not everyone loves PT and not everyone thinks the lead man Steven Wilson is a prog God like I do, but you can't deny Steven's influence and his contribution to the genre in these current times.This album is definitely one of the louder PT albums, and the guitar work and loudness of the album works very well. SW's lyrics have always been dark, even in his other projects, of which he has many. But that doesn't mean they have always been loud, in fact some are quite mellow and beautiful. But the harshness in this album and the following two releases is very well executed and drives home the meaning of the lyrics most effectively. The album starts out instantly very loud with the heavy introduction to \"Blackest Eyes\", but PT uses dynamics very effectively, so the music is constantly changing, even in their heavier albums. The contrast of soft and loud leans more towards the loud side in this album of course, but that really makes the contrast very noticeable and effective in all of the songs. The most beautiful of the contrasts occurs in the transition between the last two tracks; namely of the harsh and abrasive \"Strip the Soul\" and orchestral and expansive \"Collapse the Light into Earth\" which is soft and simply lovely with the repeating piano chords and the beautiful harmonies in the chorus. It's examples like this that make PT an album-oriented band and also makes them the masters of dynamics. If only more modern music artists could be this dynamic.Anyway, after all is said and done, this is a masterpiece of prog rock especially in the use of contrasts and dynamics. It is essential and Porcupine Tree deserves to have it's name up there with the best of the best in progressive rock. Definitely essential. 5 stars."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Tuesday, December 29, 2020",
      "rating": 5,
      "text": "Review N� 398\"In Absentia\" is the seventh studio album of Porcupine Tree and was released in 2002. This is an album marked by several changes in the group. It was their first album with their new drummer Gavin Harrison, who substituted their previous drummer Chris Maitland, and it was also the first album to move into a more heavy sound. It shows the band moving to progressive metal musical direction, contrary to their past albums with a psychedelic and pop rock sound.While not a formal traditional conceptual album, many of the songs still have common themes related to serial killers, youthful innocence gone wrong and criticism of the modern world, related with our Western civilization. The album's title is also ties into this, with the Latin phrase \"in absence\" or \"in one's absence\", which is often in reference to a person's rights when mentally they are unable to be represented in court in the normal and legal situations.The line up on the album is Steven Wilson (vocals, acoustic and electric guitars, piano and banjo), Richard Barbieri (analog synthesizers, mellotron and Hammond organ), Colin Edwin (bass guitar) and Gavin Harrison (drums and percussion). The album also includes the collaboration on backing vocals of Aviv Geffen and John Wesley.\"In Absentia\" has twelve tracks. All songs were written by Steven Wilson, except \"Wedding Nails\" written by Wilson and Barbieri and \"Strip The Soul\" written by Wilson and Edwin. The first track \"Blackest Eyes\" begins as a very heavy and distorted song making us believe that it's going to be a heavier song, but suddenly it changes into an incredible melodic song with heavy parts. It's a catchy melodic song with some nice contrasting aggressive guitars. The second track \"Trains\" begins with a simple acoustic riff, with Steven singing beautifully, and then it slowly blends into a catchy progressive rock sound with an amazing chorus and melody. This is one of the best tracks on the album. The third track \"Lips Of Ashes\" is a melancholic, slow and hypnotising song. It has a dreamy psychedelic feel with some distant Pink Floyd's echoes. This is a very simple song with dark, haunting and beautiful vocal passages, a reminiscence of the old times. The fourth track \"The Sound Of Muzak\" is one of the most interesting songs on the album and is just as good from a lyrical perspective as it's from a musical perspective. It's quite uplifting and it features some nice guitar work. The fifth track \"Gravity Eyelids\" is a melancholic slow song with some Mellotron sounds and a hypnotising rhythm in the background. It's a typical depressing Wilson's song with some aggressive riffs and with that typical Barbieri's synthesizer solo. The sixth track \"Wedding Nails\" is the only full instrumental track on the album and it has a heavy exploration of riffs, breaks and time signatures. It's a very heavy and noisy track, perfect for concerts, but somewhat out of misplaced on the album. The seventh track \"Prodigal\" is an interesting track, a friendly and a sunny piece that becomes a bit heavier towards the end. It has some more remote Pink Floyd's influences and sounds more like a track from the \"Signify\" period. The eighth track \"3\" is a psychedelic and atmospheric track. The orchestral sounds give to it a beautiful feel of melancholy and desolation. This might well be the track that appeals most to Porcupine Tree fans that prefer the 90's period. The ninth track \"The Creator Has A Mastertape\" is one of the heavier songs on the album, featuring distorted vocals and extremely heavy riffs. This is a great song with a very dark atmosphere and a heavy tone, but surely it isn't for everybody. The tenth track \"Heartattack In A Lay-By\" is an extremely good, beautiful, depressing and melancholic track. It has very subtle and breakable arrangements, with nice acoustic guitars and beautiful vocal effects. The eleventh track \"Strip The Soul\" is a catchy song with good lyrics, good chorus, good vocal passages and good musicianship. It starts very recognisable as a Porcupine Tree track with a great bass line, heavy metal guitars and distorted vocals. The twelfth and last track \"Collapse The Light Into Earth\" is a very beautiful little acoustic song that ends the album on a very high note. This is an excellent and sentimental ballad that can really get direct to my heart.Conclusion: If we analyse \"In Absentia\" we'll easily find this is a transition album of Porcupine Tree. It blends lots of different musical styles without be focused on any in particular style. It's really amazing how Steven Wilson lets that so many and different musical styles influence him and how he assimilates them incorporating all of them into his music. Undoubtedly the last relationship of Wilson with metal bands has been a source of inspiration on this album, particularly the latest two studio albums of Opeth, \"Blackwater Park\" and \"Deliverance\", which have been produced by him. But of course, this isn't a completely metal album. There are some tracks with experimental pop melodies and others with enigmatic and psychedelic fragments. In this sense, \"In Absentia\" has more to do with \"Signify\" than with \"Stupid Dream\" and \"Lightbulb Sun\". Concluding, \"In Absentia\" is a great album with no weak points, but probably, with too many different musical influences. Probably, I would rather prefer an album totally heavy or totally psychedelic.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Saturday, June 25, 2022",
      "rating": 5,
      "text": "Slowly but surely the solo project of Steven Wilson that began as a joke and was created simply to create music inspired by the most lysergic sounds of Pink Floyd incrementally gained steam and the momentum to reach the status of international prog stardom. After Wilson turned the project into a full band experience with 1996's \"Signify,\" PORCUPINE TREE had all but set its basic blueprint of mixing 90s alternative rock with 70s psychedelic space rock made all the better with elements of progressive rock mined from various sources. In many ways PORCUPINE TREE was like the more progressive counterparts to Radiohead with a very similar approach of mixing Krautrock inspired electronica, beefy guitar grooves reminiscent of the grunge era and a propensity for Pink Floyd's space rock set to thought provoking lyrical content.The band's second phase culminated with \"Lightbulb Sun\" which found them crafting some of the catchiest crossover prog tunes of the new millenium thus showcasing the band's propensity for delivering strong ear wormy hooks, eerily haunting harmonies and cleverly crafted space rock contrasted with a bit of alternative rock heft however the best was yet to come as the band ratcheted the aforementioned elements up a few notches and cranked out a trilogy of what many would deem three of the greatest prog rock albums of the 21st century. The first of this string of well-crafted albums came in the form of IN ABSENTIA in 2002 and with its instantly eye-catching album cover you know immediately you're in for something a bit out of the ordinary. This was also the first album to be released on a major record label. Lava Records may not ring a bell for many but is in face in partnership with Atlantic Records and has sold over 100 million albums, so they know what they're doing obviously!While the next step of PORCUPINE TREE's inevitable ascent to the top of the prog world may have been unstoppable, a couple well known factors played a pivotal role in how the band developed and upped its game. The first was the addition of drummer Gavin Harrison who played with an impressive number of artists before landing his role with Steven Wilson and friends. His seasoned approach and technical drumming prowess were exactly what PORCUPINE TREE needed to take them to the next level of technical wizardry and take them out of the dream pop-infused sorta prog camp to the whole enchilada. Add to that, Wilson acquired a taste for the world of metal music having discovered Burzum, Meshuggah and prog metal superstars Opeth. After meeting Mikael �kerfeldt and producing Opeth's \"Blackwater Park,\" the indelible mark of metal would leave its filthy little claws in Wilson's psyche and PORCUPINE TREE would never be the same.The differences are noticeable immediately. While IN ABSENTIA begins with some psychedelic teasers as the album starts, the opening track \"Blackest Eyes\" doesn't take long to showcase the band's newly acquired progressive metal bombast taken to the proper level of technical wizardry with Harrison's drumming skills. The beautiful thing about PORCUPINE TREE is that Wilson never jettisoned the old to make room for the new. Like a beautiful orchestral symphony he simply added more complimentary elements to the band's already established sound and improved what had come before as well and IN ABSENTIA presents those standards impeccably with all the attention placed on the melodic developments first and foremost and the supporting elements simply falling where they may. The result was an amazing display of prog compositional fortitude made all the better by an immaculate production job and mixing.For the most part IN ABSENTIA is the perfect balancing act between the art of ear wormy art rock, sophisticated prog, heavy guitar oriented alternative metal and psychedelic space rock made all the more ethereal by an excellent display of electronic musical forms such as trip hop and ambient music at key moments. The tracks all stand on their own with each adding a vital element to the band's repertoire. While the opening \"Blackest Eyes\" displays the band's new love of metal, the album spends most of the time in the space rock zone with tracks like \"Trains\" and \"The Sound of Muzak\" more in the vein of material off of \"Lightbulb Sun.\" At this point the metal had made its debut but was used sparingly. The heavy music is let off the leash though on the all instrumental \"Wedding Nails\" which displayed that the band's fascination with heavier music was not a mere fad.While the Pink Floyd, Radiohead and Nirvana style grunge are the key ingredients on IN ABSENTIA, on the hardcore prog side of things, there is a heavy King Crimson influence at times most prominent on the proggiest track of the album \"Strip The Soul\" however much of the proggier elements came in the form of production with subtle contrasts between mixing the various instrumental parts. While guitar solos erupt occasionally IN ABSENTIA was still more psychedelic space rock than anything remotely metal madness. This was controlled heavy but in a good way. What the band's biggest achievement on this album was that it featured a keen display of various musical motifs and interesting ways of crafting a series of interconnected ideas that somehow resulted in a warm organic process. Take \"Gravity Eyelids\" for example. It starts off as a trip hop arty space rock song and then transitions seamlessly into a a grunge-fueled Nirvana meets Radiohead sorta track.While many have hailed IN ABSENTIA as the first prog masterpiece of the new millenium i have to disagree that there had been some fine albums already released by Spock's Beard, Transatlantic, Pendragon and even avant-proggers Present but where PORCUPINE TREE succeeded where they did not was in the fact that a major label offered a much larger audience and therefore IN ABSENTIA did indeed become one of the best known and best selling prog releases in the early 2000s. Although this is a prog classic indeed, personally i don't find it perfect but nearly so. While PORCUPINE TREE had mastered the art of fusing its influences and idiosyncrasies into a seamless whole on this release, the track \"Prodigal\" just seems like filler to my ears. It's not a bad track but is the one that screams Pink Floyd the loudest and ultimately comes off as totally unneeded. Same for the following \".3\" which delivers a lot of psychedelic noodling before finding some true substance. It should've been edited to half the length or deleted altogether. The track \"Heartattack in a Layby\" would've been a perfect followup downer track to pacify the feisty metal oriented \"Wedding Nails.\"Overall IN ABSENTIA truly is one of the great works of the 21st century not only in terms of prog but in the greater rock universe as well. Everything Wilson and company had been working towards came to fruition on this album and made PORCUPINE TREE one of the biggest prog acts OF the 21st century. While i may not find this album absolutely perfect i certainly cannot deny its relevance, its professionalism and the uncanny strength of most of the material presented. Yes it is a bit too long at over 68 minutes and had the two weakest tracks been nixed it would've made this a perfect listening experience for my ears but even as it is i can't complain too much. I much prefer the following \"Deadwing\" and \"Fear Of A Blank Planet\" which took the approach delivered on IN ABSENTIA in sheer perfection however there's no reason to deny this first installation of the band's peak years of its classic status. Given my preference for the following albums i had to psychoanalyze my reasoning for listening to this one less and my conclusion is that the metal and space rock elements hadn't quite completely integrated quite yet in addition to my already presented nitpicking. Anyways, no matter how you slice it, IN ABSENTIA is brilliant prog release that signified prog was alive and well in the new millennium.4.5 but too damn good to round down"
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Tuesday, November 14, 2023",
      "rating": 4,
      "text": "Preceded by the very good reception of \"Stupid Dream\" and \"Lightbulb Sun\", it is with their seventh album, \"In Absentia\", that Porcupine Tree reaches new heights of reputation and raises the figure of Steven Wilson to superlative levels of recognition. A proposal that conserves the atmospheric dalliances and structures detached from the floor, but adds a hardened and raspy sonic content that at times is akin to Prog Metal. The constant contrast of scenarios that flies from tense calm to overflowing, reflects the vertebral concept developed in the album: the diseases of the mind and what they can generate in human beings, and whose disturbed cover art in the best style of Tool's animated videos clearly conveys it.From the sombre \"Blackest Eyes\" and its powerful guitars combined with Wilson's acoustic riffs that serve as a backdrop to describe in first person the unbalanced thoughts of a serial killer, \"In Absentia\" shows the complexity of its subject matter in different passages, such as with Barbieri's sickly synthesizers and the intensity of the guitars in \"Gravity Eyelids\", or in the unhinged \"Wedding Nails\" and its dark ending, or the also frenetic \"The Creator Has a Mastertape\" with Wilson's voice in megaphone mode and the recharged and insistent drums of the recently incorporated Gavin Harrison, describing in a very saturated sound structure the horrible plans of a family father with a double personality.But the album also interweaves moments of rawness with gentle backwaters used as oxygenating pauses, such as the delicate \"Trains\" and Wilson's electro-acoustic solo, or the floydian \"Lips of Ashes\", or the acid and harmonic \"The Sound of Muzak\" and its critique of the music industry business, to conclude with the beautiful \"Collapse the Light into Earth\" and the diaphanous piano that gives way to a very successful and emotional orchestration as a melancholic vindication of life in spite of all its ups and downs. An unbeatable ending.\"In Absentia\", one of Porcupine Tree's best works, is a demonstration of the maturity that the band had reached by that time and which positioned them as a fundamental reference of the 2000's.Excellent4/4.5 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "albume0f7.html",
  "last_parsed": "2025-05-18T12:31:59.865974"
}