{
  "album_title": "ENGLISH ELECTRIC (PART ONE)",
  "artist_name": "Big Big Train",
  "artist_page_link_local": "artist78d7.html?id=405",
  "year": 2012,
  "rating_value": 4.25,
  "rating_count": null,
  "review_count": null,
  "genre": "Crossover Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/405/cover_27752752019_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "The First Rebreather",
      "duration": "8:32",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Uncle Jack",
      "duration": "3:49",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Winchester from St Giles' Hill",
      "duration": "7:16",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Judas Unrepentant",
      "duration": "7:18",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Summoned by Bells",
      "duration": "9:17",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Upton Heath",
      "duration": "5:39",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "A Boy in Darkness",
      "duration": "8:03",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Hedgerow",
      "duration": "8:52",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Kingmaker",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "Victorian Brickwork",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Seen Better Days (The Brass Band's Final Piece)",
      "duration": "4:48",
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "East Coast Racer (live at King's Place, London August 2015)",
      "duration": "17:30",
      "is_sub_track": false
    }
  ],
  "lineup": [
    {
      "musician": "David Longdon",
      "instruments": "lead & backing vocals (1-10), flute (1-8), vibes (1), tambourine (1,2,6- 8,10), banjo & melodica (2), accordion (2,5), keyboards (2,4-6,8,9), electric (4,6) & acoustic (2,4,6) guitars, mandolin (4,6,8), birds & bees sounds (2), whistling (8), glockenspiel & theremin (9), percussion (9)"
    },
    {
      "musician": "Dave Gregory",
      "instruments": "guitar (1-4,6-10), banjo (5), Mellotron (8,10), string arrangements (1,3), voice of The Court Usher (4)"
    },
    {
      "musician": "Andy Poole",
      "instruments": "acoustic guitar (3,4), keyboards (7,8,10), mandolin (5), backing vocals (1-5,7,8), baritone bee sound (2), bass (9,10), bass pedals (9), producer"
    },
    {
      "musician": "Greg Spawton",
      "instruments": "bass (1,3,4,6-8,10), electric (1,5,9,10) & acoustic (3-5) guitars, backing vocals (1-5,7,8), Moog (1), mandolin (2), keyboards (7-10)"
    },
    {
      "musician": "Nick D'Virgilio",
      "instruments": "drums (1-10), backing vocals (4,7,8,10)"
    },
    {
      "musician": "Daniel Steinhardt",
      "instruments": "guitar (3,8)"
    },
    {
      "musician": "Andy Tillison",
      "instruments": "organ (1,4,6,9), piano & Moog (1), keyboards (1,4,6,9)"
    },
    {
      "musician": "Danny Manners",
      "instruments": "piano (3,4,7,8), organ (3), double bass (2,4-7)"
    },
    {
      "musician": "Dave Desmond",
      "instruments": "trombone & brass arrangements (7,8,10)"
    },
    {
      "musician": "Ben Godfrey",
      "instruments": "cornet (7,8), trumpet & piccolo trumpet (8)"
    },
    {
      "musician": "Jan Jaap Langereis",
      "instruments": "recorder (7)"
    },
    {
      "musician": "Jonathan Truscott",
      "instruments": "tuba (7,8,10)"
    },
    {
      "musician": "John Storey",
      "instruments": "euphonium (7,8)"
    },
    {
      "musician": "Rich Evans",
      "instruments": "cornet (10)"
    },
    {
      "musician": "Nick Stones",
      "instruments": "French horn (10)"
    },
    {
      "musician": "Rachel Hall",
      "instruments": "violin (2,4,5,8), string arrangements (5)"
    },
    {
      "musician": "Sue Bowran",
      "instruments": "violin (6)"
    },
    {
      "musician": "Eleanor Gilchrist",
      "instruments": "violin (1,3)"
    },
    {
      "musician": "Geraldine Berreen",
      "instruments": "violin (1,3,6)"
    },
    {
      "musician": "Teresa Whipple",
      "instruments": "viola (1,3,6)"
    },
    {
      "musician": "Abigail Trundle",
      "instruments": "cello (1,3,5-7)"
    },
    {
      "musician": "Jon Foyle",
      "instruments": "cello (10)"
    },
    {
      "musician": "Martin Orford",
      "instruments": "backing vocals (8)"
    },
    {
      "musician": "Violet Adams",
      "instruments": "soprano bee sound (2), backing vocals (5,7,8)"
    },
    {
      "musician": "Lily Adams",
      "instruments": "soprano bee sound (2), backing vocals (5,7,8)"
    },
    {
      "musician": "Verity Joy",
      "instruments": "backing vocals (5,7,8)"
    },
    {
      "musician": "Louis Philippe",
      "instruments": "string arrangements (6)"
    }
  ],
  "reviews": [
    {
      "reviewer": "kev rowland",
      "date": "Posted Sunday, August 26, 2012",
      "rating": 5,
      "text": "Approximately 20 years ago a postman made a delivery to my house. In itself there is nothing unusual in that concept, but the difference here was that inside the envelope was a demo tape from a Dorset band. They had been given my details by Stu Nicholson who I had recently been in contact with, so they decided to send me the tape to see what I thought of it. Needless to say that band were Big Big Train, and the tape was 'From The River To The Sea', and it was the first piece of music ever sent to me to review. Since then I have listened to countless thousands of CDs, but Big Big Train were the very first so I have always had something of a soft spot for them. Although it must be said that not only was I not a huge fan of one of their releases back in the day, but I also had the misfortune to run into Greg Spawton in a pub in Winchester not long after I had formed that opinion.The reason for that was I felt that they no longer sounded like BBT and that they had allowed outside guests and influences to take over the album, but looking back now it is obvious that it was an important step in allowing the band to grow musically. And boy have they changed now. There have been one or two line-up changes over the years but Greg (now on bass/keys) and Andy Poole (keys/production) have been there from the beginning, and singer David Longdon (plus mandolin, keys, flute etc) who joined in 2009 has been a real find. It is these three that have written all of the songs, but since 2010 they have been joined by guitarist Dave Gregory and some drummer called Nick D'Virgilio. Yes, the ex-Spock's Beard and current Mystery sticksman is also a key member of this band.So when my copy turned up from the band the other day you can guess how excited I was. One word screams out all of the time that this is playing, and that is \"Maturity\". The band have changed immensely since those early days and have produced an album that is huge and the reason for that is the control that pervades everything that is happening. I was playing this while out in one of the paddocks and I was trying to think who it reminded me of, and the closest I can come to is Marillion combined with Chris Rea but that has much more to do with the way they have approached the construction and composition as opposed to the musical direction.Many people will say that this isn't a prog album, but so what? That really depends on your personal definition of prog, but given the use of additional guests and instruments where else doe sit really fit? On a personal level, when I heard the flute I immediately asked myself if Martin Orford (IQ/Jadis) had become involved in the music scene again as I know that he had contributed to past BBT albums. Well, I was wrong about the flute as that is by David but Widge does provide some backing vocals - it was a huge loss to not only UK prog but to music as a whole when he decided not to continue so hopefully there will be more to come.This is a part one album, with the second to follow in March, and to be honest I can hardly wait. To my old jaded ears this is stunning ? and when I received that cassette all those years ago I could never have imagined that one day I would be listening to anything as powerful as this. This is essential for any lover of good music. www.bigbigtrain.com(This review was sourced from a pre release copy provided by the band - ADMIN EDIT)"
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Friday, September 14, 2012",
      "rating": 5,
      "text": "Without a doubt Dave Longdon is the new shining star of modern progressive rock; his vocal, composition, and flute contributions to Big Big Train have taken this band to a whole new level, a level that may imprint BBT into the Prog Hall of Fame--one of the few modern bands to achieve a standing right among the masters of the 1970s. Also, while I was not convinced of Dave Gregory's 'fitting in' based upon his previous BBT contributions, on this album everything, everybody is clicking. Amazing song compositions with fresh and diverse stylistic presentations topped by the amazing--did I say \"amazing\"? I meant, \"incomparable\"- -vocals of Dave Longdon. And this time the lyrics and vocal passion fit with the music. I LOVE these lyrics. Everything component of every song seems woven into a magical tapestry worthy of adorning the walls of kings! With The Underfall Yard we saw a lot of glimpses but not everything with the \"newcomers\" (D'Virgilio, Gregory, and Longdon) had gelled yet.\"The First Rebreather\" (10/10) is an amazing opener which reminds me of the way \"Dance on a Volcano\" or \"A Musical Box\" opened their respective albums, the former for Nick D'Virgilio's display of Phil Collins-like drumming (Phil at his absolute best) and the latter for the changing dynamics and essential individual contributions to the whole-group masterpiece. Amazing story, lyrics and singing! Wonderful weaving of al the instrumentalists AND the vocal arrangements. A perfect song! (though the nod to GENESIS is quite obvious.)\"Uncle Jack\" (9/10) Off-beat like a STEVE HACKETT song (or, a little bit like \"I Know What I Like [In Your Wardrobe]\"), this is, to me, refreshing for its celebration of an average Joe (again like \"I Know What I Like\"). I bit like a carry over from The Underfall Yard, but still a mature, masterful blend of everyone's talents. Plus, banjo!\"Winchester from St. Giles' Hill\" (11/10) was my instant favorite. Now I can't decide between it and all of the other 10s! A beautiful song from it's opening notes and accompaniment. Incredible vocal melodies and vocal arrangements. I love Dave Gregory's jazzy (almost PAUL WELLER-like) guitar. Amazing chorus. WOW! What power and feeling! Then to soften with those guitar strums and mellotron. The bass playing just kills me. This is a funky jazzed up prog MASTERPIECE! And then the MICHEL LE GRAND/JEAN-PIERRE RAMPAL almost- classical section in the middle! Followed by an awesome guitar solo which brings us back first to the funk rhythm and then to the AMAZING story, vocal, vocal arrangement. I'm undone! TOO beautiful for words . . .***** Each year I give a 11 our of 10 rating and this, ladies and gentlement, is that song.; the one song that transcends my expectations for the potential for human creativity.\"Judas Unrepentant\" (8/10) unfortunately begins with a bit of a Genesis \"Illegal Alien\" feel to it. Luckily the chorus and bridges diverge quite a bit. The mellow, almost classical section beginning at the 3:30 mark is a welcome, even masterful, diversion. When the main song theme returns it with a wonderful symphonic crescendo of sound. Nice little organ solo to cover the return to the original \"Alien\" beat/sound. An light, upbeat, fast-paced yet somehow heavy and complex song. Fascinating!\"Summoned by Bells\" (9/10) begins with a pretty Tony Banks/Anthony Phillips piano arpeggio before establishing itself as something else, quite, with cello, doo-wap b-vox, recorders, and even the kitchen sink thrown in. (Just kidding!) Have I mentioned how noticeable and creative--even melodic--is the bass work on this album? Wonderful. And replete with so many unexpected flourishes and techniques. And NIck D'Virgilio really makes his mastery known without going over the top or without having to be mixed too forward in the production mix. This song provides a perfect example of how Dave Gregory's guitar work fits perfectly whereas on previous albums it may not have worked, may even have stood out a bit too much. On this one every strum, arpeggio and strum fits perfectly. Absolutely stunned and LOVE the delicate, emotional outro with its gorgeous horns and heart-wrenching Fripp-like guitar solo.\"Upton Hill\" (9/10) reminds me of a perfect PREFAB SPROUT or DREAM ACADEMY song-- quirky yet drop-dead gorgeous. Prominently featured flute, cello, accordian, female b-vox and banjo help provide this one with its own unique feel.The first 1:36 of \"A Boy in Darkness\" (10/10) has a very KATE BUSH and TEARS FOR FEARS feel to it. Until the very TEARS FOR FEARS breakout at 1:36. Later, the almost jazzy top-speed instrumental section in the middle is filled with great drumming, great guitar, flute, strings, percussives, and organ is one of the highlights of the album. Breathtakeing. And then the segue back into the vocal sections is so masterful. Absolutely brilliant! Fripp guitar soloing beneath Longdon's powerful singing. The final minute is a crescendo of power and emotion with Gregory and D'Virgilio leading the way. Love the oscillating organ to-fade.\"Hedgerow\" (10/10) has an amazing XTC/BYRDS/ANT PHILLIPS/BEATLES feel, musically (thanks, Dave Gregory!), topped with some jaw-droppingly astounding vocal arrangements. Slow guitar arpeggios over which a solo viola/violin dirges propels the song into emotional depths of amazing proportions. Top this off with Nick D'Virgilio's stupendous drumming and you have the best crossover prog song of the year. The lyrics are the coup de grace?they bring me to my knees! I am not worthy! Especially the repeating flower names sung by the background singers! What an end to an amazing album?an album of a quality and consistency that I thought I'd never hear! Move aside Echolyn, Marillion, Astra, TFK, and even Anglagard.Hail! to the new kings of the hill!Congratulations Andy and Greg: Your passion, vision, and perseverance has paid off! This is the best music album I've heard from 2012. It may be (dare I say or even think it?) a perfect album. So many, many times as I listen to this album am I just astounded at the instrumental, compositional, incidental and lead sound, and textural shifts that occur--and frequently-- within each song?not to mention the unparalleled vocal arrangements. (I beg of you: Has ANY album EVER put forth such astounding vocal arrangements??) These five gentlemen are truly master music craftsmen. No: Master music artisans. This album is, to me, akin to a Sistine Chapel, a Taj Mahal, a Monet, a Beethoven's 9th."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Friday, September 28, 2012",
      "rating": 3,
      "text": "This is the second album by this particular Big Big Train lineup after The Underfall Yard, but the improvement over that one is substantial; whilst the Train had been chugging away on the UK scene for quite some years, for many listeners this is the album that put them on the map. Trimming back the stable of guest musicians substantially and offering a spruced-up sound which combines progressive rock song structures and compositional techniques to a somewhat broader aesthetic than most prog, the album manages to be simultaneously quite accessible and at the same time still a nostalgic journey through Genesis-derived symphonic landscapes.Founder member Greg Spawton's guitar work on this is what enables much of this diversity, particularly in the way he brings in influences which most prog guitarists tend to overlook. For instance, his performance on Uncle Jack begins in a folky style with just a whiff of bluegrass to it, but as the song progresses and complexities pile up it ends up gradually mutating into something much more unusual. David Longdon's one of those prog vocalists who likes to mimic Peter Gabriel, but at least he's actually quite good at it, his performance sounding absolutely natural and not forced at all.The traces of Spock's Beard I could hear on The Underfall Yard are well and truly gone - as, indeed, is any obvious imitation of past prog bands beyond the obvious Genesis pastoralisms. This album was, at the time, one of my biggest surprises of the year - having been none too impressed by the band's back catalogue, I really hadn't planned on giving them another go, but the high praise given to this one made me feel compelled to relent on that and I was at first markedly impressed.However, with the passage of time the spark of English Electric has rather faded for me. It's not so much a case of familiarity breeding contempt - if anything, I have relistened to it much less than I expected to. It's more a matter of Big Big Train's schtick wearing thin. This soppy nostalgia for a golden age that never really was - the eternal illusion that grumpy middle-aged men are prone to that society had it more or less right back when they were 6 and it's been downhill ever since - is something that I have an increasing lack of patience for, and the artistic aesthetic it inspires feels increasingly shallow and vapid. It is certainly competently executed here, but precisely because it's a hollow reflection on faded glory rather than something genuinely \"progressive\" in the sense of doing something new with the collection of old motifs it brings together, I suspect its star will wane sooner rather than later."
    },
    {
      "reviewer": "ProgShine",
      "date": "Posted Sunday, September 30, 2012",
      "rating": 5,
      "text": "There's some bands that hardly fail, you can actually see their love and their effort on making the best music possible. And that's the case of BIG BIG TRAIN.I'm not a BIG BIG TRAIN longer fan, I've discovered them when they were about to release the magnificent The Underfall Yard (2009) and they were giving away the epic track that carried the name of the album. I was so immediatelly amazed by that song and that sound and that band that I went straight to their website and bought a bundle with The Underfall Yard (2009) and their previous The Difference Machine (2007).When I've heard they were working on a new album, and that would be a 2 part project called 'English Electric' I was already happy just by heard that.I am now listening English Electric (Part One) (2012) for the first time. And they just can't fail. Their music is full of emotion, charged with a sentiment that you hardly can see in any other band, specially in Progressive Rock.They work slowly on their records and make sure every little piece is right on place. The sounds of instruments specially, is SO good to hear an album that actually have real drums sounds, a bass sound that's not equal to the other 100 albums released in this month, pianos and not cheap keyboards, flutes, the list go on and on...It's rich in every aspect it's grande not being too pompous, it's emotional, makes me shiver, and the most important thing, it makes you want to listen again and again.The band knows the music they're doing is good, only bands that know they have a great material to offer makes their album available to listen on Bandcamp (bigbigtrain.bandcamp.com/album/english-electric-part-one).And you know why they do that? Cause they know that if you listen, you'll buy, something inside you tells that you need to have it. And that's actually what happens, everytime."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Wednesday, October 3, 2012",
      "rating": 5,
      "text": "Big Big Train excel on their best release to date \"English Electric Part One\". The fact that this is a first part obviously means there is soon to be released a sequel and if it is as fabulous as this release we are in for a real treat. From the very beginning I was taken on a journey of melodic and innovative musicianship with beautiful rivers of flute and uplifting guitar solos, along with swathes of keyboards and crystalline ambience. Each track is diverse from the one preceding and makes this a very entertaining hour of music. The songs are accessible enough for the average music listener but have inspired musicianship that lift the compositions out of the ordinary and into the more progressive side of music. The flute is absolutely stunning and the grinding organ punctuates the atmospheres with a retro 70s feel.Songs like the wonderful 'Judas Unrepentant' have the 70s sound and yet remain modern enough to fit into the current music scene comfortably. There is an uplifting soundscape on such songs, and the band leave room for quiet passages of flute played with aplomb by the incomparable David Longdon, and the string section by Ken Brake is mesmirising tranquillity. This track is one of the greatest pieces of music I have heard in years, and even features strong organ soloing, and meanders into quiet textures allowing it to lift again into the main bright melody. The vocals of Longdon are always clean and easy on the ears, sounding somewhat like Peter Gabriel in places, a clear influence.The opening track 'The First Rebreather' is also masterfully composed with lengthy solos and a soul stirring melody, reminiscent of Genesis, with creative shifting time sigs. Surprisingly after this prog sound the following track 'Uncle Jack' is a diversion into Cotton Eye Joe banjo and hoedown musical shapes. It seems to work though as it is so unique to the album and shows the band having fun with their creativity. Another diversion on this album is the ballad 'Upton Heath' that is acoustically driven and has a beautiful Celtic folk flavour of accordion sounds and a strong multi harmony of voices throughout. The violins and flute are a nice touch and enhance the folk textures on this very accessible track.On the flip side of the band's style 'Summoned by Bells' is a 9 minute romp with cascading flute and guitar picking and violins that melt into the icy atmospheres. It has a dreamy feel, especially in the verses and at times a heavier guitar riff from Greg Spawton breaks through to keep things interesting. The electric piano is quite bluesy, and there is a section sounding like Genesis as it moves into a new time sig. Andy Poole on keyboards and bass keeps a consistent rhythm and the steady tempo from percussionist Nick D'Virgilio is always reliable. Spawton has a chance to launch into a lead guitar solo that is well accomplished striking against the tempo. The meter slows down with nice keys and a horn section that augments the atmosphere. This section is very relaxing and moves along at a measured pace as an extended coda and the lead solo is tasteful; an excellent progressive track.'A Boy In Darkness' is an 8 minute track with some odd melodies and shifting signatures. It begins with elongated musical bars that sound ethereal along with the haunting harmonies. It has a darker feel purposefully due to the thematic content. It is delightfully unique on the album, with more chilling atmospheres, and an overall sense of foreboding. These atmospheres are augmented by sustained violins and reflective vocals echoed by multi harmonies. The keyboard effects have an esoteric quality, echoing with distant bells, wind effects and dissonant notes. The Hammond organ sound crunches gloriously into the song and is joined by violin serrations and heavy guitars. The flute joins in and lifts the atmosphere but it still feels appropriately off kilter and disjointed. A tremolo bar wavers on the guitar and then a low ominous drone is heard. This is followed by a peaceful passage of lonely violin and Longdon's vocals return with reflective lyrics. Overall this is another of the masterpieces of the album.'Winchester From St Giles' Hill' is another case in point that focuses on varying musical styles. 'Hedgerow' closes the album with another lengthy piece at about 9 minutes, and sounds totally different to the other tracks, beginning with a folk tinged melody and ending with pastoral tones with multi layered majestic harmonies.Overall this is another great album from Big Big Train who are slowly gaining a solid reputation and wider acceptance on a worldwide scale. They are capable of incredible music and the compositions are infectious and accessible for the FM radio market. \"English Electric Part One\" is packed with brilliance, and no doubt part two will be followed up soon, and hopefully as consistent in quality as this magnificent release."
    },
    {
      "reviewer": "lazland",
      "date": "Posted Thursday, November 8, 2012",
      "rating": 4,
      "text": "I have waited a long time, with many, many listens, before reviewing this, the latest release by Big Big Train, which, if the reviews and ratings on this site are to be believed, is one of the finest prog rock releases of all time. Indeed, only one reviewer has given it anything less than five star masterpiece rating.I gave that to the exceptional The Underfall Yard, but quite a bit of that was for deeply personal reasons. I was really looking forward to this, and was delighted when it plopped through the door last month.Let me say straight away that this album contains some of the finest progressive rock I have heard this, or, indeed, in many a year. At its best, which is on most of it, it has the feel of much of what drew me to the genre in the first place, that wonderful English pastoral sound. The Genesis comparisons are, perhaps, rather obvious, but, to these ears and mind, it is more in the fact that a track such as Uncle Jack is so marvellously quirky and, well, English in the Genesis or Python sense.The utter highlight of the album, and a very strong contender for track of this decade thus far, is Judas Unrepentant. In fact, as I will explain later in this review, it was only at this stage of the album that I really sat up and took notice on first listen. The harmonies, staggeringly strong vocals by David Longdon (who is surely becoming one of our finest), the fusion of classic and modern progressive soundscapes, particularly on keyboards, make this ridiculously enjoyable and strong. Everything flows easily into each separate movement, and that flute solo.....well, Gabriel has his natural successor in Longdon. The use of strings and woodwind is also exceptional. A symphonic masterpiece, no more, no less.Of course, much of this here is a paeon to a fast disappearing English countryside, much as Selling England was to a disappearing society. The gorgeous Upton Heath is a smooth, very beautiful, example, and, if you close your eyes and use your imagination, you can see yourself walking on the Dorset heathland. It is a brave band, indeed, who make so much use of traditional orchestra instruments, and, again, this lot do it with such aplomb in a gentle, folk prog, setting. I also admire deeply here, and elsewhere, the choral vocals.Another trick this lot manage so well is the sudden change of mood. So, we go from a beautiful walk to something altogether more sinister and menacing on A Boy In Darkness. Doom laden in its low key sounds, you jump when the chorus simply explodes with a sinister symphonic energy. This all supports some of the most intelligent lyrics you can imagine, because the subject matter is a report into conditions in a 19th century colliery, and the exploitation and deaths of young boys \"sent down the pit\". This is social commentary translated into musical darkness at its best, and, again, it reaffirms the band's position to me as the natural successors to Genesis in this era. To call them some kind of neo-prog tribute is both lazy and, actually, plain wrong. They are much more than that.And, from this, we are taken to the delightful, cheery, bouncy, almost pop psychedelic joy that is the album's closer, Hedgerow. Of course, the subject matter is easily deduced, but the effect on the aural senses is one of sheer joy, almost an orgasm for the ears and mind. The singing is quite incredible, and the pace of the band never falls below that of relentless foot tapping, especially the guitars, and the strings are used to great effect again. The reprise of the vocal harmonies at the denouement has you almost weeping with the sheer joy of life and all around us.So, with such praise, why do I rate this album as an excellent one, out of step with those colleagues who rate it a masterpiece? It is simply because, as joyful as the tracks I have written about above are, I actually find this to be too inconsistent to merit the full five stars. Take the opener, The First Rebreather, as a good example. There are bursts of that Longdon voice (which I first fell in love with on Martin Orford's great The Old Road), there is some stunning guitar work, especially, but I find this strangely inconsistent as a track, or, I don't know, maybe trying to be a little bit too clever, because the shifts in time signatures I find to be confusing and, frankly, unnecessary. When it is good, it is very good (and the bass playing is especially good), but it is not only confusing, I also find, after some thirty odd listens now, it to be rather dull in parts, and find myself losing my attention in places. You never have that on a masterpiece.I also feel the same way about Winchester From Giles Hill. It starts off beautifully with deep flute, some lilting vocal harmonies and a jazzy feel on rhythm, but, I don't know, I find it very difficult to keep going throughout the track. The main vocal section sounds strained, and parts of it are, well, dull again. The strained comment also applies to parts of the otherwise sublime Summoned by Bells, which does feature some lovely brass in fusion with haunting guitar at the close.I hope I have put across here adequately the fact that this is an excellent work, with a great deal to commend itself to fans of progressive rock. 90% of it is simply to die for. This lineup will, I earnestly hope, continue to bring us joy for many years to come. I especially welcome the participation of Dave Gregory, probably the finest musician to come out of the New Wave era. I have absolutely no hesitation in recommending it to those who are thinking about buying it. It is excellent. It just ain't a masterpiece. Bet you the next one is, though!"
    },
    {
      "reviewer": "tszirmay",
      "date": "Posted Wednesday, November 21, 2012",
      "rating": 4,
      "text": "Coincidence that I get two distinct albums that both feature Nick D'Virgilio on drums in my recent purchase cart? Nah, the man is a massive talent, turning Mystery's latest offering \"The World is a Game\" into a propulsive affair the simply devastates. He has also serviced some of the finest prog musicians anywhere, look it up if need be.Big Big Train has leaped over countless summits in arriving to \"English Electric\", starting with the promising \"Gathering Speed\" then the massive \"The Difference Machine\"(a personal favorite) and then, the critically acclaimed \"The Underfall Yard\". Truth is Greg Spawton is an accomplished composer, a stellar guitarist and multi-instrumentalist and has surrounded himself with trusty longtime collaborator Andy Poole, as well as bringing in on the preceding opus, the evocative David Longdon on vocals to replace Sean Filkins , no slouch on the mike, him! Here we have the legendary Andy Tillison of The Tangent fame on assorted keys(never has he played better !) as well as the aforementioned Nick D'Virgilio. It is to be noted that Dave Gregory officiates on guitar, he of XTC fame and one of the most solid performers of the 80s still active today.. . \"The First Rebreather\" kicks off this one in style, very English and very prog , the arrangement has all the hallmarks of classic symphonic prog and easily rekindling fond reminiscence of Collins-era Genesis, without the commercial pop veneer. Andy Poole lays down some mean bass motifs that pulsate with glorified diversity and all the adornments are perfect, from mellifluous flute, played by David Longdon who positively shines on the microphone, a sensational vocalist and an emotive spirit. Lots of strings on this one, so tighten your symphonic belt, replete with a buzzing guitar solo like you have never heard before! Torrential gusts of power and substance are elevated by some stellar production, showcasing the whole as well as the parts and maintaining that blissy buzz.\"Uncle Jack\" is more playful; featuring some stunning choir work (severe nods to Gentle Giant, here) as well something Ant Phillips could come up with when not fondling his beloved 12 string acoustic. A strong medieval tone ruminates gently, a countrified air, silky percussion and breezy vocals and choirs adorn the rolling green lea , birds chirping elatedly. Some banjo skiffling along for the ride. Quite an original sounding premise and a treat for the weary.Back to classic sympho-prog with \"Winchester from St Giles' Hill\" owner of a massive atmosphere, very smooth and laid back (think ELP's \"Take a Pebble\") but equally armed with a poignant chorus that reaches Marillionesque proportions. Splashes of flute and strings fortify the strong classical feel. Please notice the shuffling drums and the grandiose chorus, a genius vehicle led by a stunning vocal from Dave Longdon , who really impresses immensely. Scintillating prog, this! We then have Tillison showing up on piano like a true ivory master that he is. Ridiculously seductive, almost scary, its that good. A Spawton guitar duel with D'Virgilio on drums is an earful only surpassed by the huge chorus ending this monumental track, a real classic.Some commentators have already anointed \"Judas Repentant\" as the firecracker composition on this winning release and one can quickly see the merit of such lofty praise. Big Big sound, a wider scope of harmonious delirium, some rapid fire playing, especially those damn drums, clobbering everything in its way, burly, hard and devastating. The anthemic qualities are hyper-evident, the majestic flute playing with the mellotron cascades. Unexpected strings sweep into the mix, heightening the passion as Longdon plaintively sings on, raging and dramatic, keys whirring wildly (check out that genius organ solo from Andy Tillison, whew! Deadly). A manic tour de force outro finishes the deal.\"Summoned by Bells\" is the proverbial ballad, dexterous piano and voice driven with some clever off-beat gilding, very close to Collins-era Genesis (even mentioning \"rooftops\". Yeah, right! Coincidence! Nah!), with Banksian keyboard washes and typical voice work. \"Come on now\" indeed! A corkscrew guitar solo (Dave Gregory?) scorches like a molten flame- thrower and then, suddenly a serene passage that is dreamily psychedelic, daring to import some serious trombone infiltration! Yes you read it correctly = TROMBONE! Ballsy move!\"Upton Heath\" is very British, with mandolins, banjo, double-bass and accordion leading the way, in folky style of ensemble playing, again rekindling hints of Penguin Caf� Orchestra and Anthony Phillips , as well as some clear Canterbury school influences. The main difference is the soul voice of Dave Longdon, adding desperate warmth to the pastoral surroundings, the magical flute being the main culprit.\"A Boy in Darkness\"as the title implies, is a more somber affair, the pleading vocal seemingly well ahead the pack, astutely orchestrated with crafty symphonics and a gruesome chorus. The contrasts are deep and dark, the instrumental sections brutal and corrosive (Dave Gregory in particular), the voice parts decisive and arresting. Heavy stuff!\"Hedgerow\" sounds more like XTC; clearly Gregory is a huge influence, as this is Brit-pop with obtuse prog flavorings, hints of the Byrds, Bread and the Beatles. Yet, the instrumental part goes totally in another direction, deeply symphonic, with huge swells of emotion, flute, violin and keys are its purveyor. The main theme is thunderous. And then back to the beginning but louder. A brainy dollop of exalted prog.There is just way too much to like, an opus that has the incredible Longdon voice, mind blowing guitar work from Gregory, jaw dropping keys work from Tillison, a rhythm section as powerful as one could hope for, D'Virgilio especially. Killer arrangements, original songs and daring adventure.4.5 Anglais electriques"
    },
    {
      "reviewer": "admireArt",
      "date": "Posted Wednesday, January 2, 2013",
      "rating": 2,
      "text": "Hey guys! Once there was a Brit-prog band named GENESIS , if you like BBT you�ll flip upside down with them. Some of the band members are still around. Maybe you have heard of one of them Steve Hackett, Mike Rutherford, Tony Banks, Phill Collins and Peter Gabriel; back then he was the vocalist and main composer of that ensemble. He absorved all the mystic ghosts that haunt his birthland; which by the way was England. Trumpets, kings and all that [&*!#]; brought to modern times. Intelligent surreal stories with the famous conspiracy-like voice, in \"off\" (the same as Jethro Tull's Ian Anderson; it runs in the \"Brits\", blood) and the music compositions, if not overwhelming, were very original in language and structure. .... It was not their virtuosity neither, ( of course they were no punk-rockers!) it had to do with the creative rush of breaking-ground for the first time, that kind of rare and unique rush. BBT; however well trained in their instruments as they are, fall in the the everlasting conflict of any composer who still hasn't found his own language; being both: original and sublime. Problem is, that the original parts are not original and the sublime is not their own. I dislike imitators, tributers or whatever you want to call the kind, that sounds like someone else, who was there before, in time. Without any kind of regards whatsoever; or the now famous \"my influences\" cheap-talk. I don�t think there is a creative shortage in composition (to me that�s what prog is all about) as to praise this kind,(seriously!). Wake up!! and listen to GENESIS first albums. In that direction you may also encounter another band; their name is or was (no one still knows) King Crimson start easy, go for the \"Lizard\" album. Don�t settle for less this will make BBT (if lucky) find their own route. Remember: \"The Lamb Lies Down on Broadway\"; it still does and it will be like that, it seems for a long time. 2 PA stars"
    },
    {
      "reviewer": "richardh",
      "date": "Posted Saturday, January 5, 2013",
      "rating": 5,
      "text": "Probably should win some award for the most over hyped album of the year. Now there is no doubt that this group know exactlly what they are doing and the tehcnical level of the playing backs thats up. They also avoid the usual late seventies Genesis clone approach that so many neo prog bands seem to be into and that perhaps gets them extra brownie points. However I've listened to this at least 5 times and I'm still struggling to be that gripped or excited by it. There are some nice bits and bits and moments of inspiration but in general it comes across just a bit too much 'prog by numbers'.The opening track is probably my favourite on the album. They have a real hook going for the first few minutes and could have fallen into the trap of trying to repeat it too much but instead allow the music to find its natural flow. The end track is also excellent and reaches a good emotional peak. What I have a problem with is the most of the middle bit that doesn't seem to have either the musical content or direction to impress me. I just don't get what its supposed to be. Its all a bit bland and lacking to my ears.Its not cliched though and I guess the fact you can't relate it that easily to other bands has lead to a fair amount of gushing praise. But for me I'm just not feeling itNeverthless it is an ambitious effort and they have used a good variety of musical instruments to add additional spice. Quite nice middle of the road neo syphonic prog album. Best check it out and make up your own mind."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Wednesday, January 30, 2013",
      "rating": 4,
      "text": "BIB BIG TRAIN haven't made an album yet that I wasn't impressed with. This is the fourth recording i've purchased by this band and to my ears they are a modern day GENESIS. Not that I think of them everytime I hear their music because I don't, but it's that very English sound that is done so well. The lyrics are always meaningful and seem to be able to touch my heart. Like the last studio album they have lots of guests on board, in fact more this time including Andy Tillison and Martin Orford (I thought he was retired).\"The First Rebreather\" might be the best track i've heard from this band, and for me the most GENESIS sounding as well. The guitar playing over top as the vocals come in is priceless ! Check out the flute and then the bass and drums join in. So good. Nice flute solo before 3 minutes and then a guitar solo 5 minutes in. The emotion is felt when the vocals return with passion. Gulp. That opening guitar is back. Man this is just so good. One of the best tracks of 2012 for me. I should mention as well that Andy Tillison guests on this song playing organ, piano, moog and keyboards. \"Uncle Jack\" is certainly different with the opening banjo. Vocals join in quickly in this catchy tune. Again this just feels good. Mandolin in this one as well as some female backing vocals. \"Winchester From St. Giles' Hill\" is a beautiful song and the keyboards after 2 minutes reminds me of Banks. Check out the flute a minute later when the vocals stop. I really like the guitar before 5 1/2 minutes as the organ and drums start to impress before the vocals return. Andy Tillison is back on \"Judas Unrepentant\" playing organ and keyboards. Nice intro before the vocals join in. We get that late as well after 5 1/2 minutes. Such meaningful lyrics here. Good song.\"Summoned By Bells\" is the longest track at just under 9 1/2 minutes. Vocals and piano lead early before the violin joins in. Flute 2 minutes in and the backing vocals before 2 1/2 minutes are a nice touch. Mellotron a minute later. Great sound 6 minutes in with the organ, guitar and drums standing out. Nice to hear horns late as well. A very enjoyable tune. \"Upton Heath\" is a mellow tune with acoustic guitar, light drums, reserved vocals and more. Banjo and mandolin also make appearances on this one. My least favourite song on here. \"A Boy In Darkness\" is an emotional track considering the lyrics. And the title of the track certainly has a lot of meaning in light of those words. Andy is back guesting on keyboards and organ. Check out the flute and bass after 4 minutes. Amazing track ! \"Hedgerow\" is such an uplifting song ! I can just imagine someone who has worked underground for so long getting some time off and being blown away by nature and sunshine. I can just picture him dancing around and we can hear his dog as he calls him as they wander the fields. Love the instrumental section that follows with that mournful violin. The vocals return including Martin Orford's backing vocals. The horns remind me of THE BEATLES.Yeah this deserves the hype and it's not surprising to see this album on so many top 10 lists for 2012."
    },
    {
      "reviewer": "fuxi",
      "date": "Posted Wednesday, February 13, 2013",
      "rating": 5,
      "text": "Hurray, Phil Collins rides again - more energetically than ever!Joking apart, this is yet another enjoyable BBT collection, very much in the vein of its great predecessor, the UNDERFALL YARD. The ingredients are the same. Most of the music is expertly performed and full of yearning. The band seem to mourn the passing of an Old England where \"heavy industry\" still counted for something. They denounce some of the social cruelties of that same Old England; they express a longing for the landscapes and cities of their youth; now that they've reached middle age, they feel great sadness, since what's left of those landscapes will soon leave them behind...That, at least, is the impression I get from ENGLISH ELECTRIC (PART ONE). The great question is, of course, if Part Two will be any different in mood. Until we find that out (at the time of writing, the wait can't be long any more) we may ask ourselves to what extent BBT have achieved their musical ambitions. In my opinion, the first six tracks of this particular collection are gripping from start to finish (which makes for a first-rate 42-minute album, just as inspiring as the classics you remember from the 1970s) but thereafter the quality of the music soon deteriorates: on \"A Boy in Darkness\" David Longdon's voice really starts to grate (OK, I know it's not MEANT to be an upbeat track, but still...) and during \"Hedgerow\" (a pointless, over-long singalong) I just couldn't wait to switch the album off.I was glad that this time we were offered some wonderfully exciting keyboard solos from the great Andy Tillison. I wish Dave Gregory were given more chances to shine on his electric guitar! Whenever Gregory does appear, my heart leaps half a mile. FINAL VERDICT: Strongly recommended, but not what I'd call a flawless masterpiece.P.S. Twelve years after I wrote the above review, I decided to upgrade ENGLISH ELECTRIC (PART ONE) and award it a full five stars. Over the years the album grew on me. Listening to various live performances helped me appreciate the material included. I still think \"A Boy in Darkness\" is a little strange (what exactly is the point of giving such a downbeat track an upbeat instrumental middle section?) but I also find it terribly moving. \"Hedgerow\" doesn't annoy me anymore - quite the opposite. In fact, I'm convinced there's not a weak track on the entire album. \"East Coast Racer\" is one of the greatest 'symphonic prog' openers of recent times, and both \"Keeper of Abbeys\" and \"The Permanent Way\" are simply sublime. In my view, together with ENGLISH ELECTRIC (PART TWO) this album forms one of the most enjoyable & emotionally mature statements in 21st century prog. (And BBT didn't leave it there: their 2016 album FOLKLORE would be just as much fun. Bravissimo!)"
    },
    {
      "reviewer": "EatThatPhonebook",
      "date": "Posted Wednesday, February 20, 2013",
      "rating": 4,
      "text": "8/10Straightforward, But Right On Track.\"English Electric Part One\" is Big Big Train's eight album, released in 2012. The title implies, obviously, a Part Two, released in 2013. Even more so than the predecessor \"The Underfall Yard\", this newer release was immensely praised by Prog Rock aficionados, and has even been considered by some to be one of the greatest albums of the genre of the decade. Although this last statement is a bit exaggerated, \"English Electric Part One\" is most definitely the greatest Prog Rock album of 2012, proving that Big Big Train has officially matured as a group.The music on the album is for many, very reminiscent of old Symphonic Prog groups, more in particular Genesis: that is especially because of the vast array of instrumentation that is used on this album, especially keyboards. But there's a lot of clean and acoustic guitar, flutes, strings, horns, and so on. It's definitely the most lush release so far from Big Big Train. The previous albums however also had an astonishing amount of varied instrumentation. The brand new improvements that really surprise are the outstanding songwriting skills this band proves to have, as they are able to consistently write beautiful, gorgeously crafted songs, that hit almost all of the right spots. Another massive improvement of theirs is the structuring of the songs: if in earlier albums, their tracks at times felt a little messy and over- blown in length and flow, now they sound in order, perfectly structured and well-balanced.The album itself shows not only a great and diverse palette when it comes to instrumentation; Every song, basically, has a unique trait that makes it distinguishable over the rest of them, and that is a quality that is hard to pull of in one album and impressive when successful, considering the structuring problems the band had with \"The Underfall Yard\". A song like \"Uncle Jack\" has a predominant banjo, while \"Judas Unrepented\" has much more organ/keyboards, \"Upton Heath\" meanwhile has a very memorable and beautiful choir section in the chorus.\"English Electric Part One\" is a sweet, gentle, melancholic piece of work, strengthened by fantastic musicianship, including the charismatic, lyrical vocals that weave in each track all of the different melodies beautifully. It's diverse, catchy, lush, and challenging: four qualities that are more than enough for a Prog Rock album to work."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Thursday, October 24, 2013",
      "rating": 3,
      "text": "Good but could have been greatAfter reading all the ravishing reviews about this band and album decided to pay a couple of bucks in a well- known site and download it, won't say that wasted my money, because theEnglish Electric (Part One)has outstanding individual performances, a good sound and a few interesting passages, but overall I find it generic, lack of personality and extremely boring.YES vocal references and some GENESIS influenced passages are not enough to save this album from oblivion, let's be honest, I can't find a single memorable song. So, in my opinion the problem is not in the sound (which is high quality), virtuosity of the musicians (can't be denied), but in the tedious Alternative/Indie/Crossover/Prog related compositions, that bored me after a few minutes.The album is opened byThe First Rebreatherand the first thing I notice is the vocals, being that seem like a blend of Peter Gabriel, Phil Collins and Fish (Not bad at all) and then at the mark of 1:29, a passage that reminds me too much ofLos Endos. But to be honest I like the track, it has brilliance, strength and versatility, even though that the word originality is not in their dictionary. The best song of the album, only weakened by that Gabrielish flute passage that sounds nothing like Peter Gabriel's flute.After a promising opener, I was starting to sing that all the praises were justified, but reality hit me hard when I listenedUncle Jack, some sort of comedy relief in the style of ELP songs likeThe Sheriff & Jeremy Bender, but without the freshness and audacity of the famous power trio, and to make it worst, the fantastic vocal work ofThe First Rebreatherisn't remotely repeated here?Well played but absolutely forgettable.Winchester From St Giles' Hillis a pretty musical piece but absolutely anodyne, the intentions are good, the piano passages are delightful, but the composition is absolutely tame and predictable, sorry, but I fell asleep for a couple of seconds when listening this song the first time. Sometimes a beautiful tune is not enough.Judas Unrepentantintro takes me back to the late 70's when Rick Wakeman was experimenting with new synths and the infamous Birotron, which was great in albums likeCriminal Record, but absolutely dated today. At least in the vocal parts they give signs of life and seem to find an own sound?..Well, until they start with the gabrielish flute and the late Genesis Mellotron Choirs.Summoned By Bellsis a song of contrasts, the first five minutes are really repetitive and boring in the style of Phil Collins, but suddenly they allow themselves create one of the most brilliant moments in the album, with jazzy leanings and powerful guitar, drums and keys interplay, but when they are sounding great, fall again into some tedious Kenny G like ending section that really turns me down. Just when they dared to be ambitious and vibrant, ruined it all with a depressive closing section, and to make it worst is followed by another forgettable track asUpton Heaththat works as a Valium (Please guys stop using sections so reminiscent ofLos Endos & Squonk, especially when so watered).A Boy In Darknessis another uneven song, the first couple of minutes are absolutely soporiferous , but when I was ready to press the skip button, the song changed dramatically, at last they dared to unleash themselves, here we can listen everything, from heavy guitar solos to Ian Anderson / Thijs Van Leer influenced flutes, dramatic violin and some first class Psyche/Folk Prog that really impressed me, simply frantic and vibrant, this is what this guys need to do.The album is closed byHedgerow, another exiting song that combines the na�ve sound of 60's British Invasion, Psychedelic touches and excellent vocal work, seems as they reserved the best for the end.Well, now comes the rating part that I hate so much. Until the fifth minute ofSummoned By BellsI was decided to giveEnglish Electric (Part One)two weak stars, butv then everything changed, they left the safe play and took risks, ending the album in a very high level. It's a pity I have to go with only 3 stars, because this release has some impressive music, but it's so uneven that can't go higher.}I'm 100% sure that if this guys dare to take risks, they are able to give us a couple of essential masterpieces, but we'll have to wait and have faith..The skills are there, what they need is the decision."
    },
    {
      "reviewer": "m2thek",
      "date": "Posted Thursday, January 2, 2014",
      "rating": 4,
      "text": "Ever since the release of The Underfall Yard, a question I asked myself fairly often was 'Is the modern incarnation of Big Big Train one of my favorite bands, or is this just one of my favorite albums?' Far Skies Deep Time certainly pushed me in one direction, and fortunately with the release of English Electric Part 1 I can definitively pick a side and say, yes, they are one of my favorite bands. While the album manages to be both better in almost every way, yet not quite as good as TUY, its addition solidifies Longdon-era Big Big Train as a great modern symphonic band.Avoiding that last comparison to TUY for now, let's talk about what Big Big Train's overall sound is like. They are listed here as Crossover, but they are now obviously Symphonic. There is a strong balance between structured, melodic instrumental passages with powerfully sung ones. Instrumentally there is also a good balance between guitar and keyboard (as well as other eclectic instruments) which all take the lead about the same amount. While the music found within the songs is great, I think the most important thing about this band is that they are very concerned with crafting their albums as complete pieces, and English Electric is no different: you'll find repeated musical and lyrical themes, the songs are structured in a logical way in regards to mood and length, and the albums as a whole are kept to reasonable lengths. Another important aspect of Big Big Train's music is their lyrical content. Lately they've been interested in telling real world stories through their music, and EE takes this to the extreme with each song telling the tale of a noted Englishman, whether they were socially famous or just important to one of the band members.So, how has this changed since the last album? Surprisingly a lot. TUY was critically and commercially Big Big Train's most successful album so it's very refreshing to see them treat their new material so differently. Most importantly, EE is sonically miles ahead of TUY. If I could find one complaint about the previous album it's that while all of the songs were great, there was a lack of diversity. Taking a look at how the first four songs start out, it's like they made a specific point to be as diverse as possible: a gloomy guitar line starts the first song, warm banjo strumming the second, pastoral flute and piano the third, and furious organ and guitar to start the fourth. The choice of instruments has also been expanded; as mentioned, the banjo makes an appearance, as well as multiple flute and violin passages. There is a return of the brass band from TUY as well as the addition of a few female vocal harmonies. Judging EE on these textural elements alone, it is expertly made and it would be challenging to find a contemporary album that could stand up to it. The quality of the production is also stellar, and even at the conclusion of the album where 1,000 things are going on you can hear everything perfectly.The only area that I find TUY overshadowing this album is in the composition. English Electric is a more adventurous album in terms of song structures compared to its somewhat formulaic predecessor, and because of this, it is hit or miss. About half of the songs here are spectacular and the emotional climaxes, when they pay off, are really hard hitting and even surpass some on TUY. However, some of the songs in the middle section drag on a bit , some of the stylistic choices can be a little boring, and the only attempt to recreate a passage from the previous album (the ethereal brass coda of 'Victorian Brickwork') falls pretty flat in comparison. While the songs can be a little inconsistent, a really special note must be made for the closer, 'Hedgerow,' which contains one of the most beautiful musical moments I've ever heard which is only so effective because of the seven songs that come before it.Even though the sum of the individual songs doesn't have the same success of the last album, English Electric Part One is still a great overall package. The wonderful thing about the album is that it is clear that the whole piece was the main focus and you're really rewarded for listening from start to finish. Furthermore I'd go so far as to call it one of my favorite arranged albums ever and I could listen to the instrumental diversity all day (and have in fact repeated the closer on multiple occasions). A year later it's clear that this is one of 2012's best, and comes in as a close second for Big Big Train's best album. Simply put, this is must-hear material and we can only hope that their next main album continues the band's masterful approach to composing albums as a whole."
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Thursday, January 23, 2014",
      "rating": 4,
      "text": "Sometimes you really strike gold at PA! I discovered this band through this site and I must say I�m quite impressed. Well, the much praised The Underfall yard did not exactly won me over. it was clear that the band was good, but there was something missing yet at that point. Actually the CD sounded a little overworked too. But when I heard the following EP Far Skies Deep Time, I knew they had nailed it! It was the perfect combination of great songwriting, perfect arrangements and excellent songwriting, coupled with outstanding performances. That did the trick. So I was quite anxious to hear what would come next.English Electric (Part One) is basicly everything I had hoped for: great symphonic prog rock which mixes very well simple, nice melodies with complex arrangements and inspired performances of all involved. The comparisons with Gabriel-era Genesis are not a coincidence. Not only is this band highly influenced by that band, but they also found the right formula that made Genesis the classic band they were (all the elements mentioned before). Still, Big Big Train does not copy Genesis, that of the same matter dutch band Odyssice captured so well 70�s Camel spirit without really sounding like a cover band. That�s the difference: BBT (and Odyssice) produce a familiar style of music, but they do too have a personality of their own all along. That�s very rare.Of course the album would have never worked if they hadn�t have the excellent songwriting hability to match their obvious terrific technique. There are absolute no fillers, with all the tunes being very well done both in terms of writing and, specially, of performances. It�s so hard to see an album where every instrument, every voice, every note fits in so smoothly (another Genesis trait during their heydey). There are no fillers nor highlights, all the tracks do stand on their own, although the opener The First Rarebreather may be a personal favorite. Certainly BBT finally reached a maturity rarely seen nowadays. Since singer and multi intrumentist David Longdon joined the fold they have been getting better and better with each release. And his flute playing is certainly one of the most interesting features of this recordOk, some people will cringe upon hearing this CD, claiming the music has nothing original (meaning zanny), that they play too \"safe\" (nothing to shock you) and break no new ground (even at the expense of the music itself). I wll disagree, since they are quite original on their own way. It�s quite accessible, I admit it, but still it takes several spins to fully grasp its full richness. And the music is beautiful, skillfully played and imaginatively arranged. To me this is good enough. Wrap it up with an excellent production work and you�ll have one of the most stunning works I�ve heard in a long, long time.I�m really anxious to get English Electric (Part Two).Rating: 4,5 stars. Highly recommended!!"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album2e74.html",
  "last_parsed": "2025-05-18T12:42:39.900514"
}