{
  "album_title": "STILL LIFE",
  "artist_name": "Van Der Graaf Generator",
  "artist_page_link_local": "artist8c00.html?id=343",
  "year": 1976,
  "rating_value": 4.3,
  "rating_count": null,
  "review_count": null,
  "genre": "Eclectic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/343/cover_410161142016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Pilgrims",
      "duration": "7:07",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Still Life",
      "duration": "7:20",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "La Rossa",
      "duration": "9:47",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "My Room (Waiting for Wonderland)",
      "duration": "8:09",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Childlike Faith in Childhood's End",
      "duration": "12:20",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Gog (live) (12:23) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "* Previously unreleased",
      "duration": null,
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Wednesday, February 4, 2004",
      "rating": 5,
      "text": "As there were remaining tracks from the previous writing/recording sessions, Still Life arrived fairly quickly on the market, and what a splendid album it was! Godbluff's twin album is actually superior (and ultimately more rewarding) to it and it shows with the stunning artwork sleeve.Opening Pilgrims (and its slowly solemn descending crescendo) is a sure winning salvo only topped by the lengthy La Rossa (their Italian affinities showing), while the very personal My Room (Hugh Banton on bass and Jackson's superb ambient sax, with Evans' restrained drumming) is a real contender for the best Graaf track >> not far from House With No Door. The title track is another spine-chiller, with Hammill's doomy and desperate vocals crying out in the middle of the night, before the quartet is picking up momentum and Hammill's mood changing to anger. Then comes the lengthy and awesome Childlike Faith In Childhood's End (inspiration taken from a book that was particularly well appreciated from all band members) closing off the album in a grandiose way.While two of the five songs were written (and recorded) during the Godbluff sessions, the remaining three tracks are certainly of the same calibre if not even better, but certainly the proof that Graaf still had major things to say in the realm of prog rock. As I said before, I prefer Still Life to Godbluff for it has no weak track, but sincerely, choosing between there two is something I would rather not do."
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Friday, March 12, 2004",
      "rating": 4,
      "text": "Picking the best of this lot is not an easy task, but \"Still Life\" is an all time classic recording. This is VAN DER GRAAF at their best with the classic line up of musicians. The music here is deep dark and rich adding some of VDG's most notable song writing skills. \"Childhood's End\" is a brilliant epic tracks and one of my all time favorite VDG tracks. This band were one of the most influential in the world of Prog rock and have been praised in many circles. This album pulls all the right buttons and has a superb recording quality to it with just enough hiss to give you that classic feeling to it. Peter HAMMILL is at his finest here and sounds just superb with the rest of the band. This is a needed jem to show off to all your friends!"
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Monday, June 7, 2004",
      "rating": 5,
      "text": "When Hammill decides to write a set of lyrics about a reflective subject, he gets really intense, explosive and desperate. That's because Hammill doesn't just settle down to merely stating an idea; he needs to expose the process of grasping that idea, consider and reconsider it, then draw conclusions out of it. That is particularly true concerning the lyrics of this masterpiece 'Still Life'. Their evocative power is enhanced by the melodic lines he composes, as well as his fiery singing style. Having said that, let me say that this album is quite optimistic, not from an easy-going point of view, but regarding a positive attitude Hammill now endorses: this attitude is delivered through the typical Hammill-esque intensity. 'Pilgrims' celebrates the power of solidarity, 'La Rossa' explicates the joy of a consumated love, and 'Childlike Faith in Childhood's End' is an affirmation of the existence of a meaning to life, though it may be \"hidden\" or \"elusive\", yet it must be recognized by all means. Behind the gloomy portrait of a City of Immortals in the namesake track, lies the need to accept death as an integral part of life: if we denied it and miraclously eventually achieved it, we would be doomed to live pointlessly for ever and ever. Meanwhile, 'My Room' is a regretful meditation of a past time spent on fruitless lamentations. Musically speaking, this work signifies a fluid continuation of their previous effort 'Godbluff' (also brilliant), though I must say that I find the musicianship tighter and more impressive on this one. The dramatic ambience of 'Still Life', the combination of genuine energy and sophisticated complexity in 'La Rossa' and the epic splendour of 'Childhood's End' make them absolute highlights of this album, and their whole career as well. The majestic vibe that are displayed in the organ layers for the namesake number are really anthological, while Hammill sings about the lack of meaning for the Immortals' lives: the final sentences are literally deadly. Also deadly, but at the same time compellingly enthusiastic, is the manifesto of life delivered in the final lyrics of 'Childlike Faith'. I won't skip the intimate spirit of 'Pilgrims', nor the delicate beauty beneath the languid surface of 'My Room': in these two pieces Jackson delivers some of his most inspired sax parts ever. Let me finish by saying that this is my fave album from VdGG's second era, and I find it almost as enjoyable as 'Pawn Hearts' (my all-time fave from this band)."
    },
    {
      "reviewer": "Carl floyd fan",
      "date": "Posted Tuesday, September 21, 2004",
      "rating": 3,
      "text": "I never got into the 2nd part of VDGGs carrer (75-77) like I did the first part (69-71). Even though the last song on Pawn Hearts was a preview of what was to come and a song I liked very much, this cd was kind of a letdown. I like the first two songs but the rest of the disc just sounds so alike and not as inspired as earlier VDGG. Still, between the four albums released between 75-77, this is the one to buy."
    },
    {
      "reviewer": "Guillermo",
      "date": "Posted Monday, December 27, 2004",
      "rating": 2,
      "text": "This is the first album that I have listened from this band. Maybe I expected very much from this band after reading several reviews about their albums, and after reading that many people considers this band in the same \"level\" and \"sound\" as GENESIS (recording albums in the same label, Charisma Records, and also touring together sometimes in the 70s), YES, and other famous and praised Progressive Rock bands. Maybe I`m not fair with this band, but it took me several listenings, and this album is not as interesting for me as other albums by other Progressive Rock bands. It is \"hard listening\" for me, really. This is an \"atypical\" band in several things, in my opinion. Their history tells that Peter Hammill was signed to a record label as a soloist, and that he had this band. He had the songs, and the rest of the musicians simply played them in their first album in 1969. The band split in 1972. Hammill then started a solo career. Later, he reformed the band for more albums during the mid 70s. So, this band has mainly Hammill`s songs and vision, with few collaborations from the other members in the songwriting. This is a band without a regular bass player (like the band called Traffic), without predominant guitars, with the organ being the main instrument accompanied by the drums, and occasional saxes. I think that Hammill shares with Peter Gabriel the taste and sound of \"theatrical vocals\". Hammill has a very good voice, but sometimes his vocals sound to me with \"exaggerated emotions\". He is a very good lyricist. I like some parts of the lyrics in this album. \"Existentialist\" lyrics. Maybe this is the best part of this album, but the music is not very interesting for me. The sound of the saxes is for me similar to the sound of the late Chris Wood from the band Traffic. I have never listened to Hammill`s solo albums, but I know that he has released a lot of solo albums and I think that he really never needed to have this band to have fans for his music and lyrics. The first time that I heard him sing was in Robert Fripp`s \"Exposure\" album. I heard a strong very good voice in that album, and this also made me expect very much from this band. I consider this \"Still Life\" album only for the fans of Van der Graaf Generator. So, I give to this album a 2 stars rating."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Saturday, February 26, 2005",
      "rating": 5,
      "text": "No doubt! This is a TRUE MASTERPIECE album![IMHO. Sorry, . there is no room for me to compromise on this ..]This band was well known by name if only because they headlined the Charisma Records package tour at the dawn of the 70's. One of their supporting bands was a young English outfit going by the name of Genesis. Never fitting any traditional box, VdGG forged their own path, with the wailing organ of Hugh Banton and Peter Hammill's hallmark voice - described as having a multi-registered miracle - being the most distinctive features. [2]. It was often said that VdGG music a kind of putting more emphasize on organ as the main instrument to form their music textures - replacing what was famous at the time: keyboard / moog synthesizer and guitars. Woodwind instruments, especially sax, were also used to strengthen the role of organ and sound variety. Practically, most people thought that VdGG was the band that pushed their music with the non existence of guitar in most of their compositions. Of course there were some songs with guitars, but they were not a lot of that kind.The band's lineup changed through the formative years, even featuring Robert Fripp (King Crimson) as a guest guitarist on two of of their classic albums: \"H To He Who Am I The Only One\" (1970) and \"Pawn Hearts\" (1971). After the latter they took a break from the music business before appearing again in 1975 with the organ- driven \"Godbluff\".Personally, this band has colored my life since childhood altogether with all seventies' heroes. As many people mentioned that \"Pawn Hearts\" is the masterpiece, I would opt to say that \"Still Life\" is their finest album followed by \"World Record\" and then \"Pawn Hearts\". It's probably a difference in musical tastes. But I have a compelling reason of putting Still Life as their finest. First, there is no such track out of overall five that is considered as mediocre track; all of them are excellent. Second, this album was written with a solid concept - a melodically-based songwriting - and tight composition. This is not something to do with \"I like it\" or \"I do not like it\" ball game, I'm talking about overall songwriting, composition, structure and delivery (performance). And, this album fulfills all those dimensions very well with practically no flaw at all. As I understand from my prog mates, most people found hard to get the melody line of VdGG music. But I consistently told them: \"Be patient, open your mind - free your mind with any preconceptions or expectations - sit down and relax until you got the line, then the rest it will stay in your mind forever!\". Then I gave them this album and ask to jump start enjoying the third track \"La Rossa\" where it has a solid melody.Let's talk about this album in great details, if you want. Otherwise, just buy this album as this is a masterpiece!\"Pilgrims\" begins with a nice organ sound which by in it is already a melodic and atmospheric opening, I think. This opening organ touch is really killing. The tonal voice of Peter Hammill enters beautifully with \"Sometimes you feel so far away .\". A fantastic opening part already. Peter has been well known for his ability to shift between angelic whispering, sultry baritone crooning and violently impassioned screaming as unnerving as it is exciting to witness. He does excellently in this opening track. The contribution of Hugh Banton on organs augmented with David Jackson's sax have enriched the textures of this song. Excellent!\"Still Life\" starts off differently. Hammill starts his angelic whispering with \"Citadel reverberates to a thousand voices, now dumb: what have we become? What have we chosen to be?\". It's dark nuance opening and it provides a very good atmosphere setting of the song. Hugh Banton puts his thin-layered organs at the back, accompanying Hammill's singing. One-third of the song overall duration is set with this style until Guy Evans enters his drumming work. The music and the singing flows into higher register notes where Peter Hammil's singing turns screaming in some peak segments. The most interesting part is the thin-layered organ sounds (augmented with sax) that have textured the song brilliantly. The music turns to quieter passage with a piano and voice line until it ends beautifully. Brilliant composition!Ahem . I cannot wait until this my all-time favorite track since I heard this album for the first time in 1977. Yeah, \"La Rossa\" is a great song with easy to digest (at least for me personally) composition. In here, I think the Peter Hammill's voice is somewhat theatrical and is a pivotal element of the song. Observe this lyrical part: \"Lacking sleep and food and vision, here I am again, encamped upon your floor, ..\". It demonstrates Hammil's top caliber singer as the way he sings this opening part is like mumbling but with a very strong accentuation and excellent melody. The strong accent is very obvious when he says \"floor\" at the end of this first lyrical part. It then continues with next lyric \"craving sanctuary and nourishment, encouragement and sanctity and more.\". Again, you may observe when he sass \"more\"; it projects a very strong accent that he repeats as he previously says \"floor\". Very cool. The music gradually enters in its full swing led by drum work during this lyrical part: \"The streets seemed very crowded, I put on my bravest guise - I know you know that I am acting, I can see it in your eyes\". It flows beautifully to higher notes with excellent singing style accompanied with wailing organ sounds and drum beats. The melody is so uplifting. The composition of this song demonstrates the band's ability to mix high and low points brilliantly. Sax fills its part nicely in between transitions or sometimes during Peter's singing. Despite all, what makes this song brilliant is that it shifts the melody-line unnoticeable as at the end part the tagline melody is completely different with the first half of the song. Well, I can talk a lot about this song as this is - for me - is a very beautiful song. But I have to stop it and put one overall comment on this song: a true masterpiece!\"My Room (Waiting for Wonderland)\" is a mellow track and it starts with a baritone voice of Peter accompanied with sax at the back and some augmentation of piano sounds. I can sense the jazz influence of this song especially during the first part of the song. David Jackson is given a chance to do his sax solo in the middle of the track until Peter Hammil'ls low register voice enters the music. The tagline melody does not change much over the full stream of this song. Only at the end the piano and sax are given more roles in avant-garde jazz style to conclude the song.The concluding track \"Childlike Faith in Childhood's End\" starts with a dark nuance through a combination of Peter Hammill's voice and organ at the back; playing the same notes. At approx minute 2:01 the music turns into a faster tempo with Peter Hammil's singing takes the lead to lift up the tone. Saxophone provides some rhythmic sounds to enrich the role of organ. Some sax solo is also performed at approx minute 4 of the song until Peter Hammil's voice returns theatrically. It turns to a quieter passage with solid accentuation and the music turns fully symphonic. I can hear a lot of emotions involved enjoying this track. At approx min 7:30 the music shifts into a more avant- garde style with some sort of complex arrangements but still maintaining the baseline melody so when it returns back, it happens smoothly.It's a highly recommended album as this is a true masterpiece with a progressive approach. Still Life is a good album to start for the beginners and those who start to explore progressive rock. You won't regret at all to own this brilliant record. BTW, the band will do a long awaited REUNION CONCERT this year. Visit their website for details!Keep on progging!Yours progressively,GW - IndonesiaReferences:1. The band's website - it's a simple design site with a lot of links available here.2.PROGRESSION magazine Issue 35 - Spring / Summer 2000 \"Interview with Peter Hammill by Tony Emmerson and Steve Baylin."
    },
    {
      "reviewer": "Certif1ed",
      "date": "Posted Friday, March 4, 2005",
      "rating": 3,
      "text": "Needs a bit of movement and direction...For me, an easy and initially engaging but ultimately wearying listen. At first, the music engulfs the listener in a rich groove and washes of full Hammond. The only initial obstacle is Hammill's slightly over-enthusiastic warbling, which has somewhat precious tendencies. However, obstacles are meant to be overcome - especially when the music is of this sort of quality, and the lyrics give plenty to chew on.A fine organic ebb and flow introduces the album, and, although there's nothing remarkable or particularly memorable going on, the music is very much \"for the moment\", and provides a comfortable easy chair for the mind to relax into, despite Hammill's dark and somewhat angst-ridden vocals. There's nothing particularly outstanding about the first two songs - they're just nice. It's the texture of the music that tempts us in deeper.La Rossa combines a magical groove with imginative shifts in texture and mood. It sadly is not perfect, as it becomes altogether too raucous for my liking towards the end, with sax and keyboards apparently battling it out after a particularly impassioned vocal section. Several times, the texture and direction appears to get lost - but at least the ending is possible.My Room is a good place to be... if I may put it like that. A beautiful if slightly over- loose jazz groove winds its way around melancholic vocals. The only real criticism I would offer is that the bass tends to be a bit directionless and uninteresting - otherwise a smooth track, one that stands out without trying to.Childlike faith in Childhood's End somehow fails to maintain the interest, throughout its' epic length - although all the right noises are made... with the exception of Hammill, who maintains a wearying level of intensity with little light and shade or sensitivity to the lyrics.There are interesting episodes, when it feels like it might all come together, but generally it all seems a bit aimless and directionless....which last paragraph sums up this album as a whole, really. Definitely one for the fans - but I wouldn't say Fans/Collectors only, as I am sure that many would get something out of this album. I don't think it's an essential album, but really, every self- respecting prog collection should have at least one VDGG album in it. This may not be the one though."
    },
    {
      "reviewer": "James Lee",
      "date": "Posted Sunday, March 20, 2005",
      "rating": 3,
      "text": "Why do I do this to myself? I know I don't care for VDGG, and yet I keep trying. Part of it is because I value (to a certain extent) the opinions of fellow progressive rock fans, many of whom think VDGG is the cat's meow. Part of it is that Peter Hammill is so appealingly over-the-top that I enjoy listening, in the same way I love listening to THE LEGENDARY STARDUST COWBOY and BAD BOY BUTCH BATSON. But even I have to concede that there's much more to VDGG than a novelty thrill, and out of pure respect for the fans and musicians involved, I'll keep the review as objective as possible.Having said that, I'm happy to say that \"Still Life\" is one of the better VDGG albums with which I've tormented myself. There's a real sense that the band has progressed from the \"Pawn Hearts\" days, while losing nothing of their unique sound and musicianship. While refusing to compromise with a more mainstream sound, the songs on \"Still Life\" are relatively accessible- there are few mixed-meter passages and the melodic component is largely conventional rather than experimental (not a bad move for a band that focuses on emotion rather than virtuosity). The atmosphere is typically moody, with plenty of minor-key keyboard-led slow-burners that erupt sporadically into aggressive bursts of raspy organ and Hammill's patented ragged throaty declaiming. Everything reaches a cathartic culmination at the end of \"Childlike Faith\" which puts a nice closure to the album as a whole.Banton and Hammill provide a solid and competent keyboard foundation for the vocals (there's very little guitar here), leaving solo duties to Jackson for the most part. The saxophone adds color and a bit of soulfulness- especially in the understated opening to \"My Room\" (but, in other places on the album, contributes to the recurring temptation to compare VDGG to the \"Rocky Horror\" soundtrack). Hammill seems more comfortable with his voice, crooning softly over the majority of the album and belting out the louder sections with more control and expressiveness than ever before. Evans' drumming is better on this album than I've ever heard him- tight and masterful, and quite well-recorded, providing much of the energy and structure for these otherwise soft-and-dark tracks.If you've been waiting for me to get nasty, keep waiting. \"Still Life\" is mostly a pleasant experience (pleasant isn't exactly the right word, but I can't find a word to describe \"mellow angst\" and I've already over-used the word \"moody\"). It's not too different in texture and approach than PINK FLOYD's \"Dark Side of the Moon\"; both albums create a seductive current, a relaxed but emotion-drenched flow to the final organ-filled crescendo. VDGG has less variety and experimentation (both compared to \"Dark Side\" as well as to their earlier works), and as a result the songs are rather similar, but it's not a wearying similarity; if you like the sound, you won't mind hearing it re-interpreted from song to song. The most complimentary thing I can say is that \"Still Life\" came closer to satisfying me than anything VDGG has done."
    },
    {
      "reviewer": "Trotsky",
      "date": "Posted Tuesday, June 28, 2005",
      "rating": 3,
      "text": "I seem to be the among the minority of hard-core VDGG fans that consider Still Life to be a real disappointment. I feel that after the majestic comeback that was Godbluff, Still Life was a pretty sharp decline and is really not much better than the average post 1975 Hammill solo album.Perhaps part of it has to do with the production, for while Godbluff retained the raw sound of the early 70s albums, Still Life is a slicker, clearer album. Maybe the pervading ennui and desperation that had shone through vibrantly in past albums, suddenly became a sullen affair. It's not easy for me to pinpoint exactly why I consider this album to be so inferior to its four predecessors, but I do.At first glance, the differences between this album and classic VDGG are subtle. The opener Pilgrims for example has all the familiar ingredients but except for the outro sax solo from David Jackson, it seems so lifeless. For the first 3 minutes, the title track is even more so ... a draggy pleading affair that makes me want to switch my player off. Even when Hugh Banton's organ kick-starts the band, this song seems more like a tepid track from Coverdale-era Deep Purple than a true VDGG effort. An impassioned rant from Hammill doesn't save the song.La Rossa is often cited as a VDGG classic, but it doesn't really hit the spot musically, until around the 4 minute mark, when the song finally undergoes a change of pace. I also quite like the break that kicks off after 6 minutes but I think what sums up the crucial difference between this album and its predecessors for me is that Banton seems to spend far too much time holding chords and Jackson's sax lines lack their usual bite. What we are left with is dense, static prog that it is too much for me to handle.My Room (Waiting For Wonderland) is definitely my favourite song on the album, and in fact is often the only reason I come back to this one. The lighter feel of Jackson's lines and just about the only memorable melody from Hammill on this album clinch the deal. Nonetheless, I don't rate it among my top 10 VDGG songs.The concluding piece Childlike Faith In Childhood's End is another boring, generally monolithic piece. Even when the band picks up the pace, and Banton's organ briefly comes to the fore, I rarely hear anything that excites me. Jackson's sax work consistently seems flatulent and \"mainstream\" compared to what he's done in the past, and even some probing lyrics and violent screaming from Hammill leave me cold.I've sat through this album 7 or 8 times, and still feel like there's some joke that somebody's playing on me. Don't get me wrong, compared to many other prog bands, this is still a good, albeit non-essential work, it's just that compared to what preceeded it, Still Life is poor. ... 54% on the MPV scale"
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Thursday, July 14, 2005",
      "rating": 5,
      "text": "More aggression and jazz sensibilities from VdGG. A very organ dominated album, the saxes of Jackson are very subdued and play a much more minor role than on previous albums. Hammill's lyrics never let up, either, he's working at the same pace and with the same fury as in Pawn Hearts and their previous efforts. The rhythm unit is very tight and provide the foundation to great jazzy influenced music. There are many catchy rhythms and hooks in the music here, which was somewhat unheard of in their structure. Sure, there were some hooks in their music, but this album is filled with them. The aggression and angst that you feel in their music and from Hammill's raw and powerful voice is a very predominant force.Stand out tracks are Pilgrims, which opens with some beautiful organ work and some soft vocals from Hammill. It soon evolves into a rollicking jazz jam with more great organ work from Banton and some very precise drumming from Evans. The next track that stands out in my mind in La Rossa, which begins with very emotional vocals from Hammill and organ that slowly fades into the mix. The bass work from Banton on this track is also among the best work he's done. And the final stand out track is the Still Life, which features some intricate piano work, and some very good work form Banton and Evans, as well as Jackson, who takes the forefront.Overall, this is Van Der Graaf's second masterpiece, the first being Pawn Hearts. No fan of this group's collection is complete without this stunning collection of works that make up the album. It is my favorite VdGG album, and is a must have in my mind. 5/5."
    },
    {
      "reviewer": "Seyo",
      "date": "Posted Thursday, July 14, 2005",
      "rating": 5,
      "text": "\"Still Life\" is probably the peak of the \"second generation\" VDGG career 1975-78.A true masterpiece of progressive music, slightly more accessible than, say, \"Pawn Hearts\", but with a genuine signature heavy sound of organ, piano and saxophones. Hammill delivers his vocal/lyrics performance with emotions and confidentiality, without compromises.\"Pilgrims\", \"La Rossa\" and \"My Room\" can easily be proclaimed the top best prog compositions ever, while extended and complex \"Childlike Faith in Childhoods End\" offers a rare and effective electric guitar solo, atypical of VDGG music.This album is essential for any prog collection, provided you have already acquired a taste for Hammill's dark, expressionist lyrics and his angered, frustrated and highly emotional voice."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Monday, September 12, 2005",
      "rating": 4,
      "text": "This is one of the most interesting dark progressive works by Hammil and C., in which his lyrics (often in search of a superior artist value, above all in the development of the songs), are complex. Therefore his approach on the excellent vocalism is particular, and in spite of being not equal to his masterpieces (first of all \"Pawn Hearts\", then also \"H to He.\") it's a very deep work, both in the arrangement and in the immediate harmonic construction.in fact it's still remain as a unique and diverse episode within the career of P. Hammil, sometimes representing a true \"tour- de force\" by V.D.G.G., looking for a different music dimension. Of course their music is harsh, sometimes heavy in its content and quite difficult to take as well, but at the end it's their own \"trademark\", that you cannot emulate anyway. \"Still life\", in my opinion, is closer to the mood of his solo works, more than the other most successful albums by Hammil & C.: if you like his recent career the present issue is well worth checking out, as it's mainly composed by Peter.otherwise you could discover some diverse features within the dramatic compositions of V.D.G.G., depicted by means of new interesting colours both in the melody and the music harmony, even in the situation in which the stuff work is a bit inferior in comparison to the other albums. However - after all- it's a minor defect, as this work is worth to be collected; otherwise erase an half star at least, only if you're not too much into their intricate stuff!!!!"
    },
    {
      "reviewer": "con safo",
      "date": "Posted Monday, October 31, 2005",
      "rating": 5,
      "text": "VdGG's second album after their glorious return with \"Godbluff\". The band released two of their best albums after a four year hiatus, returning to their trademark sound (slightly altered of course) The organ is much more pronounced on the later albums, with the sax being no less excellent but becoming a less pivotal instrument as it was on the earlier albums. The music doesn't suffer one bit, in fact it's a fresh change to their sound that keeps true to their earlier work yet lets the band explore more musical ideas. The album \"Still Life\" is one of the bands most mature releases IMO, Peter Hammill's writing style peaked during this period, his lyric work on this album is absolutely brilliant. Dense, intricate song themes that take many repeat listens to fully grasp. Whereas the earlier albums the song meanings were more literal (well as literal as Peter Hamill can get) these songs are brilliant observations of human kind, including the pursuit of immortality which eventually strips all meaning from life. The inner battle that ensues when considering destroying friendship for an intimate relationship, and ultimately where the human race is heading in this time. All superbly written backed by glorious music.\"Pilgrims\" opens with Banton's sublime organ, soon joined by Hammill's beautiful voice, a great composition which ties into the album's themes perfectly. A standout passage in this song is the atmospheric and menacing \"Away, away, away - look to the future day for hope, some form of peace, within the growing storm.\" Then exploding into the uplifting chorus that reaches emotional peaks rarely heard. Fantastic opener! \"Still Life\" is a wonderful track that begins with Hammill's voice only: \"Citadel reverberates to a thousand voices, now dumb, What have we become? What have we chosen to be?\" Hugh's organ softly floating behind Hammill's mournful voice. The song gains volume until Hugh's organ, densely layered, takes off behind Guy Evan's always fantastic drumming. David Jackson again in the background of this song but definitely add's nicely to the overall texture. Great song writing!\"La Rossa\" is the highpoint of this album, and one of my all time favorite VdGG songs! Complex , beautiful and chaotic, this is song writing at its absolute finest! The song is the mental debate within, deciding whether sex is worth destroying a friendship, using a clever \"Organ Monkey\" metaphor. Hugh's organ shimmers and swirls, complex and brilliant, all augmented superbly by David's again submerged but excellent sax performance. The song gains momentum as the debate within is eventually resolved and the song bursts into the finale \"Drown me, drown me now and hold me down before your naked hunger burn me at the altar of the night - give me life!\" Thrilling conclusion! \"My Room (Waiting For Wonderland), a beautiful jazzy track, angelic piano and excellent organ generated bass. The song follows a similar rhythm throughout but never gets boring. This is the song that David get's to shine, contributing some impressive solos. The song almost resembles a free jazz jam near the end, quite nice!Still Life ends in epic splendor as we reach our final track \"Childlike Faith In Childhoods End\" A radiant composition, and some of the best writing Hamill has done thus far! The whole band shines on this one, the interplay between Banton and Jackson is superb and wonderfully textured. The song reaches several epic peaks, musical and emotional splendor, there's really no way else I can describe it! Hamill belts out this song in an almost prophetic manner, singing as if these were his last words. Listen for David's solo during the first climax, intense! The song ends in epic brilliance, almost taking you with the human race and they are brought to the apex of the universe, naked to all, preparing for the final day's of human kind. But hope is not lost - there is something more for the human race, a more meaningful existence, a better place for all -And though dark is the highway, and the peak's distance breaks my heart, for I never shall see it, still I play my part, believing that what waits for us is the cosmos compared to the dust of the past.In the death of mere Humans Life shall start!Superb closer to this masterpiece of progressive rock! 5/5 - con safo"
    },
    {
      "reviewer": "greenback",
      "date": "Posted Saturday, May 6, 2006",
      "rating": 3,
      "text": "This is another progressive rock album: VDGG keep the same style and sound here, and the compositions seem slightly less elaborated than usual. There are VERY lengthy bits; the music is mostly unmelodic and Hammill's voice is annoying, as always. The keyboardist is too linear, especially when he plays the organ in the background, which seems to be the only keyboard used here, excluding piano: the mellotron is very hard to detect. \"La Rossa\" is more loaded, reaching a climax between 6:10 and 6:40, but it still remains tedious to listen. The sax parts are often as annoying as the singer's lead vocals. The \"Pilgrim\" and \"Still Life\" tracks are often insipid and go nowhere. \"My Room\" is among the best tracks here, with more delicate, jazzy & echoed saxes, catchy piano and gentle cymbals patterns. \"Childlike faith in childhood's end\" is not really memorable, except for the bit between 7:35 and 7:50, which reminds the Happy The Man band of the 70's, and except for some more interesting parts during the second half of the track. I don't think VDGG is a difficult music: their ingredients just do not work very much for me. After 6 albums, I feel like I do not want to know more about them..."
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Tuesday, July 18, 2006",
      "rating": 5,
      "text": "As i said on God bluff, this band means a lot to me. One of the most challenging and cerebral bands ever. Absolut marvelous album from the first note to the last. Still life is in my top 10 albums ever. I describe it like this: inventive, well played, with an enourmous feeling add to the album by this four gentlemans. For the track Pilgrims 5 stars is not enough in my opinion, the highlight here, the rest gets from me 4.5 stars. The title track is also a damn good one. A highly recommended album and band. Everything in the album will surely prove superior enough to be one of your favourite albums, and why not one of the best prog albums ever in the history of music. Still life, 5 stars, grandious as always, and for sure a masterpiece of prog, stunning album."
    },
    {
      "reviewer": "Philrod",
      "date": "Posted Saturday, October 14, 2006",
      "rating": 4,
      "text": "This is the second album i bought from the band, just after Pawn Hearts, wich set an incredible precedent. Is it as good as the other one? Not really, but it remains a true must for any prog fan. Some songs are just incredible. The album has flaws, it's true. but let's look at it song by song. Pilgrims starts off the album in a great way, because this song is probably, at least in my case, one of the easier to get into in the whole back catalogue of VdGG. This is a good thing, because it will get you at least one reason to buy the album: listen to ''somewhat'' accessible Van de Graaf, because nothing is really accessible about this band. Then there is Still Life, wich is an ok song with incredible vocals from Peter Hammil. If only for that, this song is great. After is La Rossa, a truly great song wich you should all listen. The lrycis are great, the mood too. My room is the weakest song of the album. It goes nowhere, it is mostly too long. At least, they kept the best for the end. In fact, Childlike Faith In Childhood's End is one of the greatest song the group has ever done. An absolute gem you should love, and if you don't, I definitely do. All in all, not perfect, but awesome. 4.5/5"
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Tuesday, December 5, 2006",
      "rating": 4,
      "text": "The best of 2nd era VDGG.Competes with Godbluff for best of the 2nd era, you really can't go wrong with either one. I find this album more complete and more polished. No one single track particularly stands out, although La Rossa is my favorite here, and the only real flaw I see is My Room.Pilgrim is somewhat of a flashy song, with a brilliant sax line. It could easily be a song on Godbluff similar in style to Arrow and Scorched Earth. The next track, Still Life emphasizes a solemn tone, with soft organs backing Hammill's story-telling vocals. This leads to a dynamic instrumental section, and then back to a quieter, backing organ.La Rossa is one of the few tracks with guitar by Hammill himself (rather than Fripp) that I like. My favorite part about La Rossa however is the different percussion employed to back the creative sax/organ interplay. It really helps to build the vocal sections and add another flavor to an easily recognizable classic VDGG sound. The ending here fits perfectly as well.My Room is a bland track to these ears. It's more jazzier and laid back, Hammill's voice is deeper here as well, and it sounds more like a cafe song to me than anything else. It's a nice little track, but it doesn't do much for me.Childlike... is one of the most disparaging tracks VDGG have written, and their have been many, so you know it's pretty bleak. Lines such as \"Even if their is a heaven when we die\" wouldn't be the thoughts of an optimist. This track reminds me somewhat of Plague of Lighthouse Keepers, even if the eccentricities are much more pulled back. I see it as such mainly for its structure and the importance of the lyrics to the music.The second best VDGG album, and the place I would look to for new fans to the band. I say here, rather than Pawn Hearts, because I feel that album is perhaps most difficult to get into and most standoffish to casual listeners. Of course, this all depends on your interpretation of Hammill's intriguing vocal delivery."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Friday, January 19, 2007",
      "rating": 5,
      "text": "After Godbluff, could VDGG strike hard again ? Well, let's hear.As \"Godbluff\", I purchased it at the time of release. During these ancient times,VDGG was one of my beloved band (I still come back regularly to them, especially with this one).IMO, it is their second masterpiece in a row. And probably their best record ever.The title track, as opener, is a brilliant song : good keys, discreet sax and omni- presence of the smooth vocals from Peter : \"What have we bargained and what have we lost ? Unlike \"Undercover Man\", this one is not a crescendo song. It switches straight form light to hard. From the most subtle VDGG moments to the strongest one : great keys and sax. How fabulous is Jackson again.I can only be disappointed that I will soon see VDGG again after an enormous break in my life (just over thirty years) but without Jackson...(he will not be touring with the band in 2007). Banton is also great during the instrumental break. The \"finale\" is full of emotion, with Peter almost alone in command (but he is used to this). This is one of my Van Der Graaf all time fave (together with \"Refugees\" as you might know).Next is : \"Pilgrims\" : a fresh, very emotional song full of hope; a bit like \"Refugees\". I quote : \"I've been waiting for such a long time just to see it at last, all of the hands tightly clasped, all of us pilgrims\". This quiet song for most of its duration ends in a torrid sax solo with great backings from the band. Superb. I have to admit that VDGG second generation pleases me a lot. Better than \"Mark I\". Their repertoire turned from quite obscure, frightening, extremely difficult to perceive into an almost light and accessible music (for VDGG standards of course).\"Pilgrims\" is a marvelous song. IMO it is probably to best one of their whole career (only equalled by \"Refugees\"). It is amazing to notice how close they are in their atmosphere but at the same time quite far from each other in terms of release. Thank you guys to delivered such a great piece of music again.\"La Rossa\" is a more classic VDGG, harder and darker with a very powerful band supporting Peter. It is the first song in which he seems tortured as he used to be. More keys than usual and Jackson more in a background mode (but this is valid for the whole of \"Still Life\"). It works pretty well, though. The finale is extremely powerful : the band being really strong. A great track but the less accessible of the album.\"My Room\" is the darkest one on \"Still Life\". Quite desperate lyrics : \"My lungs burst to cry: - Finally, how could you leave me here to die ? I freeze in the chill of this place with no friendly face to smile goodbye - How could you let it happen?\" Brrrr.I guess you should not listen to this song if you are in a depressing mode to avoid commiting suicide. Very slow tempo all the way long (the atmosphere of this song is pretty close to the one of the album \"Berlin\" from Lou Reed).I would say, typical Hammill lyrics (\"Necromancer\" style). Scary, bizarre but oh ! so passionate ! Slow, very slow tempo all the way through. If you want to get the shivers on a tropical holiday, put this song on your MP3 player to cool down. Guaranteed. The whole song is harmonious. It has the (very) dark side of their first generation but with no \"weird\" intrumental passages. So, even if \"My Room\" is rather morbid, it is another great song.The closing number \"Childlike Faith in Childhood's End\" combines the best of both VDGG worlds : wonderful melancholic tone (typical of this album), Peter is again very passionate in his rendition, Jackson is absolutely \"grand\" in the backing sax. But really the whole band (including Evans and Banton of course) is really on par. This wonderful song closes the original vinyll album in such a wonderful way. Fabulous. Another highlight.So, it seems that it's the fifth highlight so far. And it's the last track. Out of five !The remastered CD version proposes a live bonus track \"Gog\" which is rather poorly recorded (specially the vocal parts : Hammill is more eructing/shouting his text than singing it). Not an essential track at all (unless you are a collectionist of their work, like I am) to get this remastered version. Since it is their most accessible album, I would strongly recommend it as an entry one if you are new to VDGG. So, yes. VDGG stroke hard. Definitely! Five stars."
    },
    {
      "reviewer": "el b�thy",
      "date": "Posted Wednesday, July 18, 2007",
      "rating": 5,
      "text": "Ok, let me start off by saying that it is very, very rare for me to listen to a Van der Graaf album for the first time and be blown away, they usually take three listenings at least for me to say \"hey... this album is pretty damn good\"... with this one the very first time I was listening to it I knew I would write a 5 star review about it.And yes, ladys and gentlemen, it is really one hell of an album, all you could ever ask from VDGG is here and better than ever, music does not get much better than this... specially not the vocals!!! And I mean it, ladys and gentlemen, the vocals here are not only superb as always (it�s Hammill... what else could you expect?) but I think maese Hammill never sung with more emotion before (I do not dare to say \"after\", there is a lot of his material, specially solo I haven�t had the chance to hear yet). I mean, liste to the part where he sings \"I climb through the evening, alive and believing in time we shall all know our goals and so, finally, home\" from the opening act Pilgrims without feeling something. I mean. it�s simple imposible, this one line, this one and only line is so... so damn charged with emotions... I can only take my hat off to Hammills genius. Of course the rest of the album is just as good, specially La Rossa, which might be the strongest song of this album, and one of the top... three of their whole career or so... that�s for sure!What more to add?... mmm, nothing really; damn, I had not written such a short review in a very long time... but there isn�t really anything more I can say... I can maybe with some synonymous to Still Life. marvellous, excellent, masterpiece, incredible, the [&*!#], extraordinary, just to freakin�good. and I could go on and on."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Wednesday, October 24, 2007",
      "rating": 4,
      "text": "4.5 stars. As others have mentioned Hugh Banton's organ work takes a more prominant role on this recording while David Jackson's sax work is reduced to more of a supportive role except for on \"La Rossa\". Peter Hammill's vocals really shine on this album, and his lyrics are second to none as usual.\"Pilgrim\" is my favourite song on this record. The lyrics are encouraging and hopeful with the music to match. Some mellotron on this one as we get a dark section that only makes the passage before 5 minutes even more uplifting. \"Still Life\" has interesting lyrics about what it would be like to be immortal. Soft vocals and organ to open and the song doesn't really kick in until 3 minutes with aggressive vocals, drums and organ leading the way. Piano and reserved vocals 6 minutes in. \"La Rossa\" is a song that wasn't used on the \"Godbluff\" record. It builds to theatrical vocals, percussion and sax. Lots of vocals and sax until the song sort of takes off after 7 1/2 minutes with faster paced vocals and some great sax melodies.\"My Room(Waiting For Wonderland)\" is about dealing with lost love. It's sad with sax and light drums to open. Reserved vocals arrive,but it's the higher pitched vocals 2 minutes in that are such a highlight. \"Childlike Faith In Childhood's End\" deals with thoughts about life. Is life and death all there is ? This is the longest track at over 12 minutes. Peter's vocals go from aggressive to passionate. I really like the drum, organ and sax melody early. Check out the powerful organ 12 minutes in. Emotional.This is one of my favourite VDGG records. A must have for all prog heads."
    },
    {
      "reviewer": "sean",
      "date": "Posted Saturday, March 8, 2008",
      "rating": 5,
      "text": "This is VdGG's second album after their first break up and it arrived quite soon afterwards. Although Two of the songs are leftovers from the Godbluff sessions, I have to say I prefer Still Life to its predecessor. This album, my favourite from VdGG's second era, contains some of their deepest and most moving material. Musically and lyrically it tends to be very dark but beautiful, with an element of hope in the darkness, as if he is showing us that though life can be dark and hopeless, that if we persevere we will find light and hope. Lyrically, Peter Hammill deals with familiar subects like death, immortality, and loneliness. The standout in the department is Childlike Faith in Childhood's End, a musing on the necessity to give life meaning, and how even in the darkest times we must work to make things better for the future. The title track also excels here with its lyrics about the necessity of death and how immortality would take away our wills to survive and better ourselves. Musically, the album bears a jazz influence, mainly due to David Jackson's sax work, while still working within the structure of rock music. Honestly, this band sounds like no other so it's hard to make comparisons and state influences. Simply put, this is unique, special music. It is dark, savage, experimental, and beautiful all at once and I highly recommend this album for any fan of music. My favourite VdGG is Pawn Hearts but I'd say this could be the best album for a starter on the band, as that one is a bit further out there and this one is a bit more digestible, but still great music."
    },
    {
      "reviewer": "LiquidEternity",
      "date": "Posted Thursday, April 24, 2008",
      "rating": 4,
      "text": "Another grand album from these boys. However, compared to Godbluff, it's not quite as impressive. La Rossa and the massive Childlike Faith in Childhood's End are my favorites off this one, and I almost wasn't surprised at all when I read that they were written during the Godbluff sessions. Pilgrims and Still Life are both pretty good songs, but a bit less exciting than I was hoping for. Certainly not bad, but just not the kind of explosively surprising that I had been hoping for on account of other Van der Graaf songs. My Room has some grand saxophone work, as well.In all, a very good album, and certainly not one worth ignoring, but not necessarily as impressive as some of the others these boys cranked out. Of course, any fan of VdGG needs to buy this one, too, as it is more of them in peak form. Not great enough to merit five, but still very enjoyable."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Tuesday, May 27, 2008",
      "rating": 5,
      "text": "Hammil's voice alone will floor youFor my 200th review I thought I'd visit an old friend. That, and around the time of my 100th someone said I'd committed a sin not having reviewedStill Lifeyet. So here we go.This record is, simply put, one of the best and most emotional collection of songs ever put to tape. From the opening organs to the ring of the last chord, this is an album that induces nothing but a spine numbing chill that will leave you breathless. If you're familiar with other Van Der Graff Generator [VdGG] albums, then this one won't be entirely hard to ''get'' but it will come as a shock as though you've just been defibrillated back to life. What's most noticeable about this album is a few things - yes, Hammil has always been a very emotional vocalist, and yes VdGG have always been a group of superb musicians, but something about this album just clicks.It's been said that during the recording ofGodbluffthere was so much material that they simply had to make another album,PilgrimsandLa Rossawere performed on stage during theGodbluffshows and it really makes sense considering how amazing each of these tracks turned out. This album is definitely not the simple off cuts of a masterpiece - it is a masterpiece in of itself as a separate entity who has much in kin with it's older brother but has coming into it's own enough to know what's up in the world.Starting with the ever beautiful and classicPilgrimswe're treated to the same kind of VdGG we know and love. But then... something happens. As though Bruce Banner had just been belted by gamma rays this one explodes with Hammil's voice coming into the apex of the track. Not to say that the track reaches it's pinnacle early and then burns out, but who can ever forget that amazing delivery from Hammil as he screams, ''I climb through the evening, alive and believing''. From there on in the album's course is set. And ho boy, is this a good course for the band to take. The lo-keyStill Lifefollows the opening track quite well, almost forming a cohesive suite with how well the songs segue into one another. A similar melody toPilgrimsmakes for more spine chilling moments but somehow the track stays as it's own voyage.The second of the two songs from theGodbluffsessions finally rolls around.La Rossais an amazing track which, while not as tear jerking as the opening track is still burning powerhouse with Hammil's sharp delivery. A frantic and frenetic track, this is one that's not to be taken lightly. Typical VdGG madness molded into a very fine tune.Coming into side 2 we have some of the finest tracks ever laid down by VdGG. Starting off is the mellow and melancholicMy Room (Waiting For Wonderland)which sees Hammil tone down the grumble on his voice for a precious moment to allow this pretty track to unfold.Childlike Faith In Childhood's Endhowever, is a bomb waiting to explode. Opening with a very calm and wispy intro the track eases along for a moment following suite of the previous track until it starts to pick up with the intro of a drum. By the time a couple minutes have passed however, this one has turned into a fast and evil track which makes use of everything done on the album and even epitomizes it in a way. Excellent solos and voicing make this one of the standouts of VdGG's career, with the ending segment showcasing Hammil's voice with excellent melodies that will get stuck in your head for ages.There is nothing more to say about this album other than it is an essential masterpiece that demands listen after listen. VdGG fans will be blown away (if they don't already have it) and potential VdGG fans will become diehards. This is a stellar effort that has been, and should be seen as a landmark release. 5 stars, no hesitations - Recommended for all."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Sunday, June 22, 2008",
      "rating": 4,
      "text": "An oddity, 'Still Life' is an excellent VDGG album, but somewhat out of place in 1976. The band's choice of instruments was by now somewhat regressive and, like 'Godbluff', this was still VDGG without their youthful fire. They seem more dedicated to following rock music's unwritten rules than in breaking them, and by this time other bands, notably GENTLE GIANT and HENRY COW had ploughed new fields, leaving VDGG out to pasture.Nevertheless, this is as good as they got post 'Pawn Hearts', and there are some truly memorable moments here. Notably, the title track, 'La Rossa' and the sterling final track 'Childlike Faith in Childhood's End' all remind one of the energy the band possess, married here with a much greater reliance on melody that had been the case earlier in their career. HAMMILL's voice is unleashed, and it has never been better than on these five tracks. He uses it judiciously, no longer solely for shock value, and at times sounds plaintive, gentle and melodious, not words normally associated with the great man. JACKSON's sax appears on occasion, but the album is dominated musically by HUGH BANTON's organ and bass pedals. His work drives the title track, for example, a short but powerful musical statement sandwiched in between reflective opening and closing sections. 'My Room' is a beautiful interlude, a fragile theme developed into a moody, powerful lyrical statement of loss, HAMMILL's favourite theme. The closer doesn't quite measure up to their glory days, but it is close.Lyrically this album is as dark as any of their work, though more personal and self-revelatory and less reliant on metaphor. This self-revelation more than the music make the album compelling. However, at no stage is this album worthy of the tag 'heavy prog', nor is it difficult to penetrate in the way 'Pawn Hearts' undoubtedly is. It is neither unsettling nor caustic. 'Still Life' reveals a band at the peak of their powers and confidence, but some distance away from the genre-shaping music they had authored five years previously."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Thursday, October 2, 2008",
      "rating": 4,
      "text": "Still Life is the sixth studio album from Van der Graaf Generator. I�m new to the band and have listened to their albums from an end. I had a hard time appreciating and accepting the unique approach Van der Graaf Generator has to progressive rock and therefore my reviews of the first four albums weren�t as appreciative as they would be now ( I�ll redo them some time in the future). It was not until I came upon their fifth album Godbluff that I was truly intrigued or better put blown away by their innovative and experimental style and therefore I was really looking forward to listening to Still Life which is the successor to Godbluff.Van der Graaf Generator disbanded after the tour for their fourth album Pawn Hearts and Godbluff was a kind of re-union album. The sessions for that album was a very fruitful and inspired time for the band and they wrote a lot of songs. Not all songs made their way unto that album and two of them, namely Pilgrims and La Rossa, are present here on Still Life. Van der Graaf Generator had performed both live for a while and really wanted them to be on Still Life. The three other songs on the album Still Life, My Room ( Waiting for Wonderland) and Childlike Faith in Childhood�s End was written for Still Life.The music on Still Life is centered around Peter Hammill�s distinct vocal style and melody lines. Peter Hammill is a theatrical and emotional performer and his approach has taken me a while to appreciate, but today I regard him as one of the most original and unique progressive rock singers. His performance on Still Life is a bit more subdued than his generally aggressive style on Godbluff and due to that Still Life is a much more subtle album than Godbluff. Hugh Banton�s omnipresent organ playing is also a big part of Van der Graaf Generator�s sound while David Jackson�s sax and flute playing compliments the vocal melodies. Guy Evans is a great drummer. I really enjoy his style of playing. There are little regular bass on the album. Hugh Banton mostly uses bass pedals. The bass lines are usually pretty simple.All five songs on Still Life are excellent progressive rock songs. Pilgrims, La Rossa and Childlike Faith in Childhood�s End are my favorites while the two more subtle songs Still Life and My Room ( Waiting for Wonderland) are still growing on me. The mood is very melancholic and the music is generally pretty dark.The musicianship is excellent. Original and unique performances all over the line.The production is excellent. Really enjoyable.Still Life is one of the most unique progressive rock albums I have ever heard. Extremely emotional and cleverly composed. I�m still undecided if this is a true masterpiece and just the slightest hesitation in giving the 5 star rating means that I�ll give Still Life 4 stars. This is the kind of album that I might upgrade some time in the future though. This album just keeps growing on me the more I listen to it. Right now I think that Godbluff is a notch better than Still Life but if you enjoyed that album be sure to check this one out as well as they are like freak siblings. If you like your progressive rock dark and a bit out of the ordinary Van der Graaf Generator should certainly tickle your treat."
    },
    {
      "reviewer": "progrules",
      "date": "Posted Thursday, January 1, 2009",
      "rating": 3,
      "text": "Well, in fact my review (and rating) could almost be a copy+paste from the one James Lee did, at least for 90% of it. Because I also keep trying with this band whilst I know this isn't my cup of tea and never will be. But same as with TAAB from Tull where I stated that as a prog reviewer you should check out the most famous prog albums, I couldn't ignore this one either. And this is one of those famous ones, that's for sure and I also bought it because it was for sale here and another personal rule is that I review every progressive album I own.So maybe that's bad luck for VDGG because I also bought Pawn Hearts and Godbluff for the same reasons (the \"Wave\" one was already in my collection) but same as James I also will review fairly and as objectively as possible. This is my first of the quartet VDGG, let's see how it will end up.Yesterday I played PH and I wasn't impressed really and compared to that one I have to say this album is more to my liking and that's simply because it's slightly more accessible. This is not yet very obvious with the opener and the title track which are more like what I heard on the Pawn Hearts album. But third track (La Rossa) is actually an example of what I mean. I like their jazzy approach here as well.The other two tracks are somewhere in between the two options I mention above. Acceptable for what I can stand but not as nice as La Rossa. The bonus track Gog (live) is well, what shall I say, ..... interesting. Bit strange I hear no audience afterwards, probably they cut it out.Anyway, this wasn't really as bad as I feared. And I will never be an eclectic fan which is not a big surprise if you're a neo and prog metal fan to the bone like me. Of course it's also possible you like everything (like Gatot for instance) but alas, I'm not as broadminded as he. VDGG will have to settle for 3 in this case and it's rounded up from some 2,7."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Thursday, September 3, 2009",
      "rating": 4,
      "text": "Still Life seamlessly continues the revival started with Godbluff.Pilgrims and La Rossa were already recorded during the Godbluff sessions and are another proof of the huge creativity and energy that must have peaked during those sessions. The three remaining songs are a bit less rough around the edges and get to their point in more subtle ways. The combination results in a strong and varied album that boasts some of my favourite VDGG tracks (La Rossa and My Room).Because of the slightly smoother approach the album might be a good VDGG introduction candidate for music lovers that are maybe not that much into prog. Reason is that Still Life has a broader range of appeal then what you expect to find from your classic prog dish: with their dark intensity they might win over some of the more adventurous dark wave fans (Bauhaus anyone?), with their complex song structures, absence of guitar and dominant sax/organ instrumentation they might attract an occasional jazz enthusiast and with their harsh and evil (!) atmosphere they could easily lure some metalheads into their realm.Hey, with an album title like Still Life they should have won over all Opeth fans already!"
    },
    {
      "reviewer": "The Sleepwalker",
      "date": "Posted Friday, September 4, 2009",
      "rating": 5,
      "text": "It took me a while to get into Still Life, a long while actually. Still life is the first release after the magnificent Godbluff, and though there are some similarities between the two, Still Life is very different from Godbluff. Godbluff was full of raw power, while the strength of Still Life is not the band's fierce and angst laden sound, but the sensitive and melancholic sound.The first time I listened to Still Life, I didn't like it at all. It was the marvelous VDGG, but it was not even close to some of their other albums. For example, \"Pilgrims\" sounded a bit too euphoric, and songs like \"La Rossa\" seemed like songs not worthy enough to be on Godbluff. After a long while, my opinion has totally changed. I think Still Life is an exceptional piece of music, as it is one of the most emotional and haunting albums I've ever heard.Still Life does not have any bad song on it, though some are really better than others. The albums opener is the mysterious \"Pilgrims\". The song starts kind of euphoric, but in a mysterious way. The song soon takes some turns and really becomes a diverse and brilliant piece. So is the soothing \"My Room (Waiting For Wonderland)\". Both these song give me some feeling of relievement, very good. The title track is a very lyric driven song, as half of it is Peter singing over some very low volume instruments. The song might take a while to understand, but it's a great piece.The two big highlights of the album are the epic \"Childlike Faith In Childhoods End\", a twelve minute VDGG classic, full of different riffs, moods and styles and the powerful \"La Rossa\". My ideas about about \"La Rossa\" sounding like a song not worthy enough to be on Godbluff have completely changed. In fact, \"La Rossa\" is one of the best pieces VDGG ever made. It's one of those songs that makes me constantly shiver and at some moments make tears appear in my eyes. This really is one of the most powerful songs I've ever heard.Still Life is one disc full of brilliance, I have rarely heard an album as haunting and sensitive as this one. I ca't give it another rating than five stars, because it fully deserves those. This really is a masterpiece of prog, and though it might be tough to fully understand and appreciate, I would recommend it to anyone liking or wanting to like VDGG."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Tuesday, November 24, 2009",
      "rating": 4,
      "text": "After having just listened to the debut of this eclectic prog band I had to release one of the classics upon my senses. There is no comparison.This album is truly a wonderful foray into the dark netherwold of VDGG. Ear splitting vocals and ambient keyboards are the order of the day and Hammill is a master of the insightful existential lyric. This is him at his existential best. Listen to the caterwauling of La Rossa and Still Life to hear his heartbeat and feel the tension and angst of a life dedicated to music.My Room (Waiting for Wonderland) is an 8 minute journey into the darker consciousness of the man. This is not an easy album to digest, in fact no VDGG should be, but of the big 5 classics this is the most difficult and takes several listens to appreciate. I still cannot appreciate it as much as PH, TLWCDIWTEO, GB, or indeed HTHWATOO. However those albums are from a different era, maybe a different universe, and this is a diverse detour for the band. It does not rely heavily on heavy guitar or keys and is a lot more melancholy than any VDGG. Hammill is turned way up in the mix and the instrumentals accompany his instrument/voice on each track. It is gentle and quiet but very brooding and moody. Stunning vocals throughout and Jaxon, Banton and Evans are quintessential to the evolution of the group. Perhaps this is the best line up, no arguments there I suspect. But it is surprisingly restrained and may turn some off as there is not a shred of heavy rock unlike previous albums.The bonus track though rocks out and is a freak out of sound - incredible. Gog! What is this? Where does it come from as no album features this in studio format. It is a wonderful raw vibrant performance from the band.I cannot quite give this 5 stars, unlike PH, my favourite release of the band, perhaps my top 5 prog of all time is Plague of Lighthouse Keepers, but 'Still Life' must be awarded 4 stars for sheer ingenuity and audacity. A jaded album for sure, slightly twisted in places, too quiet for comfort, uneasy listening, but a very good release from VDGG."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Thursday, February 18, 2010",
      "rating": 5,
      "text": "And so just like the pilgrims we have been on a long journey through Van Der Graaf Generator's discography but now we've finally reached our goal!Still Lifeis one of the essential albums in my music collection and it's definitely as great as a Van Der Graaf Generator album can ever be! All these tracks have something different to bring to the table and the end result is satisfying to say the least. The track-list does bare a resemblance toH to He, Who Am the Only Oneand that's not the only thing in common becauseStill Lifebasically plays the role of the older and more mature brother to that record.Of course nothing is without its flaws. One possible problem that I can think of is the fact that most people considerLa Rossato be the albums biggest highlight but after more than 40 listens I still can't agree with that statement. The song is good but I actually prefer all of the other compositions a whole lot more!Is this album a continuation ofGodbluff? Well I certainly don't think so, in fact I find it to be a very different beast indeed compared to the rest of the band's discography. There is a much more personal and emotional touch embedded into these compositions flavored by Peter Hammill's exceptional themes and Hugh Banton's subtle but yet so powerful arrangements.It took almost a year and more than 40 revisits forStill Lifeto grow on me but in retrospect it was definitely worth the investment!***** star songs: Pilgrims (7:07) Still Life (7:20) Childlike Faith In Childhood's End (12:20)**** star songs: La Rossa (9:47) My Room (Waiting For Wonderland) (8:09)"
    },
    {
      "reviewer": "friso",
      "date": "Posted Tuesday, March 30, 2010",
      "rating": 4,
      "text": "Van der Graaf Generator - Still Life (1976)Silence after the StormVdGG became one of my favorite bands in recent years. Their confronting sound and their no- consensus approach to progressive music is truly a blessing. Still Life is considered their best record by some because of its professional sound and good recording. It is also considered the last of their prime period.I myself do not agree with the majority in this matter. Though I can understand people like the professional atmosphere of this record, but I miss the naive and psychedelic approach. Another letdown are some of the lyrics, those who also listen to Peter Hammill's solo career know that his divorce had become his main lyrical theme. I found a vinyl copy of Hammill's 'Over' which was totally ruined by this theme. On Still Life both the title song and La Rossa are about his ex-wife. I would rather have seen some fantasy story or some philosophical approaches like on the great opener Pilgrims.Talking about the song Pilgrims, this is one of my favorite VdGG songs because of it's great vocals, musical development and lyrical message. The refrain theme is catchy and powerful, it gives me the feeling life is real and serious. Wonderful! The second track, the title track, has a great opening theme, but the couplets are a bit simple and the aggressive vocals are a bit out of place. La Rossa has a stronger composition, with more melodic development. To bad this track hasn't the strong vocals as some of the other tracks on the album and the ending section is bombastic but a bit chaotic.On side two we begin with the excellent My Room, which could be considered to be one of the most gentle and intimate tracks VdGG ever record. This track shows the true power of the wind-section of VdGG, played by Peter Jackson. Some jazz influence were adapted for the melodic sax lines of Jackson. The changing between major keys and minor keys keep the song interesting throughout and give the vocals a boost. Childlike Faith in Childhood's End is the longest epic of the album with a lot of melodic themes and lyrics. Though most parts are interesting I do sometimes loose my attention. Luckily the \"Even if there's a heaven if we die' - part has a great philosophical stream of thoughts and do I finish the album with a good feel.Conclusion. Not my favorite VdGG, I would prefer Godbluff, Pawn Hearts, H to He and maybe even The Least we can Do over Still Life. It somehow sounds like a silence after the storm (as the Dutch say), other records of VdGG are less quiet. I will still give this record a small four stars and I must say I should listen to it more often, if only Pawn Hearts and Godbluff weren't so perfect... All fans of VdGG should own this and people interested in confronting music and eclectic prog also shouldn't skip on this one. Actually a 3.5 stars for me."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Sunday, June 6, 2010",
      "rating": 3,
      "text": "After the Generator scored one hit (Godbluff) and one miss (Pawn Hearts) in my book, I chose the next step to the album that contained some material written during the Godbluff sessions.Seemed like good logic, but I am less than pleased with the results.Godbluff had lots of rocking, which I think this band can really do well. This continues into Still Life. However, on Godbluff, even the expository or softer bits had an edge, or at least moved along rather briskly. Not so with Still Life, particularly with the title track and My Room. Even the closer, Childlike Faith, has too many slow bits to keep me into things.Some love Hammill's voice others detest it. I tolerate it--even appreciate it at times--but at no point do I think it can carry the music, particularly with falsettos and extended vibratos. It just sounds bad to my ears when it's used more than sparingly...and unfortunately it's on full display in Still Life.Highlights for me include Pilgrims, the opener which features a stately pace and melodies to match. The best of course is La Rossa, which contains most of what the band does best: greasy sax, hammerin' hammond, and a rousing finale, with a special nod to great use of the cowbell. Bravo!To those who love this album, I suppose we're speaking different dialects and certainly have different tastes. It's pretty tame by Generator standards, but it's also uniquely VDGG enough that the throbbing masses will have little tolerance for what's inside."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Friday, July 30, 2010",
      "rating": 4,
      "text": "Hard to follow up the mammoth GODBLUFF album, but Pete Hammill and co. were more than willing to try with STILL LIFE. VdGG still goes after the heavy keyboard assault here, but this happens in fewer moments and only the Hammond organ is involved, one of the more overused instruments in prog rock. Actually, there are more quiet, softer moments (Oh, no!) here than there were on the last album. Seeing that I'm more of a fan of punchier moments, this doesn't sit well with me.It's a rather weird, amusing side of VdGG we're seeing here, even if this is one of their better efforts. However, I don't consider ''My Room'' a VdGG highlight; it's a soft jazz track that, while not bad or unnecessary, doesn't really do anything. Much of the same goes for the first two tracks, although fans will appreciate the traditional perks. Heck, Hammill is vocally at his peak here and ''Pilgrims'' is quite memorable.''Childlike Faith'' is the big epic on the album, and it's one of the better tracks. The best part is when the piece reaches this cathartic climax with Hammill singing in a rather scratchy tone, and then the song ends with him gasping. However, the best piece here might be the best VdGG track overall, and I'm speaking of ''La Rossa''. It carries that overt heaviness from GODBLUFF and mixes it with an ever-building middle. My only complaint is that the song dawdles for forty seconds longer than needed.GODBLUFF holds a more favourable opinion with me because that album revitalised my interest in Pete Hammill's world. STILL LIFE is a continuation of GODBLUFF; in my mind, it's not nearly as good, but it's still a very good album that can stand up on its own, barring the soft spots."
    },
    {
      "reviewer": "TheGazzardian",
      "date": "Posted Friday, August 20, 2010",
      "rating": 5,
      "text": "This is one of those slow growing masterpieces. None of the tracks here really grab the attention immediately, but over repeated listens, they reveal depth and detail that truly astounds. Of all of Van Der Graaf's releases, this one is the one that I find I connect the most with emotionally. Every once in a while, I have to listen to the title track, and it can almost bring me to tears - very few songs I can say that about. And it is not even the best track on the album; I would give that honour to La Rossa, a love song that doesn't sound like anything you will hear on the radio, in part due to the darker undertones. And of course, the idea of hearing Van Der Graaf Generator on the radio is, in itself, somewhat laughable.I'm going to keep this short, even though it's one of very few albums I've given a five star rating to so far, in part because so much has been said about this one, but also simply because this album connects with you on a strong, emotional level that no review can truly do justice to. Suffice it to say that, while this is perhaps not the most adventurous thing Van Der Graaf did, it is the most emotional."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Friday, September 10, 2010",
      "rating": 3,
      "text": "With a trademark and singularily unique style, VDGG follows up the excellentGodbluffwith an album almost as good, but one that is unable to connect with this listener.The intro has a nice energy and dynamic, but the stately feel of the composition doesn't take the group far musically. My favorite track is probably the slow, poetic, and increasingly morose \"My Room\", which is brilliantly conceived and performed. The celebrated \"La Rossa\" is a lively and driving change of pace, with more intenste bottom end lending a more striking counterpart to Hammill's sometime sloppy though exciting vocals. This tune is a fine example of VDGG's songwriting style, moving from a quite and poetic intro to a unique organ-led rocker, shifting dynamics and tempo back and forth throughout. While as a whole enjoyable, this also highlights my only real problem withStill Life: the loud parts often turn into a directionless mess, with instruments sounding like they're stepping on each other's toes in an attempt to make as much classy noise as possible... and Hammills voice during these sections regresses into hollering very often.This has the effect of undermining a lot of the connection I might have otherwise made to these songs. OnGodbluff, for example, we were offered more thoughtful instrumental sections and, dare I say, hooks which are very likeable despite the complexity and ambience they're surrounded by. WithStill Lifewe're offered no such life-lines, so the listener had best be prepared for old-school prog at its most dense and eccentric. Very close to a 4-star album.Songwriting: 3 Instrumental Performances: 3 Lyrics/Vocals: 4 Style/Emotion/Replay: 3"
    },
    {
      "reviewer": "colorofmoney91",
      "date": "Posted Monday, April 11, 2011",
      "rating": 1,
      "text": "Still Life is one of the more boring albums that I've listened to of VDGG's discography. The overall sound is still gloomy jazz inspired progressive rock, but is much more subdued and ultimately more forgettable. Peter Hammill's voice completely dominates this album, and that annoys me to no end. I've always considered his voice to be absolutely awful, and that is what this album is all about.I've listened over this album multiple times, and nothing ever sticks. I really wanted to like it, because I really wanted to like VDGG and learn to acquire the taste for Hammill's vocals, but the unnecessary theatrics in his vocals can't make any positive impression on me. The composition on this album is much lighter, less memorable, and remarkably less pessimistic sounding that their previous albums; all qualities that make this albums less superior to its predecessors."
    },
    {
      "reviewer": "Wicket",
      "date": "Posted Tuesday, July 5, 2011",
      "rating": 3,
      "text": "I'll be the first to admit, I haven't been a Van Der Graaf fan for a significant time for me to know what I'm getting into the moment I add another album onto iTunes.Maybe I'm missing something here, but after listening to a few tracks off \"Pawn Hearts\" and \"The Least We Can Do...\", I began to appreciate VDGG's brand of prog. Once I hit \"play\" on \"Still Life\"'s \"Pilgrims\", I was ready to expect another solid album with different influences of other genres and maybe even an instrumental section.Then the title track comes on and yes, it's a slow starting track. I figure it's going to slowly rise into a bombastic epic. And then all of a sudden, it's like I'm listening to \"Pilgrims, Pt. 2\". The second half of the track is the exact same thing as the first. \"La Rossa\" is an entertaining song with the delicate mellow sax, and then \"My Room\" is like a \"softer\" version of \"La Rossa\", and \"Childlike Faith\" is pretty much all 4 tracks wrapped up in a 12 and a half minute outro.Despite being musically good, it just seems like the entire disc lacks creativity, order. While the drums and keys stay on track most of the time, everyone else seems to splinter off and play what they feel like, when they feel like. I would've given more praise to Peter Hammill if he actually tried to sing with rhythm, harmony and in some particular form or pattern instead of spouting out random words in syncopation and disjointing the entire track, but it just aggravates me too much.Maybe it's how he's always sung on VDGG albums; I haven't noticed on \"Pawn Hearts\". It just seems like the release of this record really began to show Hammill's takeover of the band and how the progressive majesty of it just sort of faded away.Or maybe I'm just retarded. Either one seems likely reasonable."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Wednesday, October 12, 2011",
      "rating": 4,
      "text": "Hugh Banton provides one of his finest organ performances on this Van der Graaf Generator album, which picks up where Godbluff left of to continue its weird and wonderful explorations of bizarre conceptual spaces. Kicking off with Pilgrims, a strident and purposeful counterpoint to The Least We Can Do's more nervous and uncertain Refugees, the album takes us through explorations of immortality, classic Arthur C. Clarke novels, wild love and lonely meditation in a murky musical haze dominated by Banton's organ and David Jackson's ever-present sax. Standout track has to be the title piece, which combines one of Peter Hammill's most fervent vocal performances with some of his most philosophically intriguing lyrics. At the same time, though, tracks such as La Ross and My Room drag on a little too long for my liking, suggesting that the band could have pushed this up to a five-star piece had they spent a little bit longer cooking up new material for it."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Sunday, April 15, 2012",
      "rating": 3,
      "text": "Clearly, Hugh Banton and Peter Hammill are the defining elements of Still Life. The organ is omnipresent and dynamic, serving the even more dynamic lead vocalist. I find Still Life to be the least indulgent of the 1970s Van der Graaf Generator albums, and in spite of that, still retains histrionic vocals and ostentatious compositions fans had grown to crave. The album is remarkably inconsistent despite being the most consistent in terms of sound: While all five of the tracks are like very close sisters in terms of sound (almost identical, really), the compositions range from masterpiece status (\"Pilgrims\") to uninteresting (\"La Rossa\").\"Pilgrims\" Over a satisfying organ, Peter Hammill's voice gets atmospherically falsetto, but that is part of the charm depending on the listener's mood. His voice has managed his theatrics to the point where there is softness where it must be and bite where it must be. The melody and chord progression make this one of Van der Graaf Generator's \"d�j� vu\" tracks- for me, it's never remembered until I hear it again. Yet it is one of their finest.\"Still Life\" Pensive vocals and low organ open the title track. The brilliance of this song is how Hammill's voice grows from quiet to regal to biting angst and then to lamentation, all in the course of a relatively concise piece. Everything takes a background role to his theatrics.\"La Rossa\" The quiet singing over organ soon becomes flamboyant. This piece has energy but fails to engage me. It eases up in the middle, with Banton offering subtle organ bits under a saxophone motif.\"My Room (Waiting for Wonderland)\" Hammill's voice is uncharacteristically deep over quiet but melodic music. Bass and saxophone enjoy some time in the fore over gentle piano. This song has one of the band's best melodies.\"Childlike Faith in Childhood's End\" Alternating between heavy sax-led rock and the quieter music that pervades this album, the final, longest piece on Still Life is hard-driven, but I find it incoherent and, while far more consistent that some of Van der Graaf Generator's earlier long tracks, inconsistent in its own right. The album always loses me at this point."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Friday, December 18, 2015",
      "rating": 5,
      "text": "Review N� 44If there's a group that might be considered as a really progressive band, we can say that their name is Van Der Graaf Generator. They're a truly progressive band, in every sense of the word, and they are undoubtedly responsible for some of the most experimental, savage, heavy, original, complex, difficult and beautiful music that has already ever been made, in any type of music or in any time. Even for those who dislike of this group and of their music in general, many of them consider the importance and the legacy of the band in the progressive rock movement.Following the recording of their fourth studio album \"Pawn Hearts\" released in 1971, which is for many the best musical work made by the group, the band's leader Peter Hammill broke up with the band, and chose focus all his energy and spend all of his time, out to develop his solo musical career. When it came the time for reuniting again all the members of the band, in 1975, the Hammill's solo experience had its effects on the band's music, and the result of that was a kind of a change on their musical direction. While the traditional musical structures of their music continued to be complex and dense, there seemed to be a far less and different musical accent, on their following studio albums.\"Still Life\" is the sixth studio album of Van Der Graaf Generator and was released in 1976. It's the second studio album recorded by the group after their reunion, and corresponds to one of the famous trilogy of albums of the band that begins with their fifth studio album \"Godbluff\" released in 1975 and that ends with their seventh studio album \"World Record\" released in 1976. It's interesting to note that the group released three albums in only two years, and those works has some of the best material ever composed by the group, especially \"Godbluff\" and \"Still Life\".\"Still Life\" has five tracks. All the songs were written by Hammill, except \"Pilgrims\" which was written by Hammill and David Jackson. The first track \"Pilgrims\" is a track about the human cooperation and is a very good theme to opens the album. It seems start with a gloomy and melancholic note, along with your own mood and then slowly pulls out its melancholy, ending in a not to clear, but still somewhat with an optimistic message, pulling you out of your gloominess as well. There is a beautiful Hugh Banton's organ work with soft vocals from Hammill, but the Jackson's saxophones make the real mood on this song. The second track \"Still Life\" is the title track song. This is a very dark song that speaks about the death and especially one's own resignation before the death. It speaks about the consequences of the immortality and the inevitable paradoxes of the eternal life, if there is such a kind of thing. The title song starts with Hammill singing and Banton playing organ and the song grows with intensity all over the theme. The third track \"La Rossa\" is an epic tale about a desire fulfilled. It's a very powerful song, is the hardest rocking song on the album and is one of my favourite songs of the group, a real highlight. The fourth track \"My Room (Waiting For Wonderland)\" brings its echoes about the imagination and loss and is the more melancholic, peaceful and beautiful song on the album. The song follows a similar rhythm throughout, dominated by the Hammill's voice and it's very well accompanied by Hammill's piano, Banton's organ and Jackson's saxophones. On \"La Rossa\" and \"My Room\", Jackson delivers some of his most inspired saxophone performances ever made by him. The fifth track \"Childlike Faith In Childhood's End\" is the lengthiest track on the album and is an epic track that speaks about the theme of the grand fate of the humanity. It's a brilliant composition and it has some of the best lyrics ever written by Hammill. This is a wonderful and dramatic song that finishes the album in such and brilliant way, and with an impressive great style.About the album's cover it shows a Lichtenberg figure. Lichtenberg figures are branching electric discharges that sometimes appear on the surface of the interior of insulating electric materials. The name derives from the German physicist Georg Christoph Lichtenberg, who originally discovered and studied those kinds of electric phenomena.Conclusion: Usually, \"Still Life\" is considered a minor Van Der Graaf Generator's album, especially when it's compared with \"Pawn Hearts\" and \"Godbluff\". It seems that it's too much meditative and philosophical to the common progressive listener. However, I find it a very charming album, if I would never recommended it to an inpatient listener. Sincerely, I really think that \"Still Life\" is an exceptional piece of music and is one of the most emotional albums I've ever heard. Of the four best albums of the band, \"H To He Who Am The Only One\", \"Pawn Hearts\", \"Godbluff\" and \"Still Life\", this is probably, the most accessible of all. For those who aren't familiar with this group, or for those that remain resistant to enjoy one of the best and most important groups that ever existed in the progressive rock music, I suggest you, without any kind of doubt, to begin with \"Still Life\". But attention, you must have your mind fully opened.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "ALotOfBottle",
      "date": "Posted Saturday, April 23, 2016",
      "rating": 4,
      "text": "After releasingPawn Hearts, Van Der Graaf Generator enjoyed respectable chart success, got a fair amount of radio play and started touring a lot more than before. This obviously included a lot of hard and exhausting work. That combined with lack of support from Stratton-Smith and Charisma label led to financial problems, resulting in Peter Hammill leaving the group. At that time, he recorded a few solo albums such asChameleon In The Shadow Of The NightorThe Silent Corner And The Empty Stage. In 1975, the group reunited, refusing to play audience's favorites, and continued to create ambitious material. The same year,Goldbluffcame out meeting a relatively warm welcome. In 1976, the band recordedStill Life. The keyboardist Hugh Banton considers this album as one of the quartet's most accomplished works.1976 was not the best year for progressive rock. Peter Gabriel left Genesis, King Crimson broke up, Yes slowly gravitated towards radio-friendly pop songs withGoing For the One. Of course, many interesting things came out after that, but the overall freshness and vigour of the genre once so exciting, was nearly gone. Despite that,Still Lifesounds vivid, with Van Der Graaf Generator's \"classic\" sound in a great condition. Compared to Graaf's previous works, this album is more organ-centric and not as dark. However, the classic moodiness and theatricality, that the band became so renowned for, is very much present. The group's signature outer space-like quality still reverbrates in places.It sometimes seems like Van Der Graaf Generator's sound is shifting towards more soul-influenced scenario with the symphonic influences being estranged. Some of the pieces like \"My Room\" sound a tad more pop-oriented, but it is all done with phenomenal taste and does not sound ubiquitous. David Jackson's jazz-inspired saxophone appears in places bringing back the band's older material to mind. Besides phenomenal organ playing, Hugh Banton plays bass guitar, and quite proficiently may I mention, which I found to sit very loud in the mix. Peter Hammill's unmistakeable voice has a very melodic factor to it, making it appear almost like another instrument. All in all, the musicianship on this release is excellent.The album consists of five tracks, all fairly long, never getting below the 7-minute mark. What I especially like is that musicians seem to be taking their time in drawing the charming soundscapes, rather than rushing because of the recording time limitation. Some find the album boring because of its slow, phlegmatic development, but I have grown to appreciate that. \"Pilgrims\" and \"Childlike Faith in Childhood's End\" are two pieces that I feel are the most representative of this work, showcasing all of the previously mentioned elements.Van Der Graaf Generator are back in a tasteful fashion withStill Life. Although their material might not be as exciting and luminous as it used to be, it s without a doubt of superior quality. All of the band's classic ingridients are there, put into great use once more! Naturally,Still Lifeis a treat for Van Der Graaf Generator fans and is a perfectly accessible album. A gem of progressive rock, recommended!"
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Wednesday, January 23, 2019",
      "rating": 4,
      "text": "The first phase of the existence of VAN DER GRAAF GENERATOR proved to be an exhaustive one but produced some of the great classics of the prog rock universe and cemented the band's status as one of the true innovators and boundary pushing bands of the early 70s but also proved to be too much for four mere mortals to sustain. So in 1972 the quartet of Peter Hammill (vocals, keyboards), Hugh Benton (organs, bass, bass pedals), David Jackson (sax, flute) and Guy Evans (percussion) stopped touring and recording under the VdGG moniker and instead remained amicable while they slightly shifted gears as a band for Peter Hammill's solo albums, a rather unheard of situation that i can't find any comparisons. However after a few years of hiatus as the great VAN DER GRAAF GENERATOR continued to generate more fans through their classic albums from 'The Least We Can Do Is Wave To Each Other' to 'Pawn Hearts,' the guys started to get the itch for another run.And so it was that in January 1975 the band regrouped not as the studio session players for Hammill but as VdGG and hit the live circuit playing tracks not even released to rouse the public's interest and after a few months of creative output the band made a comeback with 'Godbluff' which was released in 1975 and found both fans and critics foaming at the mouth as they devoured VdGG's triumphant return to the prog universe. The band had successfully reinvented themselves with less psychedelic meandering and a tighter cohesive sound that continued the vocal singer / songwriter mastery of Hammill. With a successful comeback undertaken, the band was quite keen on keeping the momentum on track and wasted relatively little time creating the sixth album STILL LIFE for the market released in April 1976. While the album was pretty much a continuation of 'Godbluff' with two tracks 'Pilgrims' and 'La Rossa' as leftovers from those recording sessions, Hammill now took up playing the electric guitar and Hugh Banton found a much more prominent role with some of the heaviest organ work of his career.The opening track 'Pilgrims' initiates STILL LIFE and the connection to 'Godbluff' with a similarly addictive melodic riff that finds Hammill's emotive declarative vocals leading the keyboard rich prog process as the jazzy drumming and sax supplemental effects add the zest. The track delivers the expected tensions that involve a slow ratcheting up of Hammill's vocal intensity with ever accruing heaviness and organ and Mellotron soaked sequences. The track introduces a more melodic and dare i say even commercial approach as the VdGG albums had become almost indistinguishable between the Hammill solo releases since VdGG had greatly reduced the sci-fi fueled fantasy of their early albums as well as the psychedelic escapist meanderings and production tricks. Also noticeable is the low key sax presence of David Jackson as the sax and flute parts take a back seat to the organ workouts and provide a more subdued melodic counterpoint for the vocals.While the opener almost sounds cheery, the following title track is drowning in melancholy as a mournful intro finds Hammill mumbling around what sounds almost like a funeral organ roll and drags on for over a couple minutes but finally the track erupts into a bristling rocker that actually reminds me a little of what Styx sounded like in the late 70s with a groovy bass and syncopated stabs around the main rhythmic dance. The sax is also more standard and sounds like a clean Supertramp type of melodic display rather than the usual squawk factory from previous albums. One of the weaker tracks for me but still decent. The highlight of the album comes in the form of 'La Rossa' which delivers the most energetic track of the entire mostly subdued album as it finds Hammill in poetic prose enticing the audience into the groove and then the instruments go fairly wild with Banton's bass groove entering more sophisticated prog territory and the melodic drive much more akin to albums like 'Pawn Hearts' with Hammill's lyrical drive flittering all over the place. The track as the most satisfying sequence of chord progressions as it complexly integrates different melodic stages and teases them out into a near ten minute climax of sound. This is the only track where Jackson really lets loose the sax and woodwinds.'My Room (Waiting For Wonderland)' is the most solo Hammill sounding track and perhaps the mellowest ballad material ever recorded as VdGG. This emotional tug track focuses mainly on Hammill's labyrinthine emotional turmoil. The melody commences in cyclical form but towards the end the sax replaces the vocals. The longest track on the album is the closer 'Childlike Faith In Childhood's End' which is the most complex track on the album as it shape shifts through various stages of development. The track was inspired by Arthur C. Clark's novel and reprises some of the sci-fi themes of yesteryears which melds the metaphysical with ideas of hope and reincarnation and beyond. The track is the most anthemic of the album as it finds Hammill delivering some of the most emotively strong expressionisms of his career as the cathedral organs and stellar percussive drive of Guy Evans are on full display. The track also creates some stellar proggy forays into intense time signature gymnastics and the only other track where Jackson is allowed to really let loose on the horns. Probably the most satisfying of the lot for the hardcore proggers.While STILL LIFE is yet another gold feather in VdGG's cap, it nevertheless is the first album where the band didn't really evolve into the next level but is almost exclusively a continuation of the album 'Godbluff' which came before. While a followup of this magnitude is hardly a horrible thing, it still feels like something is a little stagnate on STILL LIFE despite the high quality of the compositions and performances. Lichtenberg figures (the image on the album cover) are associated with branching electrical charges that are engaged in a progressive deterioration of the high voltage and much in common with this natural phenomenon is the career of VAN DER GRAAF GENERATOR at this point. While STILL LIFE retained the band's status as one of prog rock's greats, the material presented here was the first step down from the series of masterpieces that preceded it and would usher in the band's decline as the musical landscape was forever altered by the punk and new wave artists quickly usurping the soundscapes. While still a phenomenally great album, STILL LIFE fails to match up to what came before but still displays a fiery band cranking out creative gems of sonic delight."
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Wednesday, November 6, 2019",
      "rating": 4,
      "text": "Van der Graaf, second phase.After Godbluff, comes Still Life.1) Pilgrims begins with a serene atmosphere, keyboards and vocals, and with a sound quite similar to Godbluff (only drums beat more dryly). The song reaches the pathos in rhythmic progression, when drums and Jackson's sax explode, and the song becomes epic and solemn and tormented, as the songs in The previus record. Rating 8+2) Still Life. The beginning, voice and keyboards, with church atmosphere, goes on until almost three minutes, risking becoming boring, but luckily then take over the rhythm section and the saxophone. Hammill then sings the same melody but with a raucous, gritty voice, which in some moments becomes epic, but is not adequately supported by musical arrangement. As mentioned for Godbluff, Hammill can no longer reach the high notes without turning his voice into an unpleasant growl. The song, however good, does not take off, paradoxically being the weakest of the album. Rating 7.53) After two linear pieces of about 7 minutes, comes a longer and more tortuous piece, more \"prog\", with continuous rhythm changes and frenzy in the execution. According to many it would be the most engaging piece on the album but personally I find it too hectic. After 4 minutes the rhythm changes completely, becoming slower and relaxed but then begins a progression that leads to an instrumental piece towards 6 minutes, which brings back to the initial rhythm. Hammill's voice often appears choked, the rhythm becomes consulted, hyperexcited. Rating 7,5/84) The second side opens with a slow and melodic song, among the most sober of the group, with saxophone, piano, drums in the background, hammill's voice singing on the low notes, and proceeds thus to the end. It looks like a Roxy Music ballad, with a good central solo by Jackson. Pleasant song, perhaps too slow and repetitive, with an excessively long ending. Good, but it doesn't reach the climax. Rating 7.5/85) The final piece, the longest is also the one that would like to be more epic. Slow and melodic beginning, then after two minutes the rhythmic progression begins, alternating with more relaxed moments in a grueling and pathetic song, always raucous, that does not touch the sublime vertices of the epic songs of the first albums, but that strives in a great effort. Rating 8.Still Life is a Godbluff-like disc for sound, arrangement and production, as if it were its second part, with more material, compact but less inspired.Rating 8+. Four stars."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Friday, July 14, 2023",
      "rating": 4,
      "text": "Barely six months after releasing \"Godbluff\", the prolific Peter Hammill and his band are back with \"Still Life\". Introspective and poignant, VDGG's sixth album persists in the existential questions as a driving vehicle throughout its development, remaining allergic to the superficial and inconsequential.Hammill, in a leading role more than on any previous album, which is no mean feat, goes back and forth from the imperceptible whisper to the most rabid and desperate vociferation, in dark atmospheres inspired by the deep waters of the psyche. From the beginning with the hurtful and harmonic \"Pilgrims\", passing through the desolate \"My Room (Waiting for Wonderland)\" and David Jackson's wavering saxophone, to the apotheosic ending with the heartbreaking \"Childlike Faith in Childhood's End\" and Hugh Banton's celestial organ that give it a unique nuance, the singer recurrently explores the human condition and its inexhaustible inner conflicts, using the melodies more as an accompaniment to express himself than as an end in itself.The 2005 remastering includes \"Gog\", a piece from Hammill's solo album \"In Camera\", but the sound is very dirty and hard to appreciate. A shame.\"Still Life\" is undoubtedly one of VDGG's most mature and balanced albums, and is part of the gallery of their best works.4 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album383d.html",
  "last_parsed": "2025-05-18T00:09:15.463572"
}