{
  "album_title": "HEMISPHERES",
  "artist_name": "Rush",
  "artist_page_link_local": "artistfb6c.html?id=609",
  "year": 1978,
  "rating_value": 4.4,
  "rating_count": null,
  "review_count": null,
  "genre": "Heavy Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/609/cover_10416452016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Cygnus X-1 Book II Hemispheres",
      "duration": "18:04",
      "is_sub_track": false
    },
    {
      "number": "i",
      "title": "Prelude",
      "duration": "4:27",
      "is_sub_track": true
    },
    {
      "number": "ii",
      "title": "Apollo / III Dionysus",
      "duration": "4:36",
      "is_sub_track": true
    },
    {
      "number": "iv",
      "title": "Armageddon",
      "duration": "2:55",
      "is_sub_track": true
    },
    {
      "number": "v",
      "title": "Cygnus",
      "duration": "5:01",
      "is_sub_track": true
    },
    {
      "number": "vi",
      "title": "The Sphere",
      "duration": "1:02",
      "is_sub_track": true
    },
    {
      "number": 2,
      "title": "Circumstances",
      "duration": "3:40",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "The Trees",
      "duration": "4:42",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "La Villa Strangiato",
      "duration": "9:35",
      "is_sub_track": false
    },
    {
      "number": "Buenos",
      "title": "Nochas, Mein Froinds!",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "To",
      "title": "Sleep, Perchance to Dream...",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "Strangiato",
      "title": "Theme",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "A",
      "title": "Lerxst in Wonderland",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "Monsters",
      "title": "!",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "The",
      "title": "Ghost of the Aragon",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "Danforth",
      "title": "and Pape",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "The",
      "title": "Waltz of the Shreves",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "Never",
      "title": "Turn Your Back on a Monster",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "Monsters",
      "title": "! (reprise)",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "Strangiato",
      "title": "Theme (reprise)",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "A",
      "title": "Farewell to Things",
      "duration": null,
      "is_sub_track": true
    }
  ],
  "lineup": [
    {
      "musician": "Alex Lifeson",
      "instruments": "guitars (6- & 12-string electric & acoustic, classical, Roland synth), bass pedals"
    },
    {
      "musician": "Geddy Lee",
      "instruments": "basses, Taurus bass pedals, Minimoog, Oberheim Polyphonic synth, vocals"
    },
    {
      "musician": "Neil Peart",
      "instruments": "drums, orchestra bells, wind chimes, timpani, gong, crotales, percussion"
    },
    {
      "musician": "Terry Brown",
      "instruments": "co-arranger & co-producer"
    }
  ],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Tuesday, February 3, 2004",
      "rating": 4,
      "text": "What a wait we had to suffer, to discover part 2 of Cygnus X-1 , and we did not really get satisfied by it , even though the lenght of that sequel was so promising and the enigmatic sleeve artwork cover also.Although most of us tried a thousand times to really get into that long suite trying to find the passion in 2112 or Xanadu. We were sort of disappointed but dared not say it , because something was not clicking the way we were hoping it would. Actually the answer came in an interview a few years ago , with Geddy Lee telling us that they felt trapped by the three words in bracket at the end of X-1. They could not make a link between the lost spaceship and the greek mythology they wanted to expand on. This explains why this last super-long suite/epic is not working out as it should. It will also be the last on of its lenght. They will not go over 12 min in following albums.But did we ever got revenge on the second side as The Trees was the Canadians Maples yelling at the American Oaks for taking too much light , place and air . La Villa Strangiato was very atypical for Rush foraying into jazz , but we all hailed it as the masterpiece it deserved to be . Even a filler like Circumstances sound great because around that point in tiome Rush could do little that would go wrong."
    },
    {
      "reviewer": "chessman",
      "date": "Posted Friday, March 26, 2004",
      "rating": 4,
      "text": "Second only to Farewell To Kings at this point, it is in some ways similar to 2112, but a vast improvement on that album. No weak tracks here! My least fave, again comparatively, is The Trees. But my mate loves that song as one of Rush's best! The title track is, of course, an epic, and musically well crafted. Alex again in fine form. One sometimes overlooks Alex because Geddy and Neil are so well known, but let us not forget it was originally Alex's band! Circumstances has an excellent structure and heavy but controlled guitar work. La Villa is another classic and shows off Alex's often underrated ability with some nice solo lines in it. He wasn't, and isn't, just about power chords! Another 'necessary' purchase for any Rush fan."
    },
    {
      "reviewer": "greenback",
      "date": "Posted Wednesday, April 14, 2004",
      "rating": 5,
      "text": "it's the RUSH album... no ordinary songs! Guitar, bass and drums are incredible! As hard rock as progressive! The guitar sound is unique and it takes most of the place without giving you the feeling that other instruments are not present enough!! The bass is at its best: complex and perfectly played! The drums are quite outstanding: lot of cymbals and variety. The keyboards are not too present to give again all the prog hard rock dimension of the album. Certainly the best of all time prog hard rock album. Recorded in England!! Listen it very loud because this album is good loud! The guitar takes all its power and presence when played very loud. Yes, we can say that \"Circumstances\" has a quintescent bit! \"La Villa Strangiato\" is probably the best hard rock prog jazz song ever made!! Once you started \"Cygnus X-5\", you cannot stop till the end!! \"The Trees\" is very addictive and accessible while being never simple!!EXTREMELY RECOMMENDED!"
    },
    {
      "reviewer": "daveconn",
      "date": "Posted Monday, May 3, 2004",
      "rating": 4,
      "text": "Given wisdom, given love, balance between the two is the answer. That's the message of \"Hemispheres\", an 18-minute Greek tragedy that, despite its allusion to \"Cygnus X-1\", is more of a followup to \"2112\". RUSH has always had trouble with the extended epic format; they write brilliant five- and six-minute songs, but they never seem to create enough music to support multi-part suites. The same themes are re-cast from part to part, disappearing in time only to reappear louder somewhere later. And that's my knock on \"Hemispheres\" -- it would have made a great six-minute song, but over eighteen minutes the music becomes too self-referential. Maybe the answer for RUSH is to follow the approach of other prog acts, and fuse different songs together as parts of a single epic, rather than stretching a single song to cover multiple parts. As a result, the album's balance shifts in favor of side two, all of it classic RUSH. \"Circumstances\" is the kind of punched-up pep talk that RUSH would re-visit on \"Freewill\", \"The Trees\" is the engaging offspring of \"The End\", and \"La Villa Strangiato\" might be the best instrumental workout of their career.\"Hemispheres\" is ultimately half of a great album, not the sustained brilliance of \"Permanent Waves\" or \"Moving Pictures\", but deservedly a staple in any balanced repast of RUSH."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Sunday, June 6, 2004",
      "rating": 5,
      "text": "Man, it's really hard to choose between, beneath and behind Farewell and Hemisphere. It's like the case of Revolver and Rubber Soul from the beloved Beatles. These sounds just the same and really, are part I and II of a real concept at first. Imagine the super duper album that could've been! A good addition to a more guitar-oriented taste. Rush scores great on this one. Once again, to me, Hemispheres is to Farewell to Kings what the Beatles 'Revolver' is to 'Rubber Soul': a logical follow-up. Therefore, the second part of Cygnus X-1 is more elaborated, atmospheric and keyboardish as Revolver was. Not better but differently approached. It's more epic. The sense of storytelling is stronger and more dramatic. A great battle of Gods is described all along the 18 minutes. In my opinion, with the song 2112, this is Rush's most progressive effort in career. Rush also defends pretty well the reputation they made about being a guitar-leaded band. A lot of pressure is resting on Lifeson's shoulders in Rush history. He drives the tune by himself in a majority of songs; less in the further years, but the band is lucky to have such a hard-working guitarist as Alex. The song 'Circumstances' expresses well the emotion-turmoil teenagers go through. The lyrics always ringed perfectly in my ears and shows a side of Peart we should see more often: fragileness. And I looove the little interlude in the middle of the song with the soft keyboard and the chimes. Inspired me a lot of reflexion and meditation. It only last like 20 seconds, but it's a highlight. What to say about the 'Trees' and 'La Villa Strangiato'? Classics in every ways. Gotta see the cardio that La Villa gives in concert. A real workout. Hemispheres is a very solid album that won't disappoint. It's a second chapter of a Farewell to Kings, but that puts the bar very high in rock history in uncanny performance and inspired lyricysm."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Tuesday, June 29, 2004",
      "rating": 4,
      "text": "In coincidence with the first time of Rush in Italy (next September 2004)- I like to remind you of the early progressive works by this important Canadian Band: albums like this \"Hemisphere\" create a sort of conciliation among their fans, despite of remarking a few uneven breaks-through inside (in comparison for example to their stunning work entitled \"Farewell to Kings\", which is exceptional from the beginning to the end), because the new wave of Rush in the nineties won't never be equal from the artistic point of view!! Nevertheless their evolution (or if you prefer their attempt to work in progress in the recent times) demonstrates the cleverness of these guys to \"re-invent\" themselves!! But coming back to this famous \"Hemisphere\", you can find original music features within,even though the second part of Cignus X1 (Book 2) is not equal to its predecessor.The best track of the album is the instrumental \"La Villa Strangiato\", which shows the technical side of the band, involved into such a great \"jazz\" excursion,with hints of symphonic music, in the \"power-trio format\" naturally, that is surprising every time!! Instead \"The trees\" is another jewel, an unforgettable song which is a must-have also during their performances live on stage!! The harmonic solutions are always incredible and, by forgetting the short 3 minutes song of \"Circumstances\" only, a return to their \"hard rock root\", the remaining tracks are well worth checking out!!"
    },
    {
      "reviewer": "James Lee",
      "date": "Posted Wednesday, June 30, 2004",
      "rating": 5,
      "text": "If they had taken this and \"A Farewell to Kings\" and made one double-album, it would be one of the classic 'must-haves' of any progressive collection...and neither one of the individual albums would suffer from being too short. Even on its own, \"Hemispheres\" is my personal choice for best RUSH album; the single best side-length piece they've done, plus the unbeatable instrumental \"La Villa Strangiato\". \"Circumstances\" is one of Peart's best 'philosphical musing' songs, alongside \"Freewill\", and it rocks pretty hard too. \"The Trees\" is the single best compact representative for their 70s sound; acoustic and lush one moment, heavy and hard the next, with impressive and tasteful synth additions. This is also the last chance we'll see 'classic' RUSH; the days of big AOR hits are coming, and with them comes the change in the band's outlook and method. This is RUSH at their hard progressive best, and despite achieving excellence in other directions, nothing they or anyone else does will ever quite match this album again."
    },
    {
      "reviewer": "Blacksword",
      "date": "Posted Thursday, September 2, 2004",
      "rating": 5,
      "text": "This classic follow up to 'A farewll to kings' shows Rush at their most prog. The 'Cygnus x-1' concept initiated on AFTK, is continued in fine form on Hemispheres. The 18 minute opener describes an epic, mythological battle between heart and mind. The music is as ever, brilliantly played, and Terry Browns productions is way ahead of its time. Hemispheres sounds a decade away from its predecessors, and is the real start of the period of musical excellence that earned Rush such respect for their musicianship. The second song 'Circumstances' has an unforgettable guitar riff, an almost festive middle section and some very personal lyrics about Neil Pearts experiences as an 18 year old wanabee pop star, trying to find his fortune in London, and being dissiliusioned and home sick. 'The Trees' is another piece of political cooment from a band not afraid to touch on these matters every now and then, but by no means ever presenting themselves as serious political or social commentators, like some bands do, albeit not prog bands.The album ends with the glorious 'La Villa Strangiato' A ten minute instrumental masterpice that moves through rock and jazz themes and pushes Lee, Lifeson & Peart to their musical limits. All three excell and take your breath away with their technical expertise, but also by the amount of feeling they invest in this one piece of music. A very important piece of music in the Rush catalogue! The overall feel of the album is one of classic prog rock; atmosphere and musical excellence."
    },
    {
      "reviewer": "Tony R",
      "date": "Posted Thursday, October 14, 2004",
      "rating": 5,
      "text": "The previous album AFTK had seen a change from all out metal mayhem on the Prog/Metal crossover album 2112 - in came more classical and acoustic guitars,keyboards and percussion toys, out went all-out riffing and the Led Zep junior sound.Hemispheres went one step further.For starters a smoother sound was evidenced,not so jarring as say the AFTK title track and the keyboards took a larger percentage of the whole sound.Another development was Lifeson's guitar signature,the arpeggiated chorus sound that was to become his trademark for the next few years. The title track:\"Hemispheres; Cygnus X-1 Book II\" follows on,albeit a mite clumsily,from \"Cygnus X-1\" on AFTK. Our hero is transported out the other side of the black hole into a world of warring gods; Dionysus and Apollo.Apollo is the god of all things cerebral, Dionysus prefers the hedonistic philosophy.Naturally the people of this world don't know which way to turn:too much work is boring, too much play leads to nothing getting done.Good old \"Cygnus\" as our hero becomes,points out that a balance between work and play is the best way to live. The piece has some great moments, especially the Prologue and after the \"battle\" section but ultimately seems dated and over-ambitious now (hence the 4stars).Side 2 (On the LP) kicks off with \"Circumstances\" a nice track which has enough Prog moments to elevate it, just, above album-filler status. Next up are 2 of the shining lights of the Rush firmament: \"The Trees\" and \"La Villa Strangiato\". \"The Trees\" is an allegory based on equality and jealousy but is absolutely sublime in its musicianship. Lifeson's guitar work is brilliant especially the extended musical sequence depicting hatchets,axe and saws. \"La Villa Strangiato\" is such a fan favourite that it is still played in full live today.I recall Geoff Barton in \"Sounds\" Music Paper saying that the track reminded him of the \"Sabre Dance\" and he didnt know if he liked it. Well it does have an air of that perennial classical favourite and more. The jazz-rock interplay between the band members is 1st class and of course the guitar solo is one of the greatest ever laid down, up there with Comfortably Numb in the all-time lists,in my opinion.Up to about 10 years ago I would have seen this as a 5 star rated album but time has not been kind to the title track and in the super league of prog Epics cant be considered in the same breath as Close To the Edge or the bands' own Xanadu. However every serious Prog fan should own a copy and it still makes me feel nostalgic for the 70's."
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Sunday, October 17, 2004",
      "rating": 5,
      "text": "In my humble opinion (which is coincident with that of many Rush loyal followers), \"Hemispheres\" establishes the finest hour of Lee, Lifeson and Peart as both performers and portrayers. Keeping their strong step on the road of hard rock driven symphonic prog that had been started in \"A Farewell to Kings\", \"Hemispheres\" finds this power trio exhibiting an air of finesse fluidly combined with their habitual metallic rock conviction. The namesake suite, which occupied the whole A-side in the vinyl format, is a perfect example of the maturity that by now Rush has achieved: it is more cohesive and its successive sections are more cleverly arranged in an integral way than the '2112' or 'Fountain of Lamneth' suites. The link between the 'Prelude' and the main motifs of 'Apollo' and 'Dionysus' arrives to an awesome climax in the martial-like tout-de- force of 'Armageddon'; the inscrutable spatial ambience in the first part of 'Cygnus' creates a dramatic ethereal intermission between the epic fire of the previous sections and the one that burns even more intensely in the climax that signals the last part of 'Cygnus'. A bang on the gong announces the closure of 'Cygnus' with powerful majesty, but there's still something left: a beautiful 1-minute acoustic ballad in which Lee gently proclaims the dream of a unity of both sides of the human soul (the rational and the emotional). Hard as it seems to be, the remaining repertoire is not to be overshadowed by this explosive epic. Well, 'Circumstances' actually is just a moderately complex rocky number, whose melodic lines are based on catchy guitar riffs: but what a good rock song it is, indeed. 'The Trees' is an attractive fable that still nowadays is part of the band's usual tracklist on stage. Its storyline, centered on the subject of unfair inequity being eventually replaced by forced equity, is conveniently reflected by the varied instrumentation, handled with a sense of fine musical vision: a classical guitar intro, the rockier sequences switching from 4/4 to 6/4 with total fluidity, a brief introspective interlude in which the Moog solo and the cowbells portray a forest in a state of \"calm before the storm\". each and every element in this song shouts out the greatness conveyed in it as a whole. And the same happens in the case of 'La Villa Strangiato', a powerful instrumental \"exercise in self-indulgence\" that is among the most emblematic pieces in Rush's entire career. All along its 12 sections displayed in a time span of 9 and a half minutes, the threesome expose their technical abilities and their combined versatility in order to create a multi-faceted journey through the realms of symph prog, hard rock, jazz rock, Arabic-like eerie ambiences (even a memorable although brief Flamenco intro!!). The guys seem to be at ease fulfilling such a demanding task, having fun while challenging the listener with all the overwhelming complexity that is contained in 'La Villa'. What a way to close down an album! In fact, what an album! Just like its predecessor, \"Hemispheres\" is a 5-star masterpiece."
    },
    {
      "reviewer": "Eetu Pellonpaa",
      "date": "Posted Friday, April 1, 2005",
      "rating": 4,
      "text": "An interesting album, a part of the bands classic trio of their 70's albums along with \"2112\" and \"A Farewell to Kings\". The album starts with an epic which continues the story of Cygnus X-1 from their previous album. It's a good track, but it has some boring moments in it too. The composition doesn't have as much elements as the band's first epics on the \"Caress of Steel\" had, but this time there could have been a bit more. Well, \"The Trees\" is a good short song with symbolic lyrics describing a class struggle (I think), and the closing number is a long instrumental song, a true gem in the whole band's discography! Really great guitar work from Alex on that one."
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Thursday, April 14, 2005",
      "rating": 5,
      "text": "And so another masterpiece was created by Rush. After their landmark A Farewell to Kings, it was going to be tough for Rush to top themselves. Well they did with this work of art. The title song is what made the album, with lyrics alluding to famous greeks (Dionysus and Apollo). I especially like the guitar tone that Alex uses on this album. Peart adds another level to his drumming with incredible hi-hat work on all of the tracks, especially the instrumental \"La Villa Strangiato\". Geddy's use of keyboards is more prevalent here than in AFTK, using it to add texture to each track. Overall, a 70's Rush fan could not ask for more. If you don't own it, I highly recommend purchasing this album."
    },
    {
      "reviewer": "memowakeman",
      "date": "Posted Monday, May 16, 2005",
      "rating": 5,
      "text": "A Classic album, and a 5 star album!I can tell you that a couple of years ago, when i was entering to the whole progressive world, Rush was a band that i didn�t like it at all,there could be so many reasons that i dont really remember, but it just happened, i listened to Tom Sawyer, or Presto which was my frst Rush album, and i didn�t enjoy it. Suddenly i heard so many good things about them and i got interested to obtain another of thei classic abums, so i experienced Permanent Waves and 2112, i liked both, and i still like them, but hat was strange because my perspective about the band changed immediately for some strange reason.At the point that one of that lucky days i was walking in the street, went to a place when a couple of guys were selling DVD�s and some albums, when suddenly while im was giving an eye to the movies, in somewhere i sae Rush - Hemispheres, then i asked for the price, it was 50 pesos ( a bit less than 4 dls) so i decided to buy it immediately, and what happened?Hemispheres is now my favorite Rush album, and is the album which makes me love and appreciate their music, and nowadays i can assure that Hemispheres is one of my gems in my collection.An album which contains only 4 songs and less than 40 minutes, but full of virtuosity, powerful music, great musicianship and skillful, oh i remember another thing, i hated Geddy-s voice, now ask me.The first song Cygnus X-1 is an epic which blends fantastic lyrics, with a hard - rock -progressive guitar sound, and the unique style of bassing playing that Geddy uses, of course, besides the virtuosity of Neil Peart, a song which show us how big is the band, with great changes during it, and as i said with great musiciaship.Circumstances probably is the less favorite of people, maybe because is the shortest song, and the hardest and rockish of them all, nice song, could be nice to sing, but i will put it at the same level at The Trees, which is a great song and a great classic.The track which takes the album easily is the last one, La Villa Strangiato, a complete masterpiece, greaaat song, and instrumental,starting with an acoustic guitar reminding me to some virtuoso of spanish guitar, then little by little is progressing to reach the peak when 3 people gather to create the best of them, believe me this song is simply amazing, guitar solos are incredible, the bass with it�s weird lines is great, and drumms as good as usual, i dont want to sound ridicolous, but this track deserves at least 4 of the 5 stars to an album.This great song, supported by the other 3, makes a masterpiece, and a masterpiece deserves 5 stars for sure!"
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Sunday, June 26, 2005",
      "rating": 4,
      "text": "I was introduced to RUSH when the brother of a friend invited me to his room and let me hear his harder-edged musical taste, from Led Zeppelin and Deep Purple to .. \"All the world's a stage\", the live 2 LP from Rush. I was stunned by the great skills of these 'hardrockers', especially the biting, often wah-wah drenched guitarsoli from Alex Lifeson and the long and alternating piece \"2112\". A few months later I read a review about the just released new Rush album \"A farewell to kings\", this couldn' t be true: acoustic guitars, synthesizers, shifting moods, lots of soli, splendid interplay, .. etc., etc.! Well, it was true and a year later I was on the annual Dutch Pinkpop Festival in Geleen to watch the first appearance from Rush in Europe because of the new \"Hemispheres\" album. I was a bit disappointed about this album because at some times my attention faded away during the long titletrack and the song \"Circumstances\" sounded a bit uninspired to me. But \"The trees\" is pivotal 'heavy progressive rock' and \"La villa strangiato\" belongs to their finest work, it's perhaps the best example of the 'mid-Rush sound' and their incredible skills and ideas. \"La villa strangiato\" starts with exciting flamenco guitar and lush Moog sounds, followed by a great build up with twanging electric guitar, drums and bass guitar, culminating in a very propulsive rhythm with magnificent interplay between the fiery electric guitar (with repetetive quick and catchy runs) and a powerful and adventurous rhythm-section. Then the music slows down and a howling guitar (with frequent use of a volume pedal) enters as a prelude to a long and splendid build up guitar solo, from sensitve to biting. The accompaniment of soft keyboards and a slowly heavier, very propulsive rhythm-section lift this part to an almost orgasmic feeling! Soft synthesizer sounds and catchy guitar runs are a forerunner of a mindblowing final part with again sensational interplay between the guitar, (Rickenbacker) bass and drums. The 'Canadian powerhouse' pushes themselves to their limits, what a captivating blend of energy and skills. \"La villa strangiato\" ends with a short, phaser-drenched bass run. In my opinion this stunning composition is the bridge to their masterpiece \"Moving pictures\". THE POWERSYMPHONIC ROCK HAS BORN!!"
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Saturday, August 13, 2005",
      "rating": 3,
      "text": "This album is good, but flawed.What went wrong with it? The answer is the epic (Cygnus X-I Book II). It has one good theme repeated over and over again, resulting in a dull overlong track with lack of ideas. The next tracks are good and redeems the album. Circumstances is a good rocker, The trees is a very well constructed semi-acoustic track, and The last track is an impressive instrumental workout with one of the best guitar solos from Alex, and one of the best instrumental songs I have heard. It is a shame Cinema and Marooned won a Grammy for instrumental song instead of this one. The band did not repeat this mistake again, and ceased writing mediocre epics in the future.1. Cygnus X-1 Book II (18:04) 4.5/10 2. Circumstances (3:40) 6.5/10 3. The trees (4:42) 7/10 4. La Villa Strangiato: (10:34) 9/10My Grade : C"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Friday, August 19, 2005",
      "rating": 4,
      "text": "This sixth studio album of Canadian RUSH is an excellent album that any prog rock fan should not miss. Musically, this album is a bit under the quality of previous album but I still consider that this is an excellent album. It starts off with an epic which represents part 2 - as a continuation of previous album \"A Farewell To Kings\". The key track of this album is, I would say, \"La Villa Strangiato\". This instrumental piece is a true masterpiece as it starts with a sort of calssical acoustic guitar outfit by Alex Lifeson. The music flows wonderfully into crescendo through gradually increase drum work and bass lines. It moves completely into a rocking style with medium-fast tempo music. The song combines a balanced high and low points in energetic way with great (and soft) drum work during quiet passages augmented with stunning guitar solo by Lifeson. WOW! Whenever I spin this CD I always repeat this track minimum three times to really satisfy my needs. It's so uplifting! Highly Recommended!Peace on earth and mercy mild - GW"
    },
    {
      "reviewer": "slipperman",
      "date": "Posted Monday, October 3, 2005",
      "rating": 5,
      "text": "Though I don't think the opening epic is perfect, I can't help but award this entire album 5 stars. Anything less would be criminal, as 'Hemispheres' represents Rush at the height of their complexity, the apex of their most progressive period. The sound is deep, thick, punchy and clear, and the playing is tremendous. The addition of keyboards in their music is now becoming a large part of its success, with Geddy mastering a variety of lush atmospheres with those wonderful-sounding '70s-era synths.As I said, sometimes I feel like \"Cygnus X-1 Book II: Hemispheres\" is as unnecessarily convoluted as the song title itself. Maybe it doesn't work on the whole as strongly as \"2112\" (which, c'mon admit it, is PERFECT). But it still takes us into a world like no other song. Each part is a joy to behold. My ears are always drawn to the drums, not only the playing but the recording, which helps underscore the immense talent Neil Peart possessed at this point. Not as dark as the first part, \"Cygnus X-1\", from 'A Farewell To Kings', this 2nd part of the story is more upbeat and crystalline. It's the next three songs that put this album into the realm of the 'masterpiece'...\"Circumstances\": without looking back and without dumbing down, Rush successfuly captures their heavy metal past, coming up with riff that's one of their best, big and bold, carrying with it both attitude and sublimeness. Wonderful tones and chords from Alex Lifeson, not to mention a bassline underneath the verse that must've made it near- impossible for even the great Geddy Lee to tackle in a live environment. Geddy's control of the high shrieked notes in the chorus will be two things to different people: unbearable to those that can't stand his voice, and for those of us who understand, it is GOD. (I recently saw a shirt that read \"Who died and made you Geddy Lee\". Works for me.)\"The Trees\" is a parable filled with clever lyrical symbolism, one of Peart's best bits of prose (even though he now hates it). Musically it is prime Rush, moving from the lilting nylon-string acoustic guitar melody toward a thing of massive construction. Despite it's relatively short 4:42, it carries the weight and drama of any 15+ minute epic.\"La Villa Strangiato\": 9-and-a-half minutes of Lee/Lifeson/Peart tearing it up (sans vocals) at the peak of their abilities. Every musical mood you can imagine is here in this wordless story, from the fanciful to the frightful, from the fantastic to the realistic. A wonder of instrumental dexterity and musical storytelling.As amazing as this album is, the two following it would be their ultimate masterworks. Some disagree, of course, but this string of Rush albums, from '2112' to 'Moving Pictures', is the reason why this band is one of the most respected prog bands on the planet and probably my favorite band of all time."
    },
    {
      "reviewer": "Marc Baum",
      "date": "Posted Thursday, March 30, 2006",
      "rating": 5,
      "text": "Many Rush fans will tell you that the 1970s were the band's best decade. After all, in just six short years, the Canadian trio had managed to release the best selling debut in Canadian history, two successful follow up albums and the monster smash that was '2112'. So how do you close out a decade as strong as this one? Simple; you release the masterpeice that is 'Hemispheres'.As usual, all three band members bring everything they've got to the table. Geddy Lee's voice soars above the crescendo of Neil Peart's masterful drumming, while his driving basslines provide a solid foundation for Alex Lifeson's awesome riffing and incredible solos. Try as hard as you might, you just won't find a single second on this disc that doesn't rear its head back and scream excellence.2112 fans were thrilled to see another epic opener, this time the sequel to Cygnus X-1 from 1977's 'A Farewell To Kings'. Clocking in at an impressive 18 minutes, the song manages to stay fresh throughout - it never gets old and it never gets boring. Musically, the band remains solid, as showcased by the wicked basslines found in \"Circumstances\" and the wonderful instrumental \"La Villa Strangiato\". Lyrically, Neil Peart is at his finest, from the political metaphor that comprises \"The Trees\" and the cohesive storyline found in \"Cygnus X-1 Book II: Hemispheres\".All in all, you will be hard pressed to find dissapointment within this album. From the moment you hit play to the second you inevitably start it up again, the album never fails to deliver. The only flaw this album has is its length - or more to the point, the lack thereof. However, it remains an excellent way to close out an even more excellent decade, 'Hemispheres' is a must-own album for not just any Rush fan, but anyone who even slightly apprieciates the progressive genre.Album rating: 10/10 points = 98 % on MPV scale = 5/5 starspoint-system: 0 - 3 points = 1 star / 3.5 - 5.5 points = 2 stars / 6 - 7 points = 3 stars / 7.5 - 8.5 points = 4 stars / 9 - 10 points = 5 stars"
    },
    {
      "reviewer": "Philo",
      "date": "Posted Tuesday, June 20, 2006",
      "rating": 1,
      "text": "The more I listen to post All The Worlds A Stage Rush, the more I realise how good the band were in their early period. After their first live album the band closed one door and opened a new one, but Rush also lost a characteristic edge that graced albums like Caress Of Steel and 2112 for all the naivete of those mid seventies albums, but at least those albums contained a substance. Albums of their time, sure, but much easier albums in terms of playability than Farewell To Kings, and especially this one, Hemispheres. There is an innocent wonderment lost as the band progressed, they really left behind all the nuances of the old Rush as they progressed, and it is an almost forced progression to my ears with this one. The music takes a back seat to the lyrical narratives of drummer Neil Peart's obsession with all things sci-fi, social and dumb. The music lacks a bite and take the lyrical context nowhere. Alex Lifeson's guitar always soared and took flight, but now he's rigid and dull, mainly hanging on full chord sweeps and concentrating on time signatures to the point that he, and the band, lose all sense of composition, making for an awkward use of space on many occasions. The music is incidental to Peart's lyrics, sung by Geddy Lee, as always, but lacking any depth to make them exciting and/or visual without getting (or gedding if you will) irritated by his incessant whine. In fact this whole album comes across as a banal affair on purpose, and it just pisses me off."
    },
    {
      "reviewer": "WaywardSon",
      "date": "Posted Tuesday, July 18, 2006",
      "rating": 5,
      "text": "This was the first Rush album I bought. I remember being amazed by the lyrics and the \"tightness\" of this band. \"Cygnus X1 Book 2\" is about the battle of the heart and mind, basically the history of the world all in one song! Wouldn�t it be great to have the heart and mind united in a single, perfect sphere? This is the longest song on the album at over eighteen minutes and it�s a classic! \"Circumstances\" also has some great lyrics, in fact the lyrics on this album are incredible. \"The Trees\" could be a song about war or even apartheid. At the end of the song the lyrics go \"And the trees are all kept equal..by hatchet, axe and saw\"\"La Villa Strangiato\" leaves one with no doubt that these are three master musicians. I used to have doubts about Alex Lifeson and always considered him to be the weakest link in the band, but after hearing him on this instrumental I realize just how very underrated he is as a guitarist.The only problem I have with this album is that it is just too short, it�s over in 37 minutes! This album is a masterpiece, period."
    },
    {
      "reviewer": "Man With Hat",
      "date": "Posted Sunday, July 23, 2006",
      "rating": 3,
      "text": "First off I must preface this review. I was intially put off Rush after I bought and listened to '2112' . I found very few elements that i liked about it. For whatever reason I tried again, downloading Cygnus X-1 off this website. It has become my favorite Rush track and has led to buy a few more of their albums. Anyway, I was recommended Hemispheres (after i couldn't find A Farewall To Kings). Perhaps I'm not the best person to review a Rush album, but nonetheless I am.Secondly, I always found Peart to be overrated. He is a great drummer, but he provides many few moments that \"blow me away\". But saying this, every member does a great job at their own instuments. Also, Lee's voice has never bothered me. So I must appauld him for another solid vocal performence. On to the songs.This album is dominated by Cygnus X-1 Book II. I like the intro, but I feel this track suffers what many epics do: The inability to hold that intensity or power that they start off having. Saying that, I find the ending very innapropiate for the song. However, I do have favorable things to say about this song. When the music is good, its great. I am also very fond of Lee's bass work. There are a few rememberable melodies as well, that helps boost my rating of this song. After this the album picks up for me. Circumstances is a nice rocking song, that i often find myself singing/humming days after playing. The Trees is another one of my favorite Rush songs. I find the lyrics funny (which, while perhaps odd, makes me approve of them much more). I also like the quiet little section in the middle with Peart playing the woodblocks. Another excellent song. Finally, La Villa Strangiato, ends the album on a positive note. The guitar intro, the lushness of the opening (and most of the song), the shifting moods, very good instrumentations, at least one solo from every member, and a nice cohesiveness make for a very good expeirience. A classic Rush song, from my understanding.All in all, this is a solid release. For all the bad i can find in it, I can usually find good to balance it out. Definitely one for Rush fans, and probably a good one to have for a general progressive collection. Based on that, I shall rate it 3.5 stars. Also I will add, I think this would make a good introduction to the band, as it gave me hope that I would find more good things from Rush. 3.5 stars."
    },
    {
      "reviewer": "Australian",
      "date": "Posted Saturday, July 29, 2006",
      "rating": 5,
      "text": "\"Hemispheres\" is the Rush masterpiece in my opinion, it is perhaps their most progressive album. The composition on Hemispheres are amazing and there is not one weak song on the album. The 18 minute epic \"Cygnus X-1 Book II\" is the best Rush song every written and it has a wonderful classic Rush sound. The Best part of the song is the second last section of the epic when Cygnus comes and fights Dionysus (or something like). It is the section of music Rush ever came up with. \"The Trees\" is the other major highlight, I love the idea of trees fighting for sun light. The end is very true \"And the trees are all kept equal by hatchet, axe, and saw\" \"Circumstances\" Isn't as memorable as the rest but still carries an authentic Rush sound. \"La Villa Strangiato\" features a well known theme which I have heard countless times, I was pleasantly surprised when I discovered that it came from \"Hemispheres.\" \"La Villa Strangiato\" is a spectacular instrumental! The Instrumentation on this album is of a godly quality, Lifeson, Peart and Lee are masters of their instruments. The Lyrics are also at their best here and I particularly like \"The Trees lyrics.\"1. Cygnus X-1 Book II (5/5) 2. Circumstances (4/5) 3. The trees (5/5) 4. La Villa Strangiato: (4/5) Total = 18 divided by 4 (number of songs) 4,5 = 5 stars Essential: a masterpiece of progressive music\"Hemispheres\" is a masterpiece of progressive music, it is a very essential album and although it isn't as highly rated as 'Moving Pictures' I believe that it is better. I highly recommend this album to all prog fans, especially to those who enjoy louder prog."
    },
    {
      "reviewer": "richardh",
      "date": "Posted Wednesday, October 18, 2006",
      "rating": 4,
      "text": "Sorry but I'm unable to share my fellow Rush fans enthusiasm for this album.It does seem to me that the formula that resulted in the excellent Farewell to Kings was beginning to go a bit stale at this point.Cignus X-1 Book II as an epic doesn't hold a candle to the brilliant Xanadu or even 2112.Epic wise Rush had already shot their bolt in my view.Circumstances is also unremarkable.Admittedly the album picks up with a couple of Rush classics 'The Trees' which has very clever lyrics and arguably their strongest instrumental 'La Villa Strangiato'.However as I am not impressed Cignus X-1 Book II this album has to be marked down.Much better things were ahead."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Monday, October 23, 2006",
      "rating": 3,
      "text": "I've never seemed to find the enthusiasm that so many others share for this album. To me much of it seems forced and awkward. As much as I've never really cared for Cygnus-I, I've cared even less for Cygnus-2. Their are a few really neat sections, one's that are no doubt classic Rush moments, however, for the majority of the work I am lulled into a state of lukewarm indifference.A lot of this can be easily compared to the sound found on A Farewell to Kings, as it is very similar sounding. The biggest surprise for me was the instrumental 'La Villa Strangiato', which is my favorite moment on the record. Starting with a flamenco like spanish guitar sound, it moves into an upbeat Rush riff with that signature tone. There are a ton of riffs in the middle, enough to shake a stick at.Overall I've never been too impressed with this record that the legions of Rush fans will claim to you as the greatest record in the history of man. I like my copy of A Farewell to Kings much more, and will continue to ride the wings of Xanadu when I'm looking to rock out to Rush."
    },
    {
      "reviewer": "The T",
      "date": "Posted Sunday, October 29, 2006",
      "rating": 4,
      "text": "A short review of a short album: Rush's Hemispheres is the one I like the most from the 70's set of records by the canadians (I for one prefer some of their 80's works) and probably the most progressive they had released up to that time in history.If I have a complain about most ALL Rush's works in the 70's is their LENGTH: they are way too short. Yes, I know there were no cd's yet and bands had to deal with vinyl so they didn't have that big of a room to venture into gigantic projects (I wonder what would've become of The Flower Kings if they were around those days), but, let's be honest: Yes, Genesis, Crimson, Tull, VDGG, GG, all of them constantly delivered between 39 and 45 minutes of music, while the canadians rockers didn't get past 35! (actually, two minutes over that mark in this album). Off course, that's not a major MUSICAL complain, for a masterpiece is a masterpiece even if it's only 25 minutes long, or crap is crap even if it lasts 80 minutes.But there's more to the point I'm making: in this particular album, we have one great epic clocking at about 18 minutes, one fantastic instrumental closing the record at almost 10 minutes, and in between we have two short, FILLER songs not longer than 4 each. This is my major problem with 70's Rush: the songs that were not the main focus of each album (2112 in 2112, Xanadu and CygnusX-1 in Farewell to Kings, the first and last ones in this one) were usually rather simple, filler songs. They had their moments (Bangkok, Closer to the heart), but most of the time they just ocuppy the room available in the vynil after the inclusion of the main tracks. Rush's short tracks from the 70's feel a little bit RUSHed (couldn't resist, apologies for lameness).Cygnus X-1 Book II (8/10), a great track that completes the narrative started in the previous album. It begins with a atmospheric prelude that grows into full rock. I have two minor objections to this track: one, at times it's not diverse enough, some parts tend to reappear more than needed, and even with that in mind, the track just doesn't click as a whole musical entity. Two, I don't like the long pause between the prelude and the remainder of the epic: it takes away from the \"epic\" feeling and makes it look like two separate songs.Circumstances (7/10), an almost forgettable track, enjoyable but forgettable. Pure rock, almost no prog, with that poor sound that Lifeson's guitar had during the 70's. (He played great but the instrument's sound was rather thin and weak).Trees (7/10), another short unimportant song that is saved by the lyrics. Yes, in this case, the funny and ironic concept of the battle among trees (canadians and americans that take too much light, do the math) is masterfully crafted by Rush's great drummer and amazing lyricist: Neil Peart.La Villa Stragiato (10/10), THE track of the album, best Rush's instrumental and, even more so than the first epic track, the most progressive statement in Hemispheres. Geddy Lee's bass makes up for the absence of his voice in such a way that at moments we feel the man should focus only in the bass playing, for he's fantastic. Neil peart amazes everybody as usual and Lifeson performs at the regular outstanding level even if his guitar sounds like an electric saw. This \"song\" (again, is a piece) is coherent, it has variety but unity at the same time, amazing performances, starts acoustic, there's an actual crescendo (growth in volume level) till the main, fluctuating, zig-zaging guitar riff makes his entrance. We have a middle section with some almost jazz sounding bass lines and Peart using the most out of his hi-hat for effect and bright. Great track.So, I would say this is a great album but, again, like every Rush album from the 70's, it ends almost before it starts. It's my opinion that Rush, in the 80's, learned how to write great, really amazing short songs, starting with Moving Pictures (maybe even with Permanent Waves), but, off course, sadly, they forgot to include the epics and long tracks that made them one of the progressive giants at the second half of the 70's, a time when, vice versa, they just couldn't get their short tracks to be as good as the longer ones.Recommended for: Everybody. Every Rush lover, every 70's prog lover, every prog-rock lover.Not recommended for: Those who can take only 75+ minute albums, no shorter. Elephantism was not one of Rush's characteristics."
    },
    {
      "reviewer": "obiter",
      "date": "Posted Saturday, December 30, 2006",
      "rating": 5,
      "text": "A superb offerring from one of prog's greatest bands.The album cover sets put the concept simply and clearly: logic & reason (the business man) stands on one heisphere of the brain while the naked man (emotion love etc) stands on the other. The answer we are told, after listening to the forst side, is in balance: Cygnus. Well there you go: not a philosophical revelation.The second side is quite spectacular. Plus ca change (Circumstances) is an interstiing song with astute lyrics: there is nothing new under the sun. The Trees is a classic for two reasons: first, it's a great song with poignant humorous lyrics and, second, it allows budding young guitarists to learn a relatively straightforward tune to play on the acoustic which willl generally impress the listeners who do not play ... a la Stariway to Heaven.The side eands with La Villa Strangiato which remains my favourite Rush track: Lifeson and Peart are peerless, Lee is unique. This is a piece of music which must be heard: take this or exit stage left. Beautiful changes of mood and timing combine to produce a masterpiece.Essential."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Tuesday, February 6, 2007",
      "rating": 5,
      "text": "RUSH are so good with these side long suites, I wish they had done more of them. This one is their third and maybe their best. The style of \"Cygnus X-1 Book II Hemispheres\" is similar to 2112, but this one seems to flow better and is less extreme in the contrasts of the light and heavy passages. This long song is a continuation of the last song on their previous record \"A Farewell To Kings\" where our subject has gone into the black hole. In this song he seems to be a witness of a battle of the gods as they decide how the people of earth should live. The argument is between Apollo and Dionysns, wisdom verses love, the mind verses the heart. Until Cygnus comes into the argument and suggests a balance between the two. I have to tell you that this record was a soundtrack for my last year of highschool that I didn't quite finish. I was a glassy red-eyed kid who was into music (RUSH) and having fun. So this music means more to me than I can explain with words. And this long song is my favourite from this album. It makes me feel like I do when I listen to \"Natural Science\" or \"Jacob's Ladder\". It goes beyond being just guitar, drums, vocals, bass and a song to something that is a part of me and something I treasure.The \"Prelude\" for some reason conveys sadness to me, but not in a bad way. Geddy's vocals are at their best and the guitar and the melody are just amazing.The song is full of mood shifts and tempo changes as one would imagine with an 18 minute epic. From scorching guitar and Geddy screaming to a spacey, dreamy soundscape with synths, strummed guitar and gentle vocals. I haven't mentioned Neil but he's simply the best at what he does. I never tire of this song.\"Circumstances\" is a flat out rocker with some wicked bass lines and Geddy screaming in two different languages. \"The Trees\" opens with acoustic guitar and the birds are singing but \"There is trouble in the forest...\" and this pastoral soundscape doesn't stay that way for long. \"La Villa Strangiato\" is my favourite instrumental of all time ! Yes it's self indulgence but who doesn't like to indulge themselves once and a while, especially if this is the result ! Pure genius. Complex yet so accessible.In the liner notes they thank their kid musical brothers MAX WEBSTER as well as UFO. They have also mentioned in interviews that this was by far the hardest album for them to make in part because it was so complex."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Wednesday, March 28, 2007",
      "rating": 4,
      "text": "Building on the epic foundation created by \"2112\" and expanded on by \"Farewell...\", \"Hemispheres\" goes for broke and creates what is easily the band's most sweeping and well-composed extended song: \"Cygnus X-1 Book II\". More so than most of their other early, \"out-there\" songs, this epic is truly fantastical, with Peart's lyrics telling of the eternal struggle between mankind's passions and reason. Nietzschean parallels aside, the lyrics are usually somewhat silly sounding; however, somehow Geddy can make singing about Olympian gods very cool.More so than every before, \"Hemispheres\" sees the band really pushing their virtuosity and songwriting to its limits; the extended epic is about as symphonic as rock can get (without a keyboard player), while the excellent \"La Villa Strangiato\" is a 10-minute showcase of the group's masterful playing (even better live!). Fan-favorite \"Trees\" is just as good, but \"Circumstances\" slips back into their old style and comes across as a little too shrieky-- especially when compared to Geddy's more restrained vocals on the rest of the album.A few minor complaints aside, \"Hemispheres\" remains the peak of Rush's epic output, but is less accessible than \"Farewell...\". All of the songs hold up to repeated listening and are a tremendous example of the bands talent in their early years.Songwriting: 4 Instrumental Performances: 4 Lyrics/Vocals: 4 Style/Emotion/Replay: 4"
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Sunday, June 10, 2007",
      "rating": 4,
      "text": "\"With the heart and mind united in a single perfect sphere.\"In my teen years I would have awarded Hemispheres 5-stars along with most of the Rush and Zeppelin albums I was obsessed with then. Since then I've heard so many hundreds of other great bands and musicians that I am a little less captive to the bands that once owned my soul!\"Cygnus 2\" is certainly a respectable \"epic\" and I admire the spirit both musically and lyrically that they were reaching for. I definitely prefer this to 2112 as epics go. \"Circumstances\" is a smokin' Rush classic in the vein of \"Anthem,\" and it just plain kicks. It's all about the tight riff and I still love it. Perfect.\"The Trees\" is my least favorite offering here. I find it pretty tiring to listen to now. \"La Villa\" may be an \"exercise in self-indulgence\" as the band claims but it is an enjoyable one. Alex burns it up throughout this track and the song reminds me of Xanadu in the way it builds and constructs with drama. One of Rush's very best moments. Essential to Rush fans and recommended for 70s hard rock fans and guitar lovers."
    },
    {
      "reviewer": "1800iareyay",
      "date": "Posted Thursday, June 28, 2007",
      "rating": 5,
      "text": "Hemispheres shows Rush at the apex of their prog side. From this point on, the band favored shorter, yet no less complex, songs rather than epics. This is also the last album to feature Peart's penchant for mythological and sci-fi lyrics. This is Rush's most guitar-driven studio album; Lifeson dazzles everywhere. The title track continues the space epic of Cygnus X-1 by fusing it with Greek mythology. Every member of the band is terrific with great riffs from Geddy and Alex, not to mention Peart's incomparable drumming. The lyrics serve as a metaphor for the struggle of logic and emotion, reflected in the artwork. If this is to be Rush's last sidelong epic, what a send-off it is.The second side hints at where the band will go from here. \"Circumstances\" deals with the Peart's initial failure to make it in the music business before he joined Rush. It features some great high vocals from Geddy and is the first song to truly hint at Peart's ability to pen relevant lyrics. \"The Trees\" is a metaphor for socialism, where the maples argue with the oaks for getting all of the shade. Eventually, all trees are kept equal because they are cut down to size. Lifeson's guitar here is beautiful. The album closes with \"La Villa Strangiato,\" a mind-blowing instrumental that has both Peart's and Lifeson's best performances. Lee's performance is second only to YYZ, which had yet to be written. This song is nine minutes of impossibly complex drumming, heavy riffs, great basslines, and beautiful solos. This is my second favorite Rush track (next to 2112).This album has the honor of being the only Rush album with absolutely no filler. It is a watershed for Rush, and many fans stopped listening after this, as the band began to change. That's a shame, beacuse some of their best work had yet to come.Grade: A"
    },
    {
      "reviewer": "The Pessimist",
      "date": "Posted Wednesday, August 1, 2007",
      "rating": 5,
      "text": "Now this is something. Consisting of only 4 tracks, each of them being equally as superb, this is Rush's best album by far. All of the songs could count as being my favourite Rush songs, being all works of genius, and the title track especially being 18 minutes of contrasting emotion, great musicianship and memorable melodies. Circumstances is a top song also, giving out the peculiar time signatures Rush have been renowned for the past years, a very energetic song. The Trees is still a classic rock song to this day, containing excellent guitaring from the underrated mastery of Alex Lifeson. The final track is the best instrumental they have ever written in the 30 year period they have been around, La Villa Strangiato. Some typical prog at the beginning, beautiful Latin rock in the middle section and some fantastic jazz work at the climax makes this a worthy classic in prog rock history. Top marks for Hemispheres."
    },
    {
      "reviewer": "Andrea Cortese",
      "date": "Posted Wednesday, August 1, 2007",
      "rating": 3,
      "text": "This is a very good record but not a real favourite of mine. That's because the whole first side seems somehow pointless. Ambitious and excellently performed, I admit it. The main section is really exciting but repeated over and over. I presume the material wasn't enought to make an extended track of over 18,00 minutes. Very good, nothing to say. Not the masterpiece that many said, though.I rather prefer the second side, especially for the fantastic instrumental closer \"La Villa Strangiato\" which is the real classic here with its memorable flamenco-like acoustic guitar introduction. Great work on guitar and many bass's wonderful performances. 4.5 stars from me on this one. Fantastic also the darker middle part with atmospheric keyboards and then explosive bass-drums-guitar fast interplay.Other short tracks on side b deserve a special mention: \"Circumstances\" with some extended vocals by Geddy Lee and the more common \"The Trees\".Very good (3.5).But I prefer Moving Pictures. Sorry Raffa, I know the risk of such an opinion ;o)"
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Tuesday, August 21, 2007",
      "rating": 5,
      "text": "A cerebral album of the cerebellum!While prog was on it's dying breath in 1978 Rush seemed to have only started their classic era. With punk taking over it seemed only natural that the surviving prog bands would have to hit hard. Enter Rush's Hemispheres, a hard hitting album that's still as prog as they come, yet still lets the heads bang.The album consists of four songs, each one of them a construct of grandeur. HEMISPHERE'S (or CYGNUS X-1 BOOK II, whichever name you like better) starts out the fray, continuing on from the coda track from \"Farewell to Kings\". However, while the first part to this song was especially heavy and sreamy, part II is a bit more midpaced, allowing more storytelling. The track, though avant gard, refers to a battle between the two sides of the brain, portrayed by the gods Apollo and Dionysus, and their followers. Each side gets its ups and downs until the end when the main character makes his way through the bacl hole of Cygnus X-1 and stops the warring gods with a plea, making him Cygnus, god of balance. All in all the track is an incredable combination of songwritting and instumentation, and showcases each member's ability to it's finest. An essential prog track.The rest of the album consists of shorter songs until we hit the coda. CIRCUMSTANCES and THE TREES are both great tracks, both very heavy in their approach, and the latter of which uses more avant gard storytelling. Soon we hit the next great standout on the album, the 9-minute instumental LA VILLA STRANGIATO, which starts out with a quiet guitar and explodes into a full blown epic journey. It's very hard to describe with words, as a matter of fact.When it comes right down to it this is an essential band at their essential moment in life, and they have given us a masterpiece deserving no less than 5 stars."
    },
    {
      "reviewer": "Dim",
      "date": "Posted Tuesday, September 11, 2007",
      "rating": 4,
      "text": "Probablyt the pinnacle of the progressive rock period of Rush. This is definately their boldest step towards artisticness the power trio got too, and it came out looking very good. With a more clean and structured sound than a Farewell to kings, and a less mainstream edge than permanent waves, this album is a huge standout in Rush history. At first I didnt know what to expect from the album, my dads friend and I were talking about music one day, and I said I was a big fan of Rush, he tells me that he's seen them 15 times and has every album! So a week later he lets me borrow A farewell to kings, Permanent waves, counterparts, and Hemispheres. Whwn I popped in the latter I was shocked how clean and toned Alex' guitar sounded on the first chord on the first song, which was a major advancement from the first electric riff on A farewell to kings. Anyways, let me proceed with the songs...If yuu are in anyway a prog fan, than you are innitially excited to see a big twenty minuete song like this one come up, and for good reason. Hemispherers is such a huge improvement from the other twenty minueter 2112, with an actual structur and and flow, not a bunch of songs put together to make one big long one. Anyways Geddy is the one who really stands out to me for this song, excellent basslines, and good clean vocals easily make him stand out far more than the sloppy Alex and the overdone Peart. The lyrics to this song are very innovative, with Greek mythology and talk of the space time continuum. It's about a learderless world that is being fought over by the Gods, but at the end when the world is in utter choas, a lonely immortal, Cygnus, silentl cries for it to stop... so it does. The rest of the songs are all great, except circumstances, and the instrumental is epic in everyway. The bad song circumstances reminds me of freewill, limelight, orcinderella man, boring, poppy, and sounds like something you would hear in a disney showtune. The singal of the album, the tree's is excellent, easily Rush's most artistic radio song with some great all around bandhood and fun lyrics. La villa strangiato is great, one of Lifesons most shining moments in hai otherwise overated style of guitar playing (pentatonic), but whats so great about this piece is that the group works together so effetiantly and precisely they make the sudden changes and awkward tiem changes seem really easy.I will admit that the music is not Rush's best, Peart is a bit more conserved this time, and I feel that his drums did not stand out in the mix like it should have. I also feel that Geddy did not stretch to the limits of his voice like how he did in cygnus one. I am however impressed with Alex' guitar work, which is a lot less pompous than in previous albums, and his solo during the first part of the opener is one of his best next to natural science. I believe Peart could have done a better job with the lyrics on circumstances COMPLETELY! Overall...4****"
    },
    {
      "reviewer": "Tapfret",
      "date": "Posted Wednesday, October 3, 2007",
      "rating": 2,
      "text": "Sigh...I was quite a Rush fan after 'Moving Pictures' came out. I decided to get all of their previous albums. I was amazed, aroused and astonished by each one I bought...except this one.The disappointment starts immediately with the title track. What is supposed to be a sequel to Cygnus X-1 is basically an 15 minute very uninspired and lackluster verses and chorus interspersed with the least interesting parts of x-1, and 3 minutes of the good parts. It basically made the first half of the album completely useless. The second track, 'Circumstances' is almost as boring. The album finally starts to redeem itself with 'The Trees'. A quaint little metaphor on human nature told ...um...vegepromorphicly?...is that a word? And the final track, 'La Villa Strangiato' saves Hemispheres from being relegated to one star. This is in my opinion, Rush's finest instrumental.I would probably have given Hemispheres 3 stars for the last 2 songs had it not been for the fact that I had already heard those 2 tracks played with superior energy on 'Exit...Stage Left\". Therefore 2.3 stars...and I am rounding down."
    },
    {
      "reviewer": "FruMp",
      "date": "Posted Wednesday, October 17, 2007",
      "rating": 5,
      "text": "The most progressive and arguably best effort from the Canadian prog power trio.Hemispheres takes up where the previous stellar album A Farewell to Kings left off with the band's sound a great mix of influences at this point, the hard rock sound of their past is only briefly touched upon in 'circumstances', their lighter folk sound that was quite evident in A Farewell to Kings is relived in the trees and both are great little songs but what this album is about is the epics, 2 of the best songs of the bands career.The title track is a direct continuation of the final song of the previous album (if only by name - Cygnus X-1 book II) and is in my opinion the best song of their 30 odd year career, very progressive, musically very strong and varied in dynamics and emotion. One of the things that clicked with me about this song that made me realise the amount of genius that went into creating it is that each of the riffs in the introduction before the vocals come in is revisited and pretty much transformed into it's own part of the song, it's like a synopsis of the song in the first 2 minutes. Something of note here is the lyrics, in the past the lyrics on RUSH epics had been to put it bluntly cheesy, but here the stories of solar federations, black-holes and magic are replaced with a mature tale revolving around Greek myths. There really isn't a weak moment in the 18 odd minute track, if anything it only gets better as it goes along, ending triumphantly then passing on with a nice little acoustic outro.La Villa Strangiato is something of a departure from anything RUSH had done up to this point stylistically, being a 10 minute long big band inspired instrumental and all and it certainly paid off in spades. Lifeson in particular shows his skills and comes to the fore which is quite a feat considering his wingmen are 2 of the greatest and most influential musicians of contemporary music. The solos here are a particular highlight, very dynamic and with great emotional impact and the swing riff that comes along during the latter half of the song is a masterstroke.Hemispheres is an essential album for any prog fan, my only problem with it is that there aren't more songs on it."
    },
    {
      "reviewer": "Atavachron",
      "date": "Posted Wednesday, October 31, 2007",
      "rating": 5,
      "text": "There is something special about this record. Something strange and wonderful, like in an Arthur C. Clarke novel. And it wasn't just because Rush had finally found that ideal balance of hard-hitting power and disturbingly good musicianship, showing at last a truly distinct identity among modern rock bands. No, it was something else, and it gave this recording a flavor unlike any of their other releases. The music seems to arrive straight from the cosmos onto the playing fields of paradise, delivered by deities for our pleasure and sparkling with incredibly bright electrical power.A backward cymbal sweeps us into the enormous 'Cygnus X-1 Book ll Hemispheres', an ambitious track even for 1978 with six parts, bold and high-minded arranging, symphonic flair and flawless execution. Lee and Lifeson's compositons are nothing short of inspired, especially when one keeps in mind Rush were, at heart, a hard rock band. And Neil Peart, a brilliant drummer who inexplicably writes all the lyrics, carries this album with his joy and enthusiasm. This title track was the band at the peak of inventive and physical energy, and set a standard for excellence in guitar-driven progressive rock that few could even consider matching. The piece ends with the moving simplicity of 'Cygnus, Bringer of Balance'. Alex Lifeson's power chords break into 'Circumstances', Peart's playing fantastic and Geddy Lee shrieking in his best classic Rush manner, and I wouldn't have it any other way. The ethical axis here is 'The Trees', a stunning personification of nature that oozes troubled symbolism. A great cut. The record concludes with 'La Villa Strangiato', a fan favorite... and who can blame their loyal throngs, it is a thrilling nine-minute instrumental that may be the single finest moment in the heavy progressive rock theater.The remaster sounds great but the original production was so good it barely matters... and the original poster (a bit smaller of course) is included. Sweet."
    },
    {
      "reviewer": "progrules",
      "date": "Posted Thursday, November 1, 2007",
      "rating": 4,
      "text": "In the long long history of this band there is always a number one album to be found and that his to be this one. Obviously many people seem to think so, so it's not always a matter of taste, sometimes it's probably a matter of facts. When I got to know Rush's albums in the eighties I learned to understand the natural maturing of the band, their debut was a little heavy and somewhat sloppy, then they became real progressive, symphonic really, but they were also growing in that department. This culminated in their ultimate masterpiece: Hemispheres. Funny enough it appeared to be their peak because after this I think they went backwards in quality but of course it's all a personal opinion.This album starts with a sort of follow up after their previous album Farewell to Kings. On that one there was the track: Cygnus X-1, here we find the Cygnus X-1, book II (Hemispheres). I must admit I haven't played this album for quite a while now. I do remember that once this was to me the best song ever. It isn't any more by a long way because there has come up so much more the last 30 years. But still, it was a proof how much impact it made on me. A real symphonical composition with a heavy prog style added. A highly original song with a tremendoes finish. It blew me away in those days and still is great of course. Another brilliant song is of course Villa Strangiato, the song they conquered Holland with in 1979 on a festival in Limburg. They played it live, Geddy Lee doing all kinds of things with his feet as goes the story. Anyway a great instrumental track with unbelievable guitar playing by Alex Lifeson, showing his great skills here. Even the two short songs are very nice. So actually I should give this 5 stars but I intended to give these only to the absolute masterpieces and this album isn't so significant to me as it ever was. So I give it 4 (4.5 really)"
    },
    {
      "reviewer": "Nightfly",
      "date": "Posted Saturday, November 10, 2007",
      "rating": 5,
      "text": "Beaten to the post as my favourite Rush album by only A Farewell to Kings. Hemispheres was the follow up to that release and is most notable for the side long (on the original vinyl version) continuation of Cygnus X-1 and probably their most complex instrumental piece, La Villa Strangiatto.Getting back to Cygnus X-1 Book II this 18 minute piece to my ears is one of the bands finest moments, heavy Rock based Prog of the highest order. Strong melodies and fantastic musicianship throughout which starts with a great instrumental workout before the Vocals come in. If I have a complaint and I hasten to add it's just a minor quibble, it's that for the most part the music of this track is one paced apart from a lull just after the halfway mark for part V Cygnus, Bringer of Balance and the final acoustic section of part VI, The Sphere, A Kind of Dream. Alex Lifeson plays an excellent guitar solo here and on a track of such length it would have worked well to have fitted another one in earlier on but I guess you can't have everything.What makes Hemispheres so good though is that the other 3 tracks are equally as good as Cygnus X-1 Book II. Circumstances and The Trees are both fairly short tracks but Rush prove with admirable ease that you don't need necessarily write an epic to get lots of tempo/ time changes going on.Finally we come to perhaps their most celebrated (and my favourite) instrumental, La Villa Strangiatto. The band must have worked really hard to write and play this masterpiece. An acoustic intro gives way to the main riff and from there goes off at many tangents to great effect. All the band play superbly here but special mention must go to Lifeson for his stunning guitar playing.Overall then, another classic Rush album that can sit up there with the best Progressive Rock by themselves or indeed any other band."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Wednesday, April 9, 2008",
      "rating": 3,
      "text": "'Hemispheres' continues RUSH's mid-career dalliance with progressive rock. Like its two predecessors, this album is frustratingly uneven, though in the reverse to '2112': here, the side-long epic is overly repetitive and rather poor, while the side of shorter songs is excellent, with the closing instrumental 'La Villa Strangiato' reminding us what RUSH can be when they get it right.In my view there's an excellent 5-star album's worth of material to be culled from '2112', 'AFTK' and this album. There are too many low spots for any RUSH album to receive the ultimate accolade, but they do deserve a listen and warrant a place among prog's greats, albeit at a second-tier level. If that sounds patronising to RUSH fans I apologise, but I feel that only the absence of viable alternatives in the late 70s propelled this band to the attention of lovers of progressive music."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Thursday, April 24, 2008",
      "rating": 4,
      "text": "I almost feel this is the reverse 2112 in the sense that the second side of shorter songs is far superior than the epic. Rush's ventures into progressive rock have really helped their 4-minute rock song writing as ''The Trees'' and ''Circumstances'' have enough punch to knock the listener out, yet develop well in their short lengths. And ''La Villa Strangiato'' has to be one of their most ambitious acheivements; a lengthy instrumental that goes through a few twists and turns, yet keeps itself in check compositionally. It is not a solo showcasing excepting a few parts here and there.The problem herein lies the beefy ''Cygnus X-1 Book II'' thingy. The ''Prelude'' section is another one on the album where the music is spectacular, but beyond that, not much happens. The development of the epic is poorer than that of ''2112''. In ''2112'', themes from the ''Overture'' are reused later in the epic, but are done in a way that makes the theme sound fresh. Here, most of the music is copy-paste from the ''Prelude'' with little deviation, other than boring synth stuff and ''Cygnus X-1 Book I'' leftovers. The Greek mythology lyrics sound pretty cliche. We still have the classic Rush sound here though, at that's what matters the most for prog fans."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Monday, June 23, 2008",
      "rating": 4,
      "text": "\"Hemispheres\"is the 6th full-length studio album by Canadian progressive rock actRush. The album was released throughMercury Records(US/Europe)/Anthem Records(Canada) in October 1978. It�s the successor to\"A Farewell to Kings\"from 1977.Rushcompleted their 9 months long tour in support of\"A Farewell to Kings (1977)\"in May 1978, and after a very short break, entered Rockfield Studios in Wales in June 1978 with producerTerry Brown, to begin work on material for\"Hemispheres\". The band entered the studio with no pre-written material and worked tirelessly to write and record throughout June and July 1978, after which they were finally allowed some time off from recording and touring.Stylistically the material on\"Hemispheres\"continue the progressive rock style of the predecessor with some natural development of style and sophistication.\"Hemispheres\"features four tracks. The 18 minutes long\"Cygnus X-1, Book II: Hemispheres\"filled side 1 of the original vinyl version of the album, while the two shorter rockers\"Circumstances\"and\"The Trees\"filled side 2 along with the 9 minutes long instrumental album closer\"La Villa Strangiato\".\"Hemispheres\"is a well produced affair and it�s mostly not audible that the band were rushed into the studio with next to no written ideas for songs. But on the other hand neither\"Circumstances\"nor\"The Trees\"are the most remarkable tracks in the band�s discography, so maybe the songwriting was rushed just a little bit. The highlights of the album are definitely the long epic i>\"Cygnus X-1, Book II: Hemispheres\"and the playful instrumental\"La Villa Strangiato\". Even those two tracks could also have featured a more fluent structure, as they are both obviously created using many shorter compositions/pieces of music. I know that�s howRushalso wrote earlier long epics like\"2112\"and\"Cygnus X-1 Book I: The Voyage\", but here it just seems more pronounced.With that minor complaint out of the way,\"Hemispheres\"is overall another high quality progressive rock release byRush, and a natural successor to\"A Farewell to Kings (1977)\".Rushare incredibly well playing and lead vocalist/bassistGeddy Leereaches helium heights with his voice here like he would never do again.\"Hemispheres\"isRushmost progressive hour, and after this album they would tone down the progressive playing style a bit and focus on a more subtle (or at least less focused on technical playing) progressive rock style (with exceptions). A 4 star (80%) rating is deserved."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Sunday, July 20, 2008",
      "rating": 2,
      "text": "Review 61, Hemispheres, Rush, 1978Hemispheres is rather a mixed album for me. On the one hand, we have a couple of standout moments, and a fairly light-hearted and strong second side, on the other, we have some of the most funny-spot-wrenchingly-bad lyrical content I've seen since First Aid's Nostradamus (released around the same time, coincidentally). Additionally, Cygnus X-I Book 2 is not really a sequel per se, and certainly isn't consistently powerful and interesting like the first 'book'. Even worse, it actually damages the mystique of that incredible piece of music. There is some stuff here that is seriously interesting progressive rock, but not nearly enough to merit the 'essential' tag.Hemispheres (AKA. Who shot Cygnus X-I?... book 2) takes up the whole first side of the album. It's a very mixed piece, in my opinion, simultaneously containing some flashes of brilliance and some of pure irritation. A rather grandiose overture, which I could conceivably see tagging onto the end of Cygnus X-I book 1, leads up to a basically complete instrumental rendition of the first couple of verses. Of some interest is Alex Lifeson's odd tone and very soft guitar sound. Geddy Lee is on good form throughout this overture.The vocals open accompanied by some stabbing Rickenbacker bass work, and some interesting twists on the usual thick Rush guitar sound. Peart does a couple of his classy rolls, but is otherwise pretty bland, and a few swirls on the synth try to give a vestigial spacey atmosphere and fail miserably.Apollo, Bringer Of Wisdom, is the beginning of the true lyrics debacle, as well as opening after a rather ineffectual pause for effect. Not exactly a sequel to Cygnus X-I, but rather a prelude to it and an epilogue set around the classic with a feeble philosophical lesson of balance attached, and with some truly appalling lines. Musically, the accompaniment isn't stunning, either. Just a wandering bass, guitar and drums, seemingly doing not much interesting. However, the tune picks up with Alex Lifeson's typically 'scientific'-feeling solo, with a squeaky edge and supportive bass.Dionysus, Bringer Of Love, is basically a lyrically altered re-rendition of the above. I didn't see the reason to type out another paragraph to describe it.Armageddon, The Battle Of Heart And Mind is where the piece picks up with plentiful references to Cygnus X-I book 1, containing some of the ideas in the original, but with a slowed-down nature and softer twist. Geddy Lee's vocals, watery, and they almost sound weak, but are nonetheless somehow likeable. Finally, the lyrics move onto the original's storyline. In addition to hearing a stunning riff thing from the original (I really do love that song so much), and some backgrounded nods to the original over a lush keyboard backing, the piece finally improves.Cygnus , Bringer Of Balance, features a jaw-droppingly generic keyboard soundscape. But I love it. I have no idea why. I just do. Keys are prominent throughout, and thunder-rolls add a more genuine atmosphere to the piece than any previous work. Even the return to the more rock-based section and even more abysmal lyrical content sort of works, and includes a functional solo, though nothing as mindblowing as 2112. A crashing conclusion with almost classical drumming ends the part fairly effectively.The Sphere, A Kind Of Dream, works surprisingly well as an acoustic conclusion, with a nice melody (however basic) and a light vocal to accompany it. There is, much to my amazement, a single great verse of lyrics crammed in there. Overall, a bit awkward, ambling and semi-connected, but at times superb and very charming. If the album stopped here, though, it would probably crash in at sub-Moving Pictures levels.The second side picks up pretty substantially, and is much stronger overall. It's opened by Circumstances, a typically sophisticated commercial-lengthed Rush rock song. After the terrible Rush fanfarey opening we see all too often, the piece takes off potently, with a cheerfully sung set of fairly weak lyrics. Geddy Lee spins around terrifically on bass, taking a triumphant performance, complimented nicely by Peart's fairly edgy and precise percussion. An instrumental break features a silly synth solo with a small workout for the orphan-shelter drumkit's more unusual components, as well as more of the odd guitar tone from Apollo... . All in all, a fairly good song, but I don't feel the guitar really added anything to my experience, and a stronger vocal couldn't hurt it.I consider The Trees sarcastic, and thus like the lyrical material and delivery. If it were serious, I really wouldn't. Fairly neat, quick characterisations/representations of general kinds of people. It is certainly more quirky than Circumstances. It opens with a set of acoustics backed by uncharacteristically hollow and vibrating bass. Guitar rocks in traditionally as well as sliding around with curiosity. Neil Peart again provides a fairly interesting performance, with classical rolls, shimmery things and hollow-log-tapping aplenty. The break, featuring gradually a constant guitar riff of the style so characteristic of the album and gradually building rhythm sections, works quite nicely, also allowing another Lifeson solo to break out. A final verse rocks slightly more, and, while virtually the same principle as the end of Red Barchetta, it doesn't matter because the content lends itself to it. A good, short, prog song.La Ville Strangiato is where the album reaches a really special height on a couple of occasions and remains consistently good throughout the entire 'exercise in self-indulgence'. The acoustic opening with a great classical solo gives us a hint of what we're in for, before the whole band enter. After a gradual build, the kicking La Ville Strangiato riff bursts in, with chordal guitar juxtaposed by quick bursts of note guitar. Neil Peart provides a sort of forest of percussive noises as a cheery background throughout. The piece's biggest highlight is a guitar solo, feeling very Spanish on electric, presumably 'Lerxt In Wonderland'. An emotive, calculated and lively performance. Nabbing highlights, since a running description will become tedious very quickly, a Geddy Lee bass solo especially stands out for energy and verve, and Peart's later move to more 'standard' drums devices doesn't fail to pay off with a rock feel as well as a good set of performances. The piece rollicks off fluidly to an abrupt stop. A thoroughly indescribable three-man piece, with recurring themes aplenty and enough motifs and links to give it a cohesive feel despite its very abstract nature and range. Great stuff, though it feels a bit wallowing when you're not in the right sort of mood for it, and the real reason I'd recommend the album.So, overall, not consistent in quality, and quite weak on the first side, but nonetheless it has a fair few highlights and is usually pretty decent. There is definitely prog material of interest here, and no ardent Rush fan should be without this album. Lerxt In Wonderland alone justifies the album's price. It gets better when you stop listening to the lyrics, mind vs. heart = balance theme and all. I'd recommend this to most progressive fans, except those who really live for the psychedelic and atmospheric stuff, very little of which you'll find here, and those who really find some weaker performances on vocals or guitar insufficient compensation for great bass-work and bursts of stellar guitar. Geddy Lee's bass is another serious redeeming factor (one I've failed to emphasise above, but c'est la vie) for Hemispheres, and fans of that instrument should thus seriously consider it. I'm not the greatest Rush fan (Caress Of Steel excepted), so I'd suggest reading a few more generous reviews to balance my opinion out.Rating: Three Stars Favourite Track: La Ville StrangiatoEdit: Since I'm going rather harsher on the ratings, and I've provided that a two is something you should get if you'd consider yourself a fan, it's dropping to a two. Even Strangiato has a couple of moments I'd consider awkward or unneccessary, and I simply don't think the title track is up to the standards Rush hit in their previous excellent record or following decent one. Given it's half the album, I think a two is in order."
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Sunday, August 3, 2008",
      "rating": 4,
      "text": "Speaks to both of my hemispheresHemispheres is in my opinion Rush's masterpiece and also perhaps their most progressive effort ever. With this album Rush completed their journey from a Led Zeppelin-influenced bluesy Hard Rock band to a full-fledged Prog Rock band. Hemispheres also brings together into one place the various elements that made other classic Rush albums so great: the extended suite (first tried on 2112), the acoustic side of the band in Trees, the jazzier/Fusion side in La Villa Strangiato and more melodic Prog Rock in Circumstances pointing forward to Moving Pictures. There is for the first and perhaps only time in their long career the perfect balance between guitars and keyboards. The band is as passionate as they ever got and every member is at his best. The compositions are varied, intelligent and memorable. The lyrics of the side-long epic are intriguing, but I do admit that The Trees is a bit naive lyrically.There is simply nothing to complain about here!"
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Thursday, October 2, 2008",
      "rating": 2,
      "text": "Unlike most reviewers here I really never enjoyed Hemispheres. Strangely enough, even the band seems to agree with my opinion on the articles I read about this period. Just like other famous prog bands of the 70�s Rush seemed to delivering something too pompous, self indulgent and complex work just for the sake of it. The epic Cygnus X-1 is the continuation of the previous LP last track. And that tunewas the worst one from Farewell To Kings. It did not have a great theme or development, both in musical and lyrical contexts. By their standards, it is really poor. Not bad, but way below their capacities. Side two is a little better, but not much. The Trees, for exemple, seems to be a rehash of A Farwell To Kings. the only real strong point on Hemispheres is the last track, the very fine instrumental La Villa Strangiato: ten minutes of great, imaginative, jaw-dropping playing.The band seemed to be a victim of their own virtuosity and pretensioness (something Neil Peart agrees, so much so he decided, along with the other band members, to redirect the band�s style). Fortunatly it would all change with Permanent Waves, their next studio move, which put them back on track. Hemispheres stands as a wrong step by a great band, specially in view of their former (and latter) high quality work. It still has its moments, but definitly this is not a good starting point for a newbie. Be sure to get their classic stuff before this CD, or you�ll have a wrong perspective. For fans and collectors only."
    },
    {
      "reviewer": "MovingPictures07",
      "date": "Posted Wednesday, November 26, 2008",
      "rating": 5,
      "text": "The pinnacle of Rush's progressive rock period. An absolute masterpiece of music.1. Cygnus X-1 Book 2: Hemispheres- This has always been one of my favorite tracks of all time, so excuse me if I sound like a fanboy here. Everything is PERFECT. The trio really show off their instrumental chops on this one! The lyrics, which I've heard many criticize, I love to death. They are intriguing and delve into mythology to make a neat little story. This track is so epic that it feels so much shorter than it actually is. Flawless. 10+/102. Circumstances- Great rocker! They played this song live on the first S&A tour and it really showed how awesome and overlooked it is. That keyboard instrumental part in the middle kills me every time. Wonderful! How can this be the worst song on the album?! Well, just look at what follows it. 9/103. The Trees- Instrumental and lyrical genius. There's no other way to describe it. This is often cited as one of Rush's signature songs and let me tell you... that is for good reason. The atmosphere is perfect, the musicianship is perfect, and the song really rocks! I love the metaphorical lyrics about the whole concept of equality versus equal opportunity and how it can be twisted and demented to something entirely different. Flawless. 10+/104. La Villa Strangiato- Wow. Just wow. A roaring instrumental from the trio here, supposedly based on a series of nightmares that guitarist Alex Lifeson had. Musicianship again is AWESOME, absolutely stellar, and all 3 musicians really craft a unique piece of music here. Haunting and beautiful, this song really is magic. Flawless 10+/10In short, if you want to hear what Rush is all about, this is always the album I recommend (along with Moving Pictures).To those of you who question Rush's prog credentials, I dare you to listen to this. And not just once!One of my desert island albums and an extremely important album in my love of music."
    },
    {
      "reviewer": "DamoXt7942",
      "date": "Posted Saturday, December 6, 2008",
      "rating": 4,
      "text": "Lump of stableness, rigidness, and hardness.Actually, when I had the album on the turntable for the first time, I was overwhelmed by the terrific rhythm section. Although the album (especially the first track Cygnus X-1 Book II) has a calm and quiet part, basically it's very aggressive. In other words, the songs there might push and push like a Sumo wrestler. About forty minutes the storm of Rush keeps blowing hard around listeners and suddenly gets over like the calm night after a storm...I always feel as that.This album was released thirty years ago. In that period I guess this was too hard-progressive all of the hard progrock albums. And still now it's alive in all of progrockers' mind...Very interesting and excellent album, I want to give 4.5 stars."
    },
    {
      "reviewer": "progaardvark",
      "date": "Posted Friday, December 12, 2008",
      "rating": 5,
      "text": "Rush's follow-up to the A Farewell to Kings masterpiece was, well... another one. Hemispheres continued where A Farewell to Kings left off, most notably with the conclusion of the Cygnus X-1 duology. On Cygnus X-1 Book II, instead of the sci-fi storyline from Book I of being crushed by a black hole, the storyline shifts to Greek mythology. Our explorer re-enters midway through the song, body-less, but spirit intact in a mysterious land. Here the explorer experiences the Apollo/Dionysus dichotomy of a society struggling between heart and mind. Neil Peart is quite the writer and I often have wondered what it would have been like if he had written lyrics for Yes.The Trees is one of Rush's most popular songs, telling of a fable with oak and maple trees competing for sunlight. Many Rush fans have often taken this song to be allegorical with the oaks representing the United States and the maples representing Canada, describing their occasional politically strained relationships (perhaps also with regard to cultural dominance issues too). I can understand this interpretation, but putting that aside, the lyrics are exceptionally well done prose.The album ends with a stunning instrumental, La Villa Strangiato. This has to be considered one of the top 10 best prog rock instrumentals ever composed. The guitar work and complex rhythms on this piece are simply astounding.Easily a five-star masterpiece. Many consider this about as good as A Farewell to Kings. Some, like myself, think it is slightly better. You can't go wrong with this one. An essential must-have."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Tuesday, February 17, 2009",
      "rating": 5,
      "text": "One of the great Canadian trio's most remarkable releases, this album should put to rest any accusation that Rush is not a progressive rock act. I'm not sure I can heap enough praise on the band for Hemispheres; it is certainly an album I often turn to when I am in need of a Rush fix. Though only four songs are here, each one is a masterful creation in its own right. The eighteen minute epic is perhaps my favorite Rush piece- exciting, memorable, and entertaining. The two short songs are fantastic, blending elements of heavy rock and ambient phrases. The final track is a searing instrumental with the guitarist in the fore. Such an amazing album is not one to pass by.\"Cygnus X-1 Book II\" The flow of this lengthy piece is unparalleled compared to other Rush epics. Sure there are six distinct sections, but they blend together almost seamlessly. Geddy Lee's bass playing is rather sophisticated, and his voice is beginning to mature at this point. Alex Lifeson's guitar moves between clean chords to crunchy rhythms with chorus throughout. Neil Peart's drums are effective and stand out more than they had up until that point. I really love the sudden stops that punctuate the piece. The use of the synthesizer is tastefully minimal, yet there are atmospheric sections where Lee's vocals are subdued. A short acoustic piece concludes the song, serving as something of an epilogue. This is probably the finest thing Rush ever recorded.\"Circumstances\" Following such a powerful and wonderfully crafted track, Rush offers a short song that is structurally straightforward but still complex in its own way. It has that full Rush sound, Lifeson's guitar thick and creamy. This great song boasts great guitar riffs and a catchy chorus.\"The Trees\" This song, with amusing lyrics, a classical guitar introduction, heavy rock, and a tranquil musical interlude in 5/4, has always been a favorite of mine from this great band. The chord progression is unique, and the light percussion during the relaxing bits is innovative. And Lifeson's solo still surprises me, just as I am starting to relax. From the acoustic introduction to the mentioning of the three arboreal equalizers, this is most certainly one of Rush's greatest works under five minutes.\"La Villa Strangiato\" A gentle classical guitar introduction, fantastically performed, gives way to airy synthesizer and clear electric guitar. Lee and Peart fade in very gradually. This is if anything one of Alex Lifeson's grandest moments in the spotlight. A quiet passage, with Peart maintaining the main rhythm, has Lifeson playing with a cleaned up tone that soon becomes the screaming lead guitar sound he is more known for. This is not to say Lee does not have his moment in the song. After six minutes in, he fires off a quick little bass solo, and Peart soon follows suit. The bulk of the music consists of powerful chords and fast pull-offs, but the music fails to get stale, even after all these years- this instrumental rivals \"YYZ\" in terms of love from fans."
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Wednesday, February 25, 2009",
      "rating": 4,
      "text": "By the late '70's when prog music becomes something only for open minded listners, the rest of the public were captured quikly by punk and disco. Anyway Rush knew how to manage to survive in this jungle, some of the mosnsters of prog bands from the early '70's didn't know, or they took another path. With Hemisphere from 1978 Rush gained a new status in prog music, the one of the masters of heavy prog with lenghy instrumental passages and above all, the top notch musicianship and writting. This status they manage to mentaint 'till today, with some plus and minuses in they career, but also on front lines. To me Hemispheres is better than the predecesor from 1977 and at same level with my second best from them from the '70's 2112. The music is eleborated with some catcy interplay between two masters, or better said all 3 are masters. The opening track is an epic and is a classic tune in progressive music, everything from here is elegant played and with some very intristing elements from prog music. All four pieces are great, but my fav remains the last track La Villa Strangiato, brilliant musicianship, thats why this piece is still today in their play list in concerts after 30 years of the first issue. And another thing to mention is that the lyrics are excellent, with deep and thoughtfull meaning. So, I will give 4 stars to this album, is not my fav album, I remain to Permanent waves or (it might be strange to some of you) Hold your fire to be my fav albums ever by Rush, Hemisphere is for sure an intristing and well played album in prog history. Recommended, among the best from late '70's and from their career."
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Sunday, March 8, 2009",
      "rating": 4,
      "text": "'Hemispheres' - Rush (8/10)The concept of 'Hemispheres' can be seen in the album art, read in the title, and heard in the music and lyrics. The concept of 'art versus science' has long been an interesting debate, and Rush address the topic in the best way they know how, through intelligently constructed science fiction lyrics and an epic song length. Wrapping up the story the was started in 'A Farewell To Kings,' 'Cygnus X-2: Hemispheres' has the greatest lyrics Neil Peart has ever written, as well as some great music that feels like Rush's most cohesive epic to date (despite the criticism it's gotten for being a tad repetitive.) I've always liked the first side of this album more, but side two is a fantastic three song arc that is only hindered by the mediocre track 'Circumstances.'The 'war between heart and mind' borrows lyrical elements from philosophy, classic science fiction, and greek mythology and melds it all together into a massive poem that could easily be the topic of a university paper in terms of it's complexity and deepness. While the music isn't up to par with the ingenuity of the lyrics, the flanger guitar is a very interesting addition to the sonic tapestry, and the vocal performance for the acoustic closing chapter 'The Sphere' is very emotive.The other highlight of the album is the instrumental 'La Villa Strangiato.' Arguably the band's best instrumental, theres some really great guitar work from Alex Lifeson here, possibly his best. Thrown into the mix as well are some homages to ragtime, which are unexpected and bring something new and refreshing to the table. The guitar solo in 'La Villa Strangiato' is one of the best of all time, and it stands as being a Rush classic.'The Trees,' while being better than 'Circumstances' sort of feels like an extention to lengthen the gap between the two longer songs. 'The Trees' (as shorter Rush songs go) is really cool, and like 'Cygnus X- 2,' the lyrics are of particular appeal.Despite being only four songs long, Rush has made a prog classic here, and while it's not their most consistent, it's a great addition to their discography. Well done, Rush. My hat is off to you."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Thursday, September 3, 2009",
      "rating": 4,
      "text": "Hemispheres finds Rush right in the middle between sheer genius and overblown ambitions. The 18 minute title track contains plenty to drool over and it is their only 10 minute+ piece that really holds together as one song (opposed to 2112 and the Fountain which were just a song cycles). Still, not all sections flow equally strong. The music is amazing. The vocal melodies sometimes leg a bit behind.For the first time on a Rush album, the shorter tracks are very accomplished as well. Circumstances and The Trees are very clever and intensive songs that would serve as a template for the tracks on the following albums.La Villa Strangiato is simply beyond grasp. It's a display of musical freedom. It starts off very innocently with a pleasantly building intro, then there's the first guitar solo that is one of the best of the many exceptional guitar solo's that flourish almost every Rush album. After that it just starts dashing in all possible and impossible directions with 4 more minutes of surging riffs and deceptive time signatures till it ends very suddenly and abruptly.Rush would take another approach after this album and start releasing more consistent albums but even so, we will be forever nostalgic to '77-'78, their short but dazzling prog moment. 4.5 stars"
    },
    {
      "reviewer": "The Quiet One",
      "date": "Posted Wednesday, September 9, 2009",
      "rating": 2,
      "text": "On the Prog HemisphereThis is Rush's second full-blown Prog Rock album, Alex's guitar has already changed of sound permanently, synths are included for a more Prog-alike sound, Geddy's vocals are softer in the high-pitch ''screams'', and Neil now is technically better, less of a massive and unstoppable drummer as he was in 2112.So, this is definitely Rush's hey-day to proclaim themeselves as a Prog Rock band. Though, does that mean anything at all? Well on this site yes, but as far as my preference goes this album is not an album I would pick when I want to listen to Rush:The 18 minute epic, the second part of Cygnus X-1, makes you hear all the introductory description I gave about how the band was now. Alex's guitar is less heavy and his riffs are pretty forgetabble, only pros would be his solos which still sound pretty great. The rest of the musicianship is top-notch, better than in 2112 and previous I got to state, yet the composition as a whole is rather repetitive and leads to nowhere, and just makes a good bunch of musicians throwing their great ability to the trash.Circumstances and The Trees bring back the straight hard rock from their early days, however this is not the raw mid-70's hard rock they used to deliver, this is headed to a softer and cleaner hard rock where all the power and strength is aniquilated. Not enjoyable if you prefer the more loose hard rock with energy, however it's indeed in the like of those from Rush's later albums, so those who like that surely will get a better kick out of these.La Villa Strangiato alongside YYZ are Rush's pinaccle on the musicianship side, incredibly tight instrumentation. Yet, again it's not the raw sound we're talking about here, already reading this review you'll notice that Rush sacrificed there heavier and rawer sound to ''become Prog 100%''. Definitely check this instrumental out, though not one I particularly like.Hemispheres is no less than a PROG Rock record, yet it's just not the side I particularly enjoy from Rush, and well it's not that it's an excellent PROG Rock record either, A Farewell to Kings deserves that position.2 stars. Prog, yes. Great Prog? Well, many seems to think that and I respect that, though don't include me in."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Friday, September 25, 2009",
      "rating": 4,
      "text": "True Rush album, but still in transition. May be it sounds a bit strange, but for me this album is still the evidence of their way to masterpieces as Permanent Waves and Moving Pictures,Yes, there we have just four compositions, that formally confirms their music as prog-rock. But in fact I can hear here more mix between hard rock and prog. OK, this album is very important in sense of decision of the direction: Rush turned on to their classical heavy prog ( from hard rock of their earlier albums).Music is true Rush, but still too heavy and in moments a bit simplistic. Whenever you have a big portions of heavy prog there, at the same time you have big portions of hard as well. In some places you just can feel how these pieces are connected between each other.The best song for me is \"La Villa Strangiato\", more deep and melodically mature composition, one of their best instrumentals at all.I think this album is very important for Rush discography and quite interesting for listening. But still not at the level of their best works. Strong 4."
    },
    {
      "reviewer": "The Sleepwalker",
      "date": "Posted Monday, October 19, 2009",
      "rating": 3,
      "text": "Hemispheres, Rush's 1978 release, is seen by many as the best album Rush has ever made. It is a very ambitious album I must say, with an 18 minute sequel to \"Cygnus X-1\", from the previous album A Farewell To Kings. The album is more synth driven than the previous album was. This synth sound would eventually get much more important for Rush's unique sound. I have to say I am not very fond of this album at all. Most of the music on this album actually is good, but compared to the other albums Rush released in this part of their carreer this one is kind of dissapointing.The main reason for this album being somewhat dissapointing is the first half of the album. The 18 minute long \"Cygnus X-1 Book II\" is the sequel to \"Cygnus X-1\" and Rush did make this sequel because people expected them to do so. The result is a repetative song, that sounds forced. The riffs of the song are pretty good, though not Rush's best. It's a shame that they last way to long, to eventually become boring. The second half is better, though the first song here, \"Circumstances\", isn't a killer either. The remaining songs, \"The Trees\" and \"La Villa Strangiato\" are some of the best songs in Rush's catalogue though, The first being a great song, which is in the typical Rush style; powerful, somewhat straight forward and full of great musicianship. \"La Villa Strangiato\" is a lengthy instrumental, featuring some truely memorable music, though not being perfect.This album has two sides. One of them is pretty uninteresting, being forced, repetative and eventually becoming boring. The other is very good, featuring some of the best and most memorable material Rush has ever written. Because of this I will rate the album three stars, which is what I think it deserves."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Thursday, April 29, 2010",
      "rating": 4,
      "text": "After three albums that featured signs of development towards progressive rock Rush finally went all in and carved their most complex album yet! Widely considered to be their most progressive release, a statement I support completely,Hemisphereswas also the most consistent band effort from the trio. Just when Rush managed to score their biggest hit withCloser To The Heartthe band must have left the mainstream audience feeling cold after hearing this album, which might explain the indifferent reviews that this album has received from a wide array of critics. Let's talk about the music!I think that it was a smart idea adding the tagBook IItoCygnus X-1 Book IIsince, besides one riff rehash and the sampled section there isn't really much of a connection between the two compositions. Lyrics are much more coherent and the ending brings the two pieces to a completely unexpected closure that is well worth experiencing. As a composition this one still doesn't hit the spot as much as2112, due to a rather slow progression, but it's a definite improvement over the performance that we've heard onA Farewell To Kings! Unlike the previous two albums where the second side didn't hold a candle to the excellent first side,Hemispheresactually gets even better towards the album's end.Circumstancesmight not be the best rocker that we've heard from the band but it has grown significantly over the years, which might explain why Rush still performs this track during their concerts.The Treesis easily my favorite 5 minutes featured on this album. What we get here are smart lyrics mixed into a masterfully technical rocker. Plus there is an acoustic middle section, leading up to the guitar solo, that sounds like as if it was lifted straight out of a classic Genesis tune! Surprisingly enough I've never been much of aLa Villa Strangiato-fan. I can sympathies with everyone who considers it to be a solid instrumental piece but there's just nothing more to this performance. Yes, it's a great highlight in a live setting but that's probably why this studio version leaves me cold.Unlike the previous releases that had a few majestic highlights that kept those releases afloatHemispheresis a very consistent record from start to finish that might not have as many magnificent moments. Nonetheless, it's an excellent addition to any prog rock music collection.***** star songs: The Trees (4:42)**** star songs: Cygnus X-1 Book II (18:04) Circumstances (3:40) La Villa Strangiato (10:34)"
    },
    {
      "reviewer": "progpositivity",
      "date": "Posted Thursday, May 6, 2010",
      "rating": 4,
      "text": "This is Rush's finest hour! Well, their finest 37 minutes to be exact, but who's counting?Was there ever a longer year than the one from 1977 to 1978? A year I spent in eager anticipation of the conclusion to Cygnus X-1. For all I knew, this Canadian trio would make me wait more than 1 album before finally concluding the saga. (Yes, I led a very sheltered life I'm afraid!)Anyway, Hemispheres did not disappoint me in any way, shape or form. It spun Part One's sci- fi tale in a direction I never anticipated, transforming it into a fable of cosmic proportions!Another rock fable \"The Trees\" was the shorter (translated 'radio-friendly') AOR *hit* song from this album along with the beloved instrumental romp \"La Villa Strangiato\".But it is Cygnus X-1's \"Book II\" that reached a height of stylistically diverse, yet still guitar dominated progrock achievement from which Lifeson himself would later retreat. It is almost as if he asked himself \"How can I possibly top this?\" Later albums would reveal a gradual increase in passion for timbral texture accompanied by a subtle subordination of lead lines and melodies.Musically, each song is a gem. \"Hemispheres\" makes a convincing case for the potency that can be achieved by releasing only the most compelling material on a new album. Had this album been released today, I'm afraid the band would have felt compelled to provide 60+ minutes of music. I have little doubt that 23 of filler would dilute this album's impact."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Friday, May 28, 2010",
      "rating": 5,
      "text": "THE prog masterpiece of 1978; Rush present the most stunning music on the planet\"Hemispheres\" is a classic album from Rush that featured one huge epic track on side 1 of the vinyl and 3 fantastic shorter tracks on side 2. The album is primarily celebrated for the awesome instrumental'La Villa Strangiato', which may be the best instrumental ever. Both this track and'The Trees'were featured on \"Rush: Gold\" a compilation I purchased to taste what this band everyone is talking about actually sounds like. Of course, I ended up getting the entire Rush catalogue, but these two tracks intrigued me enough on first listen to warrant grabbing this album eventually, one of the last Rush purchases in fact for me. I was unaware of how extraordinary the other 2 tracks were so this sealed the deal for me; this album is an astonishing masterpiece.It starts with the 18 minute multi movement suite'Cygnus X-1 Book IIthe sequel to the track on \"A Farewell to Kings\". I enjoyed the first part to this, with it's spacey resonance and conceptual framework so I hoped this second part would justify its existence. I was not disappointed. It begins with the crunching chords and odd time sig of Lifeson and Peart. Lee's vocals soon enter the fray and the song sets sail for one of the best epics I have heard. Rush know how to structure an epic,'2112'is a prime example, but this epic has an incredible melody, crystalline vocals and very tight musicianship throughout. The lyrics of'Prelude'are fantastic;\"when our weary world was young, the struggle of the Ancients first began, The gods of love and reason, Sought alone to rule the fate of man.\"There is a break at 4:30 to herald the next section'Apollo: Bringer of Wisdom'. Lee's voice is strong as he belts out the new melody,\"I bring truth and understanding, I bring wit and wisdom fair, Precious gifts beyond compare, We can build a world of wonder, I can make you all aware, I will find you food and shelter, Show you fire to keep you warm, Through the endless winter storm, You can live in grace and comfort, In the world that you transform.\"The track has a strong melody that always gives me the chills. When the chorus builds up to a crescendo another melody begins that is perhaps the best section on the entire epic. Lee has an amazing voice and his high vocals are incomparable as he sings with passion and conviction,\"The people were delighted, Coming forth to claim their prize, They ran to build their cities, And converse among the wise, But one day the streets fell silent, Yet they knew not what was wrong, The urge to build these fine things, Seemed not to be so strong, The wise men were consulted, And the Bridge of Death was crossed.\"The thematic content is all based of course on the Greek god mythology and each god addresses what they can bring to the protagonist who searches for meaning. At 6:50'Dionysus Bringer of Love'begins, the same melody as previous though more subdued with some beautiful guitar picking. It builds to the riff and Lee returns to the chorus section;\"the cities were abandoned, and the forests echoed song, They danced and lived as brothers, They knew love could not be wrong, Food and wine they had aplenty, And they slept beneath the stars...\".'Armageddon The Battle of Heart and Mind'section 4 begins at 9:08; a new time sig change entirely, though the same chords are heard. The awesome lead break is a real feature that is phased out and spacey. On this new ascending and descending riff Lee's vocals are more aggressive with a delay effect,\"The universe divided, As the heart and mind collided, With the people left unguided, For so many troubled years, In a cloud of doubts and fears, Their world was torn asunder into hollow Hemispheres.\"The poetic pentameter works perfectly and there is a powerful effect on the sense as we are treated to one riff after another.At 12:08 the music settles and there is an ethereal ambience when the keyboard pads begin, and the next section is titled'Cygnus, Bringer of Balance'. It is reminiscent of the spaceyness of the prequel to this track. The atmosphere is definitely one of melancholy tranquillity but the lyrics are unsettling in this section speaking of\"a disembodied spirit, I am dead and yet unborn...\"It builds and Lee's voice becomes higher and more forceful on;\"Then all at once the chaos ceased, A stillness fell, a sudden peace, The warriors felt my silent cry, And stayed their struggle, mystified.\"This is followed by some divine passages of guitar and then a very soft, gentle calmness is created with minimalist guitar, effectively massaging the senses after the onslaught of power riffing.At 16:54 the new section begins, a much more moderate Lee with acoustic guitar and sustained keyboard pads. The lyrics are reflective on the chaos that has gone on before onThe Sphere: A Kind Of Dream;\"We can walk our road together, If our goals are all the same, We can run alone and free, If we pursue a different aim, Let the truth of love be lighted, Let the love of truth shine clear, Sensibility, armed with sense and liberty, With the heart and mind united in a single Perfect Sphere.\"The ending is abrupt and tends to leave the track up in the air, though there was no sequel to this. I think this track is a bonafide masterpiece.'Circumstances'has a great chorus with a strong melody and very high vocals;\"all the same we take our chances, Laughed at by time, tricked by circumstances, Plus ca change, Plus c'est la meme chose, The more that things change, The more they stay the same...\"The chord progression is heavy and the time sig is unusual at times. This track really kicks hard and the live performances I have heard or seen lift the crowd every time. It is genuinely uplifting music with a simplified straight forward power riff. The lead break seems to blend in rather than become a showcase for Lifeson. Another excellent track due to the memorable melody and killer riffs.I was never a fan of'The Trees'on the compilation that was sandwiched between two classic tracks, but it tends to work better on this album as it allows breathing space between the hard rocking content of the other tracks. The trees could be an anthem for Greenpeace or other conservationist groups as it really hammers the message about saving the trees from their point of view, if you don't mind. The lyrics are very strange;\"So the maples formed a union, And demanded equal rights, 'The oaks are just too greedy, We will make them give us light', Now there's no more oak oppression, For they passed a noble law, And the trees are all kept equal, By hatchet, axe and saw.\"It may be an allegory for civil war but more likely this is a message from rush to look after the planet, a similar stance to the music of Yes in this regard. The track begins slowly with a sad atmosphere and it eventually builds to a dynamic instrumental break, with innovative riffing and time sigs. The melody is once again endearing and grows on you on each listen. This is the weakest track on the album but is not enough to detract it as it still has some great moments on it. The film clip on the latest Rush DVD is very good too by the way featuring a humorous look at trees versus man; ironic and wonderful.The last track is the incredible instrumental'La Villa Strangiato'that begins with Spanish flavoured acoustic and then a synthesizer booms in and soon it locks into the fabulous 5 chord synth riff that every Rush fan knows. I saw this on the \"Live in Rio\" and every one in the crowd was roaring the tune out as the band played in perfect sync. The instrumental is a definitive masterpiece with so much to recommend it. The bassline is wonderful that keeps up with the loud guitar of Lifeson. His lead motifs on this are well executed and stay in the memory long after the music is over. Rather than a filler, this instrumental becomes the highlight of the album and this is unusual. The violining that is heard is dreamy and haunting, and then an absolutely soaring lead solo follows, one of Lifeson's best. He rips it out with fret melting elegance, and then an enchanting riff locks in while a two chord synth progression is layered underneath. The time sig then changes with a passage of lead and then bass solos. There are fantastic drum fills in this too with a lot of jazzy cymbal work. The time sig returns to the original though it is fractured as Lifeson blasts out another brilliant lead solo. Then a back breaking chord structure is crunched out, the bassline is divine here, and it settles into a slow paced bluesy metrical pattern. The main lead motif returns and then the intro section is reprised with the same finesses as heard earlier. After 9 and a half minutes it draws to a close. What an amazing piece of music; stunning virtuoso excellence.How does one conclude after hearing 4 incredible tracks. This is a masterpiece of prog. Perhaps the best prog album of 1978. In a year when punk had already reared its ugly head and dance-oriented disco was soon to take over and systematically kill all things progressive for a season, Rush produced this music, despite what everybody else was doing. They refused to sell out to mainstream commercialism in the late 70s, and in fact their music was more progressive than ever on this release. You have to give them credit for that and you have to identify a masterpiece when you hear it, and this is it."
    },
    {
      "reviewer": "Andy Webb",
      "date": "Posted Friday, July 9, 2010",
      "rating": 5,
      "text": "If you want a good Rush album, Hemispheres is a good choice. Blasting forth with the second Cygnus X-1 track, which is a spectacular song, the album sets out on a great foot.Cygnus X-1, Book 2: Hemispheresstarts out with a nice melody. As the song progresses, the great melodies and part changes don't stop. The mythological allusions are great, as are most of Peart's lyrics. Despite its long length, it flows beautifully and it flies by quite quickly, so don't be discouraged by the fact that it is eighteen minutes long.Circumstancesinstitutes that great essence of Rush that is progressive yet is so damn catchy. With great lyrics and great melodies and rhythms, this song is a wonderful track; I can see why it was chosen as a single.The Treesis a great sing not only because of its nice acoustic intro, but also because of those lyrics. Detailing how Canada (the maples) feels that America (the oaks) feels diminished by America's fame and prowess, it presents and very poignant problem, and how we should and shouldn't address it.La Villa Strangiatois such a spectacular song. Being a drummer myself, I am always awed by Neil Peart's drum work. With this song, I cannot stop whatever I'm doing when listening and wonder at Rush's great musicianship, all of them! With mystic solos by Alex, blistering and complex riffs from Neil and spectacular bass lines, this instrumental is definitely a showcase of the bands great musical talent."
    },
    {
      "reviewer": "tarkus1980",
      "date": "Posted Wednesday, July 21, 2010",
      "rating": 4,
      "text": "A GOOD album, and none too soon.A Farewell to Kingscould have easily indicated that Rush had run out of gas and were about to fade into oblivion, but fortunately that wasn't the case. Starting with this album (and fan favorite, in my observation), the band was able to launch itself into a period of, if not necessarily greatness, then solid competency.The fact that I enjoy this album so much is made all the more remarkable by the fact that, lyrically, I consider this album bad even by Rush standards. Of the three songs with lyrics (the fourth, the closing \"La Villa Strangiato,\" is instrumental), one (\"Circumstances\") is unremarkable for good or bad, but the tracks which bookend it strike me as totally ridiculous. The opening side-long \"Hemispheres (Cygnus X-1: Book II)\" tackles the age-old concept of the heart-mind dichotomy, but the problem is not the subject matter; rather it's that Peart decides to frame the argument around what I can only describe as a Greek mythology fan fiction. The lyrics make me cringe every time I hear them, and given that the track lasts over 18 minutes, there's a lot of them to make me grit my teeth. The other offending track is \"The Trees,\" where Peart writes a straight-forward parable deriding the concept of labor unions. The lyrics are off the charts on the unintentional comedy scale, to say the least.When I ignore (and I don't mean tolerate or just allow to blend into the background, I mean IGNORE) the lyrics, though, this album turns out to be really great. Musically, the title track is EASILY my favorite of the band's three side-long epics, and strikes me as one of the neatest things the band ever did. The first ten minutes are built around a growling bass- driven riff, which regularly alternates with a beautiful, ambient-esque guitar line from Lifeson, and they interact amazingly. One thing that really impresses me is that those ten minutes do a good job of slowly, continually building up tension, while also continually releasing that tension, but at a slower rate than the build up; the result is that, by the end of those ten minutes, there's an overwhelming amount of net tension, and I have to respect any piece that can pull that off.The best part of the track, though, and the chunk that drives me crazy with glee every time I hear it, is around the 12-minute mark or so. It's that quiet, robotic-sounding (drenched in atmospheric synths) part with the \"I see the gods in battle rage on high\" lyrics. The idea at this point in the song is to portray Cygnus' entry into the palace on Olympus, and they did it they did it they did it so well!!! That part is so majesticallyeeriethat I can't help but tip my hat to the talent the guys so obviously posessed. Too bad they couldn't show it all of the time ...The track ends with a rather throwaway acoustic snippet, which was obviously intended to be a \"heart-warming\" coda, but which seems a bit tacked on to me. Still, it hardly mars the effect of the whole track, which is quite magnificent. The second side, then, can't possibly hope to live up to the first, but it does a decent job anyway. \"Circumstances\" is a decent riff- rocker; it never quite moves beyond the main riff, and seems to me to somewhat overstay its welcome, but I'm fine it. As for \"The Trees,\" well, my opinion of it is pretty much the exact opposite of what it used to be: I used to think the lyrics were ok, while the music was lacking. Now, though, I basically hate the lyrics, but I think the melody (which starts off acoustic-based) is quite nice, and even the mid-song instrumental break, even if it's too overlong for my tastes, is quite cool.The most famous track from this album, then, is the closer. \"La Villa Strangiato\" is a 14-part instrumental (supposedly) based around a strange dream that Lifeson had one night (I am SO GLAD Peart didn't try to write lyrics for this). The music is good, especially for how it gives Alex a chance to display his diverse skill set. I don't find it an immortal classic, and it doesn't seem as energetic on the whole as it does when I play it in my head, but most of the individual sections are quite interesting. The \"monsters\" riff, and the parts where the riffs seemingly use the quiet synth parts as a launching pad, are my favorite parts, but it's all quite decent. I still prefer theExit ... Stage Leftversion, though.This is a fine, fine album. I am not a Rush fan by any means, and the lyrics cause me to be much harsher to it than I'd like to based on the music itself, but I cannot deny the high quality of the album. No Rush fan should be without it. It's kinda short, but there's a good remedy for that; play it twice."
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Monday, October 18, 2010",
      "rating": 4,
      "text": "This was both the proggiest thing Rush ever did and the last real proggy album they made. I was never really into the Cygnus story and frankly don't care what it's all about. Neil Peart made a wise decision to drop all the sci-fi stuff after this album and concentrate on more human related topics. I prefer both his lyrics and Geddy's singing in the 1980s than almost anything either wrote or sang in the 1970s. Alex Lifeson, however, did his best guitar playing in the '70s, IMO. I don't think Rush were ever really good at making side-long epics or 3-minute pop/rock songs. Their strength, to me, was in making 5-10 minute songs whether instrumental or not.The side-long track here has it's moments. Generally I like most of it but the mellower section with 'samples' from the other \"Cygnus\" song is kinda dull. This epic features what Rush fanboys refer to as \"the Rush Chord\"(I can't remember what it is exactly as I don't know how to play guitar). I'm not sure if this is the first time they use it here, but they used it throughout the rest of their career. Rush fanboys insist that Rush were the first musicians to ever use this chord. All hail Rush! One of the best things about Hemispheres is that they are starting to use more synths than previously(MiniMoog, Oberheim), and it adds to the music. By the time of, say, Power Windows, they went overboard with the synths and it took away from the music. Apparently Lifeson uses a guitar synthesizer on this album too, but I'm not exactly sure where. I never really cared for \"Circumstances\" too much, although it does forshadow what they will be doing on Permanent Waves. I actually never noticed that Geddy sings some of the lyrics in French before. Just goes to show how little I cared for/listened to this song.Okay, now let's get to what I actually *like* about this album. \"The Trees\" has my favourite lyrics of any Rush song and \"La Villa Strangiato\" is my favourite instrumental of theirs. In fact, these may be my two favourite Rush songs of all time. Apart from the lyrics, \"The Trees\" has a super fantastic middle section that I could listen to forever. All three musicians just play their hearts out here. Hell, they play their hearts out on \"Strangiato\" as well, especially Lifeson. If you want to hear Rush at their proggiest, get this. If you want to hear Rush at their most consistent, get Moving Pictures. 3.5 but I'll bump it up to 4 because they tried so hard."
    },
    {
      "reviewer": "lazland",
      "date": "Posted Thursday, December 9, 2010",
      "rating": 3,
      "text": "The album that could almost, in the light of hindsight, be subtitled \"A Farewell To Epics\", because this was the last time that the band would ever try anything quite so lengthy or a concept piece, certainly with the sci fi fantasy that marked earlier epics. I take issue with those who declare that this album marked the end of Rush as a prog band. Maybe it was their last proggy album, for want of a better word, but they certainly, with subsequent releases, established themselves as one of the planet's leading progressive rock bands (and I do think there is a difference).Of course, in 1978, we all lapped it up. Hemispheres is the direct sequel to Cygnus X-1, and has five distinct segments lasting an entire side of 18 plus minutes. Listening to it again now, there are some lovely sections, but, dare I say it, I really don't think it has aged particularly well over the years, certainly not as much as its illustrious two predecessor albums. The story (which is so well known, I won't bother to repeat it here) is actually insensibly carried forward from the first part, and it all sounds very disjointed in a way that, for example, 2112 didn't. Sure, it features some massive riffs, excellent rhythm section work, and Geddy Lee in fine vocal fettle, but, somehow, it just doesn't hold together for me. The acoustic passages are by far the best in this.Side two gave us a hint as to the future direction the band would take. Circumstances and The Trees are two shorter tracks, whilst La Villa Strangiato, whilst fairly hefty in terms of length, offers us no lyrics and lets the music speak for itself.Circumstances is a good rocking track, with excellent riffs. The Trees is a track I love, and strikes me as actually being the true successor to the music in A Farewell To Kings. Lush and acoustic to begin, the main riff follows with the type of catchy main section for which they would definitely continue with in the later releases. A great track, with prophetic lyrics as to the future of our world, and the Lifeson & Lee main feature riff packs in more of a punch in a mere couple of minutes than the title track did in its entirety. The final, instrumental, piece of music is a glorious exercise in symphonic rock and is the sound of a threesome entirely at ease with themselves and their craft. The theme of this would later be taken forward in XYZ, albeit in a shorter time frame (i.e. without the drum soloing). This is up there with that classic.Reviews for this album range from the incredible to the damning, and it remains one of the progheads favourite Rush albums of all time. I'm in a minority when I say that I regard side two as being far better than side one. In fact, I suspect that the band, especially Peart, thought the same, because they had gone as far as they could with this particular phase of writing and recording. They then did what all of the best bands do - they moved on and progressed to another level.Three stars for this. A good album that is great to revisit every now and again."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Friday, December 17, 2010",
      "rating": 4,
      "text": "Obviously, good musical taste can be genetically passed from father to son. My son, who will be 17 in two weeks loves prog. Last night he asked to listen to \"Hemispheres\" in the car when we went out for some errands.This album is one of Rush's most progressive, having none of the rock anthems that represent nearly all of the group's radio airplay.The first piece, the five partHemispheressuite is a fine, but not perfect prog epic. I find that while each section is great, the transition between movements are often awkward. Still, the musicianship is fantastic, and the song shows why Rush belongs here on this site.The other highlight isLa Villa Strangiato, one of Rush's two best songs (the other beingYYZ). With a theme based on Raymond Scott'sPowerhouse(you may remember it from some classic Warner Brothers cartoons), this song is one of the classic heavy prog masterpieces, and has been a concert favorite since this album debuted.The production is not as lush as on later albums, and live performances of these songs usually sound better (listen toLa Villa Strangiatoon \"Rush In Rio\" for an example). But considering what was happening to prog in 1978, this is an excellent album."
    },
    {
      "reviewer": "baz91",
      "date": "Posted Wednesday, June 22, 2011",
      "rating": 5,
      "text": "Rush's Proggiest MomentUp to this point, Rush had been climbing a progressive mountain. Their debut 'Rush' had a few odd song structures, but was still more or less a heavy rock album. 'Fly By Night' showed more experimentation with epic songs likeBy-Tor and the Snow Dog. 'Caress Of Steel' was the album with Rush's first 20 minute suiteThe Fountain of Lamneth, which was flawed in that the music didn't run together. '2112' showed Rush learning from their mistakes and producing and epic prog classic. With 'A Farewell To Kings', Rush didn't write a side-long suite, but instead wrote more complex and 'proggy' songs, such asXanaduandCygnus X-1: Book I, the first part of an epic prog suite. It was time for Rush to hit their peak, by writing long complex and unashamedly progressive music.And what a time to do it! 1978 was admittedly not a great year for prog. Lest we forget that 1978 was also the year that brought us Yes'sTormato, Genesis's...And Then There Were Three..., ELP'sLove Beach, Gentle Giant'sGiant For A Day, Camel'sBreathlessand Uriah Heep'sFallen Angel. All the major prog bands had gone into decline, and would either fizzle out soon or start using a more commercial format for their songs. However, Rush seemed to be a few years behind everyone else, and this certainly payed off, as it can easily be claimed that 'Hemispheres' is the best album of that fateful year. Rush would tide the prog world over, if only until the neo-proggers came along in the early 1980s.'Hemispheres' starts off where 'A Farewell To Kings' ended, in the middle of the Cygnus X-1 story. To finish the sci-fi tale of adventure, we are given 18 minutes of pure unadulterated prog music.Cygnus X-1: Book IIis a progressive journey whose grandeur can be likened to that ofThe Gates Of Delirium. From the first three minutes, you can tell how complex and intricate this track is going to be. An impressive number of musical themes can be found recurring in this track, each time played slightly differently, making this the most cohesive Rush epic ever. There are also a few themes and devices that have been lifted from the first part, thereby making the whole suite extremely consistent.There are a couple of bizarre things about this five part epic. At the end of the first part, the music just stops as if the song has ended. After a few seconds, the music starts again just as suddenly as it stopped, making us wonder why it stopped in the first place. It's pretty hilarious actually and I don't mind it at all. The next three parts segue together without a break, showing that Rush had learned much since their 'Lamneth' days. The final part of the song is a sort of epilogue that seems unconnected to the rest of the suite.The first three parts of the song take up about 12 minutes, and together they form the most intense 12 minutes of Rush ever. Altogether,Hemispheresis a fitting conclusion to the spectacle that is the Cygnus X-1 suite. I may not understand the story that well, but boy do I love the music.Over to Side 2, things get more commercial with the radio-friendlyCircumstances. Despite being under four minutes, this is still a solid track. The chorus is quite unique and memorable with it's bilingual message. There is also a great instrumental in which Neil Peart shows off his chops.The Treesis an interesting ballad indeed. The ballad tells of the seemingly political struggle between the two groups of trees, the Maples and the Oaks. Unsurprisingly, many people have taken this as an analogy to the politics between Canada and the USA. However you interpret this track, you have to admit that it's a fun and interesting story, in lieu of Genesis'sThe Return Of The Giant Hogweed. It goes without saying that the music is also brilliant enough to carry the story.A lot of people say thatYYZis Rush's best instrumental, but I claim that they haven't heard the prog rock spectacle that isLa Villa Strangiato, a twelve part instrumental with the subtitle 'An Exercise In Self-Indulgence'. This is a killer instrumental, the twelve parts correspond to very different musical themes, with just a couple recurring near the beginning and at the end. The musical themes are all really strong, but the so called 'Strangiato Theme' is the best, and this is the theme that is repeated, giving the instrumental a really cohesive feel, and justifying the whole 'exercise'. This is a really complex and meaty track that you can sink your teeth into and listen to time and time again until you can remember all the parts (which I have yet to do). The subtitle says it all, but then again, isn't prog as a whole just an exercise in self-indulgence?This really is Rush at the top of their game. The next two albums, 'Permanent Waves' and 'Moving Pictures' would show the trio getting less and less progressive, and by 1982's 'Signals', there wasn't any prog left at all. This is a fully realised album, with three talented musicians pushing prog to its limits, and rocking it's listeners hard. A masterpiece."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Friday, October 28, 2011",
      "rating": 4,
      "text": "The followup to Farewell to Kings takes the approach of that album, cranks it up to eleven, and also sees Rush experimenting with an increased presence of synthesisers and keyboards in their work. Whilst these experiments would yield the sound of albums like Permanent Waves and Moving Pictures - foreshadowings of which can be heard here and there on this album - Hemispheres itself is a rather muddled beast.Side one is dominated by the title track, the sequel to Cygnus X-1 on the previous album - although both thematically and musically, it couldn't be more different. Cygnus X-1 is a spacey number about a guy who deliberately steers his spaceship into a black hole out of his burning curiosity to see what was on the other side. It was tight, cohesive, had different sections seamlessly melded together through tight changes of time signature, and it rocked like you wouldn't believe.Hemispheres, conversely, is a bit more of a mixed bag. It's a fantasy story about the conflict between the gods of reason and emotion and how eventually they install a mortal to adjudicate the balance between them. So far, so prog. The problem is that it's not quite as cohesive as the first part of Cygnus X-1, giving the distinct impression that the band were churning out an epic because they thought it was expected of them, rather than because they were excited by an idea they had for it; it's notable that they steered away from such long-form tracks after this. The same patchiness is also there to an extent on 2112 of course, but 2112 both rocked harder and kept the listerner's interest far more than Hemispheres, and didn't repeat itself nearly so often.On the second side we have two throwaway tracks - Circumstances, which sounds like a reject from side two of 2112, and the heavy-handed political allegory of The Trees. But at least we also have the album's saving grace - La Villa Strangiato, a 9 minute instrumental track which both acts as the culmination of their prog-above-all period and as the transition to the next phase of their career. Ducking and weaving at a breakneck pace through a range of different moods, juggling time signatures without breaking a sweat with each band member soloing like their lives depend on it, it's everything that the title track should have been but wasn't.Still, one really awesome track isn't enough to turn a merely pretty good album into a classic. Harsh, maybe, but there's no getting away from the fact that this is a very transitional album which would have got a significantly lower rating were it not for the wonders of La Villa."
    },
    {
      "reviewer": "Matti",
      "date": "Posted Saturday, August 10, 2013",
      "rating": 4,
      "text": "I may be in the majority to state that this is my favourite RUSH album. Along with A Farewell To Kings (1977) it is Rush at its most progressive, and these two albums were even made in Great Britain as if to underline the influence of British prog and the will to break into the same album market. Another factor to tie these albums together is the sequel of sorts to the 'Cygnus X-1', the title epic filling the first side. It's the third and last time Rush made a side-long epic, and by far the best if you ask me. Yes, better than '2112' though many disagree!It has a good concept - to which the cover art points directly with the brain hemispheres and two figures. Peart was inspired by a book (I now forget which, on psychology perhaps?) and he shaped the storyline about Greek gods Apollo, Bringer of Wisdom, and Dionysos, Bringer of Love, and their battle for power, until enters Cygnus, Bringer of Balance. The 18-minute epic has five sections. It works well on both narrative and musical levels with its many changes on dynamics. The use of synths is just suitable, more than before but not too much. Geddy Lee doesn't scream aggressively anymore as he did on '2112'. In my opinion Hemispheres is the high zenith of the epic prog Rush - which was to change into the accessible pop-sensitivity of Permanent Waves. But for a proghead this too is very accessible work.The hard rocking, rather straight-forward 'Circumstances' is the only track I'm not fond of. Peart's lyrics deal with his personal disappointments in London before joining Rush. 'The Trees' is one of my biggest Rush favourites, what a wonderful, ironic story about overgone equalizing! It was inspired by a comic drawing. The battle for a place in the sun between Oaks and Maples ends up with the use of \"hatchet, axe and saw\". Not only the lyrics are great; the composition is both economic and exciting, dynamic, catchy and colourful.The final piece 'La Villa Strangiato' - the first all-instrumental Rush track - is as excellent as it gets. \"An Exercise in Self-Indulgence\", based on a dream that Alex Lifeson had seen. The twelve parts form a cohesive whole that grabs the listener. The recording of this track alone took more time and effort than the whole Fly By Night album some years earlier. The album doesn't quite enter my list of all time prog favourites, but it's not very far from a five-star album for me either."
    },
    {
      "reviewer": "admireArt",
      "date": "Posted Friday, December 6, 2013",
      "rating": 4,
      "text": "Why gods, Oh WHY? Rush was not born \"instrumental\", WHY??? Why one has to go through so much Fk misery to listen to such great music? Why?... Why, no one has told this virtuous bass player and extraordinary composer, that his voice sounds like the notice of your near death?If at least their lyrics were as damn good as the music, well I would not mind that much, but really, not necessarily been a gifted-musician, makes you a gifted-poet (forget gifted, mere poet and otherwise of course,). This, I have been advised, is not Mr. Lee's fault to blamed, he just sings. ...It is just unbearable to try to skip his voice alone, then the \"surrealistic\" (I'm being polite) lyrics, in order to enjoy, such a vast universe of excelent music.In my case, I can not bear so much of this, that frequently. At the end of the day, it is not that \"essential\" to go through these \"voluntary\" visits to the dentist, that we all know are necessary, but as such, not something to look forward to.Why Gods, Oh why!??! It has to be like this?? ........of course, ****4.5 P.A. stars, and in \"Karaoke/Land\", even ********8 K.L. stars!"
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Wednesday, June 4, 2014",
      "rating": 5,
      "text": "HEMISPHERES continues the unique hybrid of hard and progressive rock that RUSH so successfully married together and basically continues where their previous album left off. Literally. I am unaware of any other two-suite composition that ended one album with part one and began the next album with part two. Other than the sci-fi and Greek mythology used to tell the story of how the logical and emotional parts of the human mind are separated into different hemispheres, parts one and two sound very different from one another which makes sense since the different sides of the brain represent two different aspects of human reality. Whereas part one represents the emotional brain and conveys a sense of cohesive flow, part two represents the logical brain and is divided abstractly into several seemingly unrelated parts much as cognitive information tends to be. The results of the second part of \"Cygnus X-1\" may seem strange at first but I have grown to love it as much as the first part. It's definitely the more demanding listen of the two.\"Circumstances\" is a proggy little rocker that is very catchy at the same time. It is basically Neil Peart's introspective take on the time he spent living in the UK which is where both \"A Farewell To Kings\" and this album were recorded.\"The Trees\" remains one of my favorite shorter RUSH tracks which allegorically uses the examples of the different species of trees in competition for the sunlight to represent the trials and tribulations of humanity's own internecine competitive nature to dominate resources for political control. Alex Lifeson just nails it on the beautifully composed classical guitar which belies the hard rockin' tale of the trees that abruptly ends by hatchets, chains and saws.\"La Villa Strangiato\" like \"Xanadu\" is one of my personal all-time musical compositions which has the honor of taking more time to compose and record by itself than most of RUSH's earlier albums. It has also been cited as the straw that broke the camel's back in the tension created by ever upping the progressive ante but what a way for RUSH to end their full-on prog stint. This 9 � minute masterpiece is divided into 12 parts which all string together effortlessly. There is even a 20 second part that begins at 5:49 into the song which uses a riff called \"Powerhouse\" written by cartoon jazz master Raymond Scott.HEMISPHERES is another huge winner in my book. Unfortunately more albums like this were not to be :("
    },
    {
      "reviewer": "TCat",
      "date": "Posted Monday, May 11, 2015",
      "rating": 5,
      "text": "Here is another Rush album that has been reviewed so many times that everything that needs to be said has been said. \"Hemispheres\" is one of the many 5 star albums by the band. But there were some interesting changes going on and that becomes apparent almost immediately. Keyboards were being used again, and were being used effectively. The core guitar, bass, drums were still the driving force.But the first real obvious change is that Geddy's voice is suddenly a huge centerpiece on the first track, which is the very long suite which serves as the sequel to \"Cygnus X-1\" from the previous album \"Farewell to Kings\". It's not really a sequel though because the first part dealt with a science fiction theme where part 2 deals with mythology. Whatever, it's Rush. The track is full of reminders of the first part with a few repeated or similar guitar hooks taken from the first part. But after a decent instrumental introduction, Geddy's vocals take over and don't let up much for the remainder of the long track. There were some disappointed fans at this time as this was the first time the guitar didn't stand out so obviously. It took more time to appreciate this track this time around, but after a few listens, it was hard to deny it the progressive epic status it deserved. Yes there was a lack of guitar craziness in the first half of the album, which is comprised of the suite, but there was masterful skill in the composition of the track. It did take a little longer to appreciate, but now that I do appreciate it, it is a masterpiece.The 2nd half of the album is a return to form from \"Farewell to Kings\". This was the familiar Rush with the same formula of excellent keyboards, blazing guitar and bass solos, and heavy exciting songs. \"Circumstances\" and \"The Trees\" are rock classics and the guitar solo in \"The Trees\" make the difficulty of \"Cygnus Part II\" easier to digest on the first few listens and it also guaranteed Rush fans would return to the album. Fans were happy, and soon they would accept the long suite even if it meant listening to it a few times to appreciate it.But I don't think anyone was ready for the awesomeness of what was to come next on the album. This is the best guitar solo ever! I know when I first heard this solo, I was amazed and excited, and I was sold on the album. After all these years, it still hasn't worn itself out, I still consider it the best instrumental track by Rush and one of the best Heavy Prog songs ever. Even if it is driven by guitar for the most part, it is a multi-dimensional full blown prog anthem. \"La Villa Stragiato\" would set the bar for guitar based prog for years to come. We all knew that Alex Lifeson was one of the best prog guitarists, but after this track, he was considered a guitar god. Simply amazing track that still gets me excited when I hear it. And the progressive nature of the track is amazing with all kinds of rhythmic changes, dynamics, moods, style shifts and it's all done seamlessly. If nothing else on the album was any good, this track still would have been a standout in all of rock music. But fortunately, the album is still great. One of Rush's many masterpieces, heavy rock with classical attributes in the composition of the music and loaded with prog elements galore. 5 stars."
    },
    {
      "reviewer": "Necrotica",
      "date": "Posted Tuesday, July 28, 2015",
      "rating": 5,
      "text": "No matter what you think of Rush, I think anyone can agree that they rarely rest on their laurels. Even later on in their career, the band would always experiment with sounds of the decade while sticking to own their guns in the process. The 70s and early 80s held the best examples of this, with the trio constantly expanding upon their concepts and style with each record. Their debut and a large chunk of Fly by Night were rooted in bluesy (sometimes folky) hard rock in the vein of Led Zeppelin, but they soon realized that evolution would be important to their work. If someone ever needed the best proof that Rush's progressive experimentation was the best thing that happened to them (along with Neil Peart, of course), I'd tell him or her to look no further than their 1978 effort Hemispheres.With its four songs and 36-minute running time, Hemispheres is more abstract and less accessible than its predecessors; however, it also ends up being the band's most concise. We've got an 18-minute epic, a long-winded instrumental closer, and two shorter hard rock songs sandwiched in between. As with 2112's title epic, the opening epic on Hemispheres makes up the entire first side of the record. The storytelling and overall lyricism, also like 2112, are once again a big part of this song, as I'll talk about in a minute. As for individual performances, the trio absolutely astounds. One quality of Neil Peart's drumming here that really sticks out is the fact that he seems to put the overall band first. What I mean by this is that he only gets flashy when the situation calls for him to do so; he anchors the other musicians very nicely while bringing his own style to the table as well. Geddy's voice is as high-pitched as ever, but the bass playing is phenomenal at the same time. Alex Lifeson is more experimental with his guitar effects this time around, utilizing a wide range of tones and sounds to suit any given situation. His emotive and technical solos on \"La Villa Strangiato\" and \"Cygnus X-1 Book II: Hemispheres\" are standout moments on this album as well.When the title track bursts right out of the gate, you can feel the band's confidence shining through 100%. The band aren't going to take any prisoners on this effort, and it shows as the instrumental overture goes on. Similar to \"2112,\" you'll hear many of the song's future themes on this overture as it displays all of the band's frequent time signature changes and unorthodox compositions. As you could imagine by the \"Book II\" in the title, there's also a story to this epic. Following the events of \"Cyngus X-1 Book I\" in which the protagonist was sucked into a black hole during his voyage, the explorer enters a new world where he's eventually destined to be the God of Balance. In a world filled with multiple extremes and fluctuations between love and hatred, the explorer decides to be the balance that anchors everything into place and is named Cygnus. The story is epic and moody, and the instrumental work always gets switched up to suit the mood. For instance, the Apollo segment contains contemplative guitar work and a sense of instrumental control to display the theme of wisdom that's supposed to be represented there. While the technically remains present, it sounds more reserved at the same time. Then there's the Armageddon segment in which the music is much more distorted and loud to represent conflict and chaos. The rhythm Neil goes for is a bizarre sort of swing beat, but it surprisingly works with the music. The last few sections depict how the explorer eventually becomes Cygnus (after it's debated by the other Gods) and the Sphere segment tightly wraps things up with a calm acoustic finale. It brings a sense of closure to one of progressive rock's best epics; frankly, I can't recommend this song enough overall. It's simply a masterpiece in every sense of the word.The other songs are great too. \"Circumstances\" is the most accessible song on here, a straightforward hard rock song with Geddy Lee's high-pitched screaming leading the chorus. There are still plenty of technical moments here as well, like with the calm instrumental break before the finale or the chorus itself. Either way, everything sounds tight and in place. \"The Trees\" is a bit more interesting, talking about prejudice but with... well, trees. Sort of a weird scenario, isn't it? Well anyway, it starts with 3/4-time acoustic guitar segment before launching into a clash of instruments before the verse comes about. The instrumental break in the middle is pretty interesting too, preferring to build itself up instead of making things too obvious. You get many little nuances here, such as Neil Peart's woodblock or the underlying synthesizers. Finally, we get to the other highlight of the album: the instrumental \"La Villa Strangiato.\" Holy hell, this song is absolutely insane; first of all, what other song would start with a shredding intro on a classical guitar? Anyway, this is another song that builds things up, eventually leading to one of Alex Lifeson's most emotive and refreshingly spacious guitar solos. After that, the craziness begins; a rolling drum beat is supported by a hard rock riff and rhythm changes start to get constant. The \"rolling riff\" is a recurring theme but usually appearing in different forms, such as a bluesy swinging section that reminds me of \"Lovin,' Touchin,' Squeezin'\" by Journey. This song is pretty much a perfect combination of compositional variety, exceptional instrumental prowess, and a cohesion matched by very few progressive rock/metal bands even today.So what do I think overall? Get this. I don't care how you get it, just do. It's one of the best progressive rock albums of all time, if not one of the best rock albums in general; this record represents what music is all about, and only in 36 minutes. Very impressive."
    },
    {
      "reviewer": "Modrigue",
      "date": "Posted Wednesday, June 22, 2016",
      "rating": 4,
      "text": "Beyond the black hole4.5 starsOften referred as one of RUSH's best albums alongside \"2112\" and \"Moving Pictures\", \"Hemispheres\" extends the musical approach and story developed on \"A Farewell To Kings\". Still consisting in sophisticated changing tracks, uncommon time signatures and complex rhythms with fantasy / sci-fi lyrics, the musicians develop their neo- hard/heavy progressive identity they've been crafting in their two previous opuses. Unlike its 1977 predecessor, there are no filler songs here, the quality and inspiration remain constant this time.The story of \"Cygnus X-1 Book Two\" begins where the first book stopped. Initially describing the descent into a black hole, the second book explores what's beyond this spatial singularity and the possible conflicts between the two cerebral hemispheres, by mixing Greek mythology and philosophy. This 20 minutes epic is in the same neo-heavy- prog vein as the suites from RUSH's two previous albums. It alternates soft, calm and rocking passages but is a bit lengthy. Nice, although not as dark and epic as \"Book One\" or as remarkable as \"2112\".\"Circumstances\" is a powerful heavy rock in the style of \"Something for Nothing\" from \"2112\". Geddy Lee even sings a part of the lyrics in French: \"Plus �a change, plus c'est la m�me chose\". It rocks! \"The Trees\" is social fable narrating the battle between two tree species, the oaks overshadowing the maples. At the end, Man comes to cut all trees down, making them equal in death. This song includes nature and bird sounds and features acoustic and nervous changing passages. Another very good track. However, the genuine highlight of the record is clearly the great mini-epic \"La Villa Strangiato\", RUSH's best instrumental with \"YYZ\". Here, all musicians deploys their talents and personality through multiple soli showing their virtuosity at their respective instruments, supported by complex rhythm structures. The music itself offers a wide range of various ambiances: Spanish, trippy, beautiful, hard rock, heroic, and even prog metal and little jazzy moments. Original and mindblowing, this composition alone justifies the listen!Apart from \"Cygnus X-1 Book Two\" which may be a little repetitive and not as inspired as the other songs, the overall quality of the disc is much more constant than its predecessor's. Unique at the time, the Canadians develop their identity and still manage to bring something new to the progressive world in the late 70's during the punk revolution, when the British elders were rather getting away from it. No other band was offering such neo-heavy- prog at the time. No wonder they strongly influenced DREAM THEATER.\"Hemispheres\" is indeed one of RUSH's best albums, maybe the most progressive in terms of structure. Highly recommended!This sixth studio release is also their last opus to contain 20 minutes suites. The musicians were beginning to find the long epics songwriting too stressful. After this one, the Canadians' music will become a little more accessible, but this does not necessarily means a loss of quality or interest..."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Saturday, May 30, 2020",
      "rating": 5,
      "text": "Hemispheres is the second album of the second stage of Rush, in which the increasingly intense and complex use of nuances and sounds, the result of the incorporation of more musical instruments (synthesizers, pedals, and percussion elements) shows us a band consolidated in its most progressive aspect.The album starts off great with Cygnus X-1 Book II Hemispheres, a continuation of Cygnus 1, the ending song for A Farewell To King. In its 18 minutes we have a very intense development, a spatial and atmospheric suite, in which the god Cygnus X-1, turned into a divinity that balances the friction of the rational part with the affective part, represented by the gods Apollo and Dionysus . In the style of 2112, combining moments of tense tranquility and moments of intense rhythms and dramatic evolutions, it is a theme that is among the best of his repertoire, and one of his latest extensive compositions. The entire suite completely encompasses side A of the album.Circumstances, starting the B-side, is inspired by the time when Neil Peart lived in his 20s in the British Isles, it is a beautiful song of less than 4 minutes and the shortest of the album, followed by The Trees, a critic where Neil Peart reflects, although he has always denied that it has any particular political connotation, aspects of human reality, of the complex and the constant struggle between its different social structures with a simple and fabled example of nature, using the trees of maple and oak. An excellent song and constant and highly acclaimed presence in their live shows.The album closes in a spectacular way with Villa Strangiato, and its more than 9 minutes, an instrumental composition that combines a number of styles and musical influences, all linked by the progressive thread, where both Lee, Lifeson and Peart show off of their enormous qualities as musicians. An essential song in the group's catalog.Hemispheres, in summary, places Rush as one of the most representative bands of the genre, which without leaving its very rocky initial roots, quite the contrary, they add it and complement it very well by adding a greater range of musical textures. Excellent album."
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Thursday, September 30, 2021",
      "rating": 3,
      "text": "This album is considered a great masterpiece here in Progarchives. Currently it holds the twentieth position of the best prog album ever. I explain to you my opinion about it.Side A: 1. Cygnus X-1 Book II Hemispheres (18:04) : - i. Prelude (4:27) - ii. Apollo / III Dionysus (4:36) - iv. Armageddon (2:55) - v. Cygnus (5:01) - vi. The Sphere (1:02) Cygnus X-1 Book II is not a real suite. The Prelude is a single piece, it consists of a largely instrumental rock piece with great rhythm guitar work, but the piece doesn't take off, and the vocals come in late. Interlocutory beginning, then another rock piece (similar to the previous one) starts with a beautiful acid guitar solo but with the same sustained pace, full of (boring) stop and go. The third movement starts at the ninth minute with a change of rhythm, but then comes back to be similar to the firsts two. It all seems like a long, exhausting ride, always the same. Then around 12 minutes, when the music seems to wrap around itself, the music stops to give space to the synths. There is the suspended piece, cinematic, evocative, which constitutes a nice break. At about 14.40 the rock music starts again, it changes pace at 16 minutes, and it ends at the 17th minute. The last minute begins with the vocals by Lee accompanied by the acoustic guitar.This suite, which excludes the initial 4 and a half minutes rock and the last acoustic minute, is very tiring and largely monotonous. There is a lot of effort but little inspiration for such a long piece. In fact, the first 12 minutes feel like a grueling ride almost all the same. Then it gets better, but too little too late to become a memorable piece. Total rating 7+.Side B: 2. Circumstances (3:40). Second side opens with a conventional rock-song verse-chorus-verse-chorus, with an instrumental interlude with the keyboards. Rating: 7,5.3. The Trees (4:42): it's a song that begins with acoustic guitar, but the transition to rock takes place without any gradualness and coherence, simply after the acoustic piece comes the electric piece with Lee's voice, then the usual instrumental interlude with the synths and the bass. Then, a Lifeson's solo and vocals again. Rush still fails to delineate elaborate suites or songs with coherent atmospheric passages - they simply layer acoustic pieces over electric pieces and fast beats to slow beats. This however is a good piece, so I rate 7.5 / 8.4. La Villa Strangiato (9:35): is a nine and a half minute instrumental piece that begins with a flamenco style acoustic guitar and then, with a musical progression, becomes electric and bold, led by an electric guitar riff. At about three and a half minutes it slows down, and Peart takes the opportunity to play jazz style while Lifeson's guitar does some notable decorations: this interlude is the best of the whole album. At about 6 minutes the main riff resumes, and the players take advantage of it for solos, first the bass played by Lee, then the drums. At about 7 and a half minutes the piece have said everything it needed to say but it continues for another two minutes, accelerating the pace and becoming more frantic. It is by far the album's masterpiece and generally one of the best pieces in the entire Rush discography. Rated 8.5.Second side quality: rating 8.The second side is better than the first, and gets better from song to song. The first side suite is not entirely convincing. Overall the album is compact and settles on a decent or good musical quality, reaching its peak in the last song.Rating: 7,5/8. Three Stars."
    },
    {
      "reviewer": "The Crow",
      "date": "Posted Monday, November 7, 2022",
      "rating": 4,
      "text": "\"Hemispheres\" kicked off the trilogy of records that made Rush the fittest progressive rock band of the late '70s, later completed by the equally excellent \"Permanent Waves\" and \"Moving Pictures.\"However, this \"Hemispheres\" had not yet undergone the sound modernization that the band developed in \"Permanent Waves\", so we have Geddy singing with an extremely high-pitched voice, and a very seventies sound in general.However, on a compositional and instrumental level the album is almost flawless, with very few weak points, and as such it receives the excellent score it deserves.Best Tracks: as always happened in the 70's before \"Permanent Waves\", the longer tracks are also the best. So Cygnus X-1 and specially La Villa Strangiato, are the album's most brilliant tracks. But I have to say that I also love the intricate instrumental part of The Trees, being Circumstances the weakest point in \"Hemispheres\".My Rating: ****"
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Wednesday, March 13, 2024",
      "rating": 5,
      "text": "Review N� 756\"Hemispheres\" is the sixth studio album of Rush and that was released in 1978. The album continues the band's explorations of their musical style and sounds and marks the peak of what I consider to be Rush's golden musical age, the years between 1976 and 1981. \"Hemispheres\" represents the second studio album of the band that belongs to their second musical phase. It comprises also their fifth studio album \"A Farewell To Kings\" released in 1977, their seventh studio album \"Permanent Waves\" released in 1980 and their eighth studio album \"Moving Pictures\" released in 1981.The album contains examples of Rush's adherence to the progressive rock standards including the use of epic, multi movement song structures, complex rhythms and time signatures and flexible guitar solos. This is easily Rush's finest work. Four songs, which each of them rock in their own special little way and where each individual member is at his instrumental peak. \"Hemispheres\" is one of those albums that embody everything great about its constituent genre.The line up on the album is Geddy Lee (lead vocals, bass guitar, Oberheim polyphonic, Mini Moog and Moog Taurus bass pedals), Alex Lifeson (electric and acoustic guitars, classical guitar, guitar synthesizer and Moog Taurus pedals) and Neil Pearl (drums, orchestral bells, bell tree, timpani, gong, cowbells, temple blocks, wind chimes and crotales).So, \"Hemispheres\" has four tracks. All lyrics were written by Neil Pearl and all music was written by Geddy Lee and Alex Lifeson except \"La Villa Strangiato\" which was written by Lee, Lifeson and Pearl. The first track \" Cygnus X-1 Book II: Hemispheres\" is divided into six parts, \"Prelude\", \"Apollo (Bringer Of Wisdom)\", \"Dionysus (Bringer Of Love)\", \"Armageddon (The Battle Of Heart And Mind)\", \"Cygnus (Bringer Of Balance)\" and \"The Sphere (A Kind Of Dream)\". It kicks off the continuation of the \"Cygnus X-1\" story, the part one of which was the ending to their previous studio album \"A Farewell To Kings\". It combines the structure and themes of a Grecian tragedy with the elements of science fiction. \"Hemispheres\" continues the journey of the hero from the last album, wherein the science fiction tale describes his ships journey too and the subsequent destruction by a black hole in the Cygnus constellation. Now we pick up the tail, as a fantasy, where the hero arriving formless onto a land locked in an ancient civil war. One fiction is Apollo, representing logic, and while the other is Dionysus, representing love, and one of each forming in the great conflict a hemisphere, representing modern conventions on right and left hemispheres of our brain functions. Musically, the song is also amazing with about eighteen minutes. It's a truly wonderful epic song. It has multiple time signature changes, beautiful guitar solos and Geddy Lee gives one of his greatest vocal performances in his entire musical career. This is a very solid track with its mellowed out progressive rock innovative and magnificent. The second track \"Circumstances\" is the shortest song on the album and compared with the others three it's merely good, despite still is a great song too. At a first glance it's a straightforward rock song, but some of Lifeson's unusual rhythm guitar plating and some superb bass playing by Lee give to it something extra and really good. The third track \"The Trees\" is a great track musically and lyrically. The lyrics are about a disagreement between two types of trees in a forest. Contrary to the heavy opening of \"Circumstances\", \"The Trees\" starts off very gently with acoustic guitar and Lee singing over a nice bass line. The music starts building up in volume and the final result is a great Rush's song. The fourth and last track \"La Villa Strangiato\" is an instrumental track, the first by Rush, and represents probably the most complex composition by them. Like \"Hemispheres\", \"La Villa Strangiato\" achieves a brilliant balance of complexity and accessibility. The melodies are highly emotive while the endless array of changes in tempo, timbre and rhythm are totally dizzying, really. The final four minutes are especially staggering. \"La Villa Strangiato\" finishes the album with a flurry of drums and bass. For me, this is the best instrumental of Rush. With this track Rush close this album in a perfect and irresistible way, undoubtedly.Conclusion: Unfortunately, \"Hemispheres\" became the last Rush's studio album with lengthy pieces of music. In the 2010 documentary film \"Rush: Beyond The Lighted Stage\", the band members commented that the stress of recording \"Hemispheres\" was a major factor in their decision to start moving away from musical suites with long format in their song writing. The change in philosophy would manifest itself in the band's next studio album, the considerably more accessible \"Permanent Waves\". Honestly, I deeply regret that their decision. \"Hemispheres\" is an album that combines perfectly well the best elements of Rush in a perfect blend. I'm talking about the power rock that featured a lot on their previous studio albums and the use of synthesizers that would increase more and more in their later studio albums. On \"Hemispheres\", the power rock still adventurous and strong and synthesizers add to the album a little extra, while still used sparingly. All these things make of \"Hemispheres\" as one of the best studio progressive rock albums ever made.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "A Crimson Mellotron",
      "date": "Posted Thursday, January 23, 2025",
      "rating": 5,
      "text": "Not an exercise in self-indulgence but an album full of great and complex arrangements, solid writing, a few menacing riffs and an inspired, thumping sound that eludes the glory of the early 70s hard rock and metal scene, intertwined with the complexity and pretention of prog rock - this is what you get with Rush's 'Hemispheres', the second album the band recorded in the UK and one of the shortest prog LPs you might ever find. Taking up the formula of '2112' to an extent, the band's sixth studio offering features a side-long epic on side one, and three more tracks on side two. The epic is of course the majestic second part (or book) of the 'Cygnus X-1' opus introduced on 'A Farewell to Kings'. This 18-minute title track is a perfect example of prime Rush songwriting and tight playing, arranged in seven sections that deal with complex themes including the Apollo-Dionysus antithesis as well as societal collapse. Consistent and confident, we have an epic that is both musically and emotionally rich and perhaps overshadows '2112' in terms of overall sound and presentation.The second side of 'Hemispheres' opens up with a classic Rush track - 'Circumstances', which is also the most conventional song on the album. This one has a trademark, hard-hitting, lush riff from Lifeson and bolsters some of the strongest Geddy Lee vocals on a Rush record. 'The Trees' is probably the odd one out, a slightly more pastoral, quirky piece that deals with a very abstract (and even trippy) story, not the best offering by the band but a song that gets progressively better as it reaches its second half. And finally, there is the classic 10-minute instrumental 'La Villa Strangiato'; this is a bombastic entry and an overly impressive effort by Rush. Despite its title, this track is one of the most consistently excellent pieces of music on any Rush album, a tense piece that keeps you aware at all times. 'Hemispheres' is a classic and a mandatory listen, and while it might not be entirely perfect, it is imperfectly pristine, gripping, and impressive."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album86af.html",
  "last_parsed": "2025-05-18T12:31:54.854184"
}