{
  "local_path": "C:\\Users\\salmo\\Documents\\GitHub\\AlbumExplore\\ProgArchives Data\\Website\\ProgArchives\\www.progarchives.com\\artist8c00.html",
  "name": "VAN DER GRAAF GENERATOR",
  "genre": "Eclectic Prog",
  "country": "United Kingdom",
  "biography": "Formed in 1967 in Manchester, UK - Hiatus from 1972 to 1975 - Disbanded in 1978 -  Reunited in 2004\n\nVAN DER GRAAF GENERATOR is an English eclectic progressive rock band with front man\n\nPeter HAMMILL\n\nfrom 'the classic period' that has proven be one of the most important bands of the progressive genre.\n\nIn England, 1967 Chris Judge SMITH formed 'VAN DER GRAAF GENERATOR', but after his departure it was up to Peter HAMMILL (vocals, keyboards, guitar), Hugh BANTON (organ, bass on organ), David JACKSON (sax, flute) and Guy EVANS (drums) to become one of progressive rock most proliferate and unique bands as well as the first band to be signed to the Famous Charisma Label. The band was named after the scientific instrument 'the Van de Graaff generator', which is used for accumulating high voltage bolts. VAN DER GRAAF GENERATOR (VdGG for short) is known for its extrovert dynamics (ranging from slow, calm & peaceful to fierce & heavy), its intense and emotional 'love it or hate it' vocals by Peter HAMMILL, its celebrated contribution to extended progressive songwriting and its combination of psychedelic, jazz, classical and avant-garde or even acid influences. Moreover, VdGG can be seen as the first band that was to combine the very progressive with the very personal, whereas other bands used to work with abstractions and fantasy. Peter HAMMILL has a talent for singing out intense graving, anger, panic and confusion whilst still being able to sing warm and caring in other passages. The band never really fitted in the symphonic progressive rock subgenre because of its widespread influences and unique style, though the band would have symphonic leanings throughout it's career. Unusual for the time was the focus on organ, drums and sax, whereas in the sixties the guitar and the bass guitar had played a major role.\n\nThe band had a leading role in the very first progressive phase releasing high-rated albums from 1970 to 1975. The strong conceptual 'H to He Who am the only one' (1970), the intense and highly innovative and daring 'Pawn Hearts' (1971), the bleak and ever evolving 'Godbluff' (1975) and the matured 'Still Life' (1976) are often cited as masterpieces of the progressive genre. Alongside VdGG there would be a very interesting solo-career for Peter HAMMILL who frequently invited members of the band to come and join on his seventies recordings, some of which are seen as 'lost VdGG albums'. VdGG would directly influence a lot of Italian progressive acts, a country in which they were particularly well received. The band stopped performing in its classic line-up after 1976, not to return until 2005.\n\nThe first VdGG album (though without David JACKSON) 'The Aerosol Grey Machine' was actually intended to be the first Peter HAMMILL album, but was recorded under the VdGG flag due to contractual constrictions. Only the last song 'Octopus' would feature what fans think of as 'the VdGG sound' whereas most of material could be perceived as late-coming sixties psych with some progressive and even proto-metal (due to the heavy bass riffs by Keith ELLIS) leanings. The album was recorded in two days and didn't sound very professional, but listened to as a sixties psychedelic rock record it stands quite well.\n\nIn 1970 the band released 'The Least We Can Do Is Wave To Each Other' which introduced the VdGG sound with intellectual songwriting, lot's of slightly distorted organs and intense dark passages. Moreover, wind-player David JACKSON would join in to complete band with his double sax playing. At this time the band would gather itself a cult-following, though significant commercial success would never be reached in England.\n\nThe second 1970 release, the strangely named 'H To He Who Am The Only One' (the first words referring to the chemical reaction in the sun) would show the band having grown towards brilliance with the best of lyrics about troubling solitude by Peter HAMMILL and great epic songwriting in 'The Emperor in his War Room' and the celebrated 'Pioneers over C'. The latter would take visual and philosophical songwriting to a new level. In the studio King Crimson front-man Robert FRIPP would join to add some guitars to the mix. Due to the departure of Nic POTTER the bass would be played by organ-player Hugh BANTON for halve of the album and on tour.\n\nIn 1971 the band would return with an even more daring and adventurous recording, the much anticipated and revered 'Pawn Hearts'. Psychedelic darkness was taken to the maximum with not a single passage left untouched by inspired heavy progression. This would make the album both a favourite and one of the less liked classics of the progressive genre. The album would feature the 23 minute epic 'A Plague Of Lighthouse Keepers'. After this album Peter HAMMILL would focus on his solo-career releasing 'Chameleon In the Shadow Of The Night' (1973), 'The Silent Corner And The Empty Stage' (1974) and 'In Camara' (1974) with much participation of other VdGG members. These albums are considered to be great progressive records by most fans of VdGG. The VdGG recordings that were made during these years would be released as 'Time Vaults' (1982).\n\nThe year 1975 would bring us the return of VdGG with the classic 'Godbluff' that would have four ten-minute long epics showing a complex, but less freely psychedelic VdGG. The instrumental and lyrical development of these four songs is phenomenal and the before-mentioned dynamic range of the band was stretched to the maximum. After that the band was quick to record 'Still Life' (1976) on which the band's sound matured with a more solid production. In 1976 the band would also record 'World Record' which is often seen as a regression with three less progressive tracks on side one and a strong epic 'Meurglys III, The Songwriter's Guild' that was plagued by a long aimless jam-session towards the end. Later this year Hugh BANTON quit VdGG and he was soon to be followed by David JACKSON, because of the problematic financial situation of the band.\n\nIn 1977 the band was revived with the return of\n\nNic POTTER\n\non bass and the addition of Graham SMITH on the violin. 'The Quet Zone', otherwise known as 'The Pleasure Dome' showed a different band with a different sound. In 1978 the band's first live album was released, the double lp 'Vital' with David JACKSON appearing as a guest musician and the addition of Charles DICKIE on cello and synth. Due to a different line-up and a different zeitgeist (the rise of punk) the sound would again differ from the classic VdGG sound, which would have a distinctive effect on most songs. After this Peter HAMMILL would once again focus on his solo-career.\n\nThe return of the Generator with the classic line-up would be a main event of 2005 for the progressive community with the well received 'Present' (2005) and the celebrated 'Real Time' live-album which would feature great live-recordings of most of the bands progressive classics. The first concert in the Royal Festival Hall in London (where 'Real Time' was recorded) would be visited by fans from 32 countries with black-market tickets rising to a staggering 1000 dollars on Ebay. After the departure of David JACKSON they would record 'Trisector' in 2008 and 'A Grounding In Numbers' in 2011. In 2012 the band is releasing yet another new album as a trio, 'ALT'.\n\nRetrospection. VAN DER GRAAF GENERATOR has always remained too small to be a widely recognized act (like for instance Genesis or Yes), yet it was too big to get an illustrious title as ' underground band'. The band acquired some devoted following over the years and is nowadays considered to be one of the biggest acts of progressive rock history, as the amount of reviews and debates on PA can underline. For lot of us their music has proven to be very hard to get into, but it is even harder to live without it once you've acquired a taste for the band. The way the band combines the very personal with the abstract sound of progression creates a fascination that lives on and the way Peter HAMMILL puts his soul in the music seems to be untouchable for other musicians.\n\nBio by friso\n\nSee also:\n\n-\n\nTHE LONG HELLO",
  "albums": [
    {
      "title": "Godbluff",
      "local_path": "album53f2.html",
      "year": 1975,
      "rating": 4.46,
      "type": "Studio Album"
    },
    {
      "title": "Still Life",
      "local_path": "album383d.html",
      "year": 1976,
      "rating": 4.3,
      "type": "Studio Album"
    },
    {
      "title": "World Record",
      "local_path": "album7193.html",
      "year": 1976,
      "rating": 3.83,
      "type": "Studio Album"
    },
    {
      "title": "The Quiet Zone / The Pleasure Dome",
      "local_path": "album7b74.html",
      "year": 1977,
      "rating": 3.63,
      "type": "Studio Album"
    },
    {
      "title": "Present",
      "local_path": "albumbf9d-2.html",
      "year": 2005,
      "rating": 3.63,
      "type": "Studio Album"
    },
    {
      "title": "Trisector",
      "local_path": "album9795.html",
      "year": 2008,
      "rating": 3.51,
      "type": "Studio Album"
    },
    {
      "title": "A Grounding In Numbers",
      "local_path": "albumf3c9.html",
      "year": 2011,
      "rating": 3.47,
      "type": "Studio Album"
    },
    {
      "title": "ALT",
      "local_path": "album466f.html",
      "year": 2012,
      "rating": 2.55,
      "type": "Studio Album"
    },
    {
      "title": "Do Not Disturb",
      "local_path": "albumc4a4.html",
      "year": 2016,
      "rating": 3.57,
      "type": "Studio Album"
    },
    {
      "title": "Recorded Live in Concert at Metropolis Studios, London",
      "local_path": "album231e.html",
      "year": 2012,
      "rating": 3.67,
      "type": "Live Album"
    },
    {
      "title": "Merlin Atmos",
      "local_path": "album73eb.html",
      "year": 2015,
      "rating": 3.9,
      "type": "Live Album"
    },
    {
      "title": "After the Flood: At the BBC 1968-1977",
      "local_path": "album4dc3.html",
      "year": 1968,
      "rating": 4.14,
      "type": "Live Album"
    },
    {
      "title": "Godbluff Live",
      "local_path": "albumbc37.html",
      "year": 2017,
      "rating": 4.2,
      "type": "Live Album"
    },
    {
      "title": "Live at Rockpalast - Leverkusen 2005",
      "local_path": "album6c13.html",
      "year": 2005,
      "rating": 4.17,
      "type": "Live Album"
    },
    {
      "title": "The Bath Forum Concert",
      "local_path": "albumd68a.html",
      "year": 2023,
      "rating": 3.97,
      "type": "Live Album"
    },
    {
      "title": "Live at the Paradiso",
      "local_path": "albume595-2.html",
      "year": 2009,
      "rating": 4.0,
      "type": "Video/DVD"
    },
    {
      "title": "Live at Metropolis Studios",
      "local_path": "albumf516.html",
      "year": 2011,
      "rating": 4.53,
      "type": "Video/DVD"
    },
    {
      "title": "First Generation (Scenes from 1969-1971)",
      "local_path": "album60f4.html",
      "year": 1969,
      "rating": 3.45,
      "type": "Compilation"
    },
    {
      "title": "Second Generation (Scenes from 1975-1977)",
      "local_path": "album818e.html",
      "year": 1975,
      "rating": 3.39,
      "type": "Compilation"
    },
    {
      "title": "Now And Then (Van Der Graaf Generator / Jackson, Banton, Evans)",
      "local_path": "album0cff-2.html",
      "year": 1988,
      "rating": 2.13,
      "type": "Compilation"
    },
    {
      "title": "I Prophesy Disaster",
      "local_path": "album7215.html",
      "year": 1993,
      "rating": 3.33,
      "type": "Compilation"
    },
    {
      "title": "The Masters",
      "local_path": "album17f6.html",
      "year": 1998,
      "rating": 1.72,
      "type": "Compilation"
    },
    {
      "title": "The Box",
      "local_path": "album1ca3.html",
      "year": 2000,
      "rating": 3.94,
      "type": "Compilation"
    },
    {
      "title": "An Introduction (from the Least to the Quiet Zone)",
      "local_path": "album1f0f.html",
      "year": 2000,
      "rating": 3.33,
      "type": "Compilation"
    },
    {
      "title": "First Generation / Godbluff",
      "local_path": "albumbe0f.html",
      "year": 2012,
      "rating": 3.41,
      "type": "Compilation"
    },
    {
      "title": "The Charisma Years 1970-1978",
      "local_path": "albumffd2.html",
      "year": 1970,
      "rating": 4.82,
      "type": "Compilation"
    },
    {
      "title": "Interference Patterns - The Recordings 2005-2016",
      "local_path": "albumc7b9.html",
      "year": 2005,
      "rating": 4.1,
      "type": "Compilation"
    },
    {
      "title": "Masks Pt. 1 & 2",
      "local_path": "albumcfbd.html",
      "year": 1976,
      "rating": 3.73,
      "type": "EP/Single"
    },
    {
      "title": "Wondering",
      "local_path": "album90cd.html",
      "year": 1976,
      "rating": 4.33,
      "type": "EP/Single"
    },
    {
      "title": "Cat's Eye",
      "local_path": "album793c.html",
      "year": 1977,
      "rating": 4.27,
      "type": "EP/Single"
    },
    {
      "title": "Highly Strung / Elsewhere",
      "local_path": "albumb9c3.html",
      "year": 2011,
      "rating": 2.38,
      "type": "EP/Single"
    }
  ],
  "scraped_at": "2025-05-18T11:11:56.903264"
}