{
  "album_title": "FREE HAND",
  "artist_name": "Gentle Giant",
  "artist_page_link_local": "artist5cee.html?id=118",
  "year": 1975,
  "rating_value": 4.3,
  "rating_count": null,
  "review_count": null,
  "genre": "Eclectic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/118/cover_36261617102008.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Just the Same",
      "duration": "5:34",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "On Reflection",
      "duration": "5:41",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Free Hand",
      "duration": "6:14",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Time to Kill",
      "duration": "5:08",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "His Last Voyage",
      "duration": "6:27",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Talybont",
      "duration": "2:43",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Mobile",
      "duration": "5:05",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Just the Same (live) (4:50) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "* Recorded on July 3rd 1976 at Calderone Theater Hempstead, NY - previously unreleased",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "1976 Intro Tape (previously unreleased)",
      "duration": "1:39",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Just the Same (BBC session John Peel)",
      "duration": "6:05",
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "Free Hand (BBC session John Peel)",
      "duration": "6:08",
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "On Reflection (BBC session John Peel)",
      "duration": "5:42",
      "is_sub_track": false
    },
    {
      "number": 12,
      "title": "Give It Back (international 7\" mix)",
      "duration": "3:48",
      "is_sub_track": false
    },
    {
      "number": 13,
      "title": "I Lost My Head (7\" mix)",
      "duration": "3:29",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Peter",
      "date": "Posted Sunday, January 4, 2004",
      "rating": 5,
      "text": "Admittedly, many prog rock fans with otherwise excellent taste in music find Gentle Giant rather hard to get into. Their music certainly is challenging, and very varied in flavour. At times it evokes Medieval music, at other times there are a cappella vocals delivered in a quasi-\"round\" format, in company with passages that veer from moments of delicate beauty to \"rocking out.\" All of these musical paths, and more, are often explored within the space of a single song. (Of course, that could be part of a generic description of progressive rock.) Gentle Giant have an inimitable style that is difficult to categorize; they must be heard to be understood. Perhaps only those with the most open musical minds will find them at all accessible. Certainly, though major players of the 70s prog scene, \"Giant\" never fully rose above their cult status to approach the popularity and critical acclaim of contemporaries like Genesis, Yes, ELP, Pink Floyd or Jethro Tull. (Though Gentle Giant don't really sound like any of those heavyweights, their music bears a somewhat closer resemblance to that of 'Tull, than any of the others mentioned.)As I observed, Gentle Giant are not exactly the most approachable band in the prog universe; their music tends to invoke extreme love or hate reactions from first-time listeners. With that caveat out of the way, I would urge those who are curious about the band, or simply those who are in search of \"something completely different,\" to start with this excellent recording. \"Free Hand\" encapsulates Gentle Giant's sound at the top of its form. It is not as \"difficult\" as \"The Power and the Glory\" (its excellent predecessor) or \"Interview\" (its good, but uneven successor), nor as commercial as later efforts.The overall sound of the disc (if G.G. can be said to have an \"overall\" sound) is driven by keyboards, electric guitar, violin, and the unique \"vocal stylings\" of lead singer Derek Shulman and company.The album, fittingly enough for this mold-breaking group, is loosely written around the theme of individual choice and freedom. The songs are all very good, but, to my taste, the title track, \"His Last Voyage\" and \"Time to Kill\" are particularly effective. (I still get a kick out of the sound of the \"Pong\" game at the beginning of the latter track: if, like me, you can remember when Pong was a cutting-edge video game -- indeed, the ONLY video game -- then you're showing your age....) Highly recommended to fans, and to those with sufficiently eclectic and diverse tastes to \"get it.\""
    },
    {
      "reviewer": "corbet",
      "date": "Posted Saturday, January 17, 2004",
      "rating": 5,
      "text": "Even though In A Glass House is acknowledged by many as Gentle Giant's \"best\" album, Free Hand is without a doubt my personal favorite. Which is of course to say that it is one of my top 2 or 3 most treasured albums of all time. Simultaneously their most dense, complex, mechanically flawless album AND their most melodic, beautiful and accessible -- Free Hand thus represents a magical occurrence in their catalog like none other. Let's see, for starters, \"On Reflection\" is hands-down the most complex vocal arrangement in all of rock music, bringing Kerry Minnear's choral writing to its absolute pinnacle of genius. Some people may construe this as \"too technical\" but I simply shake my head at them in disbelief; this is one of the most achingly beautiful songs they ever recorded, and when the \"fugal jam\" kicks in at the end, I can hardly keep my head from exploding with joy. If that's not enough already, next comes chugging in the title track \"Free Hand\". At this point, my head goes and explodes. \"Free Hand\" is the most mind-blowingly perfect musical machine Gentle Giant ever constructed, filled with ticking clockwork keyboard figures and interweaving guitar and bass parts and skwonking piano chords and start-stop time changes and, and... three words: pure musical perfection. Then there's \"His Last Voyage\", which has at times been my favorite song ever written. I don't know where those melodies and sounds and voices came from, but they existed before time and they call me back to some distant memory that leaves me filled with joy and reverence for the sublime power of music. Thank you, Gentle Giant. So here I've just described three songs, but the remaining four are each in their own way a magical experience, with \"Time to Kill\" and \"Just the Same\" taking top billing. If you have any respect for the sincere blessings of this devout music fan, go do yourself a big favor and buy this album and listen to it for the first time. Or, pull it out of your record collection and listen to it again as if for the first time. One of the peak musical achievements our times have witnessed."
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Tuesday, February 24, 2004",
      "rating": 3,
      "text": "3,5 stars really!!Out of the whole of GG's discography Free Hand was the album that sold most (even reached chart position 26 in the UK), the band reaching even some kind of success across the pond by touring extensively the new world (and having great success in Quebec even headlining the sold-out Montreal Forum), but mistakes would again be done by forgetting to tour UK (and even cancelling a tour for no apparent valid reasons) following the commercial success.However, this album is aiming even further at distancing themselves from their earlier more acoustic material, the only thing being acoustic on this album are the sax, cello and violin (when they are used), but this is really noticeable in an overview of the few albums of the mid-70's. The other major but minor complaint I have about this album is the systematic and by now mechanical constant tempo changes sometimes clearly done for the sake of it than by necessity or artistic choices. Don't get me wrong, the general quality of the tracks are still your typically GG , but by now this being their seventh studio album , the formula is so well established that it now seems a bit exhausted and the inspiration borders on a business-as-usual impression that was already making itself felt by TP&TG album, but it is more distinct now!There are still some superb moments on the album such as the delightful last Voyage and Time To Kill, as well as the title track, but on the whole I end up relatively (slightly?) bored. I also realize that I represent a small minority among GG fans , especially given that I prefer the next album Interview."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Thursday, April 1, 2004",
      "rating": 4,
      "text": "Another winner!! OK there are some weaker breaks through,but nevertheless here you find some of their best moments of music invention. Of course regarding of the best vocal performance ever- \"On Reflection\" - an incredible polyphonic excursion by means of all the vocals (a beautiful modern \"Baroque\" game) the present album- as it contains moreover a perfect balance concerning the melodic lines- is memorable. Besides you find the excellent title track as well as fine solos at the keyboards: the music covers a lot of styles, including the Medieval music and to me that's enough to regard this one as an unforgettable number!!Highly recommended!!"
    },
    {
      "reviewer": "daveconn",
      "date": "Posted Tuesday, April 27, 2004",
      "rating": 4,
      "text": "While better known prog rock bands (ELP, KING CRIMSON, YES) were visibly running out of steam, GENTLE GIANT continued to stay on their original course, sharpening their skills and releasing consistently excellent albums quietly and (seemingly) effortlessly. As fans might expect, \"Free Hand\" is a further tightening up of the music found on their last album, \"The Power and The Glory\", leaving the concept behind and focusing on bright, medieval-tinged rock replete with the clever twists and tortuous passages that fans had come to expect. Whether you regard the band's music by now as idiomatic or merely formulaic, they bring the same skills to bear on every song, which prevents a \"hit\" or representative track from emerging but also provides uniform pleasure from end to end. The largely vocal exercise, \"On Reflection\", does stand out; the impassioned \"Free Hand\" and the languid \"The Last Voyage\" are impressive ends of the spectrum; even the instrumental \"Talybont\" has too much personality to be dismissed as a mere medieval interlude.\"Free Hand\" remains as concise a case for their talents as any album; Rolling Stone even rated it the band's best album (although their view of progressive rock came through a distorted lens). Apparently, the band liked the album enough to use it as a template for their next release, \"Interview\"."
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Tuesday, June 8, 2004",
      "rating": 5,
      "text": "'Free hand' is not only Gentle Giant's best known album, but also one of their definite masterpieces, as well as the perfect introduction for the newbie: some of the band's catchiest tunes are included here, yet the repertoire comprises the usual demanding level of clever complexity and undefatigable inventiveness. GG doesn't need to meander through long-side suites or three-part epics. These guys can handle tracks incapsulated under the 5-6 minute duration, and infuse them with genius and intensity; they use the structures of R'n'B ('Just the Same', 'Time to Kill'), jazz-rock ('Free Hand') and Celtic festival ('Mobile') and refurbish them through massive progressive reconstructions. Besides these pyrotechnical themes, there lie some others that are oriented toward more subtle realms: the Mediaeval vocal/instrumental polyphonics of 'On Reflection', the tender melancholy of 'His Last Voyage', and the high spirit of 'Talybont' show us that the gentle side of this Prog Giant is also filled with defiant sophistication. All these tracks (or at least, almost all of them) are highlights for their own merits. Yet, let me mention a few brilliant moments: the choral intro of 'On Reflection'; the recurring counterparts and countermelodies of the title track; the overall serenity of 'His Last Voyage' conveyed in both the vocal parts and the subdued guitar solo; the explosive wah-wah violin in 'Mobile'. Now, in general terms, Derek Shulman's voice works impressively as an integral part of GG's sound, and the ensemble's musicianship is technically superb as well as perfectly integrated. Kerry Minnear's keyboard's arsenal works as an \"orchestra\" in many occasions, and Weather's drumming exhibits an immaculate finesse that can't be properly grasped by words (or at least, this reviewer's words). I'll leave it to the listener to give their own verdict: mine is \"masterpiece/essential\"."
    },
    {
      "reviewer": "Man With Hat",
      "date": "Posted Wednesday, September 15, 2004",
      "rating": 5,
      "text": "4.5 stars would be more accurate. But, as with their previous albums, this is an excellent example of progressive rock and should be owned by prog fans.Coming off the highly successful The Power And The Glory, Free Hand takes a similar formula and take it off in a different direction. Slightly stripped down instrumentation, perhaps more traditionally rock, but no real loss of complexity or prog. The first three songs are all GG classics. On Reflection deserves special mention as being the one song I would recommend someone listen to if they really wanted to know what Gentle Giant were all about. All the trademarks are there, none of it feels rehashed or uninspired, and it's performed flawlessly. Talybont is the other real standout track with some incredible playing by Kenny M. A truly modern day medieval classic. The other songs are not as good, but His Last Voyage is certainly true to form Gentle Giant. Time To Kill is a fun little rocker, and Mobile, is probably the least successful song on the album, which is unfortunately being it's the closer, but it doesn't diminish what proceeded it.All in all, this is a top notch album from a top notch prog band. This is the last studio album I'd give a 5 star rating to (even though Interview is excellent in it's own right) and in many people's eyes the last true classic from The Boys In The Band. I don't know if I agree with that exactly, but I do agree that this is an album that if you've been on PA for more than 3 months you need to have immediately. Highly recommended."
    },
    {
      "reviewer": "Bj-1",
      "date": "Posted Saturday, December 4, 2004",
      "rating": 4,
      "text": "After a very varied and hugely interesting series of albums so far 'Free Hand' sums it all up; the adventurousness of their first four combined with the rock solid complexety of 'In a Glass House' and 'Power and the Glory'. Oddly, this was one of the last GG albums I acquired from their golden period but also one of my most listened. It's arguably their most melodic album to date and the brilliant opening track \"Just the Same\" really gets you going the whole day and could be a potential prog single. \"On Reflection\" is the most memorable track here and in my opinion overshadowes \"Knots\" from 'Octopus' in the vocal arrangmements, lacking the avant-garde but is extremely effective in it's beautiness. The album somewhat looses focus on the second side but ends on a high note with the bouncy and medevial hard rocker \"Mobile\" that is reminiscent of Jethro Tull during their folk-rock phase at the end of the 70's. Comparing these two bands, it's no doubt that Ian Anderson and the Shulman brothers listened and learned alot from eachother.If you are unsure of where to start with this band, I think this one should do it. A full package of complexity, great hooks and lot's of listening pleasure. It looses it slightly at the end but those songs also are of a very high standard. 4.5/5"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Sunday, December 26, 2004",
      "rating": 5,
      "text": "Merry Christmas!Background-- In recent discussion with my prog guru: Andy Julias, prog music producer (Discus) and Chairman of IPS (Indonesian Progressive Society) I was amazed with the topic we discussed. It was about choir and vocal harmony in rock music. We discussed about many types of vocal harmony from groups like Yes, Gentle Giant, Queen and Hamadryad (Canada). What surprised me was the fact that Andy gave an example of Gentle Giant's \"On Reflection\" by really emulating it very close to the original tune. It really struck me. I know that one of Gentle Giant strength is in its vocal harmony besides its complex and avant garde composition. Then I realized that I have not reviewed this masterpiece album.Album Review.It has been a great challenge for me to review classic bands with a music of their own identity. The difficulties rely on what sort of benchmarks should I use for review as they were pioneers of the kind of music they played. Gentle Giant is no exception. Can you compare it withSpock's Beard? Definitely \"no\" as they live in different time. But, for sure , Spock's Beard was influenced by Gentle Giant. Even though the band disbanded in 1980 but the soul of their music is still around us nowadays.About this album, let me ask you: \"How prog are you?\" If you are a prog lover, this album is a must in your collection. If you are new to prog, you must buy this album. The band has inspired many bands on planet earth and no one has successfully similar to their original music. The music might be a bit complex at first listen but I'm sure it would grow significantly after 8 spins. But if you can enjoy the album before it reaches 8, you are blessed with good prog ears and you should continue your journey with all Gentle Giant's albums and other prog bands.\"Just The Same\" kicks off with a staggering piano solo and great voice line followed with an avant garde beat music. The music relatively discrete at the opening and it turns continuous at the interlude with sort of spacey keyboard. The solo keyboard is really amazing. The solo ends up with electric guitar rhythm and returns back to the original tagline melody. The harmony of keyboard and saxophone is intricate. It's a superb music!As I mentioned above \"On Reflection\" has a powerful choir / vocal harmony in a capella backed with some percussive and vibes during opening. This opening is really excellent! The choir is then continued with single voice line by Derek accompanied with discrete keyboard, violin and woodwind (flute) works. Some backing voice at the end of the bars accentuate the song. The keyboard sound augments the vocal line nicely. Dynamic drumming ends the song brilliantly. The compositional quality of this song is top notch even though it's complex in structure.\"Free Hand\" starts off with a harmonious work combining keyboard sounds and bass line. The rocking vocal enters the music in upbeat tempo with continuous music. The solo keyboard and bass performed excellently during quiet segment of the song. The interlude part indicates the complexity of Gentle Giant music. No matter complex the music is, the band has successfully maintained the intricate harmony of multi instruments used.The next track \"Time To Kill\" is even more rocking with its complex composition and dynamic rhythm and melody. The opening sound indicates a tidy harmony of bass, keyboard and guitar and a simple melody followed by a discrete guitar score. It flows with the music that brings vocal into main body. Some transitions have a quieter music with sort of discrete bass, keyboard, guitar and drums. Another excellent composition by the band.\"His Last Voyage\" opens with an avant garde mood using bass, vibes (played wonderfully) followed by acoustic guitar that accompanies voice line. There are some influence of jazz and classical music. The beginning of this song is performed in ambient style exploring jazzy bass and vibes with relatively slow tempo.. The music then flows continuously in the middle of the track by the appearance of drumming. Piano at background is played in jazz style. The solo guitar is really stunning - it continues with a complex organ sound until the music returns back to original rhythm and tagline melody. \"Talybont\" is short instrumental with keyboard / clavinet and woodwind dominate the scene accompanied with percussive and bass. The woodwind and clavinet sounds indicate a classical music influence. It also reminds me to Rick Van Der Linden'sTraceas they shared similar vein in this part.. \"Mobile\" combines acoustic guitar, keyboard, violin nicely during opening. Again, the band has proven their talents to compose this complex composition with perfect harmony. Each instrument seems to play different than the others but it still produce an excellent harmony.Conclusion: This is a masterpiece and a highly recommended album. All tracks stand-out firmly as original prog tunes. There is no such thing as mediocre track in this album. Rating: 5/5. GW, Indonesia."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Sunday, January 23, 2005",
      "rating": 4,
      "text": "Boy did I had a hard time to get this one. It seemed to slip through my littles fingers all those years. No beggie 'cause it's finally here, and I don't want to repeat myself but...this one's a keeper! I thought the Power and Glory format wasn't gonna last. I thought a much colder approach did not suit well the British Giant. But the same pattern's here and I must say that the departure of Phil Shulmann (my personnal favorite of the band) is not bothering me anymore. Okay, this pops and rocks harder but the keyboard work is less atmospheric and more rythmic, which is this case played by Minnear, is growing on me.Also the many more folkish stuff is pretty satisfying (Talybont, His Last Voyage). Gentle Giant always knew how to make super medieval songs without baloney. Since Raconteur Troubadour we haven't seen much of that style. Hurray for that!This is one is surprinsingly well done. Crisper and cleaner production; the band never sounded that tight since...ever. A logical following to Power and Glory, deeper in their new train of thought, without selling out or losing their core.This album has an obvious relent of screw-up love stories. Dereck signs some pretty honest stuff in the Free Hand track. Anger, bitterness or jalousy, whatever he lived through, the song is a solid kick in the crouch to the person concerned.Especially if you're a newbie, get this to get a good idea of the post Phil Shulmann period. Come join us, broken hearted and shout out loud: \" Who would believe me now that my hands are free? That my hands are FREE!! Nobody's listening to the things you say. t To the things you SAY!!\"That's what I call a successful mission."
    },
    {
      "reviewer": "greenback",
      "date": "Posted Thursday, February 10, 2005",
      "rating": 5,
      "text": "This is one of the best Gentle Giant album. Compared to the previous \"Power & glory\" album, \"Free hand\" is much better recorded and more addictive. Kerry Minnear uses sometimes more modern keyboards, often surprisingly floating, like on \"Just the same\" or \"Free hand\". He more than ever perfectly plays here delightful arrangements of piano, clavinet, Fender Rhohes, and organ. \"Free hand\" is an extremely structured album, complex with fresh & lively moods. \"On reflection\" is an outstanding exhibition of vocal synchronization in the form of a canon: no flaw noticed! John Weathers plays his percussion devices as often as his drums: the result is totally impressing, giving childish charm and enchantment to the ensemble. The bass is absolutely complex and not timid at all. The bass ABSOLUTELY participates to the infernal nervous communication between the keyboards and the electric guitar: it makes unbelievably complex and spectacularly synchronized patterns. The finesse of this album is legendary, also revealed by the miscellaneous tender lead & backing vocals, sometimes approaching Gregorian chants, like on \"His last voyage\". The ultimate tour the force is \"Talybont\", a joyful complex medieval track where harpsichord, wah wah guitars, flute, keyboards, bass and drums form a solid canon. It seems there is no violin, except on \"Mobile\", which sounds more rythmic prog hard rock, like on the previous albums.HIGHLY RECOMMENDED!"
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Sunday, May 22, 2005",
      "rating": 5,
      "text": "I was very impressed by my first outing with Gentle Giant. This album really is an impressive spectacle of sound. The musicianship is solid and tight, playing with incredible structure. The tracks are intricate and difficult muscially, but never get too out of hand. The vocals are sultry and insane at the same time. The lyrics range from great to insightful. This is an incredible album. The Avante-Garde and jazziness of the album is inescapable, and the sound is irresistable.The most notable tracks on the album are Just the Same, which begins effectively with finger snapping, which then leads into some simple piano from Minear, and slowly the rest of the group kicks into shape. Shulman's voice on this track and the rest of this album is among the best vocal performances I've ever heard. The piece concluded just as it began with finger snapping. My other favorite is Free Hand. This is one of the most complex songs on the album, but it is catchy and hooks you in from the moment Derek's voice comes in. The jazzy break down is also something only Gentle Giant can do.Overall, this is a fantastic album that should be in everyone's collection. The songs on this album are all solid, and are among the most adventurous things they've ever done. 5/5."
    },
    {
      "reviewer": "NetsNJFan",
      "date": "Posted Thursday, July 14, 2005",
      "rating": 5,
      "text": "4.5 Stars --- Gentle Giant's 1975 offering, FREE HAND shows a distinct step towards a harder rock sound after somewhat softer (more acoustic) previous efforts. This hard- rock and complex prog sound was a complete success on FREE HAND, and it marked Gentle Giant's commercial apex; FREE HAND reaching #48 in the USA. Artistically, this would also be their plateau, as they would follow with the excellent INTERVIEW (1976), before sliding into oblivion. Derek Shulman has never sounded more like a rock singer than hear, and his soul and R&B background give him extreme depth and power. His voice is utilized really well, as on the whole, the vocal harmonies are less complex on this album than other Gentle Giant efforts. The instrumentation is less adventurous on FREE HAND than say OCTOPUS or THREE FRIENDS, obviously going for more of a rock sound, but it loses none of the beloved complexity and depth of Gentle Giant's unique baroque-rock sound.The album opens extremely strongly with \"Just the Same\" with a simple piano pattern which builds up, slowly allowing other instruments to join in, before we are hit with the full force of Derek's voice. This is a great up tempo rocker with excellent and diverse keyboards from Kerry Minnear. The song degenerates into a Jazzy break (as only Gentle Giant can do) before returning to the original vocals. The song closes fingers snapping, just as it begun. This song is extremely catchy for prog, and will leave you with your fingers snapping as well. It makes an excellent opening, and also opens their landmark live album PLAYING THE FOOL (1976). The next piece (Gentle Giant composes and arranges pieces, they don't write songs) is \"On Reflection\". \"On Reflection\" is a trademark Gentle Giant vocal experiment in the vein of \"Knots\", but this time taking on the form of a medieval fugue in four parts. This is one of their most successful tracks with ultra complex, layered vocal harmonies, alternating between extremely jarring section and profoundly beautiful moments. Gentle Giant handles this song very professionally for such a complex structure. Not many (read: any) bands could pull this off other than GG. Side one closes with the excellent title track, \"Free Hand\". This is much in the vein of the opening \"Just the Same\" but is more complex. It is an incredibly tight and complex piece, and the band doesn't miss a note. Bass player Ray Shulman and drummer John weathers turn in especially good performances on the intricate instrumental middle section. While this song is prog to the complex max, it never loses its rock roots, and is very catchy and enjoyable.Side B kicks off with the rollicking \"Time to Kill\". This is closest the band comes to rock, but it still maintains their trademark 'sound', and is incredibly enjoyable. The backing vocals take over towards the end of the track, and makes for an incredible ending. The next track is one of the more beautiful Gentle Giant songs, it is an acoustic ballad (in the literary sense of the word) full of diverse instrumentation and delicate vocals. After some layered vocals by the band members, this song picks up pace, gaining momentum, ending in a soulful guitar solo by Gary Green, with a wonderful undercurrent of Kerry's piano running through almost unnoticed. After the previous five tracks (all essential GG) the album loses steam. \"Talybont\" is fun and short medieval style instrumental, and is almost reminiscent of Jethro Tull Focus, (especially Jan Akkerman solo) but features much more complex instrumentation. Throughout this song one can hear cymbals, flutes, , harpsichord, etc. The percussion is a highlight. This track was originally intended for a soundtrack to a Robin Hood movie which never materialized. This track is pretty and enjoyable, but not essential GG. The album closes with its weakest track (never a good idea), with \"Mobile\". This is another attempt at fusing hard rock with renaissance style instrumentation, and is less successful than other tracks. The violin by Ray Shulman is an especial highlight, but by this point, one feels they have heard this stuff before, \"Just the Same\" etc. The song is good, but Gentle Giant could do better, especially for a rather short album; 36 minutes.FREE HAND is a great album, and is one of Gentle Giant's most accessible. It marks a great place for newbies to the intricate renaissance-rock that is Gentle Giant. This is on of their most sonically unified albums, and easily earns a rating of 4.5 STARS. (It would be 5, but this is no OCTOPUS or IN A GLASS HOUSE, which are also highly recommended to those more familiar with GG's music)."
    },
    {
      "reviewer": "NJprogfan",
      "date": "Posted Tuesday, July 26, 2005",
      "rating": 5,
      "text": "Not much more to add with the above comments, only that it was the first album by GG that I bought after reading a review comparing them to Yes and Genesis. I remember being totally blown away. I never heard anything like them and they jumped to number one on my list of favorite bands. If you are new to them and want to explore their albums, by all means purchase this one first. It's their most accessable album with very beautiful synth runs by master Minnear, (title track, \"Freehand\"), great a cappella singing, (\"On Reflection\") and rocking tunes, (\"Just The Same\" & \"Mobile\"). Plus, with the 35th anniversary edition, gone is the flat sound. What you get is crystal clear production where every, and I mean every instrument is loud and clear. Just amazing! And on top of it all, a bonus live track from 1976 of \"Just The Same\". A perfect album from beginning to end. A five star masterpiece!"
    },
    {
      "reviewer": "Andrea Cortese",
      "date": "Posted Tuesday, August 2, 2005",
      "rating": 5,
      "text": "No many words to say on it: IMPREESSIVE, PURE MAGNIFICENCE!! Nothing's similar to this powerful, delicate and elaborate music, in the veins of which flows an important middle-age blood! I wonder why this excellent and unique band did'nt reached a more wider success! I'm breathless: GREAT, GREAT, GREAT, GREAT!!!!"
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Friday, August 12, 2005",
      "rating": 3,
      "text": "3 1/3 starsThis is the first album in which the band tried a more commercial approach and it worked. The result is an accessible, yet complex album that tries to keep little experimentation, and play the normal Gentle Giant Way.1. Just The Same : is the opener and is an avant-garde workout that is unusually easy to get into. There are piano/keyboard solos,and a saxophone joins in the piece. Very good. 7/102. On Reflection : This is the classic of Gentle Giant, but it is flawed in my opinion. The first minute is one of the best and most complex vocal harmony moments I have ever heard in progressive rock, but I dislike the 'all around all around all around' repetitive vocal part. the second half of the song is ballad-like and has gorgeous melodies. 7.5/103. Free Hand : Another classic of the band. This song shows how beautiful complex music can be, and this song is flawless. 8/104. Time To Kill : The weakest song of the album. It is a rocker that is a little incoherent and messy, but if you like ELP, you may like this. 4/105. His Last Voyage : an underrated mellow track with beautiful slow vocal harmonies. The guitar riff going in most of the song is delicate, and gives imagery of sailing on a boat. The bass riff in the beginning will grow on you, and the vocal driven middle section for me was likable at first listen. 8.5/106. Talybont : A short instrumental with keyboards, clavinet and woodwinds ... A nice track. 6/107. Mobile : a very dynamic closer that sounds more like music from Octopus. 5/10Just like Three Friends, this is a good way to begin your journey with Gentle Giant. It is not very hard to get into, and contains some of their best songs.My Grade : C+"
    },
    {
      "reviewer": "Philrod",
      "date": "Posted Friday, August 19, 2005",
      "rating": 4,
      "text": "Gentle Giant is a class act. Album after album, they deliver great songs and excellent compositions. Free Hand is no exception. It is even one of the finest they ever did. Following the biaised reception of The Power and the glory(most prog fans loved it, but critical reviwer tought of it as a letdown from the band), Free Hand was another step into a more medieval sound. The arrangements are increasingly complex, but always remains creative and melodic. The musicianship is really strong especially from Kerry Minnear, and the interplay remains true to the gentle giant tradition, one of the best prog ever produced. Every song is excellent, and the wonderfully crafted album remains fresh and despite the complexity of the music, is probably more accessible than its predecessor. Gentle Giant were really on, and this is must for any prog fan. 4.5/5"
    },
    {
      "reviewer": "Marc Baum",
      "date": "Posted Tuesday, November 8, 2005",
      "rating": 5,
      "text": "I see \"Free Hand\" as the zenith of Gentle Giant's fabulous classic period. It's perhaps their most realized effort. After the excellent, in wide parts experimental \"In A Glass House\" the group developed it's Renaissance-medieval approach on \"The Power And The Glory\", and produced one of the most creative and complex recordings in progressive rock history. On \"Free Hand\" they perfected that style, with using more transparent arrangements.\"Just The Same\" is another superb opening to an classic Gentle Giant record, which is also the most accessible piece on. Their vocal approach to the four-part fugue \"On Reflection\" was revolutionary for it's time and is looked upon as one of the genre's defining moments (specially it inspired Spock's Beard's vocal-arrangements very strongly). Despite the complexity of the arrangements, the music never sounds academic and in fact is very accessible thanks to several melodic hooks. The combination of once more superb musicianship, dry wit, and creative compositions make this an essential and historical recording. The Renaissance-medieval approach of Gentle Giant reached it's highest point in the illustry \"Talybont\". The impressive \"Mobile\" finally crashes the album to an end, before the classic period of GG is finally over for many fans and progressive rock-addicts. Many of those seem to have forgotten the great \"Interview\" album they delivered one year after \"Free Hand\", even it wasn't quite on the same high level but not very far. What is left to say about this landmark progressive rock record?9.5/10 points = 95 % on MPV scale = 5/5 starspoint-system: 0 - 3 points = 1 star / 3.5 - 5.5 points = 2 stars / 6 - 7 points = 3 stars / 7.5 - 8.5 points = 4 stars / 9 - 10 points = 5 starsEssential: a masterpiece of progressive music"
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Thursday, July 27, 2006",
      "rating": 4,
      "text": "I'm not a big fan of Gentle Giant but i apriciate almost every work of this outstanding band. When i first listen this band i said to my self what is going on with them, to complicated, to many sounds, complex arangements. But after 15 times of hearing every '70 album, i begun to understand how they work, what is their porpose in music. There are still some superb moments on the album such as the delightful last Voyage and Time To Kill, as well as the title track, but on the whole I end up not so enthusiastic. Free hand is almost a masterpice, because every track is beyong average listner, complex and intresting arrangements. A 4 star album. I remain to Octopus witch i find the first masterpice ( second is The power...) of Gentle Giant and an album hard to beat even for them. This is my opinion regard to this one."
    },
    {
      "reviewer": "Certif1ed",
      "date": "Posted Monday, July 31, 2006",
      "rating": 5,
      "text": "On Reflection - A MasterpieceThe main problem with other Gentle Giant studio albums is that they do not contain the perfect confection of hard rock and dazzling polyphony that is \"On Reflection\". This is possibly the best Prog Rock song ever, deceptively accessible to the point of seeming simplistic, and yet laden with technical subtleties and complex contrapuntal marvels that in no way stifle the natural flow of the piece.But enough already! I'll do the analysis bit when I reach the song during my customary \"live\" review; As the album plays directly into my headphones, for your entertainment, before your very eyes, I will endeavour to pull out the succulent fruits and the sour grapes, the nightingales and the turkeys, the stellar and the stinkers from this marvellous musical trove of tonal treasures:\"Just the Same\" must surely be considered a succulent fruit - bursting as it is with juicy proggy goodness. A finger clicking good rhythmic motif begins, then a piano motif joins it, crossing the rhythm of the clicking. It should be noted that the very first iteration of each motif is different to the motif itself, which provides instant drama and energy to what follows. The click disappears, and a distorted guitar provides a note-for note echo to the piano, exactly half a beat behind.Note that this is all in the first 30 seconds - we're talking real proggy value for money here!The song kicks in, and the instrumentalists and vocalists pick up melodically and rhythmically modified versions of the introductory motifs, lending a perfect continuity to the music. The chorus is another modification of these motifs, the time signature changing and layers of instruments changed to indicate the new territory, rather than the more predictable device of changing riff or key. This is followed by a rather surprising codetta - not a bridge, as it is clearly not intended as a linking device, rather a continuation of the previous flow of musical thought - and the second verse arrives.The \"bridge\" is more of a development of the earlier ideas, but in a calmer, less chaotic zone, with swishy synths and soft-sixth squishy harmonies washing underneath twining guitar lines. The tempo picks up for the second section of the bridge, and is almost a recapitulation of the earlier ideas - except that Gentle Giant have surreptitiously modulated a few times during the past few sections, and use the new key to kick off into surprising and new material - except hang on, didn't I hear that finger clicking in the intro? The transition back to the verse is thus made smoother than it really has any right to be, and the song is drawn to a close with perfection.The main drawback with this particular song is in the somewhat generic lyrics - akin to what one might expect to find in an \"arty\" pop song.Now we get to \"On Reflection\", and on first hearing, you're almost bound to wonder why I rave so profusely about this song, as there is simply too much going on for you to absorb all at once - the music is a complete story in itself, and there is far more here than many bands produce in an entire album.We kick off immediately with a striking melody line that is then turned into a canon - except that unlike a canon in a Classical work, when subsequent voices begin, they pick up at the same point in the lyrics as the primary voice.As with many of Bach's fugal writings, the melody entries are a perfect 5th apart - but unlike Bach, 3rds and 6ths tend to be lightly touched upon - which lends an austere, almost mediaeval flavour to the whole piece, denying either major or minor key dominance.The vocal lines continue, each part carefully composed to promote maximum movement within the music, until a sudden stop on a major triad that brings this section to a sudden stop in a perfect cadence.The next section \"reflects\" the lyrics, as it is a reflection upon the person who is the subject of the song, which is perfectly symbolised by the complete change in character of the music: A sudden shift to a minor key and quasi-madrigal style harmonies using suspensions modulate downwards using our old friend, the cycle of fifths.Again, for the next lyrical section, GG use a new character in the music for this reflection upon a reflection with an odd sequence of dischordant chords that suggest a kind of warped barbershop - or even the Beach Boys. This successfully imparts the questioning tone, and then yet another shift to a reflection on this question in the contrapuntal style of earlier: \"Now: On reflection, why should I have changed my ways for you?\".This gives way to yet another musical fragment, which almost completes the exposition of main ideas for this song: the \"All around\" motif, which recurrs again and again in a quite brilliant stream-of-consciousness way, expressing the circular nature of thought patterns.It should be noted at this point, that not even a minute of this song has passed - such is the density of carefully composed and outstandingly expressive material under scrutiny here. And it should also be noted that not all of the main music ideas have been exposed yet - despite the battery of rich inventiveness, GG keep a few tricks up their sleeves.The next section feels familiar to us now, as it uses the same canon ideas as the very first, but this time we have instruments for the first time: A piano accompanies the 1st voice, a vibraphone accompanies the second, and a gockenspiel accompanies the third, lending a more urgent, percussive feel to what we might think of as the second verse.The structure begins to feel a little more familiar now, as the second section or subject appears once more, closely followed by the third. Drums and cymbals join the instrumentation at this point, and an instrumental interlude follows - which is suddenly interrupted by the \"All Around\" motif.This time, the motif is extended, and the guitars join the instrumentation - the bass at first - and the motif slowly fades and gives way to a completely new and ever more reflective idea - a lyrical, melancholy and reminiscent melody - the perfect 5th accompaniment maintaining the mediaeval flavour, and a wooden flute double underscoring this by accompanying the voice in unison. The arrangement is particularly notable as the instruments take fragments of the main melodic ideas and use them to expressively decorate and emphasise key lines and words in the lyrics.This is a moment of real magic and tranquility, as the voices are shaped sensitively and the whole thing comes together as a perfect balance to the chaotic polyphony of earlier.This is cut across by a sharp reminder (and a developed musical idea that feels new) \"Look back, it's not your game, together just in name\", but the reminiscent feeling is still strong, and the idea is recapitulated.This time, a violin plays a slightly agitated counter-melody, and the \"All around\" motif performs the cut-off, before being cut off itself by a quite delicious riff fragment. The \"All around\" motif is having none of this, and attempts to re-assert itself once more, while percussive ideas sneak in fromthe sides attempting to establish some ground. Eventually the guitars (and organ) win, though, with a strong statement and development of the very first idea - this whole section clearly describing a battle inside the psyche. To put the icing on the cake, drums are added - and you just wonder how!Sadly, the piece fades at this point, and we are left wondering what might have happened next - but that is the ONLY thing wrong with it!Having just realised that I've managed to dedicate an album review's worth of space to a single song, I'll stop here. That should give an idea of just how great this album is in terms of compositional technique - an entire essay could be written on each piece, and there is simply no way you could assimilate all of the ideas presented within these grooves immediately - unless you're some kind of musical prodigy.Maybe one day I'll write a review of a Gentle Giant album that gets the time and HTML- space it deserves - but for now, like the song \"On Reflection\", I'll leave the reader to wonder what happens next, to go straight to the nearest stockist, purchase a copy of this exceptionally fine Prog Rock album and begin the quest to discover how the heck they did that - or simply enjoy the deliciously complicated music underneath the deceptively accessible melodies.Either way, an essential purchase for anyone that appreciates the finer points of Prog Rock - or progressive music generally."
    },
    {
      "reviewer": "bhikkhu",
      "date": "Posted Wednesday, August 23, 2006",
      "rating": 4,
      "text": "This could be Gentle Giant at their most accessible, while holding on to the traits that make them so unique. It is a fun, and (of course) quirky album. This may not be the band at their most dramatic, but it is ultimately enjoyable.\"Just the Same\" is strong, bouncy, and has that odd timing that GG fans have come to love. There are also some wonderfully silly keyboard sounds. So come on, and snap along (if you can).\"On Reflection\" starts out with a trademark vocal round, and is joined by a few percussive instruments. It then goes into a folk section. Towards the end more is added, and we are treated to various sounds \"all around, all around, all around.\"\"Free Hand\" starts with a quickly played piano and guitar duet, backed with some subtle bass. It soon turns into a rocker, GG style.\"Time to Kill\" is a jazzy groove. If you listen closely, there are some tasty progressions here.\"His Last Voyage\" is delicately haunting, but has a little 'cut this thing loose' section.\"Talybont\" is a medieval dance. If it weren't for the electronics, this could have been recorded in a castle of old. Ah, fetch me an oversized turkey drumstick.\"Mobile\" is the only thing keeping this from getting five stars. It's a good tune, but not the best choice to close the album.Once again, this is a fun album. It is also a great place to enter into the land of the Giant. I highly recommend it.H.T. Riekels"
    },
    {
      "reviewer": "Chus",
      "date": "Posted Sunday, October 22, 2006",
      "rating": 5,
      "text": "I don't understand how people would rate it lower than 4 just because it entered the charts. Look at \"A Passion Play\" by Jethro Tull: it is their less accessible album of the 70's, yet it charted at No.1 in the States (if memory serves well). The charts are very unpredictable, because the albums enter charts for selling and not because of the general opinion of the album; that is how the charts measure popularity: by number of copies. They just got a bit more popular, that's all. This album is as complex as the rest; except that now they actually filtered a bit more their ideas to create compact compositions, and instead of dull experimentation they focused on writing actual songs with every detail carefully planned and less atonalities. They kept the assimetrical time signatures but they don't just throw them for the sake of throwing them. In short: they polished their songwritting. I sometimes wonder how they all fit together perfetly into all those undecipherable time signatures (e.g. His Last Voyage) and how could they play all of these numbers on stage without a director's aid; they really are quite disciplined, and this album shows some of the most precise playing ever by Gentle Giant. John Weathers manages to get every strange beat with groove drum playing, and not a song on this album goes unnoticed. From the cheerful \"Just The Same\" to the fiddling on \"Mobile\", every number has it's charm... no fillers at all.The most amazing song on here is \"His Last Voyage\": with amazing renaissance imagery and the most jazzy intersection in the mix, it represents the eclectic and extreme style this band displays. \"On Reflection\" starts with blends of fugal structure (a vocal fugue, later intrumental) and later proceeds into a more mediaeval approach, it's also amazingly memorable. \"Talybont\" is an almost pure mediaeval fair music, only mixed with canon in the arrangements. \"Free Hand\" is the perfect example on how to create a musical soundscape, with every instrument serving it's part separately to create complex polyphonic music, and then the song turns into a very funky piece, then bits of jazz on the bridge. \"Time To Kill\" has a more soul approach, in the way Gentle Giant only knows how. \"Mobile\" is known mostle for the fiddles, and the electric guitar also serves as a fiddle with the wah-wah effects.a deserved 5-star rating... If you're starting out with GG I suggest this one LAST.... Yes, the best taste for last."
    },
    {
      "reviewer": "fuxi",
      "date": "Posted Sunday, November 12, 2006",
      "rating": 4,
      "text": "I've enjoyed most of the 1970s albums by Yes, Genesis and Jethro Tull for decades, but last night I listened closely to FREE HAND, probably for the first time ever, and it made me wonder if Gentle Giant were not, perhaps, more sophisticated than any of the aforementioned. The only early prog bands that truly matched GG in ensemble playing, were Frank Zappa's band circa 1974, and the early 1980s incarnation of King Crimson, with its intricate gamelan-style melodies. I simply gasped with astonishment when I heard the fugue GG pulled off in 'On Reflection'. This was so much more than that textbook fugue Keith Emerson inserted into 'The Endless Enigma'; it's an original piece of music that's vibrantly alive!For Gentle Giant there were no experiments with pompous church organ-like sounds which some listeners may find questionable (as produced by Tony Banks on FOXTROT, or by Rick Wakeman on GOING FOR THE ONE). There is nothing solemn about this band; it really ROCKS, and lead singer Derek Shulman bears a lot of responsibility for that - he must be one of the most dynamic prog vocalists around. Shulman is also capable of moving the listener: the sweet melancholy of 'His Last Voyage' shows that it makes no sense to call prog music 'sterile'.So, hats off to Gentle Giant! On the 1998 remaster, FREE HAND is coupled with INTERVIEW, which was originally released just seven months later. Although a lesser album, INTERVIEW is still worth hearing, so the FREE HAND/INTERVIEW combi looks like a first- rate bargain."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Tuesday, November 28, 2006",
      "rating": 3,
      "text": "More polished, but old hat.Gentle Giant is perhaps the most unheralded \"great\" prog band of the 70's along with VDGG. A wealth of talented musicians and songwriters never seemed to stop the GG machine from chugging along. That being said, this record seems like DeJa Vu. The music is great, but it seems as if GG really never \"progresses\" as a band while being in a genre of prog. Sure it's much more polished than Acquiring the Taste, but I'lol conclude with tuxon, essentially it's all been done before, even if it is one of their better records.Just the Same and Free Hand are my personal favorites here, both are fun rocking prog tracks. Both highlights are on a creative and quirky chorus and a solid middle instrumental section.GG is probably at their most accessible of their quality releases here, something that wouldn't be too awkward to play at social events. On Reflection has some of the best vocal work since the absence of the other brother, and Mobile is a folksy tune thats packaged nicely and includes a dark riff that sounds awkward among the other music, but seems to fit ok.Talybont is a Medieval sound that sort of crosses ELP's keys with Camel's \"The Procession\". Time to Kill is one of the darker sounding tunes here, with some dissonant notes building tension to the main riff. His Last Voyage should have been the closer here, as it was really the \"Last Voyage\" of a great GG album.Overall it's a nice and interesting little record, but nothing is too moving about it. As a GG fan it's an important part of their collection, but me, I just was hoping for a bit more when I came to this one."
    },
    {
      "reviewer": "Chris H",
      "date": "Posted Sunday, January 7, 2007",
      "rating": 2,
      "text": "Ok, when I saw all of the 5 star ratigns the first time I saw this page, I was thinking must be a good album! Then I bought it months later and here I am now, jaw dropped with astonishment that people consider this a masterpiece. \"Just The Same\" and \"Free Hand\" are the only tracks off this album I enjoy. \"Just The Same\" has some nice solo-ing in it from just about every badn member, and \"Free Hand\" is quite catchy with some fun lyrics and riffs. These songs save this album from one star doom.On the othere side however, the rest of the album is pointless. \"On Reflection\" gets on my nerves. The chanting is really annoying and those chimes give me headaches, plus the echo vocals are very dated. \"Time To Kill\" is an aptly titled song. They had time to kill on the record, so they recorded this track. When I listen to it, I think more along the lines of \"time to kill myself!\". \"His Last Voyage\" is a waaayy too long Yes-wannabe song that just drags on and on and on! Ughh, \"Talybont\" is next? I can't believe I wasted my time listening to this rubbish! It's a waste of disk space honestly. Finally, \"Mobile\" ends the album. Not too shabby but it does get very repetitive and annoying.2 stars, but only for \"Free Hand\" and \"Just The Same\"!"
    },
    {
      "reviewer": "el b�thy",
      "date": "Posted Friday, April 6, 2007",
      "rating": 4,
      "text": "What Gentle Giant created with Free Hand is their most accessible album (from their classic period, let's not bring Giant for a Day and Civilian into discussion.) without loosing their instrumental and vocal complexity nor their polyrhythmic compositions; what an achievement indeed! And to top it all, this might even be among their three best albums; again, what an achievement!The album starts with finger snaps. no, really it does, with Minear�s keys dropping in a few seconds later to mark the counterpoints of the \"finger snap beat\" in a more than typical Giant fashion, a great way to open the album. Of course I'm talking about \"Just the same\". Minear shines here, not only for his counterpoints rhythms, on which Green�s guitar would also help latter on, but for his strange sounds in the chorus and that spacey solo. Among his best stuff, and in another great Giant fashion, it's complex, inventive but never in your face; what an achievement! \"On reflection\" follows and it brings us another characteristic Giant composition, maybe the one they are more famous for: the polyphonic, medieval multi vocals. Sure, this has been done before with the \"head turning\" \"Knots\" in Octopus, so the result might not be as surprising, but let me tell you, it�s equally as good as the previous mentioned one. Some might even say it's better, I know my friend and Giant fan-boy, Martinn, would agree. \"Free hand\" is in my eyes and ears the best track of the album. Again, Minear owns this one, but Ray Shulman is not far behind with his fantastic bass lines. The main key riff that could be taken as the chorus must be one of the best things the Giants have done in their career. Of course the rest of the band also delivers pure brilliance in every note, every beat. Strange as this might sound, one could even dance to this song; what an achievement! The second side of the album, for I have the vinyl version, kicks of with \"Time to kill\" which, at least for me, is the weakest track from the album. BUT, this does not mean it's a bad tune, no, no, no, no, no. it's still very, very good, specially Shulman�s bass lines, but the rest of the album is just way better. \"His last voyage\", the longest song from the album. which is still quite short if you compare it to other prog songs, is really interesting. Here the Giants take it down a notch; the song presents little drumming, just in some sections here and there, but other than that, it's a very calm song. Still, the instrumentation here (as usual) goes wild. It is rare for the Giants �cause an instrument that is not usually used by them in other songs, prevails here as their main in the vocal parts. the acoustic guitar! Again the vocals are sung in their polyrhythmic fashion, but not as over the top as in \"On reflection\". Gentle Giant was one of �70 strongest instrumental bands, yet they didn't do many instrumental songs, which is quite weird. But, here, in Free Hand, we get one. \"Talybont\", a short piece, constructed around a main key riff is as delightful as short songs come. Of course every instrument plays their own interpretation of this riff, full of variations, one almost wishes the song was longer, but no, it's short. and delightful. \"Mobile\" closes the album; an up beat song, again, full of what makes Gentle Giant Gentle Giant. Personally, I find this song to have Derek Shulman�s best vocal lines, at least from this album. Strong, direct, even happy, it's a good contrast to the complex background instrumentation this song presents. Now, this is not about the actual song itself, but about the album. I have, as I already said, the vinyl version and the CD version. Now, in the vinyl version once this song comes to an end the record plays on for a few more seconds, I would say 20 or so, till Weathers hits the drums on last time all alone. I always found this very cool, for it always took me by surprise. Now, this ultimate drum hit, does not appear in the CD version. or at least not in mine. strange indeed.To summon things up: a classic, one of their best. Few if any weak point and some of their very strongest are here. A good starter too, very accessible, yet you can get something new out of it, every time you listen to it, what an achievement!"
    },
    {
      "reviewer": "obiter",
      "date": "Posted Tuesday, June 26, 2007",
      "rating": 4,
      "text": "What can you say?If the jazzy funk element of Power and the Glory hadn't quite melded into the medieval choral, complex musicality that is GG, then boy does it fit in here.The first time I listened to this album it just made me smile. This is most defintiely inane grin territory (In InGT as a couple of my mates would put it).Often the difficulty with reviewing an album which is so complex is the the desire, or compulsion, to try and be profound and appear knowledegeable. The greatest compliment I can pay this album is that I've played it when a few mates & girlfriends have comeback form teh pub (well worse for wear) and they've loved it. I've played it to mates in bands I've played in: they have loved it & seethed with jealously. Finally, I can't play this album without smiling.I've always wondered what Buddy Rich would have sounded like if he'd jammed with these guys. My only disappointment in this album, and i've got to say it's a biggy is the restrained drumming: where are the swishing cymbals in His Last Voyage?? Bugs me every time I hear it.Talybont reminds me of the backing music for the dance scene in Romeo & Juliet at a production I saw years ago (23).Mobile follows suit. Typically GG. A little bit of a reel. Love the bass chords jsut before it enters a very weird section. welcome the the weird and wonderful world of GG. Love it or hate it, you must feel the quality.For me it's a 4.5 but I can't vouch it as essential so that leaves this a 4."
    },
    {
      "reviewer": "Atavachron",
      "date": "Posted Tuesday, October 9, 2007",
      "rating": 5,
      "text": "Gentle Giant were so good it hurts. What Ray and Derek Shulman, Kerry Minnear, John Weathers and Gary Green were able to achieve musically was unmatched in the progressive rock movement. The group didn't demand attention, squeeze catchy melodies or foment heart-tugging manipulations. They just recorded some of the most accomplished music in rock history.'Just the Same' opens on a cheerful note but gives a taste of the sophisticated architecture to come. That promise is fulfilled with the knock-out vocal arrangements in 'On Reflection', building and circulating with piano, Vibes, more vocal layers, a gingerly-sung lyric, sprinkles of recorder and violin, all leading to an immaculate rock explosion of beauty, energy and immense joy. The cocky 'Free Hand' quickly becomes a prog rock classic that matches anything Yes ever did and reveals a unit that could literally do anything, and did it with such aplomb that many contemporaries must have cried themselves to sleep after hearing this record. Gentle Giant were unafraid, and could back-up their high ambition with results. 'Time to Kill' continues in the vein of the title track with constant change, modulation, redirection and trippy high-end playfulness. The band is able to take just a few small themes deconstructed to such a degree that they become unrecognizable as related music, maintaining a connection just under the surface that strings everything together. The deep and jazzy 'His Last Voyage' gets into religious tonalities and Gregorian chants, gluing it all with some old fashioned rock 'n roll, 'Talybont' is quite pleased to see the King, giving Tull a serious run for the money and 'Mobile' is an amazing reprise with some hot fiddle.One of those albums that, looking back, captured a moment, a quality, a time that was never seen again in modern music. Eras change and generations grow-up but Gentle Giant is somehow timeless in its uncompromising quality and standards, and rock will not soon see another band bearing such undeniable gifts."
    },
    {
      "reviewer": "Moatilliatta",
      "date": "Posted Wednesday, November 14, 2007",
      "rating": 4,
      "text": "Free Hand is a document of the funkiest castle in history. I don't know if Gentle Giant invaded the funkiest castle, if Gentle Giant invaded a castle and brought the funk to the castle, or if Gentle Giant grew up in the funkiest castle and finally harnessed their medieval roots in their music, but it's all beyond the point. This is the music of the funkiest castle ever.I wish I had the motivation to review this whole album and relate it to the funky castle story.The album's got a few of GG's best tunes, most notably \"On Reflection,\" and it's loaded with musical ingenuity, but it's fun. Almost too fun. My friends and I laugh constantly when listening to this together, but it's mostly in a good way. In any case, fans of the group will find plenty to enjoy. This is Gentle Giant's last great album, and I couldn't think of a better, funkier swan song than \"Mobile.\""
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Thursday, November 15, 2007",
      "rating": 4,
      "text": "In my top four of favourite GENTLE GIANT records. This is very accessible music and at the same time intricate and complex. The band interplay is jaw-dropping at times, and the collage of sounds that seems to be perfectly timed and placed proves this point.\"Just The Same\" opens with what sounds like someone snapping their fingers. Such a catchy tune with the guitar and keys intertwining. After 2 minutes we get a calming interlude with synths until the main melody returns after 4 minutes. \"On Reflection\" features some of those incredible vocal arrangements that they are famous for. I was also reminded of YES a couple of times with the harmonies that follow. The song changes 2 minutes in as Minnear sings with his reserved vocals. I love this part of the song. Some great instrumental work to end the song including the drumming 5 minutes in. \"Free Hand\" reminds me of \"Just The Same\" with the fantastic band interplay,as well as how catchy it is. The piano is impressive, as are the strange keyboard sounds.\"Time To Kill\" is another accessible, melodic song.This really is a feel good song with harmonies to boot. Some good guitar after 3 minutes. \"His Last Voyage\" is one of my all time favourite GENTLE GIANT songs. There is something about Minnear's vocals that draw me in, and I don't want to leave. Again the intricate collage of sounds is a highlight. Check out the guitar 4 minutes in as the drums and piano play on. Lots of xylophone on this track as well.The original melody comes back to end it. \"Talybont\" is apparently the name of a forest in Wales. The song has a Celtic flavour to it. Recorder, keys and guitar lead the way. These last two songs bring down my opinion of this album a notch, not a fan of either really. \"Mobile\" is all about the violin melodies. Vocals sound processed 2 1/2 minutes in.A solid 4 star record to be sure, and in the upper half of their first eight studio albums."
    },
    {
      "reviewer": "The Pessimist",
      "date": "Posted Thursday, January 24, 2008",
      "rating": 5,
      "text": "Certainly the very best GG album in my books, this CD truly contains a mastery of all the Giant's traits: quasi-round vocals, complexity, rhythmical virtuosity, uniqueness, driving rhythm on several occasions... i could go on, but this is must buy.1. Just The Same - Great opener. Quite tame compared to the rest of the album, but nonetheless stunning - 5/52. On Reflection - Fantastic vocals at the start but slowly deteriarates and really goes nowhere in particular - 3/53. Free Hand - A second GG masterpiece song. Great driving rhythm and some really quite complex stuff! Minear really shines quite a bit on this song, as also in the opening track - 5/54. Time To Kill - As good as (if not better than) the previous track, this one's probably the most technically challenging of all - 5/55. His Last Voyage - A lovely ballad that reminds me distinctly of the Mahavishnu Orchestra - 4/56. Talybont - Fantastic prog song with a medeival feel, short and sweet with a gorgeous flute - 5/57. Mobile - Returning to the celtic feel, this is a stunning ending with everything a prog-rocker looks for - 5/5Overall score - 5/5"
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Monday, June 9, 2008",
      "rating": 5,
      "text": "Free hand is the seventh album from Gentle Giant and one of their best albums IMO. After The Power and the Glory which was the predecessor to Free Hand, Gentle Giant must have felt extremely inspired for Free Hand to come out as well as it did. I think The Power and the Glory is the weakest of the first six albums from Gentle Giant ( it�s not weak at all compared to other prog rock albums of course, only compared to the other five albums. I personally gave The Power and the Glory 4 stars) and I was afraid that their really good era was over. Free Hand fortunately proves me wrong. While still maintaining all of the charateristics of Gentle Giant which means a mix of hard rock, jazz/ fusion, classical chamber music, medieval music, avant garde and folk, Free Hand takes Gentle Giant one step further. Never on any of the previous albums have the music been this memorable yet still very complex. It�s a great achievement that only Gentle Giant could have done.The music is as always pretty hard to describe as you can probably sense when reading my above description. Songs like Just The Same, Free Hand, Time To Kill and Mobile are all extremely well written progressive rock songs while On Reflection might be the finest polyrythmic vocal song Gentle Giant ever made. On Reflection is the song with most avant garde influences on the album, but it�s very memorable. His Last Voyage is a beautiful semi-ballad while the instrumental Talybont completes this beautiful and very powerful prog rock album.The musicianship is outstanding. Every single musician plays beyond his abillities on Free Hand. Not only do Gentle Giant make beautiful and powerful music they are also mulitinstrumentalists and outstanding musicians every one of them.The production is very good. absolutely the best sound quality Gentle Giant had achieved by then.Free Hand is one of my favorite Gentle Giant albums, and also one of my favorite prog rock albums. It deserves all 5 stars for the musical genious put into the compositions and the interplay between the musicians. You will very seldom come across anything remotely like this. If you haven�t listened to this album yet, you better run out and buy yourself a copy, because this is pure genious.NOTE: I have an edition with both Free Hand and Gentle Giants next album Interview on one CD which is of course a great treat. Two albums for the price of one. I would seek out this version if I were you."
    },
    {
      "reviewer": "LiquidEternity",
      "date": "Posted Wednesday, October 8, 2008",
      "rating": 5,
      "text": "Next to Octopus, this is Gentle Giant's best album, possibly a contender for that position as strongest release by the band.Coming off the tails of the average The Power and the Glory, Free Hand simplifies the tracks just enough to turn them into cohesive songs. The same complicated structures and wild instrumental parts that the band demonstrated in other albums shows up here. The only difference is the energy of the band is absolutely very present in almost every track, giving the album a much more exciting and commercial sort of feel, even though the music is very much progressive. The experimental nature of the band has winded down by this point, but that does not mean that this album, though it does not venture into much territory that the band had not yet explored, is by any means a simple rehash of other Gentle Giant songs and ideas. What we have here is the culmination of the band's history, the peak of the band.The fun and lighthearted track Just the Same opens the album, playing with some fun keyboards and a quality chorus. It may be one of the lesser songs on Free Hand, so if this does not inspire you much, continue on anyways. The next track, the wildly complicated On Reflection, features what is probably the band's most intense series of vocal harmonies and rounds. The middle section of the song slows down considerably and produces a very neat mellow melody. It ends with a full band reprisal of the beginning vocal interplay. The title track appears next, a rather upbeat and catchy song. The musicality of the interludes is astonishing here, with perfectly aligned yet irregular instruments playing to each other's strengths. Very much a recommended listen for a song, because I believe it to be the best and most representative song created by the band.The other side begins with Time to Kill, a peppy sort of tune with fun keyboards and catchy melodies. Do not be alarmed, however. If the energy levels are starting to get to you and you are having trouble sitting still, the next song should calm you down. His Last Voyage is the album's soft ballad sort of tune, tying in lovely piano work and a lovely melody. The energy returns right after, however, with the Renaissance-esque instrumental piece Talybont. The music than reignites into the final track, Mobile, with more complicated songwriting and deeply inspired vocal bits. It wraps up the album with a tightly woven instrumental bit in the vein of Octopus's River.In the end, this is one of Gentle Giant's strongest albums. It's a wonderful place to start for any listener, even if it may be a touch weaker than Octopus. This is a highly recommended release, one that shows just where the creativity was going when it started to get wonky in a number of other popular prog bands."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Friday, October 17, 2008",
      "rating": 5,
      "text": "Octo-what?There's an eternal debate as to the best Gentle Giant album, although most will say it comes down toFree Hand,In A Glass HouseorOctopus, and most timesOctopuscomes out on top. But to be quite honest, while that album may have been a pinnacle of experimental music with an incredibly warm and welcoming sound, this album has it beat by miles and miles when you're looking for amazing compositions and musicianship. The album maintains the typical Giant quirk, but adds a couple of layers of melody and direction that some people who criticize the band claim that they lack, yet they still have the complexities that people often give them so much credit for. Really, this is the perfect blend for Gentle Giant and it's the album that will likely appeal to the widest audience.Each song on this album is a work of absolute marvel. Though each of the sides has its own standouts and features the songs all contain a certain amount of charm and crazy complexity to make them both incredibly catchy, memorable, and impressive. Probably the best example of this is the killer duo of songs that make up the most of the first side.On Reflectioncarries on theKnotsstyle of harmonized vocals while taking the length and extending it, adding more instrumentation and melody. The secondary vocals are also quite beautiful in their delivery as the music slows down - that is, until the buildup that brings the song to a somewhat cataclysmic close.Free Hand, the title cut, is also incredibly impressive. Its melodies and hooks are such that this one will get lodged in your head, never to be removed. Not a lot of Gentle Giant songs can be called ''catchy'', but this one certainly can. Add in a certain amount of aggression and you've got yourself one killer tune.Some of the other songs on the album are more familiar to the Gentle Giant style. The openingJust The Sameis an upbeat tune with some very uplifting vocals while the instrumentalTalybontrevisits the Giant's love for medieval melodies in its brief existence.Time To Killhas a structure in kin with something likePantagruel's Nativitywith its subtle nuances being the most prominent (strangely) part of the song, making for a strange hook.His Last Voyageis a slow and reflective, calm piece that simmers things down for a moment whileMobilemakes for a blistering closer.There really isn't a whole lot more to say about Gentle Giant's masterpiece other than it should be in every single prog rock collection in at least one form. If you don't take my word for it then read one of the many other gushing reviews and you just may be convinced. A bright and shiny 5 stars for this marvelous work."
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Saturday, October 25, 2008",
      "rating": 5,
      "text": "One fo Gentl Giant's bst album (if not the best) and a personal favorite of mine. Sadly, it was also the last truly great efford by the band. Their next LP, Interview, would indicate the slow decline of this amazing group. But you can't tell this by Free Hand. Those guys were in top form, both as songwriters and as players. The richness of their music reachs absurd levels on this one. Yet they could concentrade their awesome defying musicanship and very elaborated arrangements in catchy, beautiful, 5 minute songs. Who elsse could have done this?Although there are no fillers on this album, if one asked me the very highlight on Free hand I'd not hesitate to point On Reflection: the multi-layered, conterpointing voices on this tune is enough to turn the most relutant non beliver into a fan. It's a natural developement of the already incredible Knots (included on their other masterpiece Octopus). The instrumental section on this one is also of note. It's the kind of song I can hear over and over again and never have enough of it.By the time they recorded Free hand the band had nothing to prove. So while most of their peers were doing bloated, over-pretentious, over-the-top, grand suites (and most of them losing themselves into that), GG kept their heads together and worked for the music. No long noodling, no ten minute solos. Yet, so few musicians could have even dreamed of doing such subtle, delicate and difficult performances. Each song encapsulates is a true mini opus.Free Hand is the band's peak. While very demanding and challeging as all their earlier effords, it is also one fo the most pleasant and accessible. A joy to hear and a timeless piece of music that defies categorization even 30 years after its release. Essential for any prog lover. A truly masterpiece."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Friday, February 13, 2009",
      "rating": 4,
      "text": "While not quite as enjoyable to me as some other Gentle Giant releases, this album carries a lot of progressive weight, and is one I can always rely on when I am in the mood for something wildly eccentric. Every track is memorable, even if they require a bit of time and focus to appreciate.\"Just the Same\" The snapping of fingers kicks off the album. Piano and electric guitar bounce off one another until Shulman belts his first line. The melody and lyrics are extremely catchy. Initially, the instrumental section is very spacey, with some atmospheric keyboards and uncomplicated guitar work, but then jumps into one of the quirkiest sections Gentle Giant has ever recorded.\"On Reflection\" A relative of \"Knots,\" featuring complex a capella vocal arrangements with several countermelodies. The instrumentation initially focuses on percussion, but brings in piano and strings also. The chaos fades out as Minnear comes into the spotlight to sing one of the loveliest moments of the album. The more beautiful vocal section is interrupted briefly by a more forceful vocal styling. The final part of the song is Gary Green, Kerry Minnear, Ray Shulman, and the gang using their respective instruments to interpret the multipart vocal section the piece began with.\"Free Hand\" A quaintly eerie piano serves as the basis for the guitar and bass to work over before a boisterous Shulman jumps in with those lines every Gentle Giant fan knows. It features a somewhat jazzy psychedelic instrumental middle section, during which the bass plays the central role.\"Time to Kill\" Awkward percussion and loud guitars make this one of the most avant-garde things Gentle Giant ever performed, at least until Shulman sings, and even then, the guitar work brings it back to that genre. One of the main riffs in the song sounds like it inspired one particular small section in Kansas's song, \"Paradox.\" Minnear sings at his deepest with the bass.\"His Last Voyage\" A lone bass introduces this pleasant pieces of music. Minnear's voice is distant and almost sacrosanct-sounding, as though he were a lonely monk intoning in an large cathedral. While retaining Minnear's faraway vocals, the piece abruptly shifts into something closer to avant-garde jazz with loud piano and Green's guitar run through a wah pedal. The whole band uses the introduction as a springboard back into the quieter lyrical section.\"Talybont\" Full of medieval instrumentation, this terse instrumental is a favorite of mine. The percussion is apt, as are the other instruments.\"Mobile\" Floating somewhere between Celtic and Cajun, much of this song consists of fiddling and acoustic guitar, except of course where Shulman is belting the words. It's a jaunty track, and highly pleasing."
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Tuesday, March 24, 2009",
      "rating": 4,
      "text": "Free Hand is on the verge of being consecutive highest quality album by Gentle Giant. For me it's big wondering between 4.4 and 4.5, because according to my rules, if I give 4.5 I shall have to rounded it to 5 stars, when the average rating of the album is below 4.5. And yet, I think it won't happened. This album is the fourth best by the band (after Three Friends, In a Glass House and The Power and the Glory and little above Acquiring the Taste) for me!Here we have big medieval impact with the second and sixth songs - On Reflection and Talybont; and medieval/relax/new age impact with fifth song - His Last Voyage. All songs are very good, but most of them lack a little bit of masterpiece intensity and energy. It's very little indeed in my opinion. The other four songs are almost pure progart with dynamic sense of energy! And so, very difficult and unsure 4.4 stars for me!!!"
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Wednesday, May 6, 2009",
      "rating": 5,
      "text": "Gentle Giant Reaches Its Mature PeakFree Hand represents Gentle Giant in their full-blown, refined glory. All of the varied elements of their sound are brought together for one last masterpiece. Some have argued that their albums had become fairly formulaic at this point in their career. This is probably true, as for each tune I can point to corresponding songs on earlier albums. Luckily, the examples of the \"formula\" on Free Hand are often the best of their type. \"On Reflection\" continues in the tradition of \"Knots\" and \"Proclamation.\" \"His Last Voyage\" reminds of \"Think of Me with Kindness\" and to a lesser extent \"A Reunion.\" But in each case, the Free Hand versions are extremely strong GG tracks, and if this album were the only one a fan had, the entirety of the band's sound would be well represented.Contrary to many reviewers, I felt In a Glass House was a very uneven album, one that showcased the band pushing new boundaries after the exit of the eldest Shulman, but not quite succeeding. Free Hand is where the more complex and demanding writing style finds its full stride. The mix is much better, the distribution of vocals is smarter, and the band pulls in a little bit of medievalism again late in the album on \"Talybont\" and \"Mobile.\" The musical device of \"hocketing,\" tossing melodic ideas between instruments like a hot potato, continues as clever as ever. But most of all, the fun, the fire is back. The boys really sound like they're enjoying themselves.Despite their signature massive syncopation and complex rhythmic structures, songs like the opener \"Just the Same\" truly groove. Quirky wide vibrato key sounds and fingersnaps are more humorous than cheesy given the complexity of the composition. \"On Reflection\" contains the a capella work that many fans like myself love the band for. Here, the sound is more traditionally harmonic and choral than some previous work, but still contains the contrapuntal lines that are the band's trademark. The title track starts with a brilliant interweaving instrumental passage before descending into one of Derek Shulman's occasional forced lead vocal moments. The second half morphs through a reprise of the intro, dreamy keyboards with meandering bass lines, harsh staccato riffs, and it works so well that by the time the song is over the average vocal delivery is forgiven.The remaining songs are all strong GG works, with each member getting a chance to shine, including Gary Green's wah solo on \"His Last Voyage\" which evokes a bit of Tommy Bolin in the way he hangs onto notes. Kerry Minnear gets some very nice lead vocal spots, and we are treated to some medieval whimsy.All in all, I would call this the prototypical Gentle Giant album. It displays the band at their most mature, polished, and consistent. There are no weak songs on this album. The production is great, the sonic balance perfectly keeping the focus on the music rather than the recording. Though other albums may have more perfect individual tracks, this album is perhaps Gentle Giant's best, start to finish."
    },
    {
      "reviewer": "Dobermensch",
      "date": "Posted Thursday, May 14, 2009",
      "rating": 4,
      "text": "I've only recently got into Gentle Giant. In fact they're probably the best new band I've heard this year. Oh well, I'm just 25 years too late! The important thing is that it sounds fantastic and fresh even in 2009. In a funny way it reminds me of the way the 'Cardiacs' construct their songs. Gentle Giant are one of the few bands I can listen to very carefully and think to myself 'how the hell do they keep that together with so much stuff going on?. A right clever bunch they were and very experimental. I've heard their first eight albums now and this one is right at the top along with 'In a Glass House'. Free Hand is extremely complex, with frequent changes in tempo and really odd time signatures - sometimes sounding like there's two different beats being played in the same tune! They also make use of vocal counterpoint (contrapuntal to Classical music folk) - where two voices sing two different tunes at a different tempo in the one song! This is the kind of thing that was big in 16th Century Renaissance Europe!"
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Saturday, June 13, 2009",
      "rating": 4,
      "text": "Free Hand, Gentle Giant The man who first proclaimed that the progressive rock musicians shall wear capes and play solos and not, under any circumstances, write catchy songs obviously forgot to tell Gentle Giant. Their very credible 1975 release Free Hand is a full text of how-to-play-well-without-being-accused-of-masturbation, how-to-write-songs-that-are-both-involving-and-catchy and, more importantly, how-to-put-out-a-great-album. Admittedly, the excitement of this one is somewhat consolidated on the superb side one, and pleasant as the medievally flavoured work of side 2 is, it somehow stops at intelligent, pleasant movement rather than making the murky transition to a full-fledged classic.The opener is pretty much symbolic of the album as a whole, catchy as hell, opening with the infectiously obtuse shifting of handclaps from speaker to speaker and a bouncy piano part. Gary Greene and Ray Shulman leap to create a polyphonic pop song, taking in its stride the lively saxophone-heavy verses, a chorus introduced by a cool keyboard hook and a bizarre instrumental interlude, moving from a well-thought out shiny synthesiser over a calm groove to a theatrical bit of bending moog mastery with a much sharper jazzy backdrop from Ray Shulman and John Weathers. A happily rocking guitar repeat of the piano riff leads us back into the song proper, and before you know it, the chugging bass rhythm and handclaps have taken us out again. Worth mentioning, Minnear (keys) and Ray Shulman (bass) give great performances on this one.Now, how I'm meant to review On Reflection is beyond me, but I'll try... here Gentle Giant's amazing capacity for arrangement comes to the fore, with complex vocal parts interweaved with classical density and medieval flavour, interspersed with the band's incredible range of instruments. Derek Shulman's bouncy and impersonal energy on lyrics such as 'In my way did I use you/Do you think that I really abused you/On reflection now, it doe-esn't ma-atter' is matched perfectly by Kerry Minnear's lush yet fragile and affected 'I'll remember the good things how can I forget/ all the years that we shared in our way', and the complimentary gradually introduced xylophone, glockenspiel and piano tracking the various multi-layered vocal parts supplement the feel of individual voices crucial to the song's lyrical theme, as the exquisite low-tempo keyboard-and-bass support for Minnear's great vocal, and with the introduction of subtle violins and cello, this reflective moment leads up to the energetic burst out of the 'all around/all around/ all around...' block harmony before the great rock instrumental conclusion, with bass, guitar and organ trading parts just about every time and yet finding the space to add in. An impression you get from the instrumental parts of this one, which maybe wasn't there in the Giant's early albums, is simply what great musicians they are. Ray Shulman's bass in particular, is probably among my favourite albums for the instrument ever, and this instrumental burst is a prime example of how to play great interesting starts while serving the song absolutely. OK, maybe the fade isn't a perfectly satisfying ending from a musical point of view, but the idea of happily going off from this failed relationship to do one's own thing is suitably conveyed by the defiant melodies springing up over this, and I can't think of a better way to give that impression. A top notch Giant piece, and certainly among my favourites.If at the time of reading, as at the time of writing, this song is a title track here, open another tab/scroll up and click the play button and I can say with a fair bit of confidence that you shouldn't be disappointed. A typically punctuated Minnear piano and a kicking Gary Greene riff, backed up by its bizarre pauses, an incredibly fun and odd bit of bass from the virtuosic Ray Shulman, as well as some choice drum fills from John Weathers, who, if overshadowed by the other band members is a rock of consistent creativity throughout this record. If you can work out exactly what's going on in the instrumental sections, the first laden with clever piano dissonants and the second a minimal guitar-driven thing with some mystical percussion and a weird marine-sounding keyboard, bulked up by Greene's jabs, you're a braver man than I. The melody is just fantastic, and the little details present everywhere. The quintessential eclectic song? Well, either way, great pop music elaborated beyond recognition and with Gentle Giant's charm and great complexity.Time To Kill continues quite strongly, opening with a sort of inverted outro, taking thrumming static and suddenly throwing in twenty or thirty seconds of a building riff crammed full of their wonderfully obtuse musical knowledge and then pulling together to give the impression that they're aiming at a sort of running-out-conclusion already as if on the end of On Reflection... but they don't. The shift is straight on into a slightly remorseful rock song with some of the bulky vocals and a suitably great lead from Derek Shulman, alternating between immensely musical band set-ups and a sort of prowling lead bass thing hunting the voice. The wonderful vocal harmonies are almost the precursor to some of the stuff on the later pop albums that I've heard, if much, much better... again, a fade on the end isn't really satisfying, but otherwise a very clever and catchy song... Gentle Giant are fantastic at the combination of the two.The somewhat tragic and reminiscing His Last Voyage is the album's first sign of flagging just a little... the bulk of it is a sweet medieval-sounding vocal section, and much as Gary Greene's gorgeous acoustic guitar and the band joining together, it goes on a relatively long time for a section where making out the words is a challenge and also one where it doesn't really mesh with the intelligently created introduction and interludes set up to add some flavour for it. Now, in spite of this pleasant but slightly inelegant bit, at the three minute mark, it transforms, a sharp coordination between the piano and bass and a set of remarkable airy fills by Weathers are overlaid with an equally ethereal vocal to give a sort of surrealistic web of ghostlike atmosphere over which Gary Greene finally gets the blues-driven, but creative, solo he seems to have been itching for all album, and a return to the tranquil part brings a real conclusion to a mixed, but at times wonderful, piece.Talybont (a Welsh town, by the way; nice place, I've been walking there, and the music fits it nicely) is more of a hearts-on-sleeves medieval piece, with twin recorders and a harpsichord; there is a clear main theme throughout, which is frequently echoed, and the superb production of the album really allows some of the song's subtleties to stand out as highlights here, whether in the form of a solid clavichord or clavinet contrast to the playful main theme, or in John Weathers' matching drum work, placing much more emphasis on a mood than a beat. Wonderful work by Minnear and Gary Greene in particular here... overall, a very satisfying piece of music, achieving character without going to the lengths of the rest of the album to do so.The ending Mobile is, erm, wearing. Yes, it's clever compositionally, I can remember the main theme, and the dense polyphony is still there, and there are a huge number of neat catches, but, by this point in the album, it maybe feels a little odd after the two cute medieval numbers to return to the style of the first half, albeit with a somewhat more prominent lead vocal and a set of discernable and unimpressive lyrics. OK, so the band have a boundless childlike energy and musical knowledge that allows them to slam in vocoders, violins, wah-wah guitar work, suspicious piano work and a creative intensity to shame their contemporaries and their successors, but I can't really say that, either because it's simply not as memorable as half one, or because my musical brain is getting tired and I'm preparing to switch off before Interview (ah, the banes of two-in-one-CDs)... anyway, as a stand-alone song, it's good, but as the ending to such a fantastic album, it doesn't really hold up, and I can't say the random wait-then-drum roll ending is ahead of the fades that characterise the rest of this one.So, all in all, rush out to your nearest purveyor of quality music, which probably remains either Amazon.co.uk or Amazon.com unless you're less of an almost-but-not-quite-rural unfortunate than I am, and acquire or order this album. Or listen to the sample; that might be a good idea first. Alas, the fifth star eludes this one on the grounds that a few of the endings aren't exactly decisive, when the band's ability to write a song ending is really not in question, and Mobile and His Last Voyage fail to stand out in the way the other five songs do. Ah, Gentle Giant, forever stuck on four stars, despite all the talent and individuality... should be heading for In A Glass House and Octopus soon... see if that changes it. Worth mentioning, this is one hell of a bass album, and you get an impression of virtuosity as well as the creativity, individuality and emotion that has, up 'til now, been a constant feature of Gentle Giant's repertoire.Rating: Four Stars, 12/15 Favourite Track: tough choice; maybe Time To Kill or On Reflection"
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Saturday, December 5, 2009",
      "rating": 5,
      "text": "Who would believe me now that my hands are free, that my hands are free?The last really great and probably the most accessible of Gentle Giants albums,Free Handproved that the band could write all types of songs. We are treated to excellent instrumentals, advanced vocal numbers, ballads and advanced song structure in general. The album kicks in with some of the catchiest sounds ever heard on a '70s record and that same flow is maintained all the way up to the end.The composition that really made me feel completely mesmerized wasOn Reflection. The track is basicallyKnotspushed even further with some truly spectacular results especially once Kerry Minnear gets a shot in the spotlight. Eventually the band would try to do a similar piece on their next album titledDesignbut the results are far from the magic that we get here.Free Handis simply a masterpiece of an album that should be in every great prog rock music collection. Unfortunately the great album streak that the band had maintained up to this point would eventually go downhill with the later releases. Well, at least Gentle Giant had the decency to disband before the '80s really kicked in and we were spared some possible disasters.***** star songs: Just The Same (5:34) On Reflection (5:41) Free Hand (6:14) Talybont (2:43)**** star songs: Time To Kill (5:08) His Last Voyage (6:27) Mobile (5:05)Total Rating: 4,55"
    },
    {
      "reviewer": "Isa",
      "date": "Posted Wednesday, December 9, 2009",
      "rating": 4,
      "text": "|B+| One of the pinnacles of creative composition.There are few bands with the kind of devoted and musically educated fan-base that Gentle Giant has, and for obvious reasons. Any open-minded musicologist, with an education in music theory and history, should go nuts for this band. Compositional techniques dating to the early Renaissance all the way up to the creation of the album are used, and all in harmony (pun not intended), to create the marvelously eclectic band, Gentle Giant. And this album, Free Hand, is probably among the most mature and precise works of their discography. I feel, though, it slightly lacks the freshness and almost youthful vitality of many albums preceding it, thus is ever so slightly stale yet still very vibrant and now experienced, like a person who has hit his early to mid-thirties. This album still borderlines a five star, one of those albums that just barely falls through the cracks of being a masterpiece of artistic music, yet for which I still of great reverence.Elements typical (and brilliant) of Gentle Giant are prevalent, starting their pieces in unique and sometimes quite humerus ways, as the opener shows with the rhythmic snapping. We have tons of blending of various instruments, timbres, genres, influences, and compositional techniques from various periods of music history. Counterpoint everywhere, yet flowing wonderfully from track to track. Flawless execution of musicianship and recording techniques. All as usual, only in this album they all come together particularly beautifully.However, this is by no means another clone of everything the band had done before. As great composers should, they keep variety in their work. Here we have some quite intentionally catchier songs, yet the sanctity of the composition was hardly compromised for it; in fact, ingeniously enough, the craziness and complication of the music adds to the catchy quality in a strange way, as evidenced by the album title track. On Reflection is the strongest track, and probably the band's best work of their entire career; in it, the band pokes fun referring to their own composition techniques with \"all a round, all a round.\" The weakest track is Mobile, which in it of itself is a remarkable weak track.I suppose in a way this album is virtually a masterpiece, but I never developed the sort of emotional attachment to it, as with all albums I rate as masterpiece status. I have high standards for my music, and this just barely doesn't meet the \"epic\" bar, as the music lacks the youthful vibrancy of such albums as Octopus and In a Glass House. Another one of Gentle Giant's fine works that every progger should hear at some point, and one of the best eclectic albums out there."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Wednesday, December 16, 2009",
      "rating": 4,
      "text": "The first three songs on this album,Just The Same,On ReflectionandFree Hand, all rank as some of the best songs Gentle Giant have ever recorded. It's too bad that the remainder of the album, the songs that made up side two of the vinyl LP, don't fare quite as well. While these four songs are not bad, they don't achieve the greatness that the side 1 songs have. Otherwise this album would have ranked five stars from me.The first three songs are full of the complexity of structure that makes the best Gentle Giant a true wonder to linen to. The vocal arrangements are like no other band's, the instumental arrangements are a pieced together like a puzzle, and everything falls into place perfectly.The second half, while having much of those same qualities, sounds rushed, and less intense than the preceding songs. Again, not bad, but none are high up on my play list."
    },
    {
      "reviewer": "friso",
      "date": "Posted Thursday, January 14, 2010",
      "rating": 4,
      "text": "Gentle Giant grew out of experimenting wildly and started to become this very stable force of progressive rock on the album Octopus. Free Hand is an almost too perfect record of well produced and extremely well composed eclectic music. What the album seems to lack is the excitement of raw musical exploration though. Perhaps the band became a bit too good and stable for its own sake. That doesn't take away from the fact that probably every song on this record is still more original than the songs almost all other progressive rock acts would produce in 1975. On Free Hand you can hear very complex prog not become avant-prog, and that's a great thing in and of itself. The production and sound of the original vinyl is great as well."
    },
    {
      "reviewer": "progrules",
      "date": "Posted Tuesday, January 26, 2010",
      "rating": 2,
      "text": "Ok, I will have some more explaining to do about this band where my feelings are concerned. So far I have done two reviews (the debut+Three Friends) and gave them respectively 3 and 4 stars. That could give the impression I quite like the band but this is not the case. Here we have an example of an album by them that I'm not at all fond of. And strange enough it's one of their most popular ones amongst fans. A fan I'm not obviously and there will be something I don't understand when I listen to their music.The most important thing that makes me feel very ambivalent about them is: why does a band that is so talented (at least I agree about that) need to play their music in such a daft way. Anyone who can explain this to me is welcome to send me a pm. But I haven't got a clue. Take Just the Same for instance, a song that's all about rhythm and a-rhythm, so far no problem. But what on earth is that crazy key sound doing in the middle for several times. It makes a complete fool of the song and band. Wacky stuff and why ???? It's the same as with their famous song Knots from their album Octopus where the foolishness is expressed by the vocals. I really don't see the point when they play their music like this. And they do this on this album a lot more than on the two previous albums I reviewed. On those the normal music prevailed but on Free Hand there are plenty moments that I cannot appreciate. The only aspect that's really nice on Free Hand is the medieval touch (recorder !) in two of the songs.I will make this my last review of a Gentle Giant album. I think I already witnessed their two best for my taste and the rest will both be torture for me as well as for the readers and mainly the fans who will get annoyed by those reviews. I've heard enough and I've had enough. I have been confronted with the reason why I don't really like Gentle Giant and will leave them alone from now on. Objectively I can hear this is special and I even understand why many people love them. But I also understand why just as many don't and to be honest, I'm one of them. I know I should give the album at least three stars for originality and quality. But the ratings we give are personal and so I will give my true opinion and will leave it at two."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Sunday, March 7, 2010",
      "rating": 3,
      "text": "If you're new to Gentle Giant, this is a great album to get into. It follows basically what progsters should expect out of their music; odd, complex compositions, lots of dynamic and stylistic changes, intricate vocal harmonies, unusual time signatures and the odd non-rock instrument here or there. FREE HAND has all of that stuff, and it's at least a decent album in that regard.My problem is I don't like the prog rock I'm hearing to be ''expected''; I'd prefer some edgy ''twist'' that makes the music more interesting than perceived. Gentle Giant in the past was always has given me a fix in this respect, but FREE HAND wouldn't do that. To put it bluntly, the music here sounds rather forced. All of the metres, changes, instrumentations, etc. sound expected, losing a natural vibe to it that really can't be explained.Maybe it's because after hearing three previous Gentle Giant albums, this one sounds just too ''ordinary'' by comparison; rather bland offering nothing adventurous for me. ''Free Hand'', ''Time to Kill'' and ''Mobile'' are all terrific songs, but they lack a certain creative spark that ignited things like ''The Runaway'' or ''The Boys in the Band''. There's plenty of good music here that newbie progsters will enjoy thoroughly and objectively speaking, FREE HAND has high prog credentials. However, if you've heard other earlier albums by this group, this one will sound like a slight disappointment."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Saturday, June 5, 2010",
      "rating": 3,
      "text": "Perhaps I'm missing something, or perhaps after years of familiarity with this album, something has not yet fully \"grown\" on me. However, ss of now, I just don't view Free Hand as great album by any means. In fact, I believe I prefer each album that came before it. In addition, nothing from this album would crack my top 10--maybe even 15 or 20--all time Gentle Giant songs.Does that make this a bad album, or an album not worth having? Definitely not! There is plenty of solid nu-Giant to be found here, and it still has that unique Giant quirkiness.Highlights: Just the Same, His Last Voyage, Mobile, Talybont. Again, these are simply good, not great, songs to my ears. The opener is fun, with some syncopated finger snaps throughout, and containing a pleasant, soothing mellotron mid-section. His Last Voyage is at its core a very simple song--particularly considering the band--but it is nicely paced, with nice use of vibraphone (I think that's what it is at least!). Mobile might be the most classic Giant song on here, with a free-flowing happiness that is lessened in their later albums.There are no dud songs on here, but the rest simply hasn't grabbed me as of yet. The title track strikes me as very repetitive, and here Derek's voice is a bit grating for me. On Reflection is one of the reasons we love the Giant--adventurous and creative. This is certainly not Knots II, but unfortunately sounds a bit overproduced (at least the vocal rounds) and perhaps forced. Still a fun song regardless.Free Hand is never great, but overall quite solid. Maybe I'll come to regard it higher over time, but for now, this does not rank up with Gentle Giant's best."
    },
    {
      "reviewer": "frippism",
      "date": "Posted Sunday, August 1, 2010",
      "rating": 3,
      "text": "I'm sitting here and thinking about this album. And I think, well it's nice and all, but it's far from GG's best. But then I think of the songs individually, and none of them are bad at all. They're quite quirky and catchy and yet pure GG. But I think the problem lies with the fact that they are catchy. I've always had this ethos- a good prog album is never good on the first listen. I loved this album from the very beginning, and listened to it quite a lot. Now I think that just about after the 20th listen is when things started to get a bit tiring. The hooks that are here are starting to get annoying. But there are definitely some very big positive points: The much talked about \"On Reflection\" is amazing, and the Capella beginning is one of the most creative things heard in progressive rock. The starting track \"Just The Same\" I still rather enjoy, but it too is a bit filled with hooks. The two tracks that really annoy me are the title track and \"Time To Kill\". This tracks are just a bit too, well, \"rock\". It misses a bit of the things that make GG unique and are both again, filled with a bunch of hooks. \"His Last Voyage\" is actually really good, the beginning sounding as some of the most challenging riffs I have heard. The two closing tracks are fairly strong. \"Talybont\" is probably my favorite track, really nailing the medieval/renaissance feel GG has that makes them special. \"Mobile\" is also very good.I feel like this album now that I think about it is pretty good. But then I listen to it again and find that unlike \"Octopus\" or \"In A Glass House\", this album is missing some of the depth that made those two other albums and some of the other GG albums (Giant For A Day of course excluded) enjoyable listens after the 100th and the 1000th listen. Definite buy for any GG fan, and for those just starting with GG this is a pretty good start, but this is missing what made GG really unique."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Wednesday, November 3, 2010",
      "rating": 2,
      "text": "Free Handis another fan favorite, but while I have generally been enjoying my ride through the GG discography, this album is an absolute turn-off; it's cold, mechanical, contrived and snobby. I guess my main gripe is that I can't find anything spontaneous or emotive about this album.GG are a talented bunch, but if their skills are not backed up by memorable songs, their music easily turns into the kind of mathematical constructed precision that I appreciate in a BMW limousine but that is very far removed from what I want to spend my time listening to.This album sounds dead to me, it leaves no room for interpretation, it's over-rationalized and far-fetched. The only track that I can get into isHis Last Voyage, one of those eerie GG songs that clearly show where Toby Driver got his ideas from. I also can't see the point of the continuing medieval madrigal type of singing. After 7 albums it's become really tiresome, a gimmick rather then anything else.I always appreciated many songs on the preceding GG albums, andAcquiring the Tasteeven established itself as a favorite car-album past summer, but when it comes to their latter-day albums I'm obviously missing something, that incomprehensible something that makes these albums so appreciated with fans. Hardly 2 stars for me."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Saturday, November 6, 2010",
      "rating": 2,
      "text": "I was quite irritated while I was willing to post my initial review for this work. And this music worked so much on my nerves while reviewing this album, that I decided to leave it for awhile and give it another chance to rate better on my musical scale.But the more I listen to this album, the more I get upset with the music I am listening to. As long as instrumental parts are concerned, I can cope with it. But these vocals are seriously working on my nerves. They are an integrant part of the GG world though. The opening \"Just the Same\" is a perfect summary of my earlier description.\"On Reflection\" conveys some musical masturbation which is quite embarrassing to my ears. And I can only bear the title track with difficulties. Jazz music and annoying vocals: this is my perception of the next and title track. I can understand that there are other opinions than mine. I just hope that fellow reviewers will also understand that there are other opinions as theirs. If I look at the ratings, I belong to the 2% rating this album with only two stars.The second part of the album can't raise my enthusiasm either, on the contrary. The same irritating mood prevails (\"Last Voyage\", \"Mobile\"). I can't help: I don't like this album."
    },
    {
      "reviewer": "tarkus1980",
      "date": "Posted Thursday, April 7, 2011",
      "rating": 4,
      "text": "Ooh, this is better. The band is still taking the same complex, tweaked path they always have, but unlike on much of the last couple of albums, it sounds to me that the band really took the time to think its ideas through before committing them to tape. I mean, they haven't compromised their bizarritude one bit, but instead of blindly accepting every discordant and overly involved idea that passed through their fingers, it seems that they bothered to consider whether it was worth it to accept any given idea. Furthermore, whileOctopusmay have been their \"accidental pop\" prog masterpiece, many of the songs here could easily have passed, in the hands of a less ambitious band, as perfectly solid 'normal' pop songs. It should be no wonder that, as complex and proggy much ofFree Handis, it managed to chart respectably, and for several reasons may be the ideal introduction to the band.Indeed, the first half of this album is nigh unto perfect, easily my second favorite side from the band (my favorite, of course, is side one ofOctopus). I guess that there could be more Green and less Minnear (Kerry has somehow carefully snuck his way into the dominant instrumentalist of the band, for better and less for worse, sort of), but otherwise it would be hard to come up with complaints. \"Just the Same\" gets off to a startling beginning, with snapping fingers (Those pop sell-outs! They should change their names to Alterna-Giant or Gentle-Gianternative!), but on the other hand, they're alternating from channel to channel in an untrivial rhythm, so I guess it's not that shocking. But then you hear this bouncy keyboard line that bleeds poppiness (until you realize it too is going off a bizarre rhythm), then it's echoed by guitar chords that bleed poppiness (with the same realization), then Derek sings a catchy-as-hell (but not conventional) vocal melody while all sorts of strange things are going on underneath to ... poppy effect. Yup. On paper, this combination of raw elements would look anything but memorable, but sure enough, they pull it off. Of course, it also has a bunch of nice atmospheric mid-sections, some with Gary playing slow and pretty lines, some dominated by sax-keyboard jams, none of which manage to detract from the \"main\" song material or seem particularly 'tacked-on.' Great stuff.Next up is \"On Reflection,\" which has hands down the most spectacular group vocal arrangement by any art-rock band I've ever heard. They manage to convey a major medieval atmosphere with vocal lines that would make any modern classical composer proud, and the way they intertwine with each other, both melodywise and in the timbre of the members' individual voices, is something that I find myself coming back to again and again on this album. Of course, it's also multi-part, so there are multiple themes in which these amazing harmonies get to frolic, with reprises of the opening coming at just the right points. Yet as great as this track may be, it does not overshadow its successor, the side-closing title track. The opening is a terrific example of how complexity can still be beautiful, and the main song part, which is basically some sort of preverted progressive funk, has to be one of the best combinations of \"tweaked\" and \"memorable\" the band ever came up (that's a high compliment, of course). It's screaming out for a go-nuts guitar solo in the middle, which unfortunately never comes, but I definitely don't mind much while listening.Unfortunately, the second side doesn't entertain me as much as the first (else it would easily get a *****). \"Time to Kill\" would sound great on, say,The Power and the Glory, but coming out of the shadow of the title track, it doesn't grab me much. Then again, even when I listen to the second side on its own, the track doesn't strike me as particularly impressive - just a decent, strange pop song. Likewise, while I like the jig- atmosphere of the closing \"Mobile\" quite a bit, not to mention parts of the melody, it still doesn't make me jump up and down for joy. As for the other two, \"Talybont\" is an ok keyboard-driven instrumental (I'll say this at least - it beats the snot out of the instrumentals on Genesis'Wind and Wuthering), but man, you don't know how much I find myself longing for some trumpets or cellos or glockenspiel. Still, this is the side that has \"The Last Voyage,\" which starts out sounding like something I'd expect on a good Steve Hackett solo album, then gets weird like all GG does inevitably does, but always remains purrty.All in all, then, it's definitely one of the better GG albums out there. It definitely shows a regained focus at making music that makes sense while still being weird, as opposed to the last album, where the weirdness was mostly running the show. Unfortunately, the balance was about to come undone again, to ill effect."
    },
    {
      "reviewer": "colorofmoney91",
      "date": "Posted Friday, April 8, 2011",
      "rating": 5,
      "text": "Along with the previous two albums, this Gentle Giant work of art is an absolute masterpiece. The overall sound of this album is mostly a combination of the eclectic more medieval based compositions of In a Glass House and the super tight funk inspired The Power and The Glory. The supreme complexity of the music is constant throughout and occasionally makes way for some infectious melodies, which I've always felt Gentle Giant had a knack for. Anyone who loves fantastic bass will love listening to the bass on this album. From the first track, the bass is absolutely wild and extremely creative while being funk inspired.Very highly recommended and masterly crafted eclectic progressive rock."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Sunday, June 12, 2011",
      "rating": 5,
      "text": "First released in the UK on their new label, Chrysalis Records, on August 22, 1975.Line-up / Musicians: - Derek Shulman / lead (1-4,7) vocals, treble recorder (6), alto saxophone (1) - Gary Green / electric & acoustic (5,7) guitars, descant recorder (2,6), co-lead vocals (2) - Kerry Minnear / piano, honky-tonk piano (7), Wurlitzer electric piano (3,4), Hammond, clavinet (3,5-7), Minimoog (1,2,4), synthesizer (1,3,6), harpsichord (2,6), celesta & glockenspiel (2), vibes (1,2,5), marimba & tympani (2), harp & cello (2), tenor recorder (6), lead vocals (2-5) - Ray Shulman / bass, violin & electric violin (7), viola (2), co-lead vocals (2) - John Weathers / drums, percussion1. \"Just the Same\" (5:34) displays some new instruments, the best recording/mix/engineering to date on a GG album, a more laid back feel to the band's song delivery, yet with all band members' virtuosity on full display--especially Ray Shulman at his absolute best on bass. (9/10)2. \"On Reflection\" (5:41) is not as overboard or \"masturbatory\" as some reviewers complain. It is tidy, melodic, makes lyrical sense, and does an amazing job of transporting one to a time long past. I find this one much more accessible than \"So Sincere.\" (9/10)3. \"Free Hand\" (6:14) founds itself on such a nice little weave--complex but subdued, never over-powering or overwhelming, and the vocal part is, for me, one of the most powerful and emotional of the GG repertoire. (9/10)4. \"Time to Kill\" (5:08) is kind of an early version of the music brought to us by Fripp-Levin-Belew six years later on the song, \"Discipline.\" A maturely constructed and performed song, it does get a bit boring and/or tedious from time to time. (8/10)5. \"His Last Voyage\" (6:27) is like Steely Dan supporting a monastic choir--so well paced and subtlely constructed. Definitely a band at their most mature, most composed and confident--with nothing left to prove. Mastery has been achieved and here are the just desserts. (10/10)6. \"Talybont\" (2:43) is a very fun little jaunt through the medieval world--like going to a Renaissance Faire. Well mete, lads! (9/10)7. \"Mobile\" (5:05) feels older--as if it came from the Three Friends or Octopus recording period. A little more youthful rock'n'roll oriented, less mature and introspective. (7/10)Total Time 36:52It has taken me quite some time to re-immerse myself into the GG catalogue. I have enjoyed every minute of it. Especially with this one. IMHO, Gentle Giant peaks with this album. The compositions and performances are so masterful and mature, so polished and sublime. Gone are the flashy, cerebral, ever-so complicated, show-off-your-virtuosity-because-you-can songs; here the songs are unique and so intricate--even subtly nuanced.Kerry Minnear's keyboards, Ray Shulman's bass, and John Weathers' drumming have never been better than they are on Free Hand. This one is a masterpiece of one of the most truly masterful bands in rock music history.A/five stars."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Monday, October 3, 2011",
      "rating": 5,
      "text": "After the angry politically-themed Power and the Glory, Gentle Giant changed tack yet again to bring us the thoughtful and profound Free Hand, a meditation on whether there really is such a thing as free will. From the catchy (but still complex) Just the Same to the complex vocal layers of On Reflection (which interweaves its vocal harmonies with some fine vibes from John Weathers) to the tender and poignant His Last Voyage - possibly the most beautiful track the band ever recorded - this is a treasury of brilliant performances from a band who, in their prime, were one of the most consistently excellent groups on the prog scene."
    },
    {
      "reviewer": "rogerthat",
      "date": "Posted Saturday, May 19, 2012",
      "rating": 5,
      "text": "Funk reached its commercial height in the 70s and musicians working in other genres too adopted funk elements, which lends 70s music, or rather what bands are taken to represent the 70s sound, part of its distinct flavour. Herbie Hancock went funky in the early 70s and it was a pervasive influence in the jazz-rock/fusion scene of the time. But there was not much of funk going on in 70s prog, outside JR/F as already mentioned. It was up to Gentle Giant to deliver a very funky prog rock album and so they did with Free Hand.In the process of doing so, they achieved the seemingly impossible - making their music more accessible than before and yet upping the ante in terms of complexity. On the one hand, they laid down some of their most infectious grooves on songs like Just The Same. They always had a bit of funk in their music but it was never so prominent in their sound.The heavy metal of Acquiring The Taste and Octopus is pushed back a bit to allow for this smoother version of classic Gentle Giant. It does make an appearance at the start of Time to Kill in the form of crunchy riffs but they disappear seamlessly to make way for another funky groove.On the other hand, their contrapuntal wizardry reaches its zenith with On Reflection. Even if you have already heard Knots, you will still be dazzled by the complexity of this composition. It is devoid of the unsettling dissonance of that other Gentle Giant masterpiece I mentioned, but you will have your hands full just keeping pace with layer upon layers of harmony. All neatly resolved and very efficiently too, in trademark Gentle Giant fashion. Amazingly, these are basically combinations of very lucid vocal parts, individually, so that the song is actually not so hard to digest and doesn't feel mindboggling to listen to, not if you have already heard Gentle Giant before at any rate.An aspect that stands out on comparing Gentle Giant to the more, um, gymnastic technical rock music of today is how economical these compositions are. They are short and sharp and there are hardly any solos of significant length to demonstrate the skills of these wonderful musicians. Instead, the songs are put together tightly and the complexity is more in the way these songs have been conceived. And this time, unlike Octopus, there are some catchy choruses to sing along to.Alas, the vocals make them less sing-able than they should ordinarily be. The smooth, funky flavour of the album actually takes Gentle Giant's closer to that of Steely Dan than ever before. But not only is Derek Shulman no Donald Fagen, he is honestly not very good. I am not referring to just technical facility here; the very manner in which he renders the melodies is perhaps not the most appropriate choice for these songs. I feel a bit more effort to adapt and emphasise the funk elements in this album would have made it even more appealing.It doesn't stand out so much to Gentle Giant fans, actually, because Shulman is only doing as Shulman does. But it could potentially be an off putting element for first time listeners. Given that vocals often make or break a band for listeners, I might just have hit upon the very reason why Gentle Giant, with their emphasis on short and somewhat goofy prog rock songs, didn't enjoy the kind of success that Yes or Genesis did.But I personally am used to Shulman and his singing style is distinct, albeit in a somewhat dubious light, and further marks out Gentle Giant as an unique band. On Free Hand, they are absolutely on fire, so much so that even good tracks like His Last Voyage seem to drag a bit after you have been treated to Time to Kill or Just The Same. Their tightest, smartest statement up to that point and, unfortunately, to date. 5 stars without hesitation."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Monday, October 22, 2012",
      "rating": 4,
      "text": "'Free Hand' is manic Gentle Giant compositions from end to end with trademark multi part harmonies and frenetic time sig changes throughout. It begins with glorious melodic mayhem on 'Just The Same' and then launches into the weird Gentle Giantism harmonies that sound like some parody of medievalism 'On Reflection'. The opening section is almost maddening in it's delirious harmonising but it soon breaks into some fabulous melodies with a nice gentle dreaminess that pleases my senses.The best song is to follow with the title track, that I adore when I hear it on any compilation or the original album. The remaster is crystal clear and even better. The vocals of Derek Shulman are excellent throughout, strong and easy to comprehend. 'Time To Kill' is certainly a highlight with some chaotic signatures and wonderful musicianship. The pleasant chimes and acoustic guitars are a feature of 'His Last Voyage' before the very melancholy vocals echo along the melody line. The wah wah lead break is a great augmentation to the jumpy piano line. My least favourite track on the album is the sea shanty instrumental 'Talybont', but it's like a transition and fully instrumental.The bonus tracks as with all GG remasters are very good and fill the CD nicely. On 'Free Hand' there is previously unreleased '1976 Intro Tape', just an instrumental filler really, and from the John Peel Sessions 'Just The Same', 'Free Hand' and 'On Reflection', all different versions of these gems and nicely performed. Also we have 'Give It Back (International 7\" mix)', a strange reggae riff and quite out of place commercial style for this earlier album though works nicely on 'Interview', and 'I Lost My Head (7\" mix)' is a very good song. All tracks are intriguing and worth a shot, though not to return to as often as side one of this release. The album is close to a masterpiece, at least side one of the original would be classed as such, but it kind of meanders along in side two, even sounding outdated, like some hippy trip to tune out to. In any case, this is one of the greatest GG albums and should be heard by every lover of eclectic prog."
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Wednesday, February 4, 2015",
      "rating": 4,
      "text": "'Free Hand' - Gentle Giant (78/100)Free HandisGentle Giantat their most energetic, their catchiest, their jazziest, and- at least sinceAcquiring the Tastefour years and half a career prior- their most playful. Given the increasingly dry and stately route they had taken onIn a Glass HouseandThe Power and the Glory, to hearGentle Giantinject a little soul into their craft feels as refreshing as any of their more objective shifts in style. Barring that, this is very much the sort of album we might have expected by that point fromGentle Giant. Always preferring to say less with more, the rediscovered pop hooks are swept away with the trademark bombast and near-crippling aural complexity. The lean towards hooks and otherwise conventionally satisfying songwriting doesn't always work out onFree Hand, but it's one of the few times inGentle Giant's proud career where the guys sound like they're operating outside their comfort zone.Free Handis typically described in terms of its so-called 'pop sensibilities' relative to the rest of their albums, but any talk of pop goes tandem with the damning implication that a progressive act must have simplified their craft.Gentle Giantwould indeed try for a laughable 'commercial' approach a couple of years later (in a sense paving the way forYesandGenesis, who would try pop with far greater success) the hooks onFree Handare just another layer to an as-ever complex and indigestible maelstrom of rock, jazz and classical traditions.I'm not convinced the juxtaposition between the catchy and complex entirely works onFree Hand, but like the best ofGentle Giant's work, there's something to be said alone for the boldness of the undertaking. Take \"Just the Same\"; the rhythmic bounce and bright melodic focus in the verse could have foreshadowed what the Phil Collins-ledGenesiswould be doing a decade later, but the superfluous layers of noodling guitars, keys and who-knows-what-else are far more challenging than the hooks are catchy.In my original review ofFree Hand, I noted that the album place a greater weight on conventional songwriting. I don't believe that is true anymore, though I can see why I first had that impression.Gentle Giant's approach to composition is just as sporadic and 'everything but the sink' as ever, but the band's use of melody in that context is much more tactful. \"Free Hand\" and \"Time to Kill\" are instrumentally clustered and frantically busy, but Derek Shulman's vocal lines sound as if they genuinely believe they're part of a pop or disco song. Although the hooks do little to endear the music on an emotional level, it's legitimately surprising how infectious they can be, especially givenGentle Giant's feeble track record when it's come to sweet and simple songwriting.If there's anything that really setsFree Handapart from its most recent antecedents, it's not so much the melodic writing (it does help, mind you) but the feeling of vivaceGentle Gianthave injected into their performance. Whenever I'm listening attentively enough to an album, I'll get a mental visual of the band playing, as though I were there at the time it was recorded. While I did come to loveIn a Glass Housein time, the accompanying image was sombre and sedentary;The Power and the Glorywas drearier still- even the liveliest parts sounded likeGentle Giantthemselves were emotionally detached. I could never callFree Hand(or any otherGGalbum) an emotionally involving experience by any stretch, but withFree Handit sounds like they're having a lot of fun playing it, which- while rare- wasnevera bad thing to hear in progressive rock.Free Handwould also seeGentle Giant's jazz and Medieval musical influences come full force. While the jazz manifests itself in the band's fusion-style riffing, it's great to hear the latter given greater attention. While some might argue that \"Talybont\" isn't more than an interlude piece, hearingGentle Giantthrowing caution to the win and immersing themselves in their Medieval influence is surprisingly gratifying. The largely acapella \"On Reflection\" basks in classical austerity; the overlapping choral arrangement is one of the most impressive thingsGentle Giantever did, for its composition and performance alike. While the hard rock-oriented \"Mobile\" sadly fits their tradition of less-than-spectacular closing numbers,Free Handstands among the finer accomplishments ofGentle Giant's career. Akin to their very ownGoing for the One,Free Handacknowledges thatGentle Giantcouldn't function on pomp and pretentiousness and alone. Music of this cerebral sort always needs some kind of visceral hook to be interesting, and following a spot of dryness in the mid-stage of their career,Gentle Giantmanaged to partly dispel that issue here. You can hear a shard of that same compelling energy on their following albumInterview, butFree Handstands as the last relatively 'great' albumGentle Giantwould make before they started to finally unravel."
    },
    {
      "reviewer": "TCat",
      "date": "Posted Monday, March 16, 2015",
      "rating": 5,
      "text": "This was Gentle Giant's first release on the Chrysalis label and it was also an attempt to make their sound a little more accessible. I say a little more accessible, because it was just a very slight compromise and they really didn't lose much of their sophisticated yet very progressive sound. Eclectic prog is the perfect genre for this band because eclectic definitely defines their music. Very odd meters and time signature changes pop up constantly. Yet their sound is very renaissance sounding, folkish, yet complicated with plenty of jazz mixed in. This slight adjustment to their sound ended up being the thing that would bring them to the attention of the American audience they were trying to attract. And they did it without much of a compromise to their sound, other than maybe cutting out much of their classical/modernistic sound, becoming a little less avant garde, yet still keeping things technically difficult. Even hardcore prog fans seem to have a hard time penetrating the accessibility of their sound, but this album did become the most accepted.This album is excellent, even more complex than the prog folk masters Jethro Tull. It is not easy to appreciate on the first listen because it is so complex and, yes, eclectic. Their folk leanings shine through but never overbearing. Composition and formation of the songs is anything but conventional. The vocals are a little strange, and I find them the hardest thing to get used to, but keep with it and you will come to accept it. As far as the instrumental passages here, you will find yourself wanting to dance a jig at times, but the music never remains with a constant enough beat that you just can't quite seem to get the right beat, and that is how it should be with this music. The only way you can dance to this is in a madman style.I will not try to break down these complicated songs, they are there for you to listen to and plenty of other reviewers have already done that for you if you are interested. The sad thing is that Gentle Giant, even though they have a huge cult following, never really caught on and received the high regard and awe-struck status that other progressive bands like Yes, Genesis, Jethro Tull, Pink Floyd, King Crimson and many other received, but they are very deserving of that status. Their music is definitely complex, the most complex folk-oriented music you will ever hear. They can't be considered folk prog though because it is too complex and also incorporates jazz, electric music, and modernistic styles. Hence, with the many genres incorporated, even with the overall medieval rock sound, there is just so much more than that. I mean, what other band would be able to take the vocal acapella harmonies in \"On Reflection\" and perform it outside of the studio without a conductor? I doubt there are many that could do that. Sure there are many that could play the difficult passages and odd time signature changes that exist in songs like the popular title song \"Free Hand\" but they would only be those who were the most talented, and I doubt they would be able to do it without a lot of preparation. Have you ever heard anyone cover a Gentle Giant song off the cuff in concert? I don't think so.Yes this is great stuff and should be considered a masterpiece of prog and nothing less. Even if you don't like it, you should still own it and try to let it work it's way into your mind. Simply amazing. Essential music for all prog fans."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Sunday, February 14, 2016",
      "rating": 5,
      "text": "Review N� 57Gentle Giant was a band formed in 1970 by the three brothers Shulman, Phil, Derek and Ray. The group was known for the great complexity and sophistication of their music. The band had diverse musical influences like rock, jazz, classical music, blues and medieval music. They never were a huge commercial success but they managed to achieve a great cult of followers, while they still existed. I always saw similitude between the careers of Gentle Giant and Van Der Graaf Generator. Both wrote some of the best, most complex, original, creative and beautiful musical pages in the history of the progressive rock music. At the same time, and despite they're now being considered two of the best groups and that most contributed to the progressive music history, both had some problems with the record industry and both had also a small base of support fans, thought faithful and unconditional in the supporting of both bands.'Free Hand' is the seventh studio album of the band and was released in 1975. Strongly influenced by the music of the renaissance and middle Ages, it became as one of the most popular and accessible studio musical releases made by the group. The lyrics on the album reflect the lost love and the damaged relationships between people. With 'Free Hand', Gentle Giant produced one of the most creative and complex recording releases in all the progressive rock musical history. However, despite the complexity of their musical arrangements, their music is very accessible and melodic and their vocal approach was really very revolutionary for those times. 'Free Hand' is unique and unpretentious progressive rock album that couldn't have been delivered by any other band besides Gentle Giant.'Free Hand' has seven tracks. All the songs were written by Kerry Minnear, Derek and Ray Shulman, except 'His Last Voyage' which was written by Minnear and Ray Shulman. The first track 'Just The Same' is a song with one of the traditional beginnings of some of the Gentle Giant's tracks. The song opens with fingers snapping and curiously ends in the same way. It's a very slow rock song with good keyboard work that has also some jazz influences. This is a great song to open the album. The second track 'On Reflection' starts with one of the most spectaculars Gentle Giant's traditional trademarks, the polyphonic vocal inspired by renaissance and the cappella music. Musically, it's a very interesting track due to the changes between acoustic and electric instruments, but is essentially an acoustic song. It's clearly a song strongly influenced by the troubadour's songs of the medieval era. The third track 'Free Hand' is the title track song. It's a more elaborate and complex song than the two previous tracks. We may say that this is a traditional Gentle Giant's track with some dissonant parts and with constant changes of rhythm and tempo. It's without any doubt one of the best songs on this album. The fourth track 'Time To Kill' is the rocker song on the album and is also a song with other traditional Gentle Giant's overture, this time with a computer game. It's probably the simplest song on the album and it suffers also of some jazz influences. The simplicity of the song and the vocal parts are probably the main reason why this song is the least loved on the album. The fifth track 'His Last Voyage' is the most tranquil piece of music on the album. It's probably one of the most beautiful songs ever created by the band. It has good keyboard and guitar workings with particular emphasis to the way how Minnear sings it, which makes us feel the departure of someone to his last voyage to the afterlife. The sixth track 'Talybont' is another baroque song with the clear influence of the musical era of the middle Ages. It's almost a folkloristic instrumental medieval song very beautiful and agreeable, and seems that was composed for a sound track to a Robin Hood film, which I think never saw the light of the day. Anyway, Gentle Giant decided included it on the album. The seventh track 'Mobile' is a track that combines a nice acoustic guitar, keyboards and violin working, during the open of the track, with a perfect harmony. It's another song with some complexity and where each instrument seems to play free and disconnected of the other, but always with an excellent harmony. This is a song perfectly chosen to close this magnificent musical work.Conclusion: 'Free Hand' is one of my favourite Gentle Giant's albums and is one of my favourite progressive albums too. 'Free Hand' is the last masterpiece created by the band and is also one of the most accessible of the Gentle Giant's albums. The combination of superb musicianship, dry wit, and creative compositions make of 'Free Hand' an essential piece and an historical recording. All of this proved that the band could write all type of songs that they wanted to do and that could be good, creative, complex and at the same time accessible and melodic. The album has great instrumentals, advanced vocal numbers, good ballads, acoustic and electric parts and exceptionally very well structured songs. Unfortunately, the future came to show us that this wasn't the route that would be taken by them.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Thursday, August 24, 2017",
      "rating": 5,
      "text": "As the early boom of progressive rock waxed and waned in a relatively short period from 1969 to 1975, many bands came and went or transmogrified into ever increasing commercial arenas that sacrificed their earlier ambitions, however through it all GENTLE GIANT continued to crank out albums that continued to hone their prog rocking skills to new heights despite flirting with the more accessible song structures that were slowly simplifying the defining qualities that made prog rock, well so bold and daring. By the time 1975 arrived when they released their seventh album FREE HAND, the two remaining Shulman brothers had steered their creative outfit into prog rock the pinnacle of prog refinement successfully retaining their perfect marriage between brutal prog complexities and pop hook sensibilities.After more than paying their dues and striking a friendship with Jethro Tull on the extensive touring circuits, this British band scored a contract with Chrysalis Records in the UK but found their most successful charting album on the US Billboard charts (#48). Gone were the long bouts with dissonance and in was a slightly more accessible sound with the most sophisticated of production values mixed in quadrophonic but nevertheless still dressed up with the unmistakable GENTLE GIANT-isms such as their polyphonic instrumental gymnastics, folk laden vocal fugues and heavy modern rock resonating side by side with renaissance anachronisms. However by this time, the band was a fully fueled prog rock machine churning out one addictive tune after another with all the excepted prog soaked outbursts of ambition.Taking a lighter approach from the more political charged \"The Power And The Glory,\" FREE HAND found the band at their most commercial crossover potential without sacrificing one little bit of all those luscious idiosyncrasies that made the band stand out from the pack. With catchy, even funky riffs as on the opener \"Just The Same,\" GG proved they could adapt their unique time signature frenzies to the most contemporary sounds of the era but in the end composed music that sounds timeless in nature. While steeped in hard rock guitar riffs that connect the band to the burgeoning prog rock scene that was in the process of giving way to less ambitious musical genres, GG found a way to transverse both sides of the fence.Despite constructing much easier to follow overall song structures, somehow GG exploited every available option to unleash their magic. \"On Reflection\" comes off as a somewhat catchy little tune but in a short timespan runs the gamut of vocal harmonic fugues in playful interlude with Kerry Minnear's plethora of impressive keyboard runs with plenty of time signature outbursts that should kill any sense of continuity but actually serve to heighten the sense of adventure with an impressive eclectic collection of instruments trading off including the harp, cello, violin, viola, vibraphone, glockenspiel and the list goes on. GG effortlessly exhibits some of the best musicianship prog rock has to offer with their exhaustive fusion of rock, jazz, folk and Baroque classical into sensual yet aggressively angular melodic hooks.As with any GENTLE GIANT album, you really have to go into it on the band's own terms in order to appreciate FREE HAND. Despite being laced with easily digestible hooks the band still finds the perfect marriage with escapades into the unconventional instrumental and harmonic bombast. While their newfound catchiness was the perfect gateway into the following less sophisticated albums that would find the band fizzle out in irrelevance, FREE HAND is the point where they found all their trademark attributes in the perfect balance and the most recommended starting point to explore the utterly unique musical universe that the band had spent the early 70s constructing. Yet another masterpiece in a long string of outstanding musical gems."
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Wednesday, December 5, 2018",
      "rating": 4,
      "text": "Free Hand continues with simple and linear songs, very clean sound, driven by the keyboards of Minnear, which characterized the previous Power and Glory. Also in this album are missing major innovations in the arrangements, and Derek Shulman as already in Power and Glory tends to a sung too screamed in rock songs, however here are also important ethereal moments, slow, dominated by an atmosphere of silence that are missing in the his predecessor.First side that starts with a very strong rock piece, with Minnear that makes the numbers in the instrumental parts; then in the second come the choirs and medieval music left to the angelic voice of Minnear, alternating with percussive moments. The third piece, Free Hand, which has a great start with the piano, soon becomes a rock screamed with continuous dissonant piano phrases reminiscent of the pieces of Glass House. 1) Just the same 8; 2) On Reflection 7,5/8; 3) Free Hand 7,5;Second side with a first minor rock song, fast, a bit 'anonymous, with instrumental pieces that recall those just heard in Free Hand. It follows a beautiful composite piece (His Last Voyage), with Minnear singing the ethereal Renaissance part, which fades into a good instrumental interlude with the best guitar solo of the album, which finally brings back to the initial theme. The song is the best piece on the album. Talybont is the short medieval instrumental piece that, together with the others, creates this renaissance atmosphere on the album, diffused in the less rock pieces. Mobile ends with a pulsating rock, very strong, where there are also violins to create continuous rhythmic and timbral variations, which are more connected to the sound of Glass House than of Power and Glory. 4) Time To Kill 7; 5) His Last Voyage 8; 6) Talybont 7; 7) Mobile 7.Overall, it is a good album, measured, very homogeneous, with no peaks or drops, which alternates, and partly melts, a rock soul, which combines Power and Glory and Glass House in good and bad moments, and is full of medieval atmosphere , which expresses the best of the album.Medium quality of the songs: 7,46. Vote: 8+. Rating: Four Stars."
    },
    {
      "reviewer": "Rivertree",
      "date": "Posted Monday, November 15, 2021",
      "rating": 5,
      "text": "And then Steven Wilson has lend a free hand with this also ...... a new chance for getting back to that alltime progressive rock classic again, isn't it? When the album had been released in 1975 I did not have a considerable focus on the band really. The same goes for the Van Der Graaf Generator crew for example. Rather tough to get into, too tricky and angular according to my taste, at that time. But during the following decades step by step I learned to adore this stuff. And now an extra reminder, just as a side note, later I stumbled upon a somewhat special correlation. I'm referring to the involved drummer John 'Pugwash' Weathers, who in the mid 1980s was committed by a newly formed Man band incarnation, substituting Terry Williams in this case.Next step. An eponym possibly? Hah, the album title always reminds me at the times when this (nearly) equally termed pioneering Desktop Publishing application came up with its initial releases. I was involved early on, a very innovative but also stressful phase, when looking back at my professional career. Back to the topic now. It's the band's most commercially successful album. And has experienced a few re-mastering as well as re-release attempts in the past already, enhanced with bonus tracks aso aso ... I'm especially dealing with the new Steven Wilson remix in Dolby Atmos & 5.1 surround sound. Featuring vinyl or Blu-Ray disc format this comes in four different variations, again enhanced with bonus tracks aso aso ... but this also includes a CD version solely offering the originally applied seven songs, not less, not more.That's what I'm writing about. Sounds fresh and freehanded. A good starting point, if somebody still should be new with this band. Overboarding creativity, unpredictable flow, a lot of different instruments utilized. Vocals that are perfectly matching with the cunning instrumental behaviour, or vice versa, if you will. This helps setting new standards, definitely was ahead of time. No wonder, many bands and artists still are drawing on this. The weirdOn Reflectionfor example is concentrated on delivering experimental polyphonic vocals for the most time. I avoid reattempting to analyze track by track here. Has been tried enough times before, what often enough failed anyway. My sole advice: listen and learn, as often as possible."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Monday, October 14, 2024",
      "rating": 4,
      "text": "Moving to the ranks of a major label like 'Chrysalis Records' after their 1974 concept album \"The Power and the Glory\", meant for Gentle Giant an effort to expand the reach of their talented music towards new audiences, and whose first collaborative result was 'Free Hand' (1975), the band's seventh album.This renewed stage brought with it a greater fluidity in the English band's musical approach, at the cost of partially ceding a bit of originality and spontaneity, and it seemed at times to be unclear which direction to take, repeating themselves and configuring a scenario halfway between one thing and the other, reflected in songs that combine the most accessible funky vibes with jazz elements, as in the energetic \"Just the Same\" (excellent keyboard solo by Kerry Minnear) or in the demanding \"Free Hand\", or as in the also lively tune \"Mobile\" complemented with rock and Celtic overtones and the protagonist presence of Ray Shulman's wandering violins.Despite more digestible sonic additions, the experimental streak is deeply embedded in the band's DNA, and it is then that the songs feature those shimmering passages deployed in convoluted and shifting structures, as in the eclecticism of the intricate \"Time to Kill\" and its American rhythm and blues feel, in the polyphonic choral arrangements of the baroque \"On Reflection\", in the beautiful medieval and jazzy atmosphere of \"His Last Voyage\" marked by Gary Green's acoustic arpeggios, Minnear's keyboards and crowned with an agonising guitar solo, and finally in the short instrumental \"Talybont\", which Minnear's harpsichords and clavinets also set the scene in the Middle Ages.\"Free Hand\", with its ups and downs, is a very good album, one of the most commercially successful of Gentle Giant's career, and also one of their last great works.3.5/4 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album73d5.html",
  "last_parsed": "2025-05-18T00:15:55.822273"
}