{
  "album_title": "ELEGANT GYPSY",
  "artist_name": "Al Di Meola",
  "year": 1977,
  "rating_value": 4.26,
  "rating_count": null,
  "review_count": null,
  "genre": "Jazz Rock/Fusion",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/2075/cover_5241141472016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Flight Over Rio",
      "duration": "7:16",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Midnight Tango",
      "duration": "7:28",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Mediterranean Sundance",
      "duration": "5:14",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Race With Devil On Spanish Highway",
      "duration": "6:18",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Lady Of Rome, Sister Of Brazil",
      "duration": "1:46",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Elegant Gypsy Suite",
      "duration": "9:16",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Zitro",
      "date": "Posted Sunday, October 23, 2005",
      "rating": 5,
      "text": "It is short, but it is easily my favourite jazz-fusion record and the best guitar driven solo effort. I give it five stars not only because it is a masterpiece, but also because it would really appeal to prog fans. Why? Because of the musicianship!!!!! All the musicians in this record are at least excellent (pay close attention to the drummers), and Al Dimeola is a guitar God. Most of the songs are in fast tempos and have plenty of solos.There is also an epic,althrough a bit short, to satisfy fans of long duration songs. I couldn't believe this was sitting on the shelf until I listened to it on August. (my father dislikes this album (and jazz- fusion in general) I just couldn't believe my ears when I heard it for the first time!Note : This album is instrumental.1. Flight Over Rio : Probably the best song in the album. I say probably because the album itself has this amazing quality of musicianship, technique, and songwriting. The song begins with a slow guitar riff, builds up in a jazz-fusion rhythms, and explodes in an accelerated musical nirvana in which a synthesizer and a guitar duel each other. Do you remember Wakeman and Steve dueling on the 2004 Yes tour? That's nothing compared to this!!! The song continues in a latin rhythm with latin percussions (kind of Santana-like) and finishes in the same way it started. 10/102. Midnight Tango : This is another song with latin touches in its percussion and rhythm. However, it is fusioned to jazz with amazing results. The guitar is absolutely phenomenal here and the keyboard behind that guitar (jazzy) gives what the song needs to sound with perfection. There is also a distorted guitar (or bass) riff that really shines. After some great soloing, another fabolous riff melts you, gives you a thousand goosebumps, and floors you. I just can't believe how powerful the music in this CD really is! The song ends with a good drum duet which wasn't really necessary (but it does not really hurt the quality of the song) 9.5/103. Mediterranean Sundance : This is a song in which guitar virtuoso Paco De Lucia harmonizes his acoustic guitar with Meola's one. The song sounds almost like flamenco with its extremely fast acoustic guitar playing style. This is one of my father's favourite songs of all times and I see why : try to find an accelerated acoustic song with this quality. It is a flawless showcase of Meola's talents. 10/104. Race With Devil On Spanish Highway : The song begins with a fast bass riff riff played with latin percussions and is sometimes interfered with lighting speed guitar runs. After that section is over, the music is more relaxing and is led by a guitar solo. The bass playing in here is pretty good and loud. The next sections involved in extremely fast drumming and riffing until a beautiful leaping guitar lick begins what is known as a masterful guitar solo. After that is over, the song takes yet another shift with similar riffs and themes but in different rhythms and continues to shift back and forth with noticeable differences and more guitar soloing until it ends with a fadeout. This has to be the most dynamic and unpredictable song on the record and a beautiful one, even if it is not a highlight of the album. 9/105. Lady Of Rome Sister Of Brazil : An acoustic track that lets you room to breath before you get to the epic (The most challenging song of the album). This little piece is outstanding and is as good (if not better) as Horizons from Genesis. 9/106. Elegant Gypsy Suite : This song may be prog rock/jazz because of the creativity, strangeness, length, style, and technique. The beginning of the track is majestic a bit playful, and obviously very complex. The riffs are very weird and interesting here, as well as the guitar sounds produced with whatever pedals he had used. After a riff repeated a big number of times, the song transform into an atmospheric section in which an amazing (and extremely strange) synthesizer solo dominates for over a minute and leave you surprised a synthesizer can sound so GOOD! The song later gets very jazzy and continues with more unusual riffing that sound very good and interesting after repeated listens. I especially love that muted guitar riff that occurs after a heavy riff somewhere close to the end of the song. The song ends very unexpectedly, but it is a good ending. 10/10Stop reading and get this album!!My Grade : A"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Sunday, October 23, 2005",
      "rating": 5,
      "text": "This follow-up album which was released one year after the successful debut \"Land of The Midnight Sun\" is another masterpiece album. Meola brought in other talented musicians to record this album: Paco De Lucia (acoustic guitar), Jan Hammer who used to play with Jeff Beck, great bass guitar player Anthony Jackson and his Return To Forever colleague Mr. Lenny White (drums). What a great line-up. The music is still in the same vein with the debut album but this time he even put more diverse in style by exploring more acoustic guitar work. What you can hear is the excellent combination of electric as well as acoustic guitar work throughout the album. I love all tracks presented in this album and my best favorite track is \"Race With Devil On Spanish Highway\" and \"Elegant Gypsy Suite\". The music is tightly composed with many tempo changes; dominated with guitar and percussive work.Highly recommended!"
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Sunday, July 30, 2006",
      "rating": 5,
      "text": "Al Di Meola's second album is ultimately my favorite album of his and is one of the best jazz rock albums available. All the elements of total success are here, stellar musicianship, creative songwriting, and fun and imaginative variances in the music. From heavy hitting power riffing to soft spoken acoustic guitar interludes, it is all here. From the very first second of Flight Over Rio to the pulsating closing seconds of Elegant Gypsy Suite, one thing is clear, this is an album that will be remembered for many many years to come. Like I said with my review for Casino, this album will surely be up the alley of any fan of guitar oriented music and any fan of high velocity Spanish influenced jazz rock.Flight Over Rio opens the album with some intuitive bass riffing from Anthony Jackson and some very smooth keyboards from Jan Hammer. There's a definite mellow mood during this introduction, but once Di Meola enters everything slowly changes. The track becomes more fast paced and high energy, with some stellar ascending riffs from Di Meola and great and precise percussion from Mingo Lewis, as well as a great keyboard/guitar duel between Di Meola and Hammer. It opens the album brilliantly, and the quality of the songs never really goes down. Midnight Tango has a very mellow atmopshere in comparison to Flight Over Rio, with some intuitive soloing from Di Meola over a steady rhythm section and some great wavy piano lines. Slowly the pace increases, although not to the pace of the first track. The well timed chord based bass guitar work is also really well conceived. Mediterranean Sundance begins with a nice drum/percussion duet between Mingo Lewis and Lenny White, but soon becomes an exceedingly complicated piece with some great acoustic work from Di Meola and Paco de Lucia. The interplay between these two (and later along with John McLaughlin on Friday Night in San Francisco) is incredible and shows some stellar abilities for both musicians who take turns hammering out the main beat while another solos on top of it, eventually becoming a duel solo movement.Race With Devil on Spanish Highway is probably my favorite song on this album. Beginning with a strong percussive rhythm and a cool bass line, the song soon evolves into an all out shred piece with riff after riff of powerful guitar lines that intertwine and spell out brilliance. There's a riff in this song that the group Liquid Tension Experiment would also quote in their song Acid Rain (or so I believe, they are very very similar). But besides that, there's nothing to dislike about this song, it's just high energy and very inspiring to listen to. Lady of Rome, Sister of Brazil is a short interlude before the finale of the album, Elegant Gypsy Suite. It is a little acoustic ditty that has some very somber playing on the part of both Di Meola and Paco de Lucia, who create a very mellow and light atmosphere with this piece. The album ends with the song Elegant Gypsy Suite, which begins with some acoustic work from Paco de Lucia before becoming a nicely flowing piece, with a great bassline from Anthony Jackson and some great underlying percussion from Mingo Lewis. As with all the tracks on the album, Di Meola is nothing short of brilliant, who really creates some gentle yet rough riffs on this piece, as well as gentle and incredibly complicated leads that utilize a nice wah/phaser effect. Throughout the 9 minutes of the track, there is a great sense of evolution and progression, and I never really tire of this stellar piece.In the end, Elegant Gypsy is right up there with Bill Bruford's One of a Kind as one of my favorite records in the jazz rock genre. There's a lot of excellent musicianship, killer songs, great arrangements, and an overall spectacular feel I get from this album. As I said in my opening paragraph, fans of guitar oriented music and highly technical jazz rock will probably be right at home with this album. I can't call this album anything less than a masterpiece and I am very impressed with this album. You probably won't be either. 5/5."
    },
    {
      "reviewer": "Chus",
      "date": "Posted Friday, February 16, 2007",
      "rating": 5,
      "text": "It's a masterpiece. Another latin fusion masterpiece.\"Flight over Rio\" sets the album off with it's bombastic bridge of guitar/keyboard interplay, followed by the part-mellow-part-heavy \"Midnight Tango\", with it's great percussive ending featuring steel drums and congas. \"Mediterranean Sundance\" gives the album it's rightful title with a sort of \"rumba flamenca\", starring also the one and only Paco De Lucia with his usual flamenco magic. And what about the quasimetal \"Race with the Devil On Spanish Highway\"?... not bad latin metal fusion, and though not exactly my favourite song it fits well. An awfully short bossa \"Lady Of Rome, Sister Of Brazil\" follows (which could had gone a bit longer) and then the title track suite ends the album in style.I would also like to give high praise to the musicians that appeared on this album, particularly bassist Anthony Jackson who reminds a lot to Stanley Clarke at times with the power chords.I'll give 5 stars to this one, and I'm pretty sure it's not the only one I'd be giving to this superb musician's discography."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Friday, March 23, 2007",
      "rating": 4,
      "text": "Man this guy is so fast and yet so smooth !\"Flight Over Rio\" is my favourite from this record especially the 90 second intro where Jan Hammer's synth work is incredible.There is some scorching guitar 3 minutes in and check out DiMeola and Hammer trading solos ! The song ends as it began. Nice. \"Midnight Tango\" is a change of pace. It's a jazzy tune with some great percussion from Lenny White towards the end.\"Mediterranean Sundance\" has a Spanish flavour to Al's guitar playing that is fast and intricate. Some great leads ! \"Race With Devil On Spanish Highway\" features some light speed guitar playing from DiMeola that is contrasted with his almost soaring melodies. Great tune ! \"Lady Of Rome Sister Of Brazil\" is a short acoustic song. \"Elegant Gypsy Suite\" features some cool percussion and great bass playing while the guitar melodies 5 minutes in shine.Easily 4 stars. Again i'm so impressed at how smooth DiMeola's playing is when he's playing so fast. It's like he has the ability to slow it all down in his mind and it seems so effortless on his part. Amazing ! And he has surrounded himself with some very talented musicians. Highly recommended."
    },
    {
      "reviewer": "1800iareyay",
      "date": "Posted Thursday, June 28, 2007",
      "rating": 5,
      "text": "Al DiMeola is what so many shred metal guitarists wish they could be. He can play a ridiculous number of notes per second yet he plays with a musicality seldom rivalled by the genre he helped to inspire. Elegant Gypsy shows Al in his prime, with an intractable lineup featuring flamenco god Paco De Lucia and Mahavishnu organ grinder Jan Hammer. The result is a blazing set of fusion that is over far too soon.\"Flight Over Rio\" starts off with guitar and keyboard interplay that sets teh foundation for the boys in Dream Theater to pick up a decade later. \"Midnight Tango\" eases off the throttle brings an island vibe with steel drums and congas. This song shows the elegant side of the gypsy. \"Mediterranean Sundance\" features Paco keeping pace with Al as the two play lighting-fast flamenco. \"Race With the Devil on tehSpanish Highway\" is the highlight of the album with a great bass part, latin rhythms and mind-blowing performances from DiMeola. \"Lady Of Rome Sister Of Brazil\" is an interlude that leads up to the fianle, \"Elegant Gypsy Suite.\" Think that the album so far has been challenging? You've heard nothing yet. De Lucia and DiMeola lay down impossibly complex riffs using God knows how many effects, and Jan Hammer's solo is one of his finest performances. This epic track alone is worth the price of the album, which is nicely quite cheap.If you are a fan of prog, fusion, or even just the guitar, get this album. Al seamlessly fuses jazz, latin music, and guitar-based rock into one of the three best fusion albums of all time (the other two being Mahavishnu's Birds of Fire and Bruford's One of a Kind). Al Di Meola is one of those rare guitarists who can both inspire players and discourage them, as the talent he displays can shame 99% of the world's guitarists.Grade: A"
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Tuesday, August 14, 2007",
      "rating": 3,
      "text": "3.5 stars really!!Second solo album by the Italian-origined American guitarist who had a strong Spanish desire, Elegant Gypsy is usually regarded as his best solo album, even if this writer begs to differ! Indeed, EG draws on the same kind of fusion jazz-rock of Return To Forever, crossed with Santana's better moments (from Caravanserai to Borboletta) and Mahavishnu Orchestra's first period. Graced with a typical tasteless romantic late 70's artwork (the disastrous and XXX fantasy of Gypsy women portrayed by Carmen the group), Stevie Nicks, the Wilson sisters of Heart and more), this album is nevertheless a real strong outing, although a bit too close to the previous Midnight Sun.Flight over Rio cannot escape comparison with Santana, mostly due to the Latin-fusion percussions, but ADM's guitar tone is a bit too resembling also. Midnight Tango starts out well enough, but by mid-track it can't escape a cheesy fondue moments (although it could please some progheads) that lasts the rest of the track, until an atrocious (well ill-advised) pzercussion solo, that's been done better elsewhere. Mediterranean Sundance is a Flamenco piece, where ADM tries to impress (he gets by), but obviously is nowhere Paco DeLucia. I'm not sure this type of choice is judicious to ADM's career.On the flipside, Race With the Devil is another Santana-inflicted track that seems to be what ADM does best. A fairly insignificant acoustic guitar short piece follows, then the album plunges into the title track suite, which is need the album's highlight with Flight Over Rio. On this track, we approach the perfection of the debut album's title track. Definitely not quite as interesting as the Midnight Sun debut album, EG is still an interesting and worthy JR/F album that should easily find its place on your shelves, but it should remain a lesser work of the genre."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Thursday, September 20, 2007",
      "rating": 5,
      "text": "Thank you ProgArchives for this album, which I would not have found without you! Rare is the album that I enjoy EVERY time it comes on: this is great Latin and jazz rock, perfect if you are concentrating on something else and simply want something to keep up your spirits, or excellent if you want to listen closely and hear as tight a group of musicians as you can find. Great job, Al di Meola and company for this spectacular collection of music.Flight Over Rio. Bookended by a great funky groove, the middle is dominated by wonderful synth and guitar interplay. Not to be forgotten is the percussion--liveliness and originality without detracting from the other elements.Midnight Tango. From the title and opening melody, you may think this is the mellow tune of the album. Not so! The whole song is highlighted by stately and captivating bass tones, with a great guitar harmony to close things out. I really don't know what the percussion deal at the end is for, but I don't mind it. Possibly the album's one flaw.Mediterranean Sundance. A mesmerizing duet between Meola and Paco De Lucia, this tune is very repetitive and wears thin over time with repeated listens, but you can't deny that awesome melody and astounding playing.Race With Devil on Spanish Highway. Here the band is tight as they can be: fast, furious, slow, and all the while foot-tapping and memorable. An odd song structure, but memorable all the way through.Elegant Gypsy Suite. The boys saved the best for last. This seems a bit aimless, but even though it's not necessarily building to a grand finale, the process of getting there is wonderful. Staccato guitar and keyboard sometimes, and tasteful sustains and vibrato in others, with perfectly effective percussion throughout, this is an absolute gem.If you have any inclinations for great guitar that is well-integrated into the music played by talented musicians, you simply need this album. Ditto if you enjoy jazz or Latin-influenced rock."
    },
    {
      "reviewer": "FruMp",
      "date": "Posted Thursday, October 4, 2007",
      "rating": 4,
      "text": "Amazing prog infused jazz fusion.Elegant Gypsy is a fantastic record featuring some of the best songs of Di Meola's career. First you'd struggle to find a better collection musicians,Di Meola absolutely shreds - tastefully of course, the drums are first rate, particularly the percussion and the keys take turns shredding with the guitar, a very skilled bunch of musicians.As far as highlights go there are a great deal of them, the opening song 'Flight Over Rio' starts off fairly before kicking into overdrive with some latin fusion shred driven by some fantastic percussion with some extraordinary guitar work from Di Meola complimented by the keyboards perfectly with some tag team soloing. Midnight Tango is also a great song it's really quite progressive, I thought it was several different songs on my first listen. Mediterranean Sundance is undoubtedly Di Meola's most well known song featuring finger picking acoustic virtuoso Paco De Lucia (who would later feature in Di Meola's guitar trio along with John McLaughlin - their live version of the song is something else.) Mediterranean Sundance is probably one of the best songs ever written for acoustic guitar, Di Meola and De Lucia are in perfect harmony and pretty well take their turns melting the fretboard with their emotionally charged fusion shred. The closing track 'Elegant Gypsy Suite' is easily the best song on the album, truly a progressive song, covering many different emotional and musical territories, it's a fantastic song and a crowning achievement on the album.Overall Elegant Gypsy is a fine jazz fusion record, it could be a bit longer and it does lose a lot of it's zest after the first few songs but it's an essential part of any jazz fusion fan's collection."
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Sunday, October 14, 2007",
      "rating": 5,
      "text": "Second solo album by the Italian-origined American guitarist who had a strong latin desire, Elegant Gypsy is usually regarded as his best solo album, and in fact it is, and to me is among the best jazz albums ever recorded. Maybe sometime is kinda same with what he was doing in Return to Forever, musicaly speaking but this is very Ok to my taste. Album starts with Flight over Rio a typical DiMeola latin fusin music with a lot of percussions played by Mingo Lewis, this is the first track to remember. The second piece that worth investigate is the best from here , Race With the Devil - Al Dimeola at his best, nothing more.The drums are absolute stunning and very sophisticated sometimes, and sometimes very smooth. The rest of the tracks are also good jazz fusion latin flamenco orientated that must plesed every prog fan, not only jazz lovers. In the end 5 stars for this one. One of my fav albums from jazz no doubt, and deserve to be on your shelves, because worth every second. Essential album."
    },
    {
      "reviewer": "Moatilliatta",
      "date": "Posted Saturday, November 10, 2007",
      "rating": 5,
      "text": "I don't need to give much of an input here. This is a widely renowned album by a widely renowned guitarist. It is his finest work, and it is probably the greatest solo album by a guitarist ever made. The compositions are flawless and they are very much like songs. A problem with your typical guitarist album is that the music is mediocre; it's only selling point is awesome solos. That is never enough. These songs are truly brilliant compositions overall."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Wednesday, January 16, 2008",
      "rating": 4,
      "text": "I�ve listened a lot to the nineties albums from Al Di Meola like Orange and Blue, Heart of the Immigrants, Di Meola plays Piazzolla, Infinite Desire and his World Sinfonia albums, but never heard any of his seventies albums. Allthough this album is in the same spanish style jazz/ fusion genre as most of this nineties albums it�s a bit more intense and generally faster paced. It�s something I think suits Al Di Meola very well as some of this nineties songs tend to be a little too easy listening like ( incredibly complex easy listening).The sound quality which is really great and the incredible musicianship on this album makes this an excellent experience. Prog heads not into jazz/ Fusion should take a listen here as this might convert some of you.Tracks like Flight Over Rio, Mediterranean Sundance and Race With Devil On Spanish Highway ( which are my favorite tracks) are fantastic songs, exstremely well written and performed. There is not a dull moment in these wonderful songs. Try and listen to some of Al Di Meola�s soloes in Flight Over Rio or in Race With Devil On Spanish Highway. He is so incredibly fast and yet it sounds great and not forced. This is not speed for speeds sake, it just fits in the songs so well. The acoustic piece Mediterranean Sundance were Paco De Lucia guests is also outstanding and very beautiful.The rest of the songs are not as good as the ones I have already mentioned, (even though they are very good) and of course this means that I don�t think this is a complete masterpiece even though it comes close. So this is a 4 star album for me, but a very big one. I can�t wait to hear more from Al Di Meola�s early years."
    },
    {
      "reviewer": "Andrea Cortese",
      "date": "Posted Wednesday, March 19, 2008",
      "rating": 4,
      "text": "With Elegant Gipsy and its acclaimed follower you'll be carried into intense musical experience. A fabulous journey to the lands of acoustic and electric guitars immersed in the southern europe seas. A strong mediterranean flavour (also latin in the sense of latin american) is all around the six compositions as the songs' titles emphasize.Al Di Meola offers you all his capabilities he had already showed during the collaboration time with the jazz- rock glory RETURN TO FOREVER. Now all is mainly based on guitars (even tasteful mandolin when it's up to Italy imagery) but you will find also excellent keyboards' parts thanks to a certain JAN HAMMER on electric piano and minimoog.The general mood of the album is a perfect balance between rational technicality and sincere passion, compeltely instrumental and enjoyable since the very first listening. Even in the quieter parts you will feel excited due to the meticulous work of Di Meola. Race with Devil on Spanish Highway is a personal favourite of mine and truly terrific! Above all a wonderful sound's production, very sharp and very clear. No doubt it has been voted the best guitars' based album for 1977.Maybe it's not a prog masterpiece strictu sensu but along with Casino is certainly one of the most inspired records I've ever listened to. Far from being pretentious as many other so called classics tend to.Worthy of special mention the collaboration with PACO DE LUCIA on ... acoustic guitar (what else?).4.5 stars: highly recommended, an essential record in your discography."
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Monday, January 19, 2009",
      "rating": 4,
      "text": "Elegant indeed!While I'm normally not a big fan of Jazz-Rock/Fusion, I tend to love Al Di Meola's music. Together with Return To Forever's Romantic Warrior and Di Meola's own Casino, Elegant Gypsy is my favourite album in the Jazz-Rock/Fusion category. These three albums are similar in several ways. The most obvious similarity is, of course, the amazing guitar work of Di Meola himself. Another similarity is that the keyboards, drums and basses are all played with enormous skill and feeling. And they are all completely instrumental albums.Many people will inevitably think that this music is too technical and is only a way for the musicians to show off. That might be true of many albums in the Jazz-Rock/Fusion genre and perhaps some of Di Meola's other albums, but I don't think it applies to Elegant Gypsy or the other albums I mentioned above. The music is often highly complex yet somehow very melodic and accessible.A difference between Return To Forver and Di Meola's solo works is that there are more acoustic guitars in his solo work. Mediterranean Sundance is a Flamenco inspired piece with simply awe-inspiring acoustic guitar playing. As I said, I'm not at all an expert on Jazz-Rock/Fusion, but I immediately liked this music. The problem I usually have with Jazz-Rock/Fusion is that it leans too close to Jazz and contains too little Rock influences and that the emphasis is on technical skills rather than melody and feeling. Elegant Gypsy is not just Jazz played with Rock instruments, it is rather a genuinefusionof Jazz, (Prog) Rock, Flamenco and Latin influences. In fact, this album leans more towards Latin music than Jazz, I would say.Elegant Gypsy is an excellent addition to any Prog collection and a great place to start investigating the Jazz-Rock/Fusion genre."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Monday, May 11, 2009",
      "rating": 4,
      "text": "If one is looking some genuine jazz/rock virtuoso than they need look no further than here; Di Meola's celebrated release cooks with lightning dexterity and a '70's camp that oozes style and panache. More than any fusion album I've heard,Elegant Gypsydelivers crowd-pleasing jams that listeners across genres will be able to groove to.Highlights abound throughout this album, which features lots and lots of Di Meola's guitar (obviously)-- be it in a sensual legato or blistering flamenco. Songs here have a Latin feel to them, and we're given plenty of variety in tempo and composition, constantly keeping things interesting. His sound is very unique and instantly enjoyable, more so than some of the \"other\" fusion guys who favor experimentation over thrills (McLaughlin-- looking in your direction). Di Meola comes across as a showman, happy to dazzle the listener with energetic displays of proficiency, such as in the all-acoustic \"Mediterranean Sundance\". Support players give standup performances as well-- especially Jan Hammer's keyboards.One thing about this album which I think deserves special mention is its entirely dated production and super-slick feel-- which positively screams 1977. Listening toElegant Gypsyis like stepping into a time machine... and it's great! The campiness contrasts with the musicianship so well that its hard to imagine Di Meola's performances without them. Most would probably find his hyper-fast noodling pretentious if not set against this rich palette of 1970's cheese.A must for fans seeking some energetic, exciting fusion-- on par and perhaps surpassing some of the best.Songwriting: 3 Instrumental Performances: 5 Lyrics/Vocals: NA Style/Emotion/Replay: 3"
    },
    {
      "reviewer": "JJLehto",
      "date": "Posted Thursday, July 30, 2009",
      "rating": 5,
      "text": "The first time I heard the name Al Di Meola was back in my pure metal days. I read that shredding actually had it roots in Jazz Fusion, and one big influence was Al Di Meola, especially his album \"Elegant Gypsy\". Well, I finally have it and let me say it is an amazing piece of music. Jazz Fusion at its finest. Al is truly an amazing guitarist, but all the musicians on this album are wonderful. Elegant Gypsy has it all. Soft, mellow jazz. Wild jazz fusion. Beautiful guitar work and electric guitar shredding, yes actual shredding. Some amazing solos can be heard on this album.Flight Over Rio. Begins with a slow guitar melody, backed up by weird sounds and soon a nice drum beat. There is some great keyboard as well! A groovy bass riff and some bongos quickly give way to an explosion of Latin Jazz. The middle section is great, especially the guitar/keyboard harmonies. There are some great dueling guitar and keyboard solos backed up by some wonderfully funky bass and Latin drumming. Things slowly decelerate and it ends right where the song began. The guitar solos are nice, and fairly melodic.Midnight Tango. The song begins gently, and features some beautiful solos by Di Meola over an amazing bass riff, enchanting keyboard, and an smooth bongo/drum beat. Overall, its a fairly slow, song and much less upbeat sounding then the first. I was in heaven during the last minute or drum madness!Mediterranean Sundance. My favorite song on the album. This might be the fastest song on the album, with crazy shred like jazz fusion solos throughout and some wonderful dual harmonies between Di Meola and Paco, (Paco himself shows off some virtuoso skill). In fact this song is almost all them, with very little percussion or anything else for that matter. Sit back and enjoy the beautiful yet extremely fast paced harmonies and solos! A perfect song.Race With Devil on Spanish Highway. My second favorite on the album, (and a close second) starts with a cool bass riff and some random, kind of heavy guitar, with bursts of speed. It is a very progressive song with crazy tempo and style changes throughout, and even in slower sections there are random bursts of jazz fusion. Shortly before 3 minutes one of the shred solos come in, followed by a slower ambient section mostly about the synth and drums. This song also has some of the grooviest bass riffs you'll hear. A little before 5 minutes is a frantic, insanely fast section with dual guitars, soon followed along by bass and keyboards. Nice ending as well.Lady of Rome, Sister of Brazil. A short transition song. Very soothing.Elegant Gypsy Suite. A 9 minute song, this is also the most progressive on the album. Complex, layered, and runs the gambit of music. Anything you can imagine is on this song, and the musicianship can not be understated. They are all great, and each contribute perfectly. A very proggy, jazz fusion song that has some really weird sounding parts. What's not to love!?Elegant Gypsy is one of those rare albums. One of those no doubt five star albums. It is short, but what does that really matter? What's here is amazing. I love every song, and have no problem listening to whole thing straight. There is nothing wrong with it really. While every member who contributed is great, Al Di Meola is the star of the album. He is amazingly fast, yet smooth and can also play some wonderful melodies. While his style of playing may have been an influence on shredders very few have the level of musicianship Al does, and none (except MAYBE Steve Vai or Joe Satriani) have the emotion he does. Again, perfect album, no hesitation.Five Stars"
    },
    {
      "reviewer": "snobb",
      "date": "Posted Thursday, October 1, 2009",
      "rating": 4,
      "text": "Possibly, the best Al Di Meola album. In fact, it continues music of his debut, but is much more focused. There is perfect balance between his electric and acoustic guitar, between Latin sensitivity ( at the level, acceptable for ADM \"cold\" early works), and jazz rock energy. Flamenco God Paco De Lucia gave few warm acoustic touches as well.I think, even musician list is there one of the best during ADM career. In many places the music is near best RTF examples, just more guitar oriented. Jan Hammer still plays competent moog/electric piano lines ( in contrast to his later pop-synth jobs). Lenny White brings very RTF drumming.Big album plus is very different melodies,rhythms and musical arrangements. All sound fresh and impressible."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Monday, October 26, 2009",
      "rating": 4,
      "text": "Due to the frequent Al Di Meola review activity here I couldn't resist revisiting a few of my fusion albums that had been gathering dust for like 20 years!Elegant Gypsy stands as a fan favourite here and it's no mystery to see why. In a baffling 37 minute short album, Al Di Meola gets more balls rolling then most bands would in an entire career.Flight Over Rio kicks off with a meditative eastern flavour before turning into a surging jazz rock attack that any fan off the genre will instantly devour. The battle between Hammer's dashing keyboards and Al Di Meola's virtuosity is absolutely stunning. After the astounding opener, the album continues through 4 equally pleasing extended pieces. It covers all fusion ground you can think off: jazz rock, flamenco, tango, salsa. The lot.The most amazing aspect of it all is how classy this is all done. For music of this intensive virtuosity, things are never overcooked. You won't hear any 20-notes a second wizardry unless it has to be there; fast sections are balanced against more laid back parts; heavy rock merges with nearly cheesy mellowness. But it never crosses the line where sophistication becomes kitsch.Rarely does an album both have this kind of virtuosity and elegance. Hearing this back after so many years I really wonder how I could neglect this album for so long. It's not that I was tired of fusion, I must just have completely forgotten about it. Shame on me!"
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Wednesday, May 26, 2010",
      "rating": 4,
      "text": "Master Al di Meola takes listeners on a passionate and thrilling journey with humid, scorching days and cool, passionate nights. While the guitar is the most outstanding instrument, there is plenty of space on the dance floor for intelligent bass grooves, dynamic percussion, and keyboard wizardry.\"Flight Over Rio\" Several keyboards and a funky bass bang out the opening groove. With a searing tone, di Meola offers blistering solos interspersed with light, dazzling keyboard runs.\"Midnight Tango\" Hushed keyboards and cymbals begin this sultry yet cool Latin-infused piece. The guitarist lets off his distortion to provide a sweet clean tone. Despite gracing through a variety of passages, the music maintains a unified sound and some pleasant, compelling themes. The percussion tacked on to the end has nothing to do with the piece proper- I shrug my shoulders and await the next tune.\"Mediterranean Sundance\" In acoustic flamenco splendor, di Meola shares the spotlight with Paco de Lucia.\"Race with Devil on Spanish Highway\" This is one of di Meola's sizzling masterpieces, where he demonstrates his amazing skill as a guitarist over a diabolical bass and percussion that holds down bizarre time signatures and shifts. The lightning guitar licks jump in and out. Eventually a peaceful rhythm takes shape, featuring a noteworthy bass line and fantastic lead work. The next segment has a dark riff occasionally answered by rapid guitar runs. The fourth passage is smooth and slick, a variation on the theme from before. Finally, expect brisk and technically challenging runs before the remarkable conclusion.\"Lady of Rome, Sister of Brazil\" This is a delicate and transitory piece with relaxing acoustic guitars- beautiful.\"Elegant Gypsy Suite\" The final and lengthiest track is a more cheerful one, even incorporating some ever-so-slight Caribbean flavors. The middle section features some fabulous keyboard moments over a moody background that has a similar bass riff to the middle theme in \"Race with Devil on Spanish Highway.\" The chilling acoustic guitar thickens the background music, making it even more intriguing."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Friday, June 25, 2010",
      "rating": 4,
      "text": "As mentioned in my Return To Forever-reviews I'm not much of an Al Di Meola fan. His guitar style is based almost entirely around excessive soloing which is generally quite common among jazz guitarists. Therefore I hesitated for some time before sinking my teeth into this highly praised solo release. But seeing that its status continued to grow, outdoing even the mightyRomantic Warrior, there was no way for me to simply overlookElegant Gypsy.Listening to this album for the first time turned out to be a pleasant surprise indeed, even though this can't be said about the opening trackFlight Over Rio. The engaging intro riff is very promising but the excessive soloing throughout the rest of the track brings this composition down a few notches for me. Seeing that the first track offered me exactly everything I disliked about Al Di Meola's style I almost wanted to turn this CD off in a haste. Fortunately I continued listening and was rewarded with creative performances onMidnight Tangoand who can forget the acoustic guitar duet with Paco De Lucia onMediterranean Sundance? UnlikeFlight Over Riothis material showed a bigger chunk of this artists' range that never was tapped into on the Return To Forever-albums.Race With Devil On Spanish Highwaystarts with an impressive show of skill from Meola which fortunately doesn't just end up as another predictable scale run-through. There is a very tight balance between the composition work and Al Di Meola's guitar skills that never tilt the cup over to one side. While the short acoustic numberLady Of Rome, Sister Of Brazilworks almost as a prelude to what will unfold onElegant Gypsy Suite!Up to this point everything I've heard onElegant Gypsyhas been interesting and refreshing by Al Di Meola standards but nothing that I haven't heard on other guitar virtuoso albums. Instead it wasElegant Gypsy Suitethat finally managed to win me over completely. Even though this story arc unfolded in a a trueRomantic Warriorfashion where it was the final composition, titledDuel Of The Jester And The Tyrant, that stole the show it only took me less than thirty seconds to realize that I loved theElegant Gypsy Suite! The main riff is a total killer and the whole composition just grabs a hold of you and doesn't let go until the final bang at the end.I guess that there is not point in arguing whether Al Di Meola is a great guitarist or not since it all comes down to personal taste. Still I would like to thank everyone who recommendedElegant Gypsysince this experience was well worth to undertake. Simply an excellent addition to any prog rock music collection!***** star songs: Elegant Gypsy Suite (9:16)**** star songs: Midnight Tango (7:29) Mediterranean Sundance (5:12) Race With Devil On Spanish Highway (6:18) Lady Of Rome, Sister Of Brazil (1:46)*** star songs: Flight Over Rio (7:17)"
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Monday, November 29, 2010",
      "rating": 4,
      "text": "Guitar master Al Di Meola's sophomore release as a band leader and his most highly-acclaimed album of all-time.1. \"Flight Over Rio\" (7:16) a song whose first 90-seconds always felt to me as if the band were being forced to play through a blizzard; it feels almost artificially slowed down! By contrast the second motif that starts at 1:38 is more humanly paced--enough so that Al is able to show his seemingly-superhuman powers and prowess on his axe. Hearing this song brings to light the fact that I\"ve never really liked the sounds projected from the MiniMoog: I guess they're just a little too unnatural for my tastes. (This also makes reminds me of the fact that I've never been much of a fan of Jan Hammer--ever.) Weird song. (13/15)2. \"Midnight Tango\" (7:28) a murkily-engineered song that always felt to me as if Al was pandering to the new wave of radio- and adult-friendly Smooth Jazz audiences. It's nice as elevator music. it's not until the first riff of Al's fiery electric guitar leap out from the dross of everything behind it at 4:15 that I finally find myself sitting up with any kind of hope. Alas! That one little riff, as magnificent as it is, is not enough to save the song--even when played over and over ? and over and over. Nor is the oddly-tacked on Latin percussion party at the end. (13.125/15)3. \"Mediterranean Sundance\" (5:14) the world's introduction to the fiery genius of Flamenco master Pace De Lucia. What an extraordinary piece! (So which one of The Trio is passion, which one fire, and which one grace?) If I have one complaint of this song it's of its length: a have always felt that it's too long, that the novelty of these guys flying around their fretboards in their friendly duel is just a bit overwhelming. (9.5/10)4. \"Race With Devil On Spanish Highway\" (6:18) a song that takes an unnecessarily long time to develop and reach its form and ease. (3:18, to be exact.) Nice instrumental skills on display but, to my mind, that is not reason enough for a \"song\" like this to exist. All flash and glitz, no guts or beauty. (8.666667/10)5. \"Lady Of Rome, Sister Of Brazil\" (1:46) acoustic guitars (12-string and steel-string) in duet. I've always had quite a soft spot for this little one. (4.75/5)6. \"Elegant Gypsy Suite\" (9:16) an interesting mix of acoustic instruments (guitars and percussion) and electric. Once again Steve Gadd is relegated to things I consider far beneath him--at least until 90-second mark. Does anyone else out there find Anthony Jackson's \"tone-destabled\" bass sound annoying? Al is extraordinary no matter what he's doing but I'm never convinced that any of the other musicians or sounds are right for this. As a matter of fact, I can't help wondering if Al's solos alone wouldn't be enough to carry an audience into heaven. More mosquito-annoying MiniMoog to take us into another super-slowly developing motif (one filled with Latin charm and gorgeously seductive melody--if only he'd stay there!) A song\"suite\" that never really seems to reach its potential. (17.75/20)Total Time: 37:18By the time I heard this album I'd already been familiar with Carlos SANTANA, John McLAUGHLIN, and RETURN TO FOREVER, so I was primed for some amazing guitar pyrotechnics--which this album (and Al's predecessor, his solo debut) more than provided. While many people here on PA revere the work in the 1970s of keyboard wizard Jan HAMMER, I've never really been drawn in by his playing, his choice of sounds or his compositions, so this album loses a little on me when I can compare it to Al's contributions to RTF (which had Chick COREA, Stanley CLARKE and Lenny WHITE), Lenny WHITE (which had Onaje Alan GUMBS), or Stomu YAMASH'TA's GO (which had Steve WINWOOD and Klaus SCHULZE). The acoustic guitar duet with Paco DE LUCIA, \"Mediterranean Sundance\" (5:14) has always been a favorite of mine, and \"Elegant Gypsy Suite\" is impressive no matter how you look at it. The other songs are impressive compositions, technically amazing and performed at the highest level but have lost some of their lustre over the years. \"Midnight Tango\" is elegant and beautiful but seems a bit simple and immature now. It is, however, brought up a notch by Lenny's wonderful drum play. The album is very well recorded, mixed and engineered though at times it feels a bit sterile (and others murky), but it is undoubtedly a wonderful representative of a (then) young genius showing his precocious talents.I'm going to buck tradition here and claim my undying allegiance to Al's debut album over this one: despite Al's prodigious and unarguable talent, the music here just feels too showy, too scattered and afraid to commit to anything much less reach for its true potential.B/four stars; an excellent j-r fuse album for any prog lover's music collection but more to serve as a showpiece, not for the enjoyable musical listening experience."
    },
    {
      "reviewer": "friso",
      "date": "Posted Monday, December 6, 2010",
      "rating": 3,
      "text": "AL Di Meola - Elegant Gypsy (1977)Al Di Meola can be disciped as one of the key-figures of the electric guitar. His style is often referred to and ofcourse both his solocareer and his work with Return to Forever made him famous. The style of 'Elegant Gypsy' moves between three elements: fusion, flamenco and smoothly arranged rock.The recording of this album sounds professional, but I can't say I like it. It does not have an authentic sound, way to electric. The acoustic arrangements are acceptable though. The bass- guitar sounds like a keyboard and keyboard sounds are way too eighties for me. The arrangements are kitch in my opinion. The guitar sound of Di Meola is however very good throughout. His thick Les Paul sound is a blessing.The composition on this album is what might be interesting for the listener of progressive music. There are many instrumental parts on every track and most of them are quite sophisticated, or at least intelligent. It's an instrumental album, dominated by guitars.Conclusion. I won't be adding many appraisal to this long list of enthousiastic reviewers. This is in my opinion a good, but non-essential album. The composition is strong, the instrumentation is good, but it's style is so polished and non-authentic. It makes me want to listen to the classic be-bop of Miles Davis! With wind-instruments and a non-rock rhythm- section. This electric styled fusion doesn't touch me at all. Had the arrangements been less cheesy this would have been a four star album."
    },
    {
      "reviewer": "octopus-4",
      "date": "Posted Tuesday, May 10, 2011",
      "rating": 5,
      "text": "The musical videos were not yet an industry. The most common were fragments of live exhibitions. I saw Al di Meola for the first time on TV. He went into a studio, switched on a 16 tracks tape which started playing the base of Mediterranean sundance and he played the second guitar, then the screen was split in two with Al on the right side playing instead of the tape....amazing. So when I later was in a shop deciding if buying his debut that was already in the \"Nice Price\" offering and Elegant Gypsy I choose the second.One thing that I've always found bad on Al di Meola's music, specially on the live with McLaughlin and DeLucia is that the excessive technicalities make the music sound \"cold\" even when Latin. It's not the case with this album. Al doesn't indulge too much in solos and fast legatos as he usually does during live performances. The guitar in almost all the songs makes an ensemble with the rest of the orchestration and Al plays fast only when it really makes sense.It's evident since the first song: \"Flight Over Rio\" is based on bass and keyboards. It takes some time before a guitar is heard and when it's there it plays few \"right\" notes. We have to wait for the samba section that's a very good example of easy jazz to find some guitaristic virtuosities, but they are part of the song, nothing self-indulgent . The Fender piano reminds to Soft Machine, too.Several years before \"Plays Piazzolla\", Midnight Tango is not properly what the title says. It's the most progressive song of the album, instead.Now the song which made me buy the album. Respect to the live version Mediterranean Sundance has a long percussions intro that's totally useless as it fades out before the acoustic guitar starts its famous harping in A-. Since here it's exactly how I saw in that video. Two overdubbed guitars, one for each stereo channel for a flamenco-like jazz song.\"Race With Devil on Spanish Highway\" is the most technical piece. The intro features a very fast guitar played in Spanish fashion, then it's fusion with some rock accents when the rhythm increases. The work of Jackson at bass is remarkable, but of course all the musicians must be skilled to play this kind of music for this kind of artist.\"Lady Of Rome, Sister of Brazil\" would be a slow samba but the additio of a mandolin mnakes it sound very \"Italian\". Well, I'm Italian and it's at least 25 years that I don't see a mandolin, however this is how he wanted to sound for less than 2 minutes.The closer is the title track and also the best track of the album. It has all the elements of the previous track: jazz, funky, samba...in one word, fusion. The rhythm is captivating and the melody easy enough without being trivial. The bass is excellent but here Al does his best.Add to this a good production and a very clean sound. This is the album which has introduced me to fusion and I'm grateflu to Al too have open my mind and ears to this genre."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Saturday, May 19, 2012",
      "rating": 3,
      "text": "Al Di Meola uses Spanish and Latin musical influences to provide a texture to this expansive exploration of his guitar skills. To my ears, it's a pleasant but not brilliant listen, and I think this might partially because it's very much a product of its time; the Latin-flavoured fusion approach here had already become pretty tired at the hands of Santana and since then has become very well-explored, and the production quality feels dated to me even though I imagine if you listened to it at the time it would have felt very modern. On top of that, I just don't find Al's guitar playing very revolutionary, and I'm sure that's because a million and one guitarists have taken up his ideas and popularised them, but I've already heard those other guitarists and I (and most music listeners my age) can't un-hear them before coming to this album."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Wednesday, November 7, 2012",
      "rating": 4,
      "text": "I was drawn to this merely due to the high rating it has received and the plethora of reviews that rave eloquently at what a masterpiece this is. I have never heard of the man myself but it was a pleasant journey whole it lasted. As soon as 'Flight Over Rio' begins I know immediately this is very nice music that appeals to me as a form of relaxing after hearing too much ELP, Gentle Giant and Eloy. It is such an organic album that moves smoothly from one musical arrangement to the other. Parts remind me of Santana meets Hackett and it is certainly a unique sound that is created.The guitar work is beautiful, particularly on 'Midnight Tango' with lovely Spanish flavours, and some wonderful piano augmentations. The symphonic strings are a serene nuance that resonates with my senses, and it gets quite wild at the end with African congas and bongos in a short burst of inspiration. 'Mediterranean Sundance' is permeated by Spanish Flamenco guitar vibrations, playing off some amazing speed picking. Meola and Paco De Lucia are obviously accomplished guitar virtuosos and this tune proves their ability. It makes a nice break on the album after the dense musicianship previously. The crystal clear guitar tones echo in the eardrums and provides a relaxing experience, but one will be astonished at the extraordinary dexterity of the guitarists especially towards the end when the pace quickens.'Race With Devil On Spanish Highway' has an enigmatic title and is flavoured with a pulsing bassline, hi hat work, and a muscular guitar riff as bongos are played at a frenetic pace. This is my favourite track on the album feeling like the type of music heard in the 70s where twanging guitar is layered with hyper paced percussion. The guitar picking gets frenetic later and there is a soaring lead break that spins wildly out of control, and leaves me breathless. This is a master class performance and one that should be heard by all progheads.'Lady Of Rome, Sister Of Brazil' is a short piece after the last frenetic explosion of power. Here we can relax again with twin acoustics playing very melodic romantic music. The album closes on another epic 'Elegant Gypsy Suite' clocking 9 minutes. It opens with some quirky time sigs and a jazz fusion feel. The guitars hold onto the melody and at times get funky, and there is a really nice finger picking thing with some speedy work and a wandering bassline that consistently maintains the rhythm. The guitar work is astounding and is relentless in creative styles, from speed picking to soaring string bends, the man is a master.\"Elegant Gypsy\" is an incredible album of showmanship guitar work and needs recommendation. I didn't expect it to blow me away as it did but it is so good it is impossible to ignore. Good things come in small packages and although this is short it is certainly an excellent example of instrumental jazz fusion."
    },
    {
      "reviewer": "CCVP",
      "date": "Posted Wednesday, November 28, 2012",
      "rating": 5,
      "text": "One of the best jazz fusion albums everAl di Meola has been regarded, both in jazz rock and elsewhere, as one of the best guitarists of all time. Even though I could see that he was a very talented guitar player listening to the (few) Return to Forever albums I own, having a perfect technique and flawless musicianship, Return to Forever's music would, in one way or another, eventually turn me down. I just can't quite put my finger on it, maybe because of the huge amount of things that aren't right, but sometimes I just get awestruck as to how such a competent and talented group of musicians could compose some tunes that are, in my opinion, straight up boring.Long story short, if Al could not pull it wile together with three other equally talented musicians, I doubted Mr. di Meola could put out better music by himself. Well, at least that was how I though up until putting my hands on Elegant Gypsy.Indeed, Elegant Gypsy, in my opinion at least, rights many things that were wrong in Return to Forever, such as focus and proper melodic progress, which Al does perfectly here: he creates / comes up with a certain line of melody and develops it to the point it becomes perfect. Another thing which he does way right here and that doens't go quite as smoothly in Return to Forever is that everything gets its due space; there isn't a million things happening at the same time and when that happen they are the center of everything and every other instrument work around that thing (mostly guitar or keyboard lines).As one might expect from a solo album of a guitarist, Elegant Gypsy is mostly about the guitars, but not exclusively. Yes, the guitars do play a huge part here, but so do the keyboards, that, at times, work together with the guitars in a call and response style. However, most the album revolves around the stringed instrument. Al here presents us with a barrage of unbelievable guitar lines and strikingly impressive ideas and motifs.In spite of the whole album being filled with them, there are three in particular that amaze me every single time I listen to them: the guitar lines in Flight Over Rio, which make us feel like we are indeed inside an airplane (and the solo is just mind blowing); the speeding melodies of Race With Devil On Spanish Highway, which perfectly translate the feeling of being behind a racing car, the speed, the competition, the meandering curves. . . It feels exactly like you are in a speeding automobile; and the impressive layers of guitar music in the Elegant Gypsy Suite, which, by the way, is the song that sounds the closest totraditionalprogressive rock.The other songs are quite good as well, but they don't have such memorable moments as those three in particular. Midnight Tango is, as the name implies, a tango inspired song where Al uses his proficient guitar abilities to merge the Latin rhythm with jazz rock, resulting in a very interesting combination of both. Mediterranean Sundance, on its turn, tries and mixes Spanish guitar to already spicy mix of jazz and Latin American combination employed in Elegant Gypsy.There are some down points, however, even though these points actually account for what isn't in the album. First, despite the references to Brazil in some song titles, there is no musical reference to the country; Al limits himself to Latin American music, which in no circumstance includes the South American country.So instead of just mentioning Brazil it would be positive to actually mention it musically. Second (and this is more of a personal thing), I think this album could have been stretched or more songs could have been added to it in order to make it more musically diverse. In any way, these\"problems\"do not actually interfere in the album's overall quality.Rating and Final ThoughtsEven some 50 years ago, doing something new with solely a guitar was a difficult thing. Al di Meola, however, managed to do that here. Merging jazz rock, Latin and Spanish music and, occasionally, progressive rock, Elegant Gypsy accounts for one of the most impressive albums recorded in the jazz fusion genre.If you want to listen to an album that will definitely not let you down, with impressive guitar work and guitar-led compositions, look no further: Elegant Gypsy is what you most certainly need."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "albumed51.html",
  "last_parsed": "2025-05-17T12:21:11.142713"
}