{
  "album_title": "IN A SILENT WAY",
  "artist_name": "Miles Davis",
  "artist_page_link_local": "artist93ee.html?id=3906",
  "year": 1969,
  "rating_value": 4.28,
  "rating_count": null,
  "review_count": null,
  "genre": "Jazz Rock/Fusion",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/3906/cover_481121122010.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Shhh/Peaceful",
      "duration": "18:16",
      "is_sub_track": false
    },
    {
      "number": "a",
      "title": "Shhh",
      "duration": "6:14",
      "is_sub_track": true
    },
    {
      "number": "b",
      "title": "Peaceful",
      "duration": "5:42",
      "is_sub_track": true
    },
    {
      "number": "c",
      "title": "Shhh",
      "duration": "6:20",
      "is_sub_track": true
    },
    {
      "number": 2,
      "title": "In A Silent Way/It's About That Time",
      "duration": "19:52",
      "is_sub_track": false
    },
    {
      "number": "a",
      "title": "In A Silent Way",
      "duration": "4:11",
      "is_sub_track": true
    },
    {
      "number": "b",
      "title": "It's About That Time",
      "duration": "11:27",
      "is_sub_track": true
    },
    {
      "number": "c",
      "title": "In A Silent Way",
      "duration": "4:14",
      "is_sub_track": true
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Friday, August 15, 2008",
      "rating": 4,
      "text": "4.5 stars really!!!OK, sonny Miles, you're in deep crap now. You were only tolerated by pure jazzers last year with your 'lectric poop, but you had to mess it up, screw it up, you no good judas-sing traitor and your hoodlums friends calling themselves your new band. Please refund us from your private pocket. - The REAL jazzers society!!!OK, guys I admit it, I took money (loads of it) from these backwards idiots to start my review with their ugly hate splattered all over this PA page, but since Max won't reimburse my professional costs... . It's rather dismaying that some people actually thought this way and started yelling, covering IASW's superb layers of ambiances, thus not being able to actually hear how excellent an album this is. With his quintet out of the way, he assembled his new group from the two versions he had present on FDK, Shorter Hancock & Williams from one part, and Corea & Holland from the other and adding Joe Zawinyl on organ and McL on electric guitar.And right from the first notes you get an organ layers underlining a great electric piano and McL's superb guitar interventions and the 18-mins+ Shhhhh/Peaceful track is under way for then-unheard musical soundscapes that were both written and improvised. It must be noted that if Miles was breaking ground, he wasn't the only one as he was aware of his buddy Mal Waldren \"playing with a bunch of German hippies and doing some interesting [&*!#]\".The flipside is no less interesting with the slower title track divided into three sections, the middle one being a much faster and longer called \"it's about that time\", where Herbie and Chick layer the bottom of the track on electric piano, while Zawinul gradually increase volume on his organ and heads to the forefront, .before leaving it to Miles to wrap it up before the title track returns. So if you progheads were drooling at two keyboardists playing together, this album has three of them and collaborating beautifully together.The only thing missing to this album is a drawn artwork ala BB or MITS and while the present picture might be the last one featuring him until he came back in the 80's. Another slight remark is that the albums just before this one (FDK & MITS) were nearing one hour, that you wonder why this one is clocking below the 40 minutes and the remasters presented no bonus tracks, either real or alternate takes. Of course there are the \"complete IASW sessions\" boxset, but I found that to be deceiving as most of the sessions were acoustic and there were still some FDK tracks included. A first rate album, bringing the rock realm to whomever wanted among jazzers, and the first album that awakened the rock crowd to a jazz realm. Groundbreaking, and breathtaking"
    },
    {
      "reviewer": "darkshade",
      "date": "Posted Friday, August 15, 2008",
      "rating": 5,
      "text": "Forget Bitches Brew. This is the first album with Miles Davis in FULL jazz-rock mode. And what an album. This is, in my opinion, the superior album to BB. It also sounds much different that the album that came after. It's quite spiritual in sound, with great melodies and solos. All keyboardists shine on this one, and this is John McLaughlin's first appearance in a MD album. Also this is the last album Tony Williams would be on, before he left for Lifetime.I like to think of this album as the calm before the storm. The 'storm' being Bitches Brew. And it really is. This album is so 'calm' and really laid back. Then immediately, with the next album, you are barraged with dissonance and chaos and serious funk that is Bitches Brew. Sometimes I think about the fact that Bitches Brew came out right after this and it gives me chills.I must mention that Joe Zawinul (Weather Report, The Zawinul Syndicate) is all over this album, playing and composition. He really makes this album what it is (besides Miles of course). The use of electric piano is especially worthy of purchase!Speaking of which, Miles' playing on this record is some of the best and fluid of his playing I've ever heard. It's so weird how fierce and angry it would sound on the next album.This is one of those albums that's hard to describe, especially since there's only 2 songs. If you haven't heard this album yet, get it. This is one of the most beautiful Miles Davis albums ever, right next to Kind of Blue. And of course highly influential in the world of jazz-rock. Essential."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Sunday, December 14, 2008",
      "rating": 5,
      "text": "Most feel that \"In A Silent Way\" is the very first Fusion record ever recorded. Yet this isn't the fiery Fusion one would associate with that genre. In fact the title of this album is a hint of the style of music that is found on this disc. It's quiet, subtle, mellow,atmospheric and...well you get the idea. When I first saw the lineup that played on this record my chin was sore for weeks (jaw hitting floor). Miles Davis on trumpet and Wayne Shorter on sax take care of the horns. Joe Zawinul, Chick Corea and Herbie Hancock on keyboards, John McLaughlin on guitar, Dave Holland on bass and Tony Williams on drums. Of course Zawinul and Shorter would go on to form WEATHER REPORT, Williams would leave after this album to form TONY WILLIAMS LIFETIME, Corea would form RETURN TO FOREVER and Hancock his own solo project.In the liner notes it says \"For every member of this group, playing with Davis was a turning point\". It was like this was university for them, and when they graduated with the completion of this record and having learned Davis' leadership style, they were free and capable to lead on their own. Dave Holland says \"Miles knew if he picked the right person and just gave them enough room, he'd get fantastic music\". He also says \"Miles got involved and very engaged, but in a gentle way...people who played with him had the opportunity to do their thing, to do their stuff...that's all a musician ever wants...(He) never said much about what the music should be; he mostly created a setting and asked you to figure out what you were supposed to do. He had enough trust in you to do that\". There are two side long tracks on this record.\"Shhh/Peaceful\" opens with organ (Zawinul) as cymbals, keys, bass and guitar all do their thing. So much here to digest yet it's so gentle and unassuming.Trumpet before 2 1/2 minutes as Davis seems to lead and interplay with the organ for quite some time. Other sounds though are also doing their thing.The bass comes more to the surface before 4 1/2 minutes. Check out the electric piano (Corea or Hancock?) 5 minutes in. A change 6 minutes in as guitar and electric piano start to lead the way. Sax before 9 1/2 minutes. Piano sounds great 11 1/2 minutes in. A calm 12 minutes in as electric piano, cymbals, organ and guitar start to lead the way.Trumpet (before 14 minutes) and the organ are doing their thing again.\"In A Silent Way / It's About That Time\" begins with gentle guitar and electric piano playing softly and slowly. Horns come in after 2 minutes. It changes after 4 minutes to the \"It's About That Time\" section.This is more dynamic with organ. It's hard not to move to the music 13 1/2 minutes in as drums become more prominant. It settles back before we get the opening section \"In A Silent Way\" back to end the last 4 minutes of this track.4.5 stars. If your into early WEATHER REPORT you will want to check this one out. Heck if your into Jazz / Fusion you will need to check this out."
    },
    {
      "reviewer": "Matthew T",
      "date": "Posted Wednesday, January 14, 2009",
      "rating": 4,
      "text": "This was the album where Jazz Fusion was born. Miles last album Filles de Kilimanjaro was transitional where really the classic quintet of Herbie Hancock,Wayne Shorter, Ron Carter and the superb drummer Tony Williams was their last recording. The Jazz Purists were horrified and all the young crowd thought fabulous. This was where Miles left the live club scene and after this album played stadiums with rock bands as diverse as Steve Miller to Crosby,Stills,Nash and Young.This is a complete transition to what Miles was playing previously and basically he left the bop scene behind to never return. He stated that he was sick of playing My Funny Valentine and wanted new directions to follow.Every musician who particapated in this recording has gone on to form their own fusion bands. Everyone of them is renownded as pioneers in Jazz Fusion. Bands such as Weather Report, Mahavishnu Orchestra, Return To Forever, Lifetime, Dave Holland and the Herbie Hancocks albums. I could go on forever about the band members careers in Jazz . This would have to be one of the most talented Jazz bands of this calibre ever assembled.The first track is by far my favourite on the album Shh/Peaceful. The track starts with a wash of key boards and then Miles comes in for his solo and what more can you say.This a wonderful Jazz album and would have to be my most liked Fusion album.The second track In a Silent Way/It's About Time starts with John McLauglin' guitar over a keyboard (Fender) Miles loved the sound and Miles comes in for beautiful low key solo which slowly builds pitch. This track is basically 2 pieces with the quieter section at the beginning and end where Miles plays in both with that beautiful tone that he had. The middle comprises more uptempo where respective muscians take solos as in most jazz formats.I am rating this album 4 stars. The 5 star are Kind of Blue,Milestones,and Miles Smiles none of them are fusion or progessive but they are superb Jazz Albums from the late 50s and mid sixties."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Saturday, July 4, 2009",
      "rating": 5,
      "text": "Don't ask me how or why, but IN A SILENT WAY was my first ever experience of a Miles Davis album. I honestly had no expectations of the sound other than something in the grey matter of jazz, but I never expected what I actually heard. I almost felt like giving it an average rating until the surprise factor wore out and I slowly grew warm to everything.Everything here sits on basically one idea of which there are plenty of solos and variations so that an album side is filled out. So, right off the bat, this is not for those who hate any type of jamming or those who hate pieces of music that just sit on one theme. I personally find it as the strength of the album, so much so that I pay more attention to the keyboards, bass and drums as opposed to the great trumpet and saxophone solos. Plus, I feel that there's a tight groove going on in the pieces which really puts a smile on my face.My favourite section is the ''It's About That Time'' part of the title theme, although the ''Shhh/Peaceful'' movement is stronger (opinion only) as a whole. IN A SILENT WAY is really one of those albums of which I don't have any legitimate reason as to why I love it, but I do. This album is only for those who have the stomach for long, free-form fusion stuff. I guess I'm amongst the aforementioned ''those''."
    },
    {
      "reviewer": "The Quiet One",
      "date": "Posted Wednesday, October 28, 2009",
      "rating": 5,
      "text": "The Shape of Jazz to ComeBefore Soft Machine, Frank Zappa, Santana, Nucleus and any other group which played a style that approximated to the jazz rock sound we all know that groups such as Return to Forever, Mahavishnu Orchestra and Weather Report popularized, there was Miles Davis and his ''electric'' bands, in which he fused jazz compositions with rock instrumentation such as the electric guitar, the organ and electric keyboards. While Miles was definitely not the first Jazz musician to use an organ or electric guitar in music, but he sure was one of the first to use them with a rock-approach and the result was this, Bitches Brew and a whole bunch of other innovating albums released through the first half of the seventies.In A Silent Way features a wide variety of musicians in which after this album(and Bitches Brew) would later go and form their own band inspired by the experience these albums by Miles Davis gave them: John McLaughlin who would later make his own powerful and groundbreaking Jazz Rock band, Joe Zawinul would join forces with Wayne Shorter to create Weather Report, Chick Corea would lead his own Jazz Rock group called Return to Forever, Herbie Hancock would create some weird and innovating avant-fusion stuff under his own name, while Dave Holland and Tony Williams would get there name as highly capable jazz/fusion musicians.However, don't let this five-star line-up trick you, in here they don't play as they would later be known-of. Quite on the contrary, all musicians on board play as-a-whole settling some fantastic, though very subtle, jazz moods in both 18+ minutes compositions, yes that goes for John McLaughlin too. Chick and Herbie are playing some very warm and delicate electric keyboards to full-fill that gentle mood but also giving the compositions some groovy aspect, while Joe plays the organ giving a very mysterious atmosphere, very ala Larry Young(who was the one intended to play the organ in the first place!). Tony is probably the one which gives less interest, but that doesn't take credit for his essential though tranquil rhythms he settles, while Dave every now and then supports some notes to give more depth to the notes already played by the keyboard players. Miles and Wayne do the same job as both keyboardists and guitarist, adding a grabbing, though repetitive and smooth, melody.As a result, both compositions really trap you into an aura of tenderness and nothingness in which flows without a single flaw. Indeed they played in a silent, but oh so effective and gentle, way!While definitely you got to be able to listen to some jazz music to appreciate this, you're not obliged to love the genre. A truly groundbreaking record of the time, and a definite classic of Jazz Rock and Progressive Music; you might not be able to appreciate this at first listen since it's rather long and very subtle, but some dedicated time is sure to please you in the end, that is if you can handle music without riffs, flashy solos and whatever that the modern Prog stereotype is about.5 stars: not a masterpiece of 70s fusion, because, well, it wasn't released in the 70s! But also because it's not really \"fusion\" in the way Mahavishnu Orchestra and the like are. In a Silent Way and Bitches Brew are the foundations of the fusion movement, let's call it Proto Fusion of the best kind."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Sunday, May 9, 2010",
      "rating": 4,
      "text": "Like many other prog fans, I've been familiar with this album andBitches Brewfor ages. I love them a lot, but never ventured much beyond them to discover what this Miles Davis phenomenon is really all about. So I can't judge these albums in the context of Davis' career and certainly not within the jazz scene from which it emanated.But going by what my ears tell me this sure is an amazing album. It's not the wild and rocking style of jazz-rock as it would be popularized by Mahavishnu Orchestra and others in the 70's. Instead it still has the subdued mood of traditional jazz, a delicate balance of melancholy, energizing rhythms and vivacious musical performances. The bass guitar is rather prominent but the drums are still very much in the back. The clean electric guitars and keyboards bring the sound slightly closer to rock.In A Silent Wayis one of the first albums of a traditional jazz artist integrating elements of rock music. In this case 'rock' means undistorted electric guitar and electric keyboards. But still it gives this soft mood music an extra dimension and makes it sound a more appealing to rock audiences then traditional jazz."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Monday, April 25, 2011",
      "rating": 4,
      "text": "Well, this is the work of the definitive \"artistic maturity\" for a great artist such as Miles Davis, whose \"impact\"- in the history of the best cool jazz music genre- is important so far!!For instance, here you find the first defined \"fusion\" experiments during his remarkable career in the sixties and- moreover-the improvisational moments upon the melodic structure and the repetitive sketches, which allow a kind of \"reduction\" concerning the music plot, represent some important features...even though- actually- the whole length should be over two hours, but the producer Teo Macero decided to cut down the duration to 80 minutes and then along with Miles even to 27 minutes: in fact at the end of the album divided into two sections, the main music phrases have been repeated twice, probably in order to let him play in a more concise manner... in particular here you find the most remarkable phrasing and also his trumpet is extraordinary.\"Shhh/Peaceful\" is a great jam, enriched by means of a fine harmony, being supported by three keyboardists and the jam led by the guitarist and the sax player as well.As a matter of fact, the connections between several different elements , create a big contrast in the composition and also regarding of track#2- \"In A Silent Way/It's About That Time\"- which is different from the tune as it was originally written by J. Zawinul, characterized (as it was when He wrote the composition) by too many chords!At the end, the final section of It's About That Time\" is a bluesy clever piece of work, with its amazing groove, which is splitted by everything that could be composed by Weather Report for instance...the repetitions inside allow such a reflective and intense moment of art, rather than being a more serious impediment to the music growth!Basically this is a must-have for the lovers of the intelligent cool jazz!!"
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Sunday, May 22, 2011",
      "rating": 5,
      "text": "Ground zero for fusion - at least from the jazz side of things (Zappa had been working diligently on a fusion sound from the rock side for some time by this point). Although In a Silent Way doesn't sound very much like any of the fusion acts which would be spawned in its wake - Chick Corea's Return To Forever, Joe Zawinul and Wayne Shorter's Weather Report, John McLaughlin's Mahavishnu Orchestra, Herbie Hancock's Head Hunters work, the Tony Williams Lifetime, and Miles' own 1970s bands - it does nonetheless mark the point where a respected and widely-revered giant of the jazz scene went full electric and embraced a spirit of progressive, rock-influenced experimentation, which gave everyone the licence to follow.Sonically speaking, it's almost ambient fusion; a swirling, foggy, soporific mass of sound out of which soloing emerges and fades from view. Kick back and relax and let it wash over you, or pay close attention to all the ins and outs of the album - it's your call, and both approaches to listening are rewarding in their own way. Plus, just look at the list of fusion acts I've outlined above whose key members performed on this album. How can any fusion fan not be interested in the sessions which brought all those talents together?"
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Tuesday, June 28, 2011",
      "rating": 4,
      "text": "'In A Silent Way' - Miles Davis (8/10)The musical excellence of Miles Davis' work aside, there is no denying that he has greatly shaped and influenced the way music has developed over the course of the 20th century. With 'In A Silent Way', Miles Davis added yet another dimension to his musical canon; that of 'fusion', which this album is widely regarded to have pioneered. Its historical relevance aside, there are some incredible things going on with 'In A Silent Way'. Assembling one of the greatest lineups that jazz has ever seen (including Chick Corea and Herbie Hancock), 'In A Silent Way' may not be as perfect as an album like 'Kind Of Blue', but as the vanguard for another era in Davis' career, the album is incredibly powerful, and rightfully deemed one of the most influential albums in the genre.By 'fusion', this means that Miles Davis was beginning to incorporate increasing amounts of electric instruments into his sound. He brings this sound forth through two long jams, each encompassing one vinyl side. The first of these is 'Shhh/Peaceful', a fairly light meddle through electric guitars and some trumpet work. Over the course of the song, things gradually build, but the real focus is on the musicianship and chemistry between the band members, rather than any focused composition. The real highlight to the album however is in the second track, the title piece. The majority of the second track revolves around an eerie idea that gets developed upon as the blissful jam ensues, working out into a jazzy freakout from Davis himself, backed by chilled drums and nice keyboard grooves. After that, there is a very quiet reprise, featuring some ambient guitars and celestial keyboard flourishes. By the end, everything is made out to be the soundtrack to some beach sunset, relaxing and carefree. 'In A Silent Way' ends leaving the listener in a state of total calm.The album sports some incredible work with rhythms and composition in the second half, and while the first half is not nearly as memorable, 'In A Silent Way' is made excellent throughout due to its brilliant musicianship. John McLaughlin features some of the warmest clean guitar tones I have ever heard in a recording, and the keyboardists Corea and Hancock- while not getting much room to show their skills here- really compliment the sound. The best way for me to describe 'In A Silent Way' would be to invent the term 'dream fusion'; especially in the way the keyboards are meant to scale up and down quietly over peaceful leads, everything is made out to be very surreal, and the effect of that is something that only musicians as good as these could make. A bit of a weaker first half, but 'In A Silent Way' remains an excellent piece of early jazz fusion."
    },
    {
      "reviewer": "thehallway",
      "date": "Posted Tuesday, July 5, 2011",
      "rating": 3,
      "text": "There's not enough to explore.This album, Miles' first fusion one (and perhaps Jazz's first fusion one), has a very calm, peaceful feel to it. It's still highly rhythmic, but dynamically subdued and lacking in any explosive or heavy moments. This is actually hinted to in the titles of the two pieces. But that isn't the bad thing about it; I love the mood that Miles' band creates here. The problem for me is that there just isn't much material on the record, and very little variation on the few themes that are there.Borrowing from the ABA or 'Sonata' structure of a typical Classical symphony, the pieces on 'In a Silent Way' have a friendly and accessible construction. However, the reprise of the first section, in both cases, isn't actually a reprise, but the EXACT same music simply repeated. I don't expect a \"copy and paste\" mentality from an album that pre-dates computers! This means that one quarter of the album is exactly the same one another quarter. Hence, there aren't many listenings you can handle before you get bored. I think the music itself is pleasant enough, but it's minimalistic (for example, the section entitled \"Shhh\" consists of a two-note bass ostinato and pure improvisation from the rest of the band). Minimalistic music is great when there's lots of it, but there isn't lots of this, and in any case, there isn't any development on it.My favourite part is 'It's About That Time', which is very groovy and the most upbeat moment on the album. Because of this, and the more free nature of the 'In a Silent Way' intro/outro, the title track definitely works better than 'Shhh/ Peaceful'. The former song's two parts are almost indistinguishable, despite being quite good independently. I think the second piece has more to offer, and every band member has a significant role to play.Miles Davis has always been 'variable' to my ears. Sometimes he is a genius, sometimes I can find him to be awful. 'In a Silent Way' is neither. It is culturally significant in terms of Jazz Fusion, and it is somewhat restrained (although this making it beautiful at times). It is also quite literally, repetitive. Ultimately, we cannot ignore that the album is a certainmilestone. However (and here I shall do what Miles did and copy and paste my original theme).......There's not enough to explore."
    },
    {
      "reviewer": "J-Man",
      "date": "Posted Sunday, October 30, 2011",
      "rating": 4,
      "text": "In A Silent Wayis usually considered to be one of the first albums to blend traditional jazz with rock music, as well as one of the greatest albums in the fusion genre. Miles Davis had hinted at this fusion of jazz and rock music on a few previous efforts, but this observation from 1969 can safely be considered his first full-blown fusion effort.In A Silent Wayis a little bit different from what you may be expecting from a fusion album, though - you'll hardly find any zany instrumental outbursts here. Apart from a few sections, this is a very subtle album that is focused mainly on quiet jazz ambiance and deep improvisation. The 'rock' element ofIn A Silent Wayis mainly found in the instrumentation; the extensive use of electric guitar, electric piano, and organ was nearly unheard of in jazz music back in 1969. This is first and foremost a jazz album, and those seeking audacious rock rhythms and frantic soloing may be in for a slight disappointment, but it's an essential purchase for any open-minded fan of early jazz fusion music.This album took longer for me to 'get' than a lot of other Miles Davis albums, for some reason or another. I guess an album that only consists of two sidelong tracks, both of which are only characterized by subtle rhythms and improvisations can take a little while to warm up to.In A Silent Waydid eventually click with me, though, and after about six listens or so I began to understand what everyone else sees in this album. What initially struck me as boring noodling soon grew into genius solos, and the improvised chemistry between each of the musicians is truly remarkable. The album begins with \"Shhh/Peaceful\", which is (as the title suggests) a very quiet and subtle piece. It's a bit too long-drawn for my tastes, but there are plenty of great moments throughout the eighteen minute duration. Herbie Hancock and Chick Corea's electric piano playing both add lots of depth and layering to this piece. \"In A Silent Way/It's About That Time\" is my favorite of the two songs, and contains a few more traditional rock elements than the first track. The riffs also tend to change more frequently, and the ending is quite exciting.Neither of the two songs draw extensively from rock music in terms of songwriting, but the electric instrumentation was sure to have jazz purists crying foul around the time of its release. John McLaughlin's warm electric guitar tones as well as the organ and electric pianos were, while still very subdued and gentle, pretty ambitious for jazz music at the time. Of course, the musicians playing these 'new' instruments were all top notch. If you look at the lineup and then consider all of the legendary jazz groups that formed from these guys, it's clear that Miles hand-picked some of the scene's most talented musicians for this session. The production courtesy of Teo Macero is very warm and clear -In A Silent Waysports one of the best fusion productions out there for sure.Parts ofIn A Silent Waymay feel a bit too long-drawn and unfocused for my tastes, but there's no denying that this is a revolutionary - and damn good - jazz fusion album. Anybody looking for an example of what jazz rock sounded like back in 1969 should be sure to check this classic out (if you haven't already heard it, of course). Although more subdued than a lot of other fusion classics,In A Silent Wayshould hold just as much appeal to rock and jazz fans alike. This may not be my favorite Davis album, but there's enough quality music and ambition here to let me consider it part of his essential canon.In A Silent Waydeserves no less than 4 stars in my mind."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Monday, January 2, 2012",
      "rating": 4,
      "text": "\"In A Silent Way\" is a jazz fusion paradise featuring Davis at his absolute best. In many ways this is his most accessible and most highly revered album. The lengthy compositions are really improvised jazz sessions that are interwoven with dark and light tapestries of sound.Side one is driven by a glorious jazz beat and grinding Hammond, with some absolutely exquisite guitar work. It feels improvised but always has a direction and gets there. Along the journey there are wonderful sounds such as the hi hat work and of course Davis soulful trumpet.Side two is the dreamier side that soon breaks into jazz patterns and musical shapes of incredible complexity and beauty. It is music created to generate moods. The main thematic point seems to be competing musicianship and allowing the artists to take off on their instruments. At one point we are lulled off to sleep with dreamy trumpets and chiming keyboards. Then the thunderous percussion kicks in and takes on a jazz excursion into dynamic soundscapes.This, along with \"Bitches Brew\", is certainly one of the Miles Davis albums that will resonate with many prog listeners in comparison to some of his other less progressive albums."
    },
    {
      "reviewer": "VanVanVan",
      "date": "Posted Tuesday, February 14, 2012",
      "rating": 5,
      "text": "There was a period a couple of months ago when I would put this album on every night as I was going to sleep. It became a sort of ritual for me, and more importantly, it gave me a chance to listen to this album without any distractions, a privilege which is rarely afforded otherwise. I will freely admit that I am not nearly as knowledgeable about jazz fusion as I would like to be, but it doesn't take an expert to realize that this album is something special. I had listened to Miles Davis before, but this was really the first album of his I really got to know, and listening to his trumpet every night in the dark was really something special.\"Shhh/Peaceful\" begins the album with a piano, guitar, and organ part that is indeed fairly peaceful despite the uptempo percussion part that persistently plays behind these instruments. Some bass joins the mix and almost immediately after the unmistakable trumpet of Mr. Davis himself jumps in. I'm sure that far better writers than myself have written more than I ever will about Miles' playing, but listening to this album it's impossible not to be captivated by the clarion tone of the horn. The trumpet simply commands the piece, taking center stage and perfectly complementing the playing of the musicians behind it. After a little while piano and guitar take the lead, and it's great stuff (with McLaughlin, Corea and Hancock, how could it not be?) but the magic really returns for me when Miles jumps back in. By this point the track has stopped living up to its name and is full of energy, a trend which continues for most of the meat of the track. This is music that is by turns hypnotic, psychedelic, jazzy (duh), experimental, and above it all, great.\"In A Silent Way\" begins on a much calmer note, with guitar, keyboards, and bass weaving together a lullaby-like ambience for Miles to lay a crooning trumpet part over. This motif continues for quite a while before the tempo picks up and the keyboards start laying down a little chord progression that the guitar quickly matches, then begins soloing over. The repeated piano chords create a trance-like ambience that seamlessly forays into a bass-led motif with organ backup. Over it all, of course, Miles keeps on playing some of the smoothest, most natural sounding jazz I've ever heard. I can't think of too many other 20 minute pieces built on a repeating chord progression that can keep my attention, but this one certainly can, and by the time the first motif returns the listener's had a very memorable ride indeed.I recognize that this is a much shorter review than I usually write, but I'm sure there are others out there who have described the music far better than I've been able to. I hope though, that I have been able to impress just how good this album is. It's infinitely listenable, compelling throughout its entire 40 minutes, and most importantly, it's got heart. You can hear the passion of every single musician who appears on this release, and that's really something to be cherished. Hard to argue that this is anything short of a masterpiece.5/5"
    },
    {
      "reviewer": "EatThatPhonebook",
      "date": "Posted Sunday, March 4, 2012",
      "rating": 5,
      "text": "10/10\"In a Silent Way\" is one of the essential Fusion records. A landmark achievement that never seizes to be so powerfully stunning.\"In a Silent Way\" is for many Miles Davis' magnum opus, the album that officially started the Fusion genre. Some may even say it's the greatest Jazz record ever created, and as a matter of fact, if such a prestigious title would ever be officially labeled to any album, \"In a Silent Way\" would have a great chance in obtaining it. The famous musician just needed to get an absolutely stellar ensemble of musicians, almost all just as talented as he was, to reach such great heights.As the first Fusion record, \"In A Silent Way\" starts off the genre quite smoothly: the music on the legendary album is quiet, peaceful, and never getting louder than it is. A record that for this reason might be a hard pill to swallow on the first spin, and might take several listens before it magically clicks. Fusion fans cannot deny that the basic, essential elements of the genre are present: electric guitars (by master John McLaughlin), electric keyboards (two legends, Herbie Hancock and Chick Corea) and the organ are always strong characteristics of the album, all three instruments of course playing very smoothly and delicately. Miles' trumpet is as usual sublime, haunting, with a seducing, sensual feel to it and with still a strong power of virtuosity. The crispy drums by Tony Williams give a suspended touch, while Dave Holland's bass grumbles like a beast. Not to forget another great, Wayne Shorter on saxophone, even though admittedly his contributions are not as essential as the others.The two tracks, that cover the entire space of the album dominate each side, starting with \"Shh/Peaceful\", a relaxing, chill piece that remains of the same toned down mood for the entire eighteen minutes. The most curious thing then is how Miles managed it to sound constantly enjoyable. The song's musicianship is flawless, ir has an innovating structure, almost identical to the second side: The first part, \"Shh\", is somewhat climactic, where starting from an organ note almost all the instruments come in one at once a while before Miles' trumpet steals the show. The song then evolves almost unnoticeably into \"Peaceful\", the second section, with a great performance by John McLaughlin. The last minutes of the suite are dominated by repeating \"Shh\" identically. The second side, with the title track , has a very similar mood and feeling, however it is much more accessible in it's form and more melodic sounding, with once again the repetition of the first part of the song in the final minutes.\"In A Silent Way\" is a revolution in Jazz music, an album that at the same time never bores and always intrigues and fascinates. The electric Miles Davis will go on and create other masterpieces like \"Bitches Brew\", but \"In A Silent Way\" is simply unforgettable, timeless, and still highly entertaining, even for someone who isn't familiar with Jazz music."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Sunday, March 18, 2012",
      "rating": 4,
      "text": "In a Silent Way is outstanding background music; although it never quite engages me, it is exceedingly gratifying in spite of that, and is far superior to Bitches Brew, released the following year. It is rhythmically repetitive, almost to a fault, but what Miles Davis and company do in the course of those thirty-eight minutes is enchantingly satisfactory.\"Shhh/Peaceful\" Illusorily uptempo, this piece begins with an ethereal organ, electric guitar phrases, and electric piano tinkling in the backdrop before Davis enters with his dynamic trumpet performance over the rhythmic ostinato. The keyboards and guitar runs create an ethereal mood that textures the music beyond what the repetitive bass and hi-hat create.\"In a Silent Way/It's About That Time\" Despite the previous title, this piece is initially the more peaceful and quiet of the pair. It retains a dreamy character for a fifth of the piece, and then takes off, exhibiting a feel that is nearly identical to the other opus. Herbie Hancock's electric piano provides a haunting element. Midway through, a wild bass groove appears. Eventually- finally- the drummer gets in on the action, creating a climactic motif that is the most exciting moment on the album and one of the best in Davis' lengthy career. John McLaughlin's electric guitar denouement is tranquil, creeping in like the lullaby that finally puts a child to sleep."
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Monday, March 19, 2012",
      "rating": 5,
      "text": "Beauty that Transcends GenreI came to Miles Davis differently than many on this site. I played brass instruments in middle and high school jazz bands, mostly songs with set arrangements and relatively short solo sections. Miles Davis was a little \"out there\" for me in those days but his technique and style were undeniable. As I got into guitar and learned about the fusion heroes of the 70's, BITCHES BREW was always part of the conversation. I checked out the seminal album, and still didn't get it. Late in college, I began my immersion in blues and then back to jazz. First I found KIND OF BLUE which remains one of my favorite records of all, deserving of its classic status. I actually looked backwards from there to BIRTH OF THE COOL era works, enjoying but not falling in love with that style. I finally picked up a copy of BB at a used record shop a few years ago and was still underwhelmed.It was only after coming to this site that I saw that some fusion lovers were enjoying Miles' other fusion works more than BB. It was from this entry point that I found IN A SILENT WAY. It has now become my second go-to album from Davis, along side KIND OF BLUE. There is something just transcendant about this album. The bandmembers are simply so plugged into each other, the vibe so pure. While SILENT WAY superficially shares the basic sound of BB, it exceeds it on an emotional level by leaps and bounds. Where BB sounds like an excellent jam session, SILENT WAY feels like one of those works where the musicians were channelling something from another dimension. Athletes talk about being \"in the zone,\" and all musicians can attest to knowing when that little special switch flips and something amazing happens. For me, I feel that all the musicians here are wide open with blazing beauty flowing through their instruments.I never feel like \"ok now it's Miles solo section\" or that we dropping back into the main head of the song. (The second title song does have one thematic riff, but it weaves in rather than being used as an exposition.) SILENT WAY seems more like pure improvisation over a set groove, each player trying to tap into an emotional setting and then explore the scene. As the title suggests, these scenes evoke dark nights, mellow murmuring crowds. There is a sense of urgency but absolutely no aggression.I have several albums rated as masterpiece in jazz-fusion, but none are better than this. Absolutely essential."
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Tuesday, September 4, 2012",
      "rating": 4,
      "text": "Ten years after Miles Davis shows the world what Cool Jazz is about, he releases this album and shows the world what his vision of what a fusion of jazz and rock music could be. On his 1968 album Miles In The Sky he introduced electric piano; with his next album he adds electric bass. This album adds electric guitar and with it comes elements of rock'n'roll music. This was a controversial album when it was released. Like Bob Dylan before him, Miles got labelled a \"sell out\" for going electric. Both jazz and rock critics were confused; generally the former hated In A Silent Way and the latter liked it a little more. This album links Miles' first flirtations with electric jazz (the last two albums) with the avant-jazz-rock of Bitches Brew, an album that would be even more controversial than In A Silent Way. Despite being controversial, or maybe because of it, In A Silent Way sold better than the last few Miles releases.A major difference from before is the way producer Teo Macero uses editing and tape-splicing to rearrange what has already been recorded. If including electric piano/guitar and rock rhythms into the music was not enough, having the final product be a studio creation was more than jazz purists could handle. Macero used the classical sonata form to rearrange the music already recorded into what the album ended up sounding like. English bassist Dave Holland returns from the last album where Ron Carter played electric bass; Holland only plays acoustic double bass here. Herbie Hancock, Chick Corea, Wayne Shorter and Tony Williams are all back again but it's the two new guys in town who make this album a who's who of future jazz fusion.English guitarist John McLaughlin and Austrian keyboardist Josef Zawinul would both make important contributions to this album, yet the involvement of both came almost by accident. Davis met McLaughlin for the first time the day before In A Silent Way was recorded; he was so impressed with him he invited him to the recording session. The rest, as they say, is history. Having two electric piano players already was apparently not enough and Miles wanted an organist as well. Originally he wanted Larry Young but Zawinul ended up taking the position. Zawinul brought with him a little folky ditty called \"In A Silent Way.\" The group recorded it the way it was written by Josef; Macero then proceeded to rape it, butcher it and basically just have his way with it. The end result sounds nothing like the original.That part bookends the title track while the \"It's About That Time\" part was written by Davis and is the rockiest the album gets. Much closer to jazz-rock than the first side-long piece \"Shhh/Peaceful.\" Both McLaughlin and Williams are more subdued here, with Williams basically only using his hi-hat for repeated patterns. No beats or drum fills. This track draws you in with its hypnotic repetition. This has a vibe similar to some of the space rock and Krautrock coming out at the time. You can see(hear) how this track had an influence on some ambient music. An important album but it's not my fav from Miles' fusion period. In the next five years his music would just get louder, weirder, funkier and more raw. I give this 4 stars."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Friday, June 13, 2014",
      "rating": 4,
      "text": "In a way, a more accessible album than Bitches Brew, In a Silent Way offered the Miles listener a gentler show of transition from the exclusive world of jazz into the world of pop-rock-funk-jazz fusion. Enlisting the contributions of hot shot young bloods Herbie Hancock, Tony Williams, John McLaughlin, and Joe Zawinal, Miles continued to rely on bassist Dave Holland and saxophonist Wayne Shorter as well as recent band stalwart, Chick Corea. The biggest development with In a Silent Way came in the form of giving Columbia Records producer Teo Macero the green light to employ engineering thus taking the \"live\" sound out of the music and creating a fabricated, even stylized and/or fabricated music. (Teo was a big fan and student of classical music formats, thus the three movements, exposition, development, and recapitulation, used in the reconstruction of Miles' band's studio recordings.) The music here is surprisingly sedate and accessible for such a \"revolutionary\" and \"innovative\" album. Nothing is offensive or repellant but then nothing, to my ears and mind, is neither particularly mind-blowing or ear-catching. I guess it's more of the fact that there are two side-long pieces presented here--something bands like The Soft Machine, Colosseum, Magma and other jazz and jazz-rock bands picked up on fairly quickly. While many hardcore jazz musicians turned their thumbs down to the new commercialized jazz coming out of Columbia and Miles, many others found inspiration and a new freedom to explore--many of them members of Miles' own studio sessions. The two songs are great if subdued, with my favorite performances on \"Shh/Peaceful\" coming from Dave Holland (bass) and Larry Young (organ) and on \"In a Silent Way/It's About That...\" from Miles and Wayne Shorter and the funk of Dave Holland and the keyboard players. Tony doesn't get much time to shine and John's guitar is so subdued without any effects enhancements that it sounds quite dull and even tame. I guess what we're really all in awe of is Teo's shaping of the music into pop-like songs (despite 19 minute lengths)."
    },
    {
      "reviewer": "patrickq",
      "date": "Posted Monday, February 18, 2019",
      "rating": 3,
      "text": "In a Silent Wayis a 1969 album containing two sidelong pieces. Although it is a Mikes Davis solo album, lots of big names participated in a one-day session from which the album was culled. Among the biggest: keyboardists Joe Zawinul, Herbie Hancock, and Chick Corea, and guitarist John McLaughlin. Given the fact that the recordings were sliced and reassembled to createIn a Silent Way, Teo Macero, who produced the session and assembled the album with Davis, is often considered as more essential to the success of the album than any sideman.The individual compositions, the four \"songs,\" are good - - although the two on the first side are, in my opinion, better. The composition of the album itself from three hours of sessions is also impressive, although I haven't heard the source material, available onTheIn a Silent WaySessions. The sound quality is good, although the soloing instruments are a bit too starkly isolated in the mix for my tastes. And of course, the playing is excellent.Side one is presented in the liner notes as a medley of two Davis compositions, \"Shhh\" and \"Peaceful.\" But the side is, in effect, a single piece with brief pauses. For example, there is a pause at 6:14, indicating \"Shhh\" transitioning to \"Peaceful,\" although the music before and after that point is very similar. A more noticeable break occurs around 12:04, when the intro to \"Shhh\" reappears. Despite the titles on side one, the music is of moderate intensity. Actually, the most peaceful part of the album is the opening of the second side.Side two is a medley of Zawinul's \"In a Silent Way\" and Davis's \"It's About That Time.\" The first two minutes are given to McLaughlin who solos over a very light electric piano backing which fades in slowly. At this point, Davis and saxophonist Wayne Shorter enter and take center stage. At 4:11, as noted in the credits, \"It's About That Time\" begins, and here there is a clean break between two songs. Whereas \"In a Silent Way\" has no rhythmic percussion, \"It's About That Time\" is much more energetic, with a steady beat provided by drummer Tony Williams and bassist Dave Holland. Throughout this piece - - the middle eleven-and-a-half minutes of the side - - McLaughlin, Shorter, and Davis each have plenty of time for an extended solo. The last 4:14 is a recapitulation of \"In a Silent Way\" played in a very similar arrangement as it had been earlier on the side.The dice-and-splice construction onIn a Silent Wayworks on side one, but it seems forced on side two. \"It's About That Time\" just doesn't work in a medley with the title track, and Davis himself might have wondered about side two fitting with side one; apparently he and the group returned to the studio later the same week to record different material to go with \"Shhh/Peaceful.\"Overall, the album is good. It's also historically important for its groundbreaking production and style. Recorded and released in 1969,In a Silent Wayis regarded as a true \"fusion\" album - - perhaps the first. Although its rock quotient is much higher than on Davis's earlier breakthroughKind of Blue(1959), there would be significantly more rock the next year on his follow-up album,Bitches Brew. So whileIn a Silent Wayis a good jazz album, fusion or rock fans might want to start withBitches Brew."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Tuesday, October 22, 2019",
      "rating": 4,
      "text": "MILES DAVIS didn't become one of the jazz world's most recognizable name by chance. This relentless composer and performer never for a single moment lapsed into any sort of complacency and was constantly advancing his art form to the next level. It would have been easy for DAVIS to rest on the laurels of his lauded 1959 modal jazz masterpiece \"Kind Of Blue\" which propelled him to the top of the jazz world's highest echelons however he immediately steered his craft in a completely new musical direction with the following \"Sketches of Spain\" which tackled the complexities of third stream and orchestral jazz competently infused with Spanish ethnic folk traditions. The 60s found a consistent stream of jazz recordings from DAVIS and a mere ten years later, DAVIS shocked both the jazz and rock worlds once again with this eclectic release IN A SILENT WAY which not only began DAVIS' own eclectic period that would extend into the 70s but also gave the green light for jazz and rock artists to commingle and open the doors for the wildest jazz-rock hybridizations to come.While on the top of his game in the jazz world, DAVIS had a knack for keeping his pulse on the musical scenes at large and had a keen command of not only the rock and pop world but also steadily incorporated the most advanced techniques of Western classical music into his style. While jazz-fusion had been slowly but steadily building throughout the 60s by the likes of various artists like Herbie Mann, Gabor Szabo and even Jean-Luc Ponty, many of these hybrids were based on incorporating ethnic and world musics into the annals of the jazz universe. Rock was clearly considered inferior subject matter and although Frank Zappa and the Mothers of Invention were beginning to display the fertile possibilities of such desegregation, it wasn't until MILES DAVIS released IN A SILENT WAY that it was considered a bona fide musical expression. All this despite DAVIS adding more fusion elements on the two preceding albums \"Miles In The Sky\" and Filles de Kilimanjaro\" which steered the post-bop flavored compositions with rock music elements such as rhythm and blues, funk and other unthinkable things like electric instruments, repeated melodies and improvised jamming fortified with steady constant time signature flows.While considered DAVIS' first true jazz-fusion album, IN A SILENT WAY owes more to the world of classical music in that its two lengthy tracks \"Shhh\"/\"Peaceful\" and \"In a Silent Way\"/\"It's About That Time\" are arranged in the classical sonata form which finds the two tracks featuring an exposition which presents the main theme, a development which moves the compositional themes through various keys and other technicalities and finally engaging in recapitulation which creates an alternative reality of the exposition. The two tracks in their entirety both extend past the 18 minute mark with each swallowing up an entire side of the original vinyl editions that emerged on 30 July 1969. Despite the classic nature of this album and its groundbreaking approach that has influenced jazz musicians ever since, the entire album was assembled from a short sessions from Studio B at CBS 30th Street Studio in New York City in February of 1969 with only a few extras recorded. The magic of the album came not only from the musicians involved but was more the product of the production and mixing laid down by producer Teo Macero. IN A SILENT WAY eschewed the post-bop gymnastics that allowed jazz musicians to exhibit their highly developed techniques but rather imbued an otherworldly atmospheric approach. Personally i would call this either spiritual jazz or dream jazz as it exudes a placid altered state of consciousness that drifts by serenely.While the musical aspects of IN A SILENT WAY take a back seat to the atmospheric characteristics, the album is chock full of the best talent of the late 60s jazz world and successfully launched the careers of many of the newer members on board including guitarist John McLaughlin, bassist Dave Holland and keyboardist Chic Corea. While DAVIS' trumpet prowess is usually the star of the show, on IN A SILENT WAY, he remains rather obscured by the various waves of sound that oscillate with a heavier emphasis on the electric piano trade offs of Corea, Hancock and Austrian keyboardist Joe Zawinul who composed the exposition and recapitulation parts of the title track. Perhaps the most subdued role in this mellow style of jazz fusion are the drum parts of Tony Williams who propels just enough percussive drive to keep a slow steady beat which is perhaps why the jazz purists were so against this sort of development in DAVIS' evolution. Many saw this as selling out since rock music was ruling the commercial aspects of music supreme at the end of the 60s, however the jazz aspects were fully exercised with the complex harmonies and improvisations and the wind instruments which found Wayne Shorter's sax squawking and DAVIS' familiar trumpeting kept the music grounded in the world of jazz. Overall the album walked a very nice tightrope act between the jazz and rock paradigms. McLaughlin's guitar antics may have made him a huge star in the future fiery Mahavishnu Orchestra but on IN A SILENT WAY, his style is subtle and one must struggle to distinguish it from the tapestry of sound that flows like a cosmic river of time.IN A SILENT WAY didn't exactly perform well upon its release as it went over the heads of many who were stuck in their respective expectations of what jazz or rock should be but historically, this album is now regarded as one of the most influential albums of the entire 60s as it unapologetically opened a completely new Pandora's box of musical mingling that changed the entire playbook for both rock and jazz. While a beautiful album indeed, this is one that i think gets rated so highly for its impact rather than its performances. While pioneering an entirely new reality of creative fertile cross-pollination, i don't find IN A SILENT WAY to be exactly the masterpiece that it is purported to be. On the contrary i find it as a mandatory first step for the music of the more magnanimous jazz-fusion expressions that DAVIS would conjure up with \"Bitches Brew\" and \"Get Up With It.\" Those albums tackle the logical conclusion of what is presented here. Overall this album seems to just coast on like a nice road trip with no stops to see the sites. It merely presents a new idea to the audience without ramping up the extremes that would erupt onto the scene in a very short time. As a classic influential album, this indeed is a historical triumph but as a specimen of musical expression in its own right, i find it a tad on the tame side and due to the fusion creeping into both the jazz and rock worlds in the preceding years, isn't quite as revolutionary as \"Kind Of Blue,\" however no one could ever argue that this album doesn't deserve its status as a benchmark for a new explosion of more artistic expressions of rock and jazz engaging in a hitherto unthinkable syncretism."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "albumcd3f.html",
  "last_parsed": "2025-05-18T00:25:40.999527"
}