{
  "local_path": "C:\\Users\\salmo\\Documents\\GitHub\\AlbumExplore\\ProgArchives Data\\Website\\ProgArchives\\www.progarchives.com\\artist681a.html",
  "name": "GENESIS",
  "genre": "Symphonic Prog",
  "country": "United Kingdom",
  "biography": "Formed in 1967 at Charterhouse School, Godalming, Surrey, UK - Disbanded in 1998 - Shortly reunited in 2007-08\n\nBeloved Symphonic prog rock through to stadium filling rock titans\n\nAny biography of Genesis must recognise that there are distinct periods in the band's history, and that any discussion should recognise that musically and lyrically, the band which filled vast stadia throughout the 1990's was a completely different creature to that which played sweaty student halls filled with spotty young men in the early 1970's.\n\nThe original incarnation of the band had its origins in two outfits formed by\n\nPeter GABRIEL\n\n(vocals & flute),\n\nTony BANKS\n\n(keyboards),\n\nMichael RUTHERFORD\n\n(bass & rhythm guitars), and\n\nAnthony PHILLIPS\n\n(lead guitars) whilst boarding students at the elite English public school, Charterhouse in the mid-1960's. Outside the confines of an extremely stuffy atmosphere, the world was becoming far more liberated, socially, sexually, politically, and musically, and these bands represented an outlet for young men who, basically, as young men do, wanted some of that.\n\nThe two acts coalesced into one, and the students had the novel idea of placing a tape of their music into the hands of Jonathan King whilst he was visiting his alma mater. King was, at this time, a big selling artist and musical impresario, and, consequently, someone who mattered in the rock world.\n\nThe tapes were basic, but King took a shine to Gabriel's voice, and recognised a unique sound and talent which, if nurtured, could become huge. He arranged for the band, with drummer Chris Stewart, to record some sessions in London, where the boys experimented with quite complex, orchestral pastiches. Knowing that King was not happy, the band penned Silent Sun, a song which was essentially a Bee Gees tribute single. The brothers Gibb were huge commercially at this time, and King was known to be a huge fan. The resulting album in early 1969 was named \"Genesis to Revelation\" by King, as representing something brand new and exciting in the musical world. It barely scratched the surface of the commercial music world, and, for many a year after, copies could still be found in the bargain bin section of stores.\n\nFollowing this, there was, initially, some doubt as to whether the musical careers would survive leaving school. Parental pressures were particularly acute on Rutherford, whose parents had virtually guaranteed him a scholarship with the British Foreign Office. However, a decision was taken to further the music, and, with new drummer John Mayhew (not a schoolmate) in tow, the band began to gig extensively, picking up admirers in the burgeoning progressive rock scene which was bursting out in student halls across the UK.\n\nKing had, by now, lost interest, but the band were lucky when, on a recommendation, Tony Stratton-Smith, a legendary Soho impresario and founder of Charisma Records, saw them live, fell in love with, particularly, a live version of what was to be later recorded as Visions of Angels, and signed them up virtually there and then. The key to this signing was the artistic freedom afforded by the label to the band to produce the music they wanted to produce, and, crucially, the time required to build a following, something which would be next to impossible in the modern world, with its record executives generally having the attention span of the average gnat.\n\nThe first Charisma release was Trespass in late 1970, a collection of complex songs which belied the youth and relative inexperience of the band. As strange as it may seem, the band continued to play music from this album right up to the final live shows of 2007, with elements of Stagnation forming part of the classic instrumental medley regularly played at gigs. Most recognise that the highlight of the work was the furiously paced, radical, revolutionary rock track The Knife, which was the album, and live show, closer. It became a hit in Belgium in 1971, helping to propel the album to number one in the charts there.\n\nThe extensive touring was, though, beginning to take a toll on Phillips, who began to suffer from acute stage fright, this becoming so bad that he made the decision to quit. His departure was a body blow to the band, because Phillips was far more in terms of song-writing and playing one fifth of the outfit. Phillips would subsequently become a music teacher, and launched his own (studio based) solo career in 1977, encompassing a range of musical styles. Despite the loss, the decision was taken to carry on and to replace Mayhew, who had serious musical limitations, at the same time.\n\nSteve HACKETT\n\non guitar was recruited on the back of an advert he had placed in the music newspaper Melody Maker, in which stated he wished to join \"receptive musicians, determined to drive beyond existing stagnant music forms\". Phil Collins on drums attended auditions held at the rather grand Gabriel residence, and learned the songs being played to and by other auditionees whilst relaxing in an outside swimming pool. By the time his turn came, he was note perfect!\n\nAs grave as the loss of Phillips must have been, Genesis had added two exceptional musicians. Collins came to be regarded as one of the finest rock drummers in the world, and he had the added advantage of being able to provide decent backing vocals to Gabriel. On the first album released by the line-up, Nursery Cryme in 1971, Collins sang (uncredited) lead vocals on the short For Absent Friends.\n\nThe album did not sell particularly well in the UK, where the band were still very much a cult act, but did break big in Italy. Belgium also continued its commercial affair with the band, and, as a result, the band toured extensively on the continent, and made several television appearances, some of which can still be viewed in varying degrees of quality, on YouTube.\n\nThe breakthrough, though, was with the release of Foxtrot in 1972, featuring at its heart a sprawling epic on the second side, Supper's Ready, with its patchwork of differing ideas and tunes brought together to stunning effect and, literally, Biblical epoch. On the resulting tour, the stage costumes and theatrical persona of Gabriel began to take shape. He caused no end of controversy in Eire when he leapt onto the stage in a lady's dress and fox head, a la the stunning album cover drawn by Paul Whitehead. An old man's mask was worn to frightening effect in the closing stages of Nursery Cryme, telling the story of a love unrequited, and unfulfilled. The mask of the Magog in the Suppers Ready passage Apocalypse in 9/8 was distinctly creepy and dark, whilst the flower head in The Guaranteed Eternal Sanctuary Man was simply silly. A Genesis gig at this time was becoming an event, visual as well as oral, and it is fair to say that the oral side was becoming more and more accomplished.\n\nThe follow-up, Selling England by the Pound, consolidated the progress made, and even spawned a hit single in I Know What I Like. Highly recommended for those wishing to get a flavour of the live act in this period is the initial Archive (1967-1975) boxset release of 1998, which has a 1973 set from The Rainbow theatre. The first two CD's of this boxset have the entire live performance (barring the denouement, It, which was lost, and subsequently re-recorded by the band in the studio) of the subsequent album release, the sprawling Lamb Lies Down on Broadway, a double concept album released in 1974 about a Puerto Rican youth living in New York with dual personality issues.\n\nThe Lamb was incredibly adventurous, and remains a firm progressive rock favourite to this day. However, it marked the end of the \"classic\" line-up of the band, and the strains had begun to show even before Gabriel announced to the press in a statement that he was leaving. Banks has subsequently gone on record to state he never really \"got\" the concept of the album, the costumes worn by Gabriel, in particular the Slipperman bubble suit, were thought by his bandmates to be becoming a real distraction to the music, and the recording of the album itself was marred by Gabriel's first child almost dying after birth, and the not altogether sympathetic reaction of the remainder did not go down well.\n\nUpon the news becoming public, Melody Maker printed a front cover proclaiming \"The death of Genesis\", but they, and the wider music community, had not reckoned with the sheer stubbornness of the remainder of the band. Auditions began for a new lead singer, including, amusingly, one Nick Lowe, who went on to become a darling of the post punk New Wave scene. Eventually, the band decided that they already had a replacement in house in the form of their drummer. A commercial rock behemoth was born. In the subsequent live period,\n\nBill BRUFORD\n\n, formerly of Yes & King Crimson, guested on drums, but he refused a permanent live role, and was replaced by Chester Thompson of The Weather Report and Frank Zappa for all live work to significant effect, in tandem with Collins on instrumental passages.\n\nThe four-piece band released, in what is known as the \"middle period\", two albums, both of which still retain massive affection in the progressive rock world in terms of the symphonic excellence demonstrated on Trick of the Tail (said to be the late Princess Diana's favourite album) and Wind & Wuthering. There was, though, a chilly wind blowing. Punk was born in this period, its spittle fuelled violence spewing against all things prog, and Hackett was becoming disenchanted with the direction the band were taking musically. The remaining three tried to provide additional song-writing credits to Hackett on Wind & Wuthering, but to no avail, and, in 1977, he left to pursue an eclectic solo career, taking with him songs he felt had been unfairly rejected by the band. A subsequent interview with the band (Genesis: Together & Apart) in 2014 showed that the tensions of this split still ran deep, certainly as far as Banks was concerned. The double album Seconds Out does, though, capture the incredible live experience of this time and line-up extremely well. For live duties, Hackett was replaced by\n\nDaryl STUERMER\n\n(who also played bass guitar on the later penned tracks to Rutherford's lead guitar), who had recorded with Jean-Luc Ponty.\n\nThe remaining three doggedly continued, and, thus, the later period of the band started. Each release, starting with And Then There Were Three in 1978, and culminating in We Can't Dance in 1991, sold more than the previous work, and each tour saw the band playing to ever larger audiences and stadia. They became huge, began to specifically write, and have, hit singles, and there is still much controversy in the progressive rock community as to the direction taken, specifically with most of the vitriol being directed at one Mr Collins, who, after the release of his debut solo album, Face Value, which included tracks rejected by the band in the rehearsals for Duke, became probably the most unlikely superstar in music in the history of unlikely superstars. Numerous interviews with the band have demonstrated the unfairness of this vitriol. Both Rutherford & Banks have made it clear that all the material written for much of Duke, and all albums after Abacab, were group material, born of jamming ideas and gelling them together at their custom-made studio. Banks is on record as stating that, although his preference musically was for the longer pieces, it was certainly extremely pleasant, not to say lucrative, to have hit singles.\n\nAll the albums of this period included recognisably progressive tracks, and some famous sprawling epics, and the live shows were careful to include such favourites for the older fans, who were now joined by persons of the female form not previously seen at a Genesis show. In truth, the band became what could be deemed a progressive pop/rock outfit, or \"Crossover Prog\" as it is termed on this site. Whether one loves, or hates, this (and opinion is certainly still split), nobody could deny not just the success it brought, but the fact that the musicianship was still never less than superb. Many fans were also introduced to the more symphonic past of the band because of the later works, thus serving as a good introduction to the history of progressive rock.\n\nIt didn't last. In 1996, Collins left to concentrate on his stellar career in music, television, and films. Nick Mason, of Pink Floyd, was, though, to later remark, on being asked how bands should break up,  \"Genesis. I wish we could have broken up like Genesis\", i.e. on the best of terms.\n\nBanks & Rutherford, the latter despite a successful act, Mike & The Mechanics, decided to carry on, and recruited as lead singer Ray Wilson, who had had a small measure of success with Stiltskin. The resulting album, Calling All Stations, released in 1997, did not exactly bomb, but it was, perhaps unfairly, not a critical success, and certainly did not sell anywhere near as well as its predecessor albums. Live, they were now playing venues the size of Manchester Indoor Arena, whereas with Collins, it was venues the size of Wembley Stadium. Banks & Rutherford, who had signed Wilson on a two-year deal, called it a day.\n\nIn 2007, Collins, Rutherford, and Banks, with Thompson and Stuermer back on board live, embarked on a hugely successful reunion tour, without any album to promote. It proved, beyond all doubt, that there was only one line-up the wider public would flock to see.\n\nThat, compilation albums and anthology interviews aside, was the last Genesis activity as this bio is written. Rumours continue to persist, however, of plans for one last reunion tour, although whether Gabriel, at the age of 67 would want to prance around the stage playing a 20-odd year-old Puerto Rican punk is another matter.\n\nGenesis, all iterations of Genesis, are simply essential progressive rock. It is a fair summary to state that no student of the genre could possibly ignore the history and music of this seminal act.\n\nSteve Lazenby (Lazland) - 2017",
  "albums": [
    {
      "title": "Selling England by the Pound",
      "local_path": "album63b1.html",
      "year": 1973,
      "rating": 4.65,
      "type": "Studio Album"
    },
    {
      "title": "The Lamb Lies Down on Broadway",
      "local_path": "album4963.html",
      "year": 1974,
      "rating": 4.31,
      "type": "Studio Album"
    },
    {
      "title": "A Trick of the Tail",
      "local_path": "albumd61c.html",
      "year": 1976,
      "rating": 4.28,
      "type": "Studio Album"
    },
    {
      "title": "Wind & Wuthering",
      "local_path": "album498f.html",
      "year": 1976,
      "rating": 4.12,
      "type": "Studio Album"
    },
    {
      "title": "...And Then There Were Three...",
      "local_path": "albumf211.html",
      "year": 1978,
      "rating": 3.42,
      "type": "Studio Album"
    },
    {
      "title": "Duke",
      "local_path": "album8174.html",
      "year": 1980,
      "rating": 3.53,
      "type": "Studio Album"
    },
    {
      "title": "Abacab",
      "local_path": "album4deb.html",
      "year": 1981,
      "rating": 2.62,
      "type": "Studio Album"
    },
    {
      "title": "Genesis",
      "local_path": "album4868.html",
      "year": 1983,
      "rating": 2.79,
      "type": "Studio Album"
    },
    {
      "title": "Invisible Touch",
      "local_path": "album6636.html",
      "year": 1986,
      "rating": 2.51,
      "type": "Studio Album"
    },
    {
      "title": "We Can't Dance",
      "local_path": "album91f4.html",
      "year": 1991,
      "rating": 2.66,
      "type": "Studio Album"
    },
    {
      "title": "Calling All Stations",
      "local_path": "albumd03a.html",
      "year": 1997,
      "rating": 2.45,
      "type": "Studio Album"
    },
    {
      "title": "Live - The Way We Walk Volume Two - The Longs",
      "local_path": "album78cd.html",
      "year": 1993,
      "rating": 2.96,
      "type": "Live Album"
    },
    {
      "title": "Live over Europe 2007",
      "local_path": "album5f9d.html",
      "year": 2007,
      "rating": 3.28,
      "type": "Live Album"
    },
    {
      "title": "Watcher of the Skies - 1972",
      "local_path": "albumcd77.html",
      "year": 1972,
      "rating": 4.44,
      "type": "Live Album"
    },
    {
      "title": "The Shrine Auditorium Volume One",
      "local_path": "album3b57.html",
      "year": 2025,
      "rating": 0.0,
      "type": "Live Album"
    },
    {
      "title": "The Shrine Auditorium Volume Two",
      "local_path": "albumb741.html",
      "year": 2025,
      "rating": 0.0,
      "type": "Live Album"
    },
    {
      "title": "Then There Were Three... In Concert",
      "local_path": "album1db1.html",
      "year": 2025,
      "rating": 0.0,
      "type": "Live Album"
    },
    {
      "title": "A History Of Genesis",
      "local_path": "album9bf2.html",
      "year": 1991,
      "rating": 3.38,
      "type": "Video/DVD"
    },
    {
      "title": "The Way We Walk (DVD)",
      "local_path": "albumc096-2.html",
      "year": 2001,
      "rating": 3.39,
      "type": "Video/DVD"
    },
    {
      "title": "The Genesis Songbook",
      "local_path": "albumc1f7.html",
      "year": 2001,
      "rating": 3.92,
      "type": "Video/DVD"
    },
    {
      "title": "Inside Genesis 1975-1980",
      "local_path": "albumfb6c-2.html",
      "year": 1975,
      "rating": 2.85,
      "type": "Video/DVD"
    },
    {
      "title": "Invisible Touch - Live At Wembley (DVD)",
      "local_path": "albumb9b1-2.html",
      "year": 2004,
      "rating": 3.22,
      "type": "Video/DVD"
    },
    {
      "title": "The Video Show",
      "local_path": "album004c-2.html",
      "year": 2004,
      "rating": 3.09,
      "type": "Video/DVD"
    },
    {
      "title": "Genesis Live Video",
      "local_path": "albumd094.html",
      "year": 2004,
      "rating": 3.99,
      "type": "Video/DVD"
    },
    {
      "title": "Inside Genesis The Gabriel Years 1970-1975",
      "local_path": "album9969-2.html",
      "year": 1970,
      "rating": 2.92,
      "type": "Video/DVD"
    },
    {
      "title": "Rock Review - A Critical Retrospective",
      "local_path": "albumc5d2.html",
      "year": 2005,
      "rating": 3.13,
      "type": "Video/DVD"
    },
    {
      "title": "The Gabriel Era",
      "local_path": "album2142.html",
      "year": 2006,
      "rating": 2.58,
      "type": "Video/DVD"
    },
    {
      "title": "In London",
      "local_path": "album00cc.html",
      "year": 2007,
      "rating": 3.81,
      "type": "Video/DVD"
    },
    {
      "title": "Up Close And Personal (DVD and book set)",
      "local_path": "albumc8a9.html",
      "year": 2007,
      "rating": 3.53,
      "type": "Video/DVD"
    },
    {
      "title": "When In Rome",
      "local_path": "album1c2a.html",
      "year": 2008,
      "rating": 4.13,
      "type": "Video/DVD"
    },
    {
      "title": "Land of Confusion",
      "local_path": "album1290.html",
      "year": 2010,
      "rating": 3.06,
      "type": "Video/DVD"
    },
    {
      "title": "Sum Of The Parts",
      "local_path": "albumd3a5.html",
      "year": 2014,
      "rating": 2.5,
      "type": "Video/DVD"
    },
    {
      "title": "Reflection - Rock Theatre",
      "local_path": "albumfba5.html",
      "year": 1975,
      "rating": 2.69,
      "type": "Compilation"
    },
    {
      "title": "The Best...",
      "local_path": "album0b4a.html",
      "year": 1976,
      "rating": 4.09,
      "type": "Compilation"
    },
    {
      "title": "Genesis in Concert",
      "local_path": "album4ed0.html",
      "year": 1977,
      "rating": 2.62,
      "type": "Compilation"
    },
    {
      "title": "The Story Of Genesis",
      "local_path": "album0113.html",
      "year": 1978,
      "rating": 3.65,
      "type": "Compilation"
    },
    {
      "title": "Nursery Cryme / Foxtrot",
      "local_path": "albumf1de.html",
      "year": 1979,
      "rating": 4.24,
      "type": "Compilation"
    },
    {
      "title": "The Lamb Lies Down On Broadway",
      "local_path": "albumede2.html",
      "year": 1981,
      "rating": 3.29,
      "type": "Compilation"
    },
    {
      "title": "Genesis",
      "local_path": "album8cb0.html",
      "year": 1981,
      "rating": 3.28,
      "type": "Compilation"
    },
    {
      "title": "Genesis",
      "local_path": "album7709.html",
      "year": 1981,
      "rating": 2.5,
      "type": "Compilation"
    },
    {
      "title": "Genesis",
      "local_path": "album0fb7.html",
      "year": 1989,
      "rating": 2.31,
      "type": "Compilation"
    },
    {
      "title": "The Vertigo Years",
      "local_path": "album5840.html",
      "year": 1990,
      "rating": 1.44,
      "type": "Compilation"
    },
    {
      "title": "Turn It On Again - Best Of 81-83",
      "local_path": "album2456-2.html",
      "year": 1991,
      "rating": 2.45,
      "type": "Compilation"
    },
    {
      "title": "Archive 1967-1975",
      "local_path": "albuma64d.html",
      "year": 1967,
      "rating": 4.29,
      "type": "Compilation"
    },
    {
      "title": "The Original Album",
      "local_path": "album5c77-2.html",
      "year": 1998,
      "rating": 2.83,
      "type": "Compilation"
    },
    {
      "title": "The Greatest",
      "local_path": "albume529.html",
      "year": 1998,
      "rating": 2.03,
      "type": "Compilation"
    },
    {
      "title": "Turn It On Again - The Hits",
      "local_path": "albumc4be.html",
      "year": 1999,
      "rating": 2.26,
      "type": "Compilation"
    },
    {
      "title": "Archive #2 1976-1992",
      "local_path": "album856f.html",
      "year": 1976,
      "rating": 3.0,
      "type": "Compilation"
    },
    {
      "title": "The Platinum Collection",
      "local_path": "album1604-2.html",
      "year": 2004,
      "rating": 3.16,
      "type": "Compilation"
    },
    {
      "title": "14 From Our Past",
      "local_path": "album920d.html",
      "year": 2007,
      "rating": 2.37,
      "type": "Compilation"
    },
    {
      "title": "Genesis 1983-1998",
      "local_path": "album9f91.html",
      "year": 1983,
      "rating": 3.51,
      "type": "Compilation"
    },
    {
      "title": "Turn It On Again The Hits -The Tour Edition",
      "local_path": "albumd398.html",
      "year": 2007,
      "rating": 2.21,
      "type": "Compilation"
    },
    {
      "title": "Genesis 1976 - 1982",
      "local_path": "albumb1da.html",
      "year": 1976,
      "rating": 3.92,
      "type": "Compilation"
    },
    {
      "title": "Genesis 1970 -75",
      "local_path": "albumfcec.html",
      "year": 1970,
      "rating": 4.56,
      "type": "Compilation"
    },
    {
      "title": "Genesis Live 1973 - 2007",
      "local_path": "album4d8f.html",
      "year": 1973,
      "rating": 3.8,
      "type": "Compilation"
    },
    {
      "title": "The Movie Box",
      "local_path": "album4aa0-2.html",
      "year": 2009,
      "rating": 4.24,
      "type": "Compilation"
    },
    {
      "title": "The Magic Of Time",
      "local_path": "album76c1-2.html",
      "year": 2013,
      "rating": 2.29,
      "type": "Compilation"
    },
    {
      "title": "R-Kive",
      "local_path": "albumac12.html",
      "year": 2014,
      "rating": 2.37,
      "type": "Compilation"
    },
    {
      "title": "The Last Domino?",
      "local_path": "album2acc.html",
      "year": 2021,
      "rating": 2.87,
      "type": "Compilation"
    },
    {
      "title": "BBC Broadcasts",
      "local_path": "albumcf71.html",
      "year": 2023,
      "rating": 4.16,
      "type": "Compilation"
    },
    {
      "title": "Nursery Cryme",
      "local_path": "albumdb9c.html",
      "year": 1972,
      "rating": 4.24,
      "type": "EP/Single"
    },
    {
      "title": "Happy The Man",
      "local_path": "album46b3.html",
      "year": 1972,
      "rating": 3.23,
      "type": "EP/Single"
    },
    {
      "title": "Twilight Alehouse",
      "local_path": "album5216.html",
      "year": 1973,
      "rating": 4.06,
      "type": "EP/Single"
    },
    {
      "title": "I Know What I Like (In Your Wardrobe)",
      "local_path": "albumf5b3.html",
      "year": 1973,
      "rating": 4.25,
      "type": "EP/Single"
    },
    {
      "title": "Watcher of the Skies",
      "local_path": "album84d3.html",
      "year": 1973,
      "rating": 4.56,
      "type": "EP/Single"
    },
    {
      "title": "I Know What I Like (In Your Wardrobe) / After The Ordeal",
      "local_path": "albuma973.html",
      "year": 1973,
      "rating": 4.05,
      "type": "EP/Single"
    },
    {
      "title": "I Know What I Like / More Fool Me",
      "local_path": "albumf57d.html",
      "year": 1973,
      "rating": 3.78,
      "type": "EP/Single"
    },
    {
      "title": "The Lamb Lies Down On Broadway (Promo)",
      "local_path": "albumcfe7.html",
      "year": 1974,
      "rating": 4.3,
      "type": "EP/Single"
    },
    {
      "title": "Counting Out Time",
      "local_path": "albumd97f.html",
      "year": 1974,
      "rating": 4.13,
      "type": "EP/Single"
    },
    {
      "title": "The Carpet Crawlers / The Waiting Room",
      "local_path": "album26d0.html",
      "year": 1975,
      "rating": 4.37,
      "type": "EP/Single"
    },
    {
      "title": "Counting Out Time / Riding The Scree",
      "local_path": "album4f4b.html",
      "year": 1975,
      "rating": 4.21,
      "type": "EP/Single"
    },
    {
      "title": "The Lamb Lies Down On Broadway",
      "local_path": "album0a62.html",
      "year": 1975,
      "rating": 4.53,
      "type": "EP/Single"
    },
    {
      "title": "I Know What I Like (In Your Wardrobe)",
      "local_path": "album3ec5.html",
      "year": 1975,
      "rating": 3.69,
      "type": "EP/Single"
    },
    {
      "title": "The Carpet Crawl",
      "local_path": "albume1ba.html",
      "year": 1975,
      "rating": 3.98,
      "type": "EP/Single"
    },
    {
      "title": "A Trick of the Tail",
      "local_path": "album8522.html",
      "year": 1976,
      "rating": 4.35,
      "type": "EP/Single"
    },
    {
      "title": "Ripples",
      "local_path": "album0cb8.html",
      "year": 1976,
      "rating": 3.44,
      "type": "EP/Single"
    },
    {
      "title": "Entangled",
      "local_path": "albuma76e.html",
      "year": 1976,
      "rating": 3.99,
      "type": "EP/Single"
    },
    {
      "title": "Your Own Special Way",
      "local_path": "albumb8d2.html",
      "year": 1976,
      "rating": 3.26,
      "type": "EP/Single"
    },
    {
      "title": "Entangled / Ripples",
      "local_path": "album0752.html",
      "year": 1976,
      "rating": 4.61,
      "type": "EP/Single"
    },
    {
      "title": "A Trick Of The Tail / Squonk",
      "local_path": "album996e.html",
      "year": 1976,
      "rating": 4.42,
      "type": "EP/Single"
    },
    {
      "title": "A Trick Of The Tail / Carpet Crawl",
      "local_path": "album77dc.html",
      "year": 1976,
      "rating": 4.16,
      "type": "EP/Single"
    },
    {
      "title": "I Know What I Like (In Your Wardrobe) / Carpet Crawl",
      "local_path": "album0000.html",
      "year": 1977,
      "rating": 4.0,
      "type": "EP/Single"
    },
    {
      "title": "Spot the Pigeon",
      "local_path": "album15ec.html",
      "year": 1977,
      "rating": 2.99,
      "type": "EP/Single"
    },
    {
      "title": "Go West Young Man (In the Motherlode)",
      "local_path": "album88af.html",
      "year": 1978,
      "rating": 3.24,
      "type": "EP/Single"
    },
    {
      "title": "Follow You Follow Me",
      "local_path": "album6c3d.html",
      "year": 1978,
      "rating": 3.23,
      "type": "EP/Single"
    },
    {
      "title": "Many Too Many",
      "local_path": "album3780.html",
      "year": 1978,
      "rating": 3.92,
      "type": "EP/Single"
    },
    {
      "title": "Duchess/Open Door",
      "local_path": "album4f2f.html",
      "year": 1980,
      "rating": 3.4,
      "type": "EP/Single"
    },
    {
      "title": "Misunderstanding",
      "local_path": "album541e.html",
      "year": 1980,
      "rating": 2.92,
      "type": "EP/Single"
    },
    {
      "title": "Turn it on again",
      "local_path": "album870a.html",
      "year": 1980,
      "rating": 3.7,
      "type": "EP/Single"
    },
    {
      "title": "No reply at all",
      "local_path": "album1b81.html",
      "year": 1981,
      "rating": 2.84,
      "type": "EP/Single"
    },
    {
      "title": "Abacab",
      "local_path": "album6a4a.html",
      "year": 1981,
      "rating": 2.88,
      "type": "EP/Single"
    },
    {
      "title": "Keep it dark",
      "local_path": "albumf60c.html",
      "year": 1981,
      "rating": 2.69,
      "type": "EP/Single"
    },
    {
      "title": "3 X 3",
      "local_path": "albumbfb6.html",
      "year": 1982,
      "rating": 2.4,
      "type": "EP/Single"
    },
    {
      "title": "The Lady Lies",
      "local_path": "album7c88.html",
      "year": 1982,
      "rating": 3.92,
      "type": "EP/Single"
    },
    {
      "title": "Paperlate picture 7''",
      "local_path": "album0a91-2.html",
      "year": 1982,
      "rating": 3.04,
      "type": "EP/Single"
    },
    {
      "title": "Man On The Corner",
      "local_path": "album7fcb.html",
      "year": 1982,
      "rating": 2.91,
      "type": "EP/Single"
    },
    {
      "title": "Turn It On Again (Live)",
      "local_path": "album14a9.html",
      "year": 1982,
      "rating": 2.97,
      "type": "EP/Single"
    },
    {
      "title": "I Know What I Like (In Your Wardrobe) / Counting Out Time",
      "local_path": "album56ec.html",
      "year": 1982,
      "rating": 4.09,
      "type": "EP/Single"
    },
    {
      "title": "Follow You, Follow Me / A Trick Of The Tail",
      "local_path": "album60a2.html",
      "year": 1983,
      "rating": 3.69,
      "type": "EP/Single"
    },
    {
      "title": "Home By The Sea",
      "local_path": "album06b5.html",
      "year": 1983,
      "rating": 4.18,
      "type": "EP/Single"
    },
    {
      "title": "Firth Of Fifth",
      "local_path": "album7c3c.html",
      "year": 1983,
      "rating": 4.36,
      "type": "EP/Single"
    },
    {
      "title": "Mama",
      "local_path": "albumb1b9.html",
      "year": 1983,
      "rating": 3.09,
      "type": "EP/Single"
    },
    {
      "title": "That's All",
      "local_path": "album4131.html",
      "year": 1983,
      "rating": 2.92,
      "type": "EP/Single"
    },
    {
      "title": "Illegal Alien",
      "local_path": "album1c53.html",
      "year": 1983,
      "rating": 2.36,
      "type": "EP/Single"
    },
    {
      "title": "Taking it all too hard",
      "local_path": "albumcfae.html",
      "year": 1984,
      "rating": 2.59,
      "type": "EP/Single"
    },
    {
      "title": "Tonight, Tonight, Tonight Exclusive Candid Interview",
      "local_path": "albumf0a1.html",
      "year": 1986,
      "rating": 2.78,
      "type": "EP/Single"
    },
    {
      "title": "Invisible Touch",
      "local_path": "album023f.html",
      "year": 1986,
      "rating": 2.38,
      "type": "EP/Single"
    },
    {
      "title": "Throwing It All Away",
      "local_path": "album5b22.html",
      "year": 1986,
      "rating": 2.38,
      "type": "EP/Single"
    },
    {
      "title": "In Too Deep",
      "local_path": "albumc047.html",
      "year": 1986,
      "rating": 2.08,
      "type": "EP/Single"
    },
    {
      "title": "Land of Confusion",
      "local_path": "albume927.html",
      "year": 1986,
      "rating": 2.61,
      "type": "EP/Single"
    },
    {
      "title": "Tonight, Tonight, Tonight 12''",
      "local_path": "album2933.html",
      "year": 1987,
      "rating": 3.3,
      "type": "EP/Single"
    },
    {
      "title": "Tonight, Tonight Tonight Tonight 7''",
      "local_path": "album22b1.html",
      "year": 1987,
      "rating": 3.3,
      "type": "EP/Single"
    },
    {
      "title": "No Son Of Mine",
      "local_path": "album4bbb.html",
      "year": 1991,
      "rating": 3.5,
      "type": "EP/Single"
    },
    {
      "title": "We Can't Dance (Special Edition Volkswagen)",
      "local_path": "album038a.html",
      "year": 1991,
      "rating": 1.73,
      "type": "EP/Single"
    },
    {
      "title": "Tell Me Why 5'' Cd single",
      "local_path": "albumcbcf.html",
      "year": 1992,
      "rating": 2.48,
      "type": "EP/Single"
    },
    {
      "title": "Jesus He Knows Me 5'' CD single",
      "local_path": "album6b60.html",
      "year": 1992,
      "rating": 2.57,
      "type": "EP/Single"
    },
    {
      "title": "I Can't Dance",
      "local_path": "albumd784.html",
      "year": 1992,
      "rating": 2.34,
      "type": "EP/Single"
    },
    {
      "title": "Hold On My Heart",
      "local_path": "album9dbd-2.html",
      "year": 1992,
      "rating": 2.56,
      "type": "EP/Single"
    },
    {
      "title": "Never a Time",
      "local_path": "album7e6a.html",
      "year": 1993,
      "rating": 2.27,
      "type": "EP/Single"
    },
    {
      "title": "Tell me why",
      "local_path": "albuma639.html",
      "year": 1993,
      "rating": 2.71,
      "type": "EP/Single"
    },
    {
      "title": "...Calling All Stations... Album Sampler...",
      "local_path": "album259f.html",
      "year": 1997,
      "rating": 3.18,
      "type": "EP/Single"
    },
    {
      "title": "Congo",
      "local_path": "album36b0.html",
      "year": 1997,
      "rating": 1.89,
      "type": "EP/Single"
    },
    {
      "title": "Shipwrecked",
      "local_path": "albuma792.html",
      "year": 1997,
      "rating": 2.57,
      "type": "EP/Single"
    },
    {
      "title": "Not About Us",
      "local_path": "albumddea.html",
      "year": 1998,
      "rating": 2.47,
      "type": "EP/Single"
    },
    {
      "title": "The Carpet Crawlers 1999 promo CD",
      "local_path": "albumbfc7.html",
      "year": 1999,
      "rating": 2.9,
      "type": "EP/Single"
    }
  ],
  "scraped_at": "2025-05-18T12:35:46.401566"
}