{
  "album_title": "A TRICK OF THE TAIL",
  "artist_name": "Genesis",
  "artist_page_link_local": "artist681a.html?id=1",
  "year": 1976,
  "rating_value": 4.28,
  "rating_count": null,
  "review_count": null,
  "genre": "Symphonic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/1/cover_5225151742016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Dance on a Volcano",
      "duration": "5:53",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Entangled",
      "duration": "6:28",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Squonk",
      "duration": "6:27",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Mad Man Moon",
      "duration": "7:35",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Robbery, Assault and Battery",
      "duration": "6:15",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Ripples",
      "duration": "8:03",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "A Trick of the Tail",
      "duration": "4:34",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Los Endos",
      "duration": "5:46",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "1-8. Full album in 5.1 Surround mix (Audio only)",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Robbery, Assault and Battery (video clip)",
      "duration": "6:19",
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "Ripples... (video clip)",
      "duration": "8:02",
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "A Trick of the Tail (video clip)",
      "duration": "4:24",
      "is_sub_track": false
    },
    {
      "number": 12,
      "title": "Reissue Interviews 2007",
      "duration": "14:08",
      "is_sub_track": false
    },
    {
      "number": 13,
      "title": "I Know What I Like (In Your Wardrobe)",
      "duration": "7:35",
      "is_sub_track": false
    },
    {
      "number": 14,
      "title": "Fly on a Windshield",
      "duration": "2:21",
      "is_sub_track": false
    },
    {
      "number": 15,
      "title": "Carpet Crawlers",
      "duration": "5:10",
      "is_sub_track": false
    },
    {
      "number": 16,
      "title": "The Cinema Show",
      "duration": "4:36",
      "is_sub_track": false
    },
    {
      "number": 17,
      "title": "Entangled",
      "duration": "6:34",
      "is_sub_track": false
    },
    {
      "number": 18,
      "title": "Supper's Ready",
      "duration": "9:21",
      "is_sub_track": false
    },
    {
      "number": 19,
      "title": "Los Endos",
      "duration": "7:00",
      "is_sub_track": false
    },
    {
      "number": 20,
      "title": "'White Rocks' Premiere Programme 1977 (stills gallery)",
      "duration": null,
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Monday, March 1, 2004",
      "rating": 5,
      "text": "I got into Genesis with this one although I had acquired Selling EBTP 18 months before but could not enjoy it (as 13 year old) and when this one came along it was .... Genesis , love at second sight.Needless to say I have a special feeling for this one and almost thirty years later, it is still fabulous. Dance On A Volcano is the amazing intro and Entangled is really out of this world and so is Mad Man Moon (a delicate Banks composition) but I do find Squonk a bit sub-par and rather uninspired compared to the rest of the album. Robbery Assault And Battery is Phil Collins doing a \"Harold The Barrel\" or \"Willow Farm\" and quite convincingly at that. Ripples and Los Endos are real gems also but the title track is really the tops emotion wise.They've got no horns and they got no tails............."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Thursday, April 1, 2004",
      "rating": 4,
      "text": "OK \"4 stars\" is the righter score, but once again its importance is worth 4 stars and an half at least!! Besides the incredible touch of Tony BANKS (listen to the splendid solos within \"Robbery, Assault and Battery\" and \"Dance on a Volcano\", or the fantastic piano excursions within \"Mad Man Moon\", probably the best reference for bands like CAMEL), makes this album absolutely essential, despite of the presence of such tepid and quite banal songs by Phil COLLINS.Absolutely recommended!!"
    },
    {
      "reviewer": "greenback",
      "date": "Posted Friday, April 9, 2004",
      "rating": 5,
      "text": "This is the third best of the Genesis' albums, right after \"Selling by the pound\" and \"Foxtrot\"! It is OUTSTANDING, and Genesis never made a so jazz/fusion album like that! The drums and bass are at many bits REALLY FAST. This album has very delicate and tender moments too, like the tracks \"Mad man moon\" and \"Entangled\". The tracks are varied enough to satisfy anyone! Hackett's guitars are quite acoustic, and the electric ones are really Fripp-esque: the emotional solos here are less like on \"Wind and wuthering\", but rather like on the King Crimson's albums of the 70's. Rutherford is probably at his best here: the elaborated bass is a strong point on this record. Phil Collins is REALLY at his best on drums, no doubt about it!! He is so fast and complex that he seems to float over his drum kit. Banks' keyboards are really refined: compared to \"The lamb lies down on Broadway\", his keyboards work here is at many levels better: more complex, more moving, more impressive, faster, more varied! Banks here really masters the keyboards: Collins' extreme drums and Rutherford's refined and fast bass really challenge Banks: Banks proves that he is able to manage the overloaded music by producing melodic solos, floating arrangements and rhythmic parts extremely difficult to play. Collins' voice is excellent, especially on \"Ripples\", his best vocals performance with Genesis! Even the least good track, \"A trick of the tail\", has something very special: very cute, funny and pleasant to listen! Well, this album contains one of the best Genesis' songs ever recorded: \"Ripples\", \"Entangled\", \"Los endos\", and the quintessential bit in \"Robbery assault and battery\". The use of mellotron as a choir emulation is very poignant, and the final product is OUTSTANDING, like on the second part of \"Entangled\" and \"Los Endos\". The instrumental part on \"Ripples\" is absolutely graceful, majestic and moving. The quintessential bit on \"Robbery assault & battery\" is one of the most complex and progressive part made by Genesis.EXTREMELY RECOMMENDED!"
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Monday, April 12, 2004",
      "rating": 5,
      "text": "A workout for the woofersWhen Peter Gabriel left, I like many others believed Genesis were finished. Indeed, based on his rather lightweight contributions to previous albums (\"More fool me\", \"For absent friends\"), I feared the worst when it was announced that Phil Collins was to take over on vocals. It was therefore a pleasant surprise to find that not only had the band written some of their best material to date for \"A trick of the tail\", but that their performance was up well up to the standard of previous albums.Gabriel's departure was arguably a benefit. His dominance which had been so apparent on \"The lamb..\" had instantly disappeared, and the band was once again working together as a team of equals. For the first time, the individual song writing details are given, with Tony Banks taking the lion's share of the credits.\"A trick of the tail\" generally has a softer feel more along the lines of \"Selling England..\" than say \"Foxtrot\". The beautiful \"Ripples\", has a deceptively simple song/chorus structure, with a highly atmospheric instrumental middle section, which builds to the final chorus. \"Entangled\" too is a soft piece, with a delightful soft melody. The closing section of the track is a haunting solo by Tony Banks, with some great bass notes to test your woofers!\"Mad man moon\" has some great prog moments, as it weaves through various themes and Gabrielesque lyrics. The closing instrumental track \"Los Endos\" is a remarkable piece which once again reflects the feel of \"Selling England..\" far more than \"The lamb..\" did. The band even have the confidence to refer back to \"Foxtrot\" with the \"There's an angel standing in the sun\" reference as the track concludes.On the whole, Steve Hackett's guitar work does not feature as much as might be hoped, with Banks' keyboards tending to take precedence on most of the instrumental breaks. A terrific album though, which flows well from start to finish. Genesis had with one stroke shown that not only could they survive without Gabriel, but that they may well in fact flourish."
    },
    {
      "reviewer": "daveconn",
      "date": "Posted Thursday, April 22, 2004",
      "rating": 4,
      "text": "Following the departure of Peter GABRIEL, and letting more than a year pass for the other shoe to drop, the remaining quartet returned with \"A Trick of the Tail\", conceding nothing. The album begins with the explosive \"Dance on a Volcano\", a tour de force that conceals one of Steve HACKETT's more riveting musical nightmares. The remaining tracks, credited here to individual members for the first time, form a series of vignettes rather than a unifying concept. It's a less ambitious effort than \"Lamb..\", but in that regard there was nowhere to go but down.\"Trick...\" is still a treat for GENESIS fans, including such classics as the title track and \"Robbery, Assault & Battery\". The songs written by the trio of BANKS, COLLINS and RUTHEFORD foreshadow the music to come, fuzzy and large-sounding creations like \"Squonk\" and \"Mad Man Moon\". In between are two very pretty numbers, the mischievous \"Entangled\" typical of HACKETT's warped tunes and the gentle \"Ripples\". It all comes to a close with \"Los Endos\", reprising the opening theme in the same way that \"Selling England...\" did.Some fans are quite fond of this record, though I'd give their next the distinction of best post-GABRIEL album. If it's not classic GENESIS, it's not far removed from it either, a somehow intimate antidote to the political/social statements of past efforts."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Thursday, April 29, 2004",
      "rating": 4,
      "text": "This album is almost exactly what I expected, Genesis had lost their unique vocalist, excellent lyricist and charismatic frontmant, so they weren't able to do anything as complex as the Lamb Lies Down on Broadway or dark as Nursery Cryme Foxtrot or Trespass, so it was logical to expect a release much more similar to Selling England by the Pound.Even though \"A Trick of the Tail\" is a transitional album, it's still progressive and complex but much more friendly and warm than any previous release, Peter Gabriel is missed, but the results without him couldn't be better at that point.Dance on A Volcano sounds like a PG era track with a slightly different voice, good an explosive. Entangled and Ripples are soft and more in the vein of Phil Collins.Squonk can be compared with I Know What I Like and Robbery, Assault & Battery with Battle for the Epping Forest, also two very good tracks. And of Course Los Endos is an excellent closer for any concert.Mad Man Moon deserves special attention, is totally different to any Genesis song previously released, but it's beauty resides in that difference, soft and warm but explosive in some parts, a wonderful song, perfect for Collins voice.Maybe the weakest point would be the title track, pretends to keep the interest on the lyrics but it's weak and repetitive.Great album, not as solid and atmospheric as any previous but still keeps the interest of the progressive fan."
    },
    {
      "reviewer": "richardh",
      "date": "Posted Tuesday, May 4, 2004",
      "rating": 5,
      "text": "Marks the beginning of the 'Post- Gabriel' era of Genesis.This balances the old and the new perfectly with much of the complexity of earlier prog efforts like 'Lamb...' and 'Foxtrot' but with a softer and more accessible approach.Collins has a better voice than Gabriel which shines through on the songs such as 'Ripples' and 'Squonk'.A CD that I would recommend to anyone starting to get into prog but with enough depth to keep long stanging prog fans interested."
    },
    {
      "reviewer": "Chris S",
      "date": "Posted Wednesday, July 7, 2004",
      "rating": 5,
      "text": "And after The Lamb and without Peter Gabriel. What a true masterpiece! One can almost feel the liberation the other members share on this album and that means no disrespect to Gabriel either. Extremely Prog by it's nature TOTT is a beautiful album from begining to climax' Los Endos'. Try this one too on Seconds Out. In saying that all the tracks are excellent on TOTT especially Dance on a volcano ( What a name for a song!!!), Entangled, Ripples, Mad Man Moon, oh what the hell the entire album."
    },
    {
      "reviewer": "James Lee",
      "date": "Posted Saturday, July 17, 2004",
      "rating": 4,
      "text": "Inspired by William Golding's \"The Inheritors\", the album looks at mankind from an outsider's viewpoint- specifically, that of a race of critters who preceded man and are now dying out. \"To summarize the legend of the squonk: It is a very ugly creature, and it knows this. Its skin is ill-fitting, and covered with warts and other blemishes, therefore the squonk hides from being seen, and spends much of its time weeping sorrowfully over its own ugliness. Hunters who have attemped to catch squonks have found that the creature is capable of evading capture by dissolving completely into a pool of tears and bubbles when cornered.\" - http://www.nebulasearch.com/encyclopedia/article/Squonk.html\"Dance On a Volcano\" is a great opener, with a slightly frantic and rhythmically interesting verse that resolves into an anthemic chorus- a structure more commonly found in classic YES than GENESIS. \"Entangled\" is mysteriously beautiful, pastoral and slightly creepy with the billowing Mellotron choir signalling the climax of the piece. \"Squonk\" is an essential single- probably the first thing I ever heard from the band, although my memory is untrustworthy. The drums are just a little plodding, but the melodic elements are very memorable. \"Mad Man Moon\" is one of my favorites, a poetic narrative painted in tender and sad colors, with a surging chorus; wonderful keyboard work marks the bridge section- a shortened progressive journey with classic playful GENESIS character. \"Robbery, Assault and Battery\" is less appealing to me ( listen to that disco beat in the chorus, yuck!) but is still a well-crafted song, very much in line with Phil's \"artful dodger\" persona, and the instrumental performances in the middle are quite impressive. \"Ripples\" is more to my taste, a perfect compromise between the \"Lamb\" sonic textures and the flowing acoustic mystery that the band often sampled from but rarely developed for a full song. The title track is very accessible without sounding too 'poppy', and manages to craft a very interesting narrative without ever letting the words interfere with the music (an area in which \"The Lamb\" often faltered). Finally, the magnificent \"Los Endos\" is an instrumental tour de force which reprises \"Squonk\" as well as quoting \"Supper's Ready\" in the brief vocal section, as a sort of tribute and response to Gabriel's departure.My decade-older siblings had a huge record collection, and much of my initial prog experiences came from what was on hand in my formative years. GENESIS was represented solely by this disc (actually, there were two copies of the sleeve, one of which contained a JACKSON BROWNE album!). That may indeed color my opinions; while I agree that Gabriel's departure was a bad sign, I also regard \"Trick of the Tail\" as one of their best albums (I prefer it to some of the more often cited band classics). The sound on this album is organic and very un-forced, stylistically flowing from one section to the next. Collins adopts a bit of Gabriel style in his vocal delivery, but to Phil's credit the emotional factor is a little closer to the surface here. Next to \"Lamb\", this is my favorite GENESIS album- very highly recommended."
    },
    {
      "reviewer": "Certif1ed",
      "date": "Posted Thursday, August 12, 2004",
      "rating": 4,
      "text": "Not as bad as the diehards would have you think!!!Genesis lost great lyrics and an enigmatic frontman when Peter Gabriel left, but he left behind the same group of musicians responsible for \"Nursery Cryme\", \"Foxtrot\", \"Selling England...\" and \"The Lamb\", and nowhere is this more evident than on \"A Trick of the Tail\".\"Dance on a Volcano\" is a simply wonderful piece of the prog that Genesis were rightly renowned for - Banks, Rutherford, Hackett and Collins fusing together to provide tight rhythms, beautiful melodies and complex changes to satisfy any prog fan except maybe the more demanding. Phil wasn't too bad in the vocal melody section either, but it's just as well that most of the words are almost unintelligible due to sensible mixing. One or two lines are quite funny, however, such as \"The lava's the lover that licks your boots away\". The ending line \"Let the dance begin ~\" is prophetic given Genesis' direction after this album.\"Entangled\" features some superb acoustic guitar work, and the lyrics are fairly amusing if slightly hackneyed. This song verges on the folk-like, and has some exquisite passages with sublime textures, although the refrain is a bit annoying.\"Squonk\" is more of the quality of \"Dance on a Volcano\" - Phil's drums sound especially resonant, and the fills are all the more satisfying for the generally minimalistic approch. This is quite a head-banger compared to much of Genesis' earlier material, as there is not much complexity in construction or form, rather complexity has been saved for small details in the layering. It does get a little more interesting around 5:30, where a short coda brings relief from the headbanging. The lyrics are an interesting little tale about the furry squonk - but ultimately silly!\"Mad Man Moon\" is quite beautiful, although the lyrics do seem to get weird for the sake of being weird and doing something a bit different. This track bears some really nice Genesis hallmarks; notably Banks' keyboard layers and Rutherford's solid bass pedals. At 2:40, there's a superb piano-led section from Banks, as if trying to recapture a little of \"Firth of Fifth\". Personally I would have bought an entire album of material like this - \"Mad Man Moon\" must surely be one of the most overlooked Gems in Genesis back catalogue. Collins gives a fine vocal delivery on this track in his own style - which is much better than his attempts to imitate Gabriel!\"Robbery, Assault and Battery\" is one of my favourite of all Genesis' songs, despite the dodgy lyrics and dreadful characterisations (dreadful as in cheesey rather than actually bad!). The rhythms and time changes for the verse sections are almost sensual, with Collins producing some particularly imaginative rhythms. The chorus sections are thankfully short, but the wonderful mid section around 2:35 featuring keyboard leads from Banks and a range of gorgeous textures from the keyboard sounds, Collins' percussion and Rutherford's striding bass lines is very satisfying. However, there's another nice keyboard lead around 4:20 that gives me goose bumps in the symphonic splendour and surprising entry. It's a pity that another verse has to follow it - this construction reminds me a little of \"The Battle of Epping Forest\", a song I'm particularly not keen on. However, all in all, a superb example of pure Genesis prog.\"Ripples\" is a nice enough ballad with nice guitar and keyboard textures, but I find it a little dull after several hearings, and not very progressive.It's fortunate that the title track is not the final song, as we have another piece in song format - even if the verses are extended. The chorus lyrics are irritating, although the story is quite entertaining, and the \"Doo-wop\" section is highly unwelcome.\"Los Endos\" is much more like it - a very energetic finish to the album which leaves a sense of overall satisfaction, Banks dominating again with gorgeous keyboard melodies and Hackett continuing to maintain a low-key presence.Conclusion - although there does appear to be some \"dumbing down\" in places, still a worthwhile prog album in any collection - with good examples to any aspiring keyboard player, bassist, drummer or vocalist (purely in terms of melody, of course!) of how simple ideas can be used to form complex arrangements; Yes, there are a few complex ideas in there as well, but this is proof that attention to detail in form can triumph over pure virtuosity when creating progressive music. It's also a warning against sticking to tried and tested song structures, and considering lyrics very carefully!This album belongs in any collection of prog, no matter where your tastes take you generally; this is an album to return to like a comfortable sweater. It's not going to blow anyone away, but it's a very satisfying listen nontheless."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Thursday, August 19, 2004",
      "rating": 4,
      "text": "\"When Peter Gabriel left Genesis, I thought the band was as good, if not...better.\" said Ray Wilson, Genesis last singer.Some worship the era that A Trick of the Tail marked with a deep scar. Lost of memories are attached to that record to many people. They were about 17 when this record came out, and they were there to witness almost a miracle. Yes, the graceful and charismatic actor Gabriel left the ship with no anchor on board. A positive and honest Collins said: \"We'll just continue as a four piece instrumental band!\" After auditioning over 400 singers, Phil tried and succeeded. This is the beginning of a new period, inbetween the dollar-showering and the theatrical majestics. A very good period, indeed.The \"feel\" is still there...thanks to the remaining presence of Banks and Hackett. Mellotron, 12 strings and superior drumming. Most of the elements are there...except the talent of Peter for writing delicious tales. But, the lyrics are still decent and sometimes...funny. A great cover (my favorite in general) by Hypgnosis that gives a great feel of mystery and you gotta admit it looks fantastic. Simple but attractive.It's a \"bronze medal\" classic, but still deserves a handclap for above-average songs and a vintage feel that aged well. At last: Dancing on a Volcano, Entangled and Robbery Assault & Battery...three butt-kicking acts. Try it."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Wednesday, October 6, 2004",
      "rating": 4,
      "text": "Two reasons why I need to review this album. First, it's the first album after the previous front man, PETER GABRIEL, left the band. PHIL COLLINS, the drummer, took his role as vocalist and drummer. So, it's sensible to review this album on the basis of \"before\" and \"after\" Gabriel left the band. Second, I'm preparing a paper for a progressive rock seminar at the end of this month with specific topic on \"neo progressive rock\" for a music institute in my country. The Institute focuses on creating musicians in contemporary music. They just recently (last week, to be exact) conducted \"The Progressive Concert 2\", presenting the performance of prog bands formed by their students and instructors. It was a great show of 11 bands and they performed beyond my expectations as I saw so many talented prog musicians. Most of them demonstrated their talent in progressive metal genre.What reminds me about this album was that in the middle of putting my thoughts on paper as a material for the seminar, I have identified clearly that there has been a strong link between what so called neo prog sub genre with Genesis \"A Trick of the Tail\" and \"Wind and Wuthering\" albums. It's really obvious that these albums were the pinnacles that have inspired many bands especially those in neo prog basket. The following write-up will show you where are they in the album.DANCE ON A VOLCANO is an uplifting track with dynamic drumming, soft guitar fills and symphonic style keyboards / mellotron work. It's obvious that when vocal line enters the music \"Holy mother of God .\" the rhythm music is composed in the vein of their previous album \"The Lamb Lies Down on Broadway\" especially the title track or \"Back in NYC\" track. The use of mellotron is intensive, coupled with energetic and dynamic drumming that make this track so powerful. The song structure has vast variety of melody with high and low point and shifting tempos that make the song relatively complex. The beauty of the song is the existence of touchy melody in some of its segments, demonstrated through keyboard sound. This song indicates the continuation of classic Genesis sound, especially \"The Lamb Lies Down on Broadway\" album.Through ENTANGLED, Genesis tried to push the progressive envelop into a simpler format but still maintaining the symphonic (thru the use of mellotron) style and classical music touch (acoustic guitar fills). This is a mellow track dominated by acoustic guitar fills with keyboard sound slowly enters the song. Structure-wise, this song basically brings only one tagline melody with no (or little) variation. To make the song memorable, the band creates some transition segments demonstrating the acoustic guitar solo and accentuation of keyboard at the end of the bars. The melody does not shift so much as the chorus says \"Well, if we can help you we will .\" (the part that Genesis-mania used to emulate about this song). When the music enters the ending part that starts at minute 4:15, it's the time where keyboard solo played slowly, accentuated by mellotron with acoustic guitar fills as rhythm. It's a wonderful melody. This song, I think, has inspired many neo prog bands in the 80's either the structural composition (overall) or the ending part of the song.SQUONK brings the music into an upbeat tempo with great and memorable opening (combination of dazzling drums and guitar rhythm - wonderful!). Again, it's a simple music segment at this opening part. The strong points of this opening are: it has a tasty melody and it creates a symphonic music nuance. When all of these are combined with Phil's dynamic drumming, the result is an ultimate enjoyment when listening to this track. We tend to emulate Phil's singing while spinning the CD. This song has more shifting tempos than the previous track. The beauty part of this song is at the ending part where the melody turns to Phil's higher tone vocal and it then fades out ..The band then brings you back to a rather mellow track MAD MAN MOON. It starts mellow at the beginning and it goes to faster tempo. BANK's piano / keyboard works dominate this track. Just before the middle of the track, there is a really nice classical piano and keyboard sound that serves as a transition for the song to move to a faster tempo. The music then comes back to the original tagline melody as demonstrated at the beginning of the track, this time with mellotron at background. Again, this song is the basis of neo prog music.ROBBERY, ASSAULT and BATTERY is a track with an upbeat tempo in the vein of classic Genesis music. At the beginning part, this track seems so monotonous in term of melody and composition but when it comes to a transition at roughly minute 1:00, the drumming style is shifting dynamically and the music then enters to the chorus part. The music becomes complex when it reaches the interlude with a domination of keyboard work by Tony Banks. It reminds me to the classic tracks of the band like \"In The Cage\" or \"The Colony of Slipper Man\". It's a stunning keyboard!RIPPLES is another mellow track opened with a melodic vocal line with acoustic guitar fills as rhythm section. The opening part of this track seems like a ballad song. But the band has composed in such a way that there are many intense influence of classical music especially during transitions. The acoustic guitar work by Hackett is really stunning, accompanied by soft keyboard work. The interesting part that, I think, has mostly inspired many neo prog bands is the interlude part that start approx at minute 4:06 where Steve HACKETT's howling guitar come into play accompanied with BANK's keyboard work. It's very nice.The title track A TRICK OF THE TAIL is a medium tempo track with stunning piano work and nice melody through a vocal line. It sounds like a pop song for me, especially in the way Phil COLLINS is singing. I don't think this track has strong prog elements; it sounds a straight pop music.LOS ENDOS is the concluding track that serves its role to summarize the album content because it contains some musical elements of other tracks in the album, performed with no vocal line. It's a very enjoyable track and it has become STEVE HACKETT's favorite in his solo work; he played this track in most of his live performance.Despite the loss of Peter Gabriel, I think the band continued to deliver excellent music for their fans. Some tracks (Dance on a Volcano, Squonk, Robbery .) still maintain the style of Gabriel era music, and some of them have gone mellower than classic Genesis. No harm at all. In fact, \"The Lamia\" of The Lamb Lies Down on Broadway was a mellow track as well. I think, the pinnacle of wonderful GENESIS music is STEVE HACKETT, not Peter Gabriel. My overall rating is 4/5 for this album. Gatot Widayanto, Indonesia."
    },
    {
      "reviewer": "Guillermo",
      "date": "Posted Friday, October 8, 2004",
      "rating": 5,
      "text": "Peter Gabriel left the band, and the \"mystery\" and the \"theatre rock\" were out of GENESIS (well, almost!). I prefer GENESIS without Peter Gabriel, because I am more interested in the music than in \"theatre rock\". So, for me, GENESIS became a \"real\" band in this album, after being considered Peter Gabriel`s backing band for several years. Phil Collins`vocals sound for me more \"authentic\" than Gabriel`s, who, at least for me, always seemed to be trying to impress the fans doing \"strange things\" (like David Bowie, Robert Fripp, David Byrne, REM`s Michael Stipe and other similar artists), being more an \"enigmatic\" character of a story than a \"real\" singer. Gabriel is another \"musical chameleon\", always experimenting, solo album after solo album. I respect Gabriel and his fans, but I prefer more the music than the theatre.I bought this album (for the first time, the L.P.) some hours before John Lennon`s death (8-December-1980). I remember that in that day I went to a record shop in the evening.Later I arrived to my parent`s house, played the album once, I liked it a lot, so I played it again. During the second playing of this album, one of my brothers was watching T.V. (an American Football match) and suddenly he went to my bedroom and told me that in the T.V. they announced that John Lennon was murdered a few minutes before. So, this album is linked to that day, but as the years passed the album still shines by itself. I like every song in this album. \"Dance on a Volcano\" is one of the best songs, with Hackett`s guitar sounding like \"burning lava\" in some places, in good interplay with Banks`s keyboards. \"Entangled\" is more influenced by Steve Hackett, with very good 12 string guitars (maybe played by Hackett, Banks and Rutherford) and a very good keyboards solo at the end. \"Squonk\" has very good drums by Collins, and it seems that this is the first song Phil sang in rehearsals, and with this song he convinced his mates in GENESIS to become the lead singer. \"Mad Man Moon\" is a very good song by Banks, with piano, mellotron, Steve Hackett`s very original guitar sounds, and Collins`percussion (a marimba?) playing along with the piano in the instrumental section. Collins`vocals have a lot of feeling, something that Gabriel lacked. Theatre Rock is almost gone, because \"Robbery, Assault & Battery\" has some \"acting\" by Collins in his vocals (after all, he was a child actor, with more experience than Gabriel, maybe!). \"Ripples\" is a nostalgical song, one of my favourite songs of the band, with 12 string guitars, and an instrumental section again with an interplay of the lead guitar and the keyboards. \"A Trick of the Tail\" is a fantasy story by Banks. \"Los Endos\" has a lot of influence of Collins`drums, a very good instrumental piece. All the songs were credited for the first time to the individual composers of the songs, to avoid confusion in the fans about who wrote which song. Banks appears as composer or co- composer in all the songs. This album started the most interesting period in GENESIS`history , which for me it is from 1975 (the recording of this album) until 1982 (\"Three Sides Live\", with \"abacab\" still sounding \"progressive\" in some songs)."
    },
    {
      "reviewer": "penguindf12",
      "date": "Posted Sunday, November 14, 2004",
      "rating": 3,
      "text": "The first GENESIS album without GABRIEL, and also the first album I've removed a star from a perfect five. HACKETT and BANKS (who eventually gives up to pop later on in the trio stage) are the last influences of prog on GENESIS, with RUTHERFORD and COLLINS fighting on the other end for pop, and the battle shows on this album.\"A Trick of the Tail\" seems to have a more defined guitar than the GABRIEL-era albums, and you can easily pick out each separate instrument on the more diluted tracks: a clear sign that the strings are beginning to unravel. Also missing are the theatrics, the flute, and the lyrical genius of GABRIEL, although COLLINS does write a few good lines. This album seems to me in form not unlike \"Selling England by the Pound.\" It begins with a strong, harder piece, then a mix, then reprises the \"main riffs\" at the end. If \"Selling England\" was buttery smooth and cinammony, this is the margarine and sugar counterpart with the pop showing occaisionally (watered down, if you will).\"Dance on a Volcano\" is like \"Dancing with the Moonlit Knight\" in title, form, and lyrical structure. Both are brilliant, wonderous pieces; both ecourage the listener to dance (in metaphor, of course: the latter being in social opposition, the former being in more Christian terms of \"doing right\"); and both have riffs which are reprised in the last song. But don't take my word for it: listen for yourself and decide what you think. The song is in mainly 7/8 time, but still flows extremely well, so it's barely noticeable and smooth. I especially enjoy the instrumental section after \"the dance begins\" at the end.\"Entangled\" is an interesting mostly HACKETT-influenced song laced with soft, soothing guitar and lyrics about a person trapped in an anesthesiac sleep. It ends in a way you would expect from GABRIEL: after extensive dream imagery and comforting voices, they give him the bill for his operation. The rest of the song is some mellotron and guitar instrumental work which keeps with the song's slower tempo and does not noticeably reflect the song's ironic lyrical ending.Immediately we are thrown into a musical counterpoint, \"Sqonk.\" When I first heard this, I had deja vu. Now I know why. MAGENTA's \"Revolutions\" completely ripped the major riff in this song! That riff is surprisingly catchy, and a thudding bass accompanies. The lyrics are about some guy catching a critter which melts into a pool of tears, nothing really noteworthy; which is probably the reason I don't really like this song that much.\"Mad Mad Moon\" is a BANKS composition with mostly pianos to begin, then with a stronger section coming in somewhere in the middle. Nice, but nothing exceptional. Following is \"Robbery, Assault, and Battery,\" which I think bogs down this album. It shows some sonic qualities, but also COLLIN's sad replication of GABRIEL's theatrics, which of course falls flat. This song is also too pop-influenced to be of my liking. However, there is a midsection instrumental in 13/8 which partially redeems the song.\"Ripples\" gives credit to BANKS and COLLINS for its existance, but what I hear in this song is mostly HACKETT. It is a nice companion to \"Entangled,\" and both are about the same in form. Its lyrics are about an old woman remembering the days when she was young and beautiful and her dealing with that. After a nice chorus, it speeds up a bit for an instrumental section which ends with another chorus.The title track is nice and all, but is pop, plain and simple. At 4 minutes with barely any variation on the main (pop) theme, the only thing of true interest here is the odd lyrics about a creature which visits humanity only to be locked up. It escapes and tries to show them a better place than their cities, but the people are too blind to see it. Now that I've summed it up, you have no reason to listen to this track. Save your time for the next one......which is \"Los Endos.\" All I can say is: wow. No, actually, I can say more: this track is an amazing instrumental which reprises themes from virtually all of the songs on this album. It is pure prog, switching up and down and staying purely symphonic all the way through. It closes with a variation of \"Squonk\"'s theme and some vocals lifted from \"Supper's Ready\" for effect. Excellent, especially the rhythm section. RUTHERFORD and COLLINS may not be my favorite songwriters, but they are VERY good at their instruments.All in all, a 4.5 star album with pop and prog both present, but prog still holds a large amount of ground. The next album leads more in a pop direction, but the balance doesn't really shift until HACKETT leaves."
    },
    {
      "reviewer": "Thul�atan",
      "date": "Posted Thursday, November 25, 2004",
      "rating": 5,
      "text": "Despite being the first one without Gabriel, this is the album that vies with 'The Lamb Lies Down On Broadway' for the title of greatest work by the mighty Genesis, an astonishing achievement in every way.A huge percentage of this recording captures something very special indeed - a timeless sound; not in terms of technical production quality, but rather in terms of the instrumentation and textures created by both old and new (at the time) sound technology. The numerous weavings of triple 12-string guitar such as on 'Entangled' and 'Ripples' simply sound magical, both ancient and intimate, and are like the ultimate form of the technique the band had been employing ever since 'Trespass'. Then there are the immaculate pianos of 'Mad Man Moon' and the title track, rich and earthy organs, synths and bass pedals, all embellished by the lyrical guitar overlays of master Steve Hackett, which are often like a voice unto themselves. But of course the true voice belongs to Phil Collins, here turning in perhaps his best performances when he was still in his completely innocent, gentle phase of vocal delivery, as opposed to his appalling 'cocky' phase ('Duke' - 'Genesis', particularly on stage) or later 'mature' phase ('Invisible Touch' - 'We Can't Dance'). He sings on this album like a sensitive, lost troubadour, full of emotion and honesty - the first verse of 'Mad Man Moon' alone typifies this, and the rest of the material showcases his range. The only truly outlandish sounds are to be found in the mindblowing synth soloing of 'Robbery, Assault & Battery' and 'Los Endos', which even themselves only serve to make things better.Like all the best Genesis albums, 'A Trick Of The Tail' is far more than the sum of its parts; each theme explored in the separate tracks does unite into a story all its own, an omnibus of tales, reflections on human experiences and dreams. And unlike much progressive fare, this is far from loose - I fail to see how any of these songs could be described as mere fairy tales. If 'Squonk' is just about a furry creature, then 'Bohemian Rhapsody' is just about a mummy's boy and 'The Long And Winding Road' is just about some road. There is much more here, a reversal of the idea 'hunter becomes the hunted', metaphorical parallels between the creature that dies of loneliness and those that hunt them. The belief that the grass is always greener on the other side is contended with great poignancy and fantasy in 'Mad Man Moon', complete with desert imagery and a chorus that threatens to make you weep. This is the calibre of material that a listener will find on this wonderful LP, all audibly executed with feeling, conviction, and an excellent standard of musicianship.Consider this essential for anyone serious about music."
    },
    {
      "reviewer": "Fishy",
      "date": "Posted Saturday, January 1, 2005",
      "rating": 4,
      "text": "A trick of the tail is a more conventional album than its predecessor The Lamb which was way too experimental for some of the fans. During the last tour with Gabriel when he announced his departure, Collins, Banks and Rutherford were already making preparations for recording the next album. Squonk was the first song they wrote without Gabriel and Hackett. Hackett was working on his solo debut at the time and joined his fellow bandmates in the studio later on. Squonk is a great track, more rock than prog anyway. It could easily be included on one of their forthcoming releases of the following decade. During the recording process many vocalists did an audition for being the new singer. The band members didn't find a suitable replacement for Gabriel but when they realised time was ticking away, Collins suggested to do the job himself pending a permanent replacement. But we all know by now how things turned out.And now for the songs.Dance on a volcano is one of the best tracks the band ever wrote. There're so many changes in moods, atmosphere and rhythms it needs a few spins before you really begin to like it. This is the only song on the album where Collins tries to sound just as angry as Gabriel did in the past. Entangled is a pastoral song with great harmony vocals and a ghostly sounding mellotron. Lovely ! Mad man moon is a typical Banks ballad, another highlight of the album. The song is based on a splendid piano melody. Later on, the sound gets broadened by some great mellotron sounds. Soon afterwards this wonderful instrument would never be used again for a Genesis album. The title track was the very first song where the band did record a video clip for. An accessible song which isn't too complicated but not commercial either. Nice one ! On each Genesis album there's a nervous track with a kind of conversation in the lyric. The Harold the Barrel/Get'em out by friday of this album is called Robbery, Assault and Battery which was issued on single as well. A quite boring track except for the little musical interlude of guitar and mellotron. To me it's no surprise the album reached bigger sales figures than any other Genesis record which had been released till then. Most songs are shorter in length than they used to be, the tracks are also less complex than before. The third single Ripples is a fine song with great sounding guitars but the melody for the chorus is sounding far more emotional than any song Gabriel did. Maybe this is the only weak point of the album. Collins did a fine job in replacing Gabriel but you can hear he didn't have much experience as a singer at the time. The ideas for the lyrics aren't really interesting. It is known that the band did loose some loyal fans with the release of this album. It was hardly noticed because of the many new fans. But off course, if you enjoy the music without putting any attention to the lyrics, you still have a good album. Los endos is an instrumental track and would become a permanent concert favourite for the tours to come. This is one of those tracks where the band puts itself on a higher level. It starts off as an excellent prog theme with eastern influences, later on it turns out to be a medley of some of the albums most exciting moments. This track makes an excellent listening experience. This was the first Genesis album with David Hentschell as a producer. He gave this album a sound which was ahead of its time in 1975. Many albums would follow using his production skills. Thanks to his good work, A trick of the tail sounds timeless which is a good thing for a prog- album. For the best sound quality I recommend the Japanes pressing from some time ago but the definitive edition remaster serves well.I gave four stars for one of the better efforts of Genesis but I wouldn't call it a masterpiece of progressive rock. I would prefer Wind & wuttering, The Lamb, Selling England by the pound or Foxtrot to this album. Phil Collins did a remarkable good job in replacing Peter Gabriel but he sounds almost shy on this record. In the early days Gabriel frightened his listeners and I don't believe Collins is able to do that at this point in time. But still.this is a good album. The songs are great, the production is good, the artwork is fantastic. and the title for this album could not have been better."
    },
    {
      "reviewer": "slipperman",
      "date": "Posted Tuesday, January 25, 2005",
      "rating": 4,
      "text": "This album was many things, but most importantly, it was a test. Simply: could they survive without Peter Gabriel? Gabriel's loss left a huge gap, and while the band would never quite be the same, musically as well as visually, they clearly had a lot left to give, and 'A Trick Of The Tail' offers plenty for any Genesis fan to chew on.With drummer Phil Collins now doubling as lead vocalist, the new four-piece lineup launches into the panoramic \"Dance On A Volcano\", marked by a crystalline production job and a wide range of dynamics, from the frantic mid-section to the dreamlike layers on the chorus. While Phil fits in well as vocalist, I sometimes hear a kind of flimsiness in his voice throughout this and many other post-Gabriel Genesis albums. Excepting some moments when he takes initiative and projects himself strongly (\"Dance On A Volcano\", the mighty \"Squonk\"), he tends to drift in the background too much. This is appropriate on tracks like \"Entangled\" and \"Ripples\", but elsewhere it's a little frustrating. That's a minor point, because the music overtakes the attention, encompassing a rich array of sounds, recalling the best moments of their previous work while offering a few new avenues of expression, like the hyper \"Los Endos\" and the throbbing \"Squonk\". The album is sequenced well, giving you a laid-back track every other song (\"Entangled\", \"Mad Man Moon\" and \"Ripples\") in between the more energetic moments. And if the final section of \"Entangled\" isn't Tony Banks at his celestial best, I don't know what is. Every song has a certain well-rehearsed quality to it, as if they knew they were going to have to present something especially solid this time (and considering some of the members found 'The Lamb.' a little too ponderous, it's no surprise this album is a compact and tight 8 songs). It doesn't quite reach the heights of total perfection, as I've always found the title track to be nice-yet-forgettable, and Phil's silly Keystone-cop thing in \"Robbery, Assault And Battery\" ruins the excellent synergy running underneath, Hackett and Rutherford locking up especially well on this. It's not a perfect album, but it does represent yet another great Genesis album worth more listens than our short human life spans will allow."
    },
    {
      "reviewer": "Bj-1",
      "date": "Posted Wednesday, April 13, 2005",
      "rating": 4,
      "text": "I remember on first listening this album didn't quite grab me the way \"Foxtrot\" and \"Nursery Cryme\" did and it took me some time to get into Genesis' 'new' sound, though the opening and closing tracks was instant jawdroppers. After a week this album did it to my top 5 Genesis albums and still is today. This album seems fresher and more upbeat and 'The Lamb Lies Down on Broadway' as it was a very tense period for the band back then before Gabriel left, and the songs are generally stronger. The charisma featured on the Gabriel'era albums is not as obvious here though although tracks like \"Robbery Assault and Battery\" recalls mini stories like \"Harold the Barrel\" and the beauty of \"Entangled\" matches everything the band did in the past. Overall an excellent album that should not be ignored by a forthcoming Genesis nut. 4.5/5I also have the original 1976 T-shirt for this album hanging on the wall, probably the best thing that will ever hang there :)"
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Wednesday, June 22, 2005",
      "rating": 5,
      "text": "This is not my favorite album but I see it as a historical album: the press had lost their belief in them after Peter Gabriel's departure but Genesis took revenge with the best way to do, THE MUSIC! In fact Hackett, Banks, Rutherford and Collins had often jammed together during the \"The lamb lies down on Broadway\" sessions because Peter Gabriel often left the studio because he wanted to telephone with his pregnant wife. So they had some experience to act without their frontman and this resulted in a wonderful progrock album entitled \"A trick of the tail\". In my opinion it is a logical successor to \"Selling England by the pound\" but with a more lush keyboard sound and more captivating interplay between Hackett and Banks. It's no coincidence that the most commercial track \"Robbery, assault and battery\" is co-writtten by Collins, it could have been written for \"And then there were three\"! Without Peter Gabriel Genesis emphasized their hugh instrumental potential, that's why so many instrumental interludes and tracks on this album are so beautiful, from \"Dance on a volcano\" to \"Los endos\". AN ESSENTIAL ALBUM!"
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Wednesday, June 29, 2005",
      "rating": 5,
      "text": "It wasn't death, but a new life what was in store for Genesis after Peter Gabriel's departure: despite the fact that Gabriel's input as a writer, frontman and sensibility was a major asset for the band's development and constant maturation, the four men who stayed managed to cherish the blessing in disguise and make the best out of it. which resulted on the conception and recording of yet another masterpiece in the band's r�sum�. The fantastic 'Dance on a Volcano' shows from step one that Banks, Collins, Hackett and Rutherford were capable of creating exciting and intelligent music and deliver it with craft and passion. Like this one, most of the tracks display the foursome's interest on increasing the instrumental expansion of the melodic motifs and enhance the jazz-oriented nuances that had somewhat been understated in the last Gabriel-era albums (\"Selling England\" found Genesis exploring their symphonic trend right to its deeper roots, while \"The Lamb\" went for rockier realms). Actually, you may notice an air of renewed enthusiasm in the way that all musicians interplay with each other and the energy displayed in Banks and Hackett's solos, as well as Collins' drumming. Yes, the musical genius was still there in spite of the loss of such a splendid source of theatrical charisma as the one provided by Gabriel. Now Genesis is more like an instrumental band that happens to have some lyrics in most of their compositions. The same goes for 'Squonk', 'Robbery, Assault & Battery' and the explosive closure 'Los Endos', which combines a series of assorted reprises of other albums tracks during its final passages right before the jazz-fusionesque tour de force that takes place in the core. I only wish that Hackett's riffs and leads were not so hidden behind the massive keyboard wall-of-sounds delivered by Banks: I guess that some things were meant to never change in Genesis recording and mixing sessions, Gabriel or nor Gabriel. But what can be heard is really fine - from the days of \"Selling England\" straight until his hot debut venture \"Voyage of the Acolyte\", Hackett had been making his way to the limelight as one of the most refined and inventive lead guitarists in the prog movement. But I don't want to say that this is a reborn Genesis out of an old life that hadn't left a print on their new one. On the contrary, the prototypical melancholic vibration that Genesis had been cultivating for years is still very present in tracks such as the majestic 'Mad Man Moon', the ethereal 'Entangled' - whose coda is a surreal exercise on creepy synth and mellotron layers - and the emotionally charged 'Ripples', a moving song about the passing of time and all the nostalgia around it. A special mention goes to the interlude (great dialogues between the guitar leads and the ARP synth textures over the grand piano arpeggios and bass pedals counterpoints) and the final set of repeated choruses of the latter song (the continuing guitar lead and the sound of bells add drama to Collins' singing). The title track is the least complex of all. Following a 'Penny Lane'-inspired piano basis and rhythm pattern, the song provides some sort of easy-going relief between the cathartic emotion of 'Ripples' and the intense energy of 'Los Endos' - by the way, Hackett's use of ultra-high notes for his leads is really chilling. As Collins himself proclaimed during the 'Los Endos' fade-out, Gabriel was free to get back home; so was Genesis, free to continue their instrumental development, and certainly they achieved what they were still capable of - creating a musical gem before the eyes of the world."
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Saturday, August 13, 2005",
      "rating": 4,
      "text": "This album proves that The band could continue without the presence of the genius Peter Gabriel. While this album is of lower quality of their previous works ... It still provides plenty of great musicianship and compositions and a songwriting similar to Selling England By The Pound.1. Dance On A Volcano is a great energetic song in a similar vein to Dance with The Moonlight Knight. It provides plenty of musical changes of rhythm, atmosphere and time signatures. The instrumental section is a little cheesy for me though. 8/102. Entangled : This is a beautiful atmospheric track with a great climax in which a haunting synth, and a mellotron lead the piece. 9/10 3. Squonk : This song is more uptempo, and is what I consider prog pop. It is a simple catchy song with a great chorus, in which tony banks dominates with a keyboard riff. The drumming here is heavier than usual. 8.5/104. Mad Man Moon : This song is a laid back track which seems to be a Tony Banks composition. The pianos dominate this track, especially on the instrumental section. 7/105. Robbery, Assault & Battery : A moderately long track that can be compared to the Battle of Epping Forest in style (playful melodies) and contains a majestic keyboard lead around minute 4. I think the piece would have been better if the song ended with that keyboard lead in a fade-out. The percussion in this song is some of the best in Genesis. 7/106. Ripples : A nice Collins ballad like More Fool Me, but much longer, and more complex. It has strong classical touches with its classical guitar work and soft piano embellishments. The chorus and instrumental section are classic Genesis. 8/107. A Trick Of The Tail : It is unusual that the title track is the weakest track of the album. This is a straightforward pop song with no prog elements. 5.5/108. Los Endos : My favourite track of the album. This is an amazing instrumental that plays most of the themes of the whole album. The musicians are at their best here, and are here to prove how worthy they are to have played with Peter Gabriel in their past. 9/10This album is a mixture of pop and prog, making it an easy album to digest, while you enjoy it in the long run. There is nothing bad about this album, other that it is far from being a masterpiece.MY Grade : B"
    },
    {
      "reviewer": "Seyo",
      "date": "Posted Wednesday, August 17, 2005",
      "rating": 3,
      "text": "A fine album that fails to captivate.This is a very harmonized and effectively written post-Gabriel album, which is often celebrated among the Gabriel-era GENESIS fans and I can see why. A superb production and musicianship including the effective cover artwork and lyrics, with Collins singing lead almost \"as good as Gabriel\".However it never appealed to me much and that's it. I cannot point at any obvious error or weakness, it just does not contain \"something\" which I could easily found in their earlier stuff. An overlooked gem is a gentle ballad \"Entangled\" by Banks/Hackett. A very good album though, which I hesitate to label \"excellent\" and I give 3,5 stars."
    },
    {
      "reviewer": "Progbear",
      "date": "Posted Sunday, September 11, 2005",
      "rating": 4,
      "text": "After a bit of uncertainty after the loss of Peter Gabriel, the remaining members of Genesis carried on with erstwhile drummer Phil Collins taking over on lead vocals. Forget about Collins' later (ahem!) work. Here his performances are a tad restrained, sort of like Gabriel-lite, but this is musically as strong an album as Genesis has ever produced.\"Dance On A Volcano\" is another \"Watcher of the Skies\"-type of number allowing Collins to show off his drumming prowess. He gets more opportunity on the lengthy instrumental/underture \"Los Endos\", which closes the album and was to become (understandably) a live staple. Much of the album is made up of curious story-songs, not too different from Gabriel-era work, with only Collins' vocals showing that anything had changed. Meanwhile, \"Entangled\" and \"Ripples\" are two of the group's loveliest and most celestial acoustic-guitar oriented numbers.It does take a bit for this one to grow on you, but in the end it's another winner from Genesis. Feel free to listen and enjoy."
    },
    {
      "reviewer": "Prognut",
      "date": "Posted Friday, October 14, 2005",
      "rating": 5,
      "text": "I really have a soft spot for this one! It was my first CD-album from GENESIS, and there are no weak points really!! With the exception that PG was not there!! But, all the elements of Progressivness IMO were still present. And, I fell that Hackett influence was the dominant one... Lyrcs were still pretty good, and production improvments, make sound much better than previous releases... Highly recommended!!!"
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Monday, November 7, 2005",
      "rating": 5,
      "text": "Very solid effort from the 4 man incantation of Genesis. With the absence of Gabriel, Collins now became the lead vocalist, but the drumming he does is nothing short of brilliant. More guitar oriented than The Lamb and still as progressive as ever, A Trick of the Tail along with Wind and Wuthering is somewhat of a bridge between old Genesis and new Genesis. The songs are more complete and are very well-rounded with memorable riffs and interludes. Hackett is as strong as ever, with great riffing and chord work. Rutherford plays fluently and creatively on the bass, and Banks is a genious on his synths.Beginning with the stunning Dance on a Volcano and ending with the sublime instrumental Los Endos, this album feels like Gabriel in craft, but in truth it is quite different. Without a doubt the best songs on this album are Squonk and Los Endos. Squonk has a memorable intro and chorus and has some of the best lyrics on the album. And Los Endos is what it was meant to be, the instrumental to end all instrumentals. The song contains nods and key phrases from each song on the album and features stellar interplay between Banks and Collins.Overall, I must say that this album is a terrific piece of progressive rock. Every song is incredibly strong, technical, and wonderfully composed. I can't give it any less than 5/5."
    },
    {
      "reviewer": "Atkingani",
      "date": "Posted Wednesday, November 16, 2005",
      "rating": 3,
      "text": "Good work with good songs, a well-balanced album. All tracks are above the average but none is a classic in the same manner of 'The musical box', 'Supper's ready' or 'In the cage'.Musicianship is high maybe because band members were probably not dealing with the strong personality of former vocalist Peter Gabriel or maybe they wanted to show their skills that were sometimes hidden. They also seem to share equally their part of the cake.\"Dance on a volcano\" keeps Genesis tradition of high-level opening track and the other songs are well disposed and recorded turning the album into an easy flowing piece.Well, but there is something not running accordingly: Phil Collins' lead vocals. Phil could do a good job as supporting vocal or even as main singer in certain specific songs ('More fool me', from SEBTP) but the task of frontman was too much for him, at least for a Genesis style of music and interpretation. He went fair in ballads like 'Ripples' or 'Mad man moon' but failed on typically-oriented Gabriel's songs like 'Robbery, assault and battery', 'Entangled' or the title-song.I saw Genesis live, here in Rio, 1977, and Collins vocals only worked for the slow songs, the others were at the edge of a disaster. The negative impact of that live show was so great that I preferred not to buy their next album, W&W, having only the opportunity to hear it completely many years after. I think that the poppish line that Genesis took had also a strong contribution of Collins inability for higher flights with more complex and sophisticated music: the essence of progressive.Minus 2-stars due to weak leading vocals in some tracks. Total: 3."
    },
    {
      "reviewer": "chopper",
      "date": "Posted Tuesday, April 18, 2006",
      "rating": 4,
      "text": "I bought this album when it first came out, but never owned it on CD until recently, so the time has come to re-assess this album.I remember on first hearing that Phil Collins sounded very much like Gabriel, but on reflection this was probably because I was more familiar with Phil's voice than I realised, as he had sung on a number of previous Genesis tracks.\"Dance On A Volcano\" is probably the most prog track on the album, being 7 beats to the bar. Nice guitar riff with keyboard harmony and great instrumental ending.\"Entangled\" is possibly my favourite track and is a lovely acoustic song with excellent harmony vocals on the chorus. The song ends with a keyboard & mellotron workout which builds up to a dramatic climax.\"Squonk\" was rumoured to be about Peter Gabriel when the album first appeared, but is actually about a mythical creature which had already featured in a Steely Dan song (look up Squonk in Wikepedia). A good guitar-driven number.\"Mad Man Moon\" is a Tony Banks song, similar in construction to \"One From The Vine\" on this album's successor. As with this song, it has an excellent instrumental middle section.\"Robbery, Assault and Battery\" is probably the weakest song here, being a \"comedy\" number in a similar vein to \"All in a mouse's night\". Only partially redeemed by a good ending.\"Ripples\" is another beautiful, mainly acoustic, number about women losing their beauty as they get older. Hackett shines on this one with a great (backwards?) guitar solo.The title track is reminiscent of Magical Mystery Tour-era Beatles with its staccato piano and psychedelic ending.\"Los Endos\" finishes the album off in style, being basically a Brazilian-style resume of parts of \"Dance On A Volcano\" and \"Squonk\". This song is even better on Seconds Out.Overall, an excellent 4 star album which proved Genesis could survive without Mr Gabriel. With hindsight, there are signs of the later, more pop-orientated band but things only really went downhill when Hackett left."
    },
    {
      "reviewer": "Melomaniac",
      "date": "Posted Tuesday, July 11, 2006",
      "rating": 4,
      "text": "This album, along with \"Wind and Wuthering\", is proof that Peter Gabriel's departure from Genesis was far from being as bad for the band as Steve Hackett's departure. This album picks up where Selling England By the Pound left off (don't get me wrong, I LOVE The Lamb Lies Down on Broadway, but it was a hell of an experiment that deserves a field all it's own and stands alone within the Genesis discography, a parenthesis if you will), and showcases a more united band, all members going in the same direction, which must have been a relief for everyone involved after The Lamb... The sound was the best they had had at that point, the songwriting was top notch, the execution brilliant. One small downfall : Phil Collins' drumming began to suffer a little due to his handling of lead vocals (really, just a little) in certain songs, even though most songs didn't call for excessively technical drumming. Collins more than makes up for it with his singing though, the vocal melodies being, in my opinion, the best from Genesis (Gabriel was theatrical and all, but not as melody friendly as Collins). The stars on this album are Tony Banks and Steve Hackett, without a doubt. Every song here is brilliant, but my favorites are : Dance on a Volcano, Entangled, Mad Man Moon, Ripples and instrumental album closer Los Endos.The best post-Gabriel album, and even rivals any Gabriel era albums for that matter. One of my favorite Genesis albums ever."
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Sunday, July 23, 2006",
      "rating": 5,
      "text": "This album enlight my teenage. First time i listen, i said to my self, this is the music i want to hear from now on, this was in 1991. From than, till now, Trick of the tail is among the best i ever heared. To me is the best Genesis, the band is in busines here and what a great album this is....Some tracks are killers Dance on the volcano, smooth Entangled, and Robbery, assult and battery, the rest are good too. A very good effort and 5 stars without hesitation."
    },
    {
      "reviewer": "Tony Fisher",
      "date": "Posted Thursday, August 10, 2006",
      "rating": 4,
      "text": "After The Lamb, Gabriel packed his bags, leaving Collins to do the lead vocal role and, whilst not in the same class as Gabriel, he has improved since \"the track we do not play or talk about\" he sang on Selling England. The material is generally strong, with Dance on a Volcano, Ripples, the brilliant instumental Los Endos and Squonk being some of their best material ever. But Robbery Assault and Battery is an inferior song in similar vein to Epping Forest and the title track is weak too. Banks keyboards dominate but Hackett produces some wonderful solos at times and the rhythm section is tight; whatever Collins failings as a singer, he is a master drummer and Rutherford is an underrated bass player who fits in perfectly.Gabriel's departure weakened the band lyrically and in his unique vocal presentation and theatricals but it did not destroy them as some would contend. This and the next album (Wind & Wuthering) were still high quality and they survived Gabriel's loss far better than that of Hackett when he left after W&W. This is a good 4* album but there are clear signs that the band was past its zenith."
    },
    {
      "reviewer": "Raff",
      "date": "Posted Monday, August 28, 2006",
      "rating": 4,
      "text": "Another case of gilding the lily here - that is, adding my probably irrelevant opinion to a couple of hundred others... Hope you'll bear with me and read this review until the end, and perhaps find something you haven't yet discovered about this album (that's my usual big-headed self showing.).In spite of having been recorded after the shock that was Peter Gabriel's departure, \"A Trick of the Tail\" seems to be universally acclaimed as one of the best Genesis albums. I must admit to having always had a soft spot for both this album and its follow-up, the patchier \"Wind and Wuthering\", though I would never go so far as to call either of them a masterpiece.Solid is probably the best word to describe AToT. Eight tracks, impeccably performed by a band that, in spite of having just lost their charismatic lead singer, are at the top of their game from a purely musical point of view. A quirky, very English cover in warm shades of brown and gold, and equally quirky, humour-laced lyrics. Though the loss of Gabriel's visionary, quasi-mystical slant can be felt, in a way the transition is not as strongly noticeable as one might think. Phil Collins (who had yet to become the prog musician everybody loves to hate) fulfills his vocal duties admirably: his voice may even be better than Gabriel's in a strictly technical sense, and he delivers the long, often intricate lyrics quite successfully (although I have to admit that I'm not overly keen on his use of a higher pitch, often bordering on falsetto).AToT's standout tracks bookend the album. \"Dance on a Volcano\" starts out with a very distinctive, explosive drum and organ riff that paints a sort of sonic picture of the song's lyrical content. If one had any doubts left as to Phil Collins' skills as a drummer (however much one can hate him for his later career), his commanding performance on this song immediately clears the ground - besides, the interplay between the four band members is nothing short of dazzling. Energetic, uplifting \"Los Endos\", possibly the foremost candidate for Genesis' best instrumental, closes the album by cleverly reprising the themes of all the other songs, with Banks' majestic keyboard washes dominating the proceedings.The other tracks offer a wide spectrum of moods and musical textures, though they can be neatly divided in two strains: the mellow and melodic (wistful, dreamy \"Entangled\", with the unexpected sting in the tail of its dryly ironical closing lines; lush, keyboard-laden ballad \"Ripples\"; the beautiful piano melody of \"Mad Man Moon\", featuring some excellent, understated singing from Collins) and the more upbeat (tongue-in-cheek \"Robbery, Assault and Battery\", somewhat reminiscent of \"The Battle of Epping Forest\"; drum-and keyboard-driven \"Squonk\", and the quirky, endearingly poppy tune which is the title-track).Unfortunately, Genesis' golden years were reaching their end, though on this album the future development of the band's sound still seems quite remote. AToT is certainly a more than worthwile offering from one of the seminal, most influential bands of prog, although not as challenging as their Gabriel-era masterpieces. However, you could definitely do worse than add it to your collection and enjoy it for years to come."
    },
    {
      "reviewer": "chessman",
      "date": "Posted Saturday, September 23, 2006",
      "rating": 4,
      "text": "This was, of course, the first album the band released after Peter Gabriel's departure. I remember well the trepidation all of us fans felt when it came out...would it match the quality of their previous wonderful albums. Well, we had no need to fear. This is another superb effort. Apparently, the album was a pleasure to write and record, and it shows all the way through the songs. the music is deceptively simple, and the songs flow from beginning to end. 'Dance On A Volcano' opens proceedings in an uptempo way, with Banks and Hackett in fine form, weaving their instruments in and out of the song, whilst Collins proves he can take on the mantle of lead singer effortlessly. Ok, he isn't identical to Gabriel, but he has a similar style and tone to his voice, and his phrasing is just as good. 'Entangled' is possibly the best post-Gabriel track they ever recorded, at least to my ears. It certainly ranks, for me, alongside 'Blood On The Rooftops', off the next album, as one of my favourites, from any era in fact! A smooth, almost trance-like melody, it could be a lullaby, the lyrics are simple yet humorous, and the ending, well...again Hackett and Banks weave their indefinable magic to leave the listener spellbound. The song is almost a step back to the Nursery Cryme era, and the song would have fitted on their well methinks. 'Squonk' was used as a concert opener, and it is another catchy song, with strange, alien-like lyrics, about a little mythological furry creature. Nice song. 'Mad Man Moon' is another classic. It is a slow, very melodic piece, except for the faster, light relief part in the middle. Exquisite piano and keyboards here from Banks. 'Robbery, Assault & Battery' opens the old side two, and is probably my least fave track on the album, though it is still pretty decent. Collins gives a glimpse into his later persona on this humorous account of a robber 'getting away with it'. Uptempo, it is straightforward, yet fits the album well. 'Ripples' is another classic. Slow and moody, it has more beautiful piano from Banks, and a lovely guitar solo in the middle from Hackett, almost in the vein of 'Firth Of Fifth'. I love the bass line from Rutherford here too. The title track is mid-tempo, jolly, almost too simple, yet very nice, with, again, bizarre lyrics about a strange creature with a horn and a tail who lives in a 'city of gold'. Finally comes the brilliant instrumental, 'Los Endos' which brings together fragments of other songs on the album. A keyboard inspired piece, it really is wonderful, especially the change of tempo near the end, where it sounds almost like a train chugging away before exploding into a wonderful keyboard riff, with Hackett's guitar subtle yet precise in the background. A magnificent ending to a magnificent album. Even the cover is a work of art. My favourite Genesis cover in fact,with all the characters from the album displayed in an almost Victorian setting. The essence of England, and the essence of Genesis! I could give it five stars, but will restrain myself and give it four. Ahh! Those were the days!"
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Friday, December 29, 2006",
      "rating": 4,
      "text": "After the collapse of Peter's departure, I was so anxious to discover this album that I rushed to the record shop the day of its availability (in February 1976). What a shock ! Was I dreaming ? Was this true ?With \"Dance on a Vulcano\" I immediately was reassured that MY Genesis was not dead. The intro is of course great, but what we all were waiting for was to hear Phil's vocals and compare them to Peter's one : the master.Well, honestly Phil is doing a great job here. I was quite scared though, because so far Phil's reference were mainly backing vocals or some reply to Peter (Play Me My song ... Here It Comes Again). Not to mention the disastrous \"For Absent Friends\" and \"More Fool Me\". So this opener was quite a relief.\"Entangled\" is a superb melodious track. Accoustic and mellow but very nice. More commercial than usual probably: all sweetness and harmony. On the contrary of \"Squonk\" which is one of their harder song so far and will be the opener of their live performances in the live tour that followed (I was lucky to see this one - but I will tell you more about it in my review for \"Seconds Out\").\"Mad Man Moon\" on the contrary will never be played live. IMHHO, it is the best track of the album : great piano work, nice melody and a good lenght to develop the idea. A top ten in their repertoire and a composition of the sole Tony Banks.\"Robbery, Assault & Battery\" opens the B side and as far as I can remember it led to their first true video clip with Phil disguised in a robber. It is a good rock and pop song. Maybe a first sign of things to come...\"Ripples\" was also one of my fave from the album at that time. A long, mellow accoustic ballad. Maybe I was too melancholic at the time. This song has not really passed the proof of time (at least I have reversed my feeling and I much more appreciate \"Dance On A Vulcano\" and the excellent closing number \"Los Endos\" - \"The Ends\" than 30 years ago).The title track generated another video clip as well but is the weakest track of this album. a gentle rock ballad, with an upbeat chorus. No more.Four stars for this work. A huge relief."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Sunday, January 14, 2007",
      "rating": 5,
      "text": "\"Holy Mother of God\" are the first words sung on this album and that was my first thought upon hearing the dynamic and arresting sounds of the \"new\" Genesis booming through the shop's stereo system. I was honestly astounded by what I was hearing. I was working in a record store in February of 1976 and I must admit I had never really paid any attention to this band for one ridiculous reason or another. (Mostly because I was firmly and conceitedly into Yes and was convinced that no other group could rival them for my attention. I guess you could have called me a \"Yessnob\").But the high fidelity and undeniable power of \"Dance on a Volcano\" with it's odd conga-line-from-hell beat grabbed me by the aural lapels and made me realize that I had better take Genesis seriously for this strong collection of songs was obviously a force to be reckoned with. Therefore, Trick of the Tail remains one of my favorite Genesis albums because it was my first to own. Steve Hackett's gorgeous twelve-string opens \"Entangled\" and Phil Collins' amazing vocals made me wonder why this excellent singer had been hiding behind the drum kit for so long. (I really knew nothing of their history). Then Tony Banks' synthesizer and Mellotron take over, creating a wonderful and mysterious atmosphere. \"Squonk\" bursts through the speakers like the second coming and never lets up in its intensity. It's quality rock and roll but it certainly doesn't sound like anything else that was being produced at that time.\"Mad Man Moon\" is without question one of the best songs Tony has ever written. There is a palpable mood of sadness that runs throughout the tune as Phil sings \"If this desert's all there'll ever be then tell me what becomes of me, a fall of rain?\" It's a very poetic piece. The keyboard interlude is absolutely brilliant in its structure and feel as it leads to the fast- paced but brief bridge. If you've ever wondered why Tony Banks is so highly regarded by proggies worldwide, this alone should answer any questions about his ability. The song ends as peacefully as it began and is one of the standouts of the album. \"Robbery, Assault and Battery\" is a bit of levity that is inventive and clever in its arrangements of varied musical ideas. Again, it is Banks' brilliant middle section that draws this song up from the realm of the ordinary and makes it unique. His Hammond organ work is spectacular here.One of the things that makes these songs stand out are the well-written lyrics (especially considering that Gabriel, one of the greatest rock lyricists ever, was no longer around) and \"Ripples\" may be the best example of all. It's about the inevitable effects of aging and the refrain of \"Sail away, away, ripples never come back. Gone to the other side, sail away, away.\" is haunting and memorable. Again, Mr. Collins delivers a passionate and poignant vocal, doing this beautiful song complete justice. It's yet another of my favorite Genesis tunes. \"A Trick of the Tail\" is a strange little song that fits well enough here but, frankly, is quickly forgotten. \"Los Endos\" is a perfect instrumental finale that sorta wraps up all the various themes of the album into a forceful and strong coda.My thinking is that when Peter Gabriel announced his pending departure the remaining four bandmembers, rather than becoming discouraged, decided to pool their creative imaginations together and shock the music world with a defiant and defining statement that they were far from finished. None more so than Tony Banks who has a writing credit on every tune. In many ways the group was just starting a whole new journey together with a new sound (for better and for worse) that would take them from relative obscurity to the top of the charts in just a few years' time. The remastered version is exquisite and sounds as fresh and exciting as the first time I heard it three decades ago. It was one of the first \"progressive rock\" albums that wasn't discordant or difficult to absorb for the general public, inviting a whole new audience to see and listen to innovative music in a whole new light. It is truly a landmark."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Thursday, January 25, 2007",
      "rating": 2,
      "text": "Lukewarm.With few exceptions, this might be one of the most accessible prog albums. It has a certain warmth to it that many could find themselves enjoying. As I find with many other Genesis works, some of this falls flat on it's face however, for being downright boring.My favorite piece is the opener, which sounds similar to much of the PG era Genesis, it's actually quite a good piece, with interesting dynamics and memorable melodies. However, much of the rest of the work is just too dull for me. Rarely can we find a powerful and moving moment, rarely a sign of innovative songwriting.There appears to be a lack of artistry in much of this. There's no flavor, no pizzazz. It's lukewarm water. It might be something we all need, but we prefer it in other forms, like a refreshing brew. Something with some kick in it. Inspiration seems almost completely gone, and it is no wonder (and with such ease) as to how the band went to pop. A Trick of The Tail isn't bad per se, but it's nothing special."
    },
    {
      "reviewer": "Kotro",
      "date": "Posted Sunday, January 28, 2007",
      "rating": 5,
      "text": "Not to contradict our various Genesis \"experts\", but I don't feel the lack of Peter Gabriel on this record. Maybe because it was only my second take on prog-Genesis after an ambitious attempt at listening to \"The Lamb...\" aged 10. Following such a complex album, it would be easy to think of ATOTT is a return to an apparent simplicity. Not quite.From the first notes ofDancing on a Volcano, you know the band went back to Nursery Cryme and SEBTP for initial inspiration. This album is a natural follower of the later, and togheter with W&W, makes \"The Lamb...\" look like the odd album in a great sequence. We have all those great lush athmospheres created by Banks and Hackett (Entangledhas got to be the most beautiful thing they ever wrote togheter), great vocals from Phil (along with drums, the only thing he does right - damned be the the day he was handed a pen) and the usual skill of Mike. The survival of the Prog-Machine Genesis seemed assured when listening to songs like theDancing on a Volcano,Squonk,Robbery, Assault & BatteryandLos Endos, with their fantastic rhythm changes, faster pace and symphonic passages.Mad Mad MoonandRipplesserved well their purpose as softer, more romantic pieces, well complemented by Steve's guitar, especially the later, with its ethereal middle section. The title track is definitly the gayer in an album that is generally somber, and the closest Genesis had ever come to a pop-track.One of the reasons I like this album so much probably has to do with the fact that there is so much Hackett in it. Yet while some might say Wind & Wuthering has even more Hackett (and good Hackett it is!), we notice here that there was still present a strong will in driving the band forward, with each member contribuiting with as much good material as possible. This is the product of a band who almost desperatly wanted to prove, and successfuly did, that they could last without what was generally assumed to be it's driving force. Something that I feel was beggining to lack in W&W."
    },
    {
      "reviewer": "Dan Bobrowski",
      "date": "Posted Wednesday, February 14, 2007",
      "rating": 4,
      "text": "A Trick of the Tail was my first Genesis album. At 15 years old, I was more into King Crimson and YES. A neighbor kept talking about Genesis and how I would love it. Sure. As a kid, money was tight, so it took a while to finally make the jump into Genesis. From the first few bars of Dance on a Volcano, I was hooked. Power, speed, rhythmic shifts, unusual lyrics and good vocals... everything I dug about YES and KC. Cool!Genesis was also very good at shades of darkness and light, shifting from Dance on a Volcano's hard edge to Entangled's tinkling keys, tinkling percussion, ethereal synths and janglely acoustics guitars. It don't get any better.Squonk, that \"imaginary being\" song, has always been my favorite from the album. As an adolescent first hearing those lyrics, I could relate to the strangeness I felt about just being me, \"what's the difference when you don't know the reason?\" During puberty we are all squonks, pools of emotion. Anyway...Mad Man Moon takes you on a Pan-like journey of the mind. I love the bridge from this tune. Banks keyboards standout brilliantly. Robbery, Assault and Battery is a bit of fun, but may well be the weakest track here. Ripples returns to the softer side of prog, lilting and filled with lyrical imagery and subdued instrumental expression. A Trick of the Tail took awhile to click for me, but it's message is still appropriate for the turbulent times of today. Los Endos is an excellent instrumental, which cleverly recaptures elemts of the complete album.4.5 stars... Every prog fan should own this one."
    },
    {
      "reviewer": "clarke2001",
      "date": "Posted Thursday, February 22, 2007",
      "rating": 4,
      "text": "Gabrielless prog's masterpiece.Well, no, it's not bad at all, said I, after a few listenings. No Peter here. OK, this is just another band. Listen and enjoy. I will. Actually, it's not. What? Another band. I don't have that impression. So, you're trying to tell me that Phil guy actually can sing.But we knew that already.After the first seconds of listening of those crazy diminished guitar chords on \"Dance On A Volcano\", we are aware that the guys didn't lost the plot. And production is very good; Nursery Cryme days are gone for good. This is focused, but not conceptual; mature, but not boring; brilliant but not a masterpiece. Hm. I really should leave that sentence for the end of the review. But it is, it's obvious. Actually it is a masterpiece - a masterpiece of between-Gabriel's-presence and Hackett's-unpresence period.What is going on?Two brilliant tracks. Two very good tracks. One very significant track. A lovely overture. And the rest, with its ups and downs, but filling the album perfectly. Actually, \"filling\" is not a good word because it will leave a bad impression. And there is no song here that left a bad impression on me. Some are weaker, but still very enjoyable.The weakest one is, perhaps, \"Squonk\". I find it a little bit boring. Actually, quite boring. I am fed up with that one. Lovely lyrics though. About a small pool of tears. No. If you just read the comments attached to each song written in the inner sleeve you'll get the idea. The song is a perfect bridge - perfect, I said - between two Genesis' era. Traces of Phil's 80's are here, and 70's are still present.\"Robbery, Assault And Battery\". What a lovely title it is. That is important because if you agree with me on that, you might agree with me on the other points as well, and find my impressions valuable for your young, intact, roseing musical knowledge. Knowledge. Guys from the band know how to do it better than that. Cheesy chorus and cheddar lyrics. Robbery, assault and battery. A felon and his felony. The rest of the songs is good. I assure you.\"Los Endos\". Now, this number can won in competition for the most stupid song title in the history of progressive rock. Maybe not. If you know any others, feel free to inform me; I'm curious and I don't know why. That's because I'm a masochist I guess. The song is actually an overture and it consists excerpts of other songs on this album. Spooky at the moments, brilliant all the time.Are the emotions changing over the years and decades? Of course they are changing. I didn't mean that. I mean, is it possible that an emotion, let's say love, anger, melancholy is not globally the same in the different decades. Anger of the seventies is not anger of the nineties? Love in the sixties is not love in the eighties? Well, that's the case with \"Ripples\". It's lovely song, and it's pure melancholy. But seventies melancholy, not this modern one. Listen to the Emerson Lake and Palmer's \"Take A Pebble\", for example. You will find the same example of the feeling. Actually it reminds me more of Pavlov's Dog.I'm often wondering if it's possible to be 100% polite. I mean, if I wrote the wordpuka, that means nothing. Right. I speak three languages (and I wave my hands in several more languages) but I can't remember if the word puka is insulting, offensive expletive in any of these languages. On the other hand, there are several thousands languages around the globe, so that word must be offensive somewhere (or if applied) to someone. Quite possible; \"A Trick Of The Tail\" is maybe to worst possible swearing somewhere on Earth. On a second thought, \"A Trick Of The Tail\" could be even in English interpreted quite kinky. I apologise if anyone ever got offended by Genesis' song. It's quite nice epic, actually.I hate when my brain tries to explain to my heart that it's wrong. I hate when I'm wrong. For example, I absolutely adore the song \"Entangled\". It contains some dreamy, floydian feeling. That's strange, I'm not fan of Pink Floyd. But I love The Stranglers. And this song, in a same way as \"Golden Brown\" does it, contains slow waltzer tempo, with one bar added at the end of the verse. Just too good to be true. After the pathos of last verse (I don't want to spoil the party, you have to hear it to believe it), the song flows into the seas and shore of lovely string-like keyboards. That part of the song is maybe a little bit too protracted and it should have been more developed. See? That's what I was talking about! I like the song as a whole! What's the use of phrases likeshould have been more developed?Sorry, I left the question mark inside italic. Now it's corrected: \"?\".Anyway, what's the use of using ofloads ofitalicized or bolded fontsinsidea review? It gives a certain significance. It looks more mature and analytical. It's proving that you're a smart guy capable of using the text codes. If you didn't noticed yet (didn't noticed? I never knew if that's correct perfect tense. Alas, my English!), the point of a review is to get your attention on a certain album, and I am doing it with a good reason, because this is good album. What else should I do? Maybe I should start writing reviews with Irish accent? How would ya loike that? On a second thought, I'm writing in Irish way already; Joyce was Irish. Or maybe I should explain in a old-fashioned, conventional way, that \"Dance On A Volcano\" is an astonishing song, with excellent keyboard solos within the 7/8 time measure, a lovely collage of different parts ranging from dreamy to furious? It is. Even the lyrics are, good, although I never liked Collins' \"ho ho ho\" somewhere in the middle of the song. This is not Jethro Tull's Christmas album, mind you.The number of the stars this album deserves is equal to the number of progressive rock fans worldwide who are actually glad that Collins replaced Gabriel. And there's no Gabriel here, and this is an excellent progressive rock album. There something to think about. Or not. Thanks, Hackett. And everyone else."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Sunday, March 25, 2007",
      "rating": 5,
      "text": "Hah! Take that, you doubters!PETER GABRIEL leaves, and the four remaining members have room to breathe. Rather than the muddy mix of previous GENESIS albums, 'A Trick of the Tail' allows BANKS, RUTHERFORD, HACKETT and COLLINS to shine. Suddenly it's about the music, and nothing Genesis ever did approaches the sheer musical excellence of this record. No, it's not really a concept album in the lyrical sense, but it is bound together by shared musical themes, brought home by the stunning closer, 'Los Endos'.'Dance on a Volcano' is no simple opener. A powerful opening theme is counterpointed by a sophisticated verse rhythm, and PHIL COLLINS powers into the vocals. Of course we're going to compare him to PETER GABRIEL. And you know what? There's no comparison. Forget 'Sissudio' or 'You Can't Hurry Love', I dare you. Come on, hear what he's doing here. A unique voice, so confident already, beautifully phrased, only to get better in the years that followed. 'On your left, and on your right ...' COLLINS doesn't have the sheer presence of GABRIEL, but that's all to the good - now we can hear GABRIEL'S former backing band, and they're not bad! 'Better start doing it right!' Oh, they are. GABRIEL has the voice of a solo artist; COLLINS that of a band singer, with a tremendous range. Now that GABRIEL has left, to go on to his own stellar solo career, they're all finally doing it right. Win-win.On to 'Entangled'. No drums, just beauty. A peasant conceit lifted into the stratosphere by TONY BANKS' last two minutes. Listen to that lead break on the keys. Imagine Gilmour playing it on guitar - it'd be ahead of 'Comfortably Numb' on all the 'greatest guitar solos' lists. With the mellotronic voices and the ethereal atmosphere, the climax of this song is as good as music gets.Then in roars 'Squonk'. Just the right gap between songs for the thundering start to work. Not their very best song, but it still beats GENESIS' earlier 'weird animal' stuff such as 'Hogweed'. 'Mad man Moon' is just beautiful: we now begin to realise that TONY BANKS is and always was at the heart of what GENESIS managed to accomplish. Plaintive, precise piano, just gorgeous singing from COLLINS, this song goes unnoticed in the GENESIS canon but would be a career highlight for almost any other band. The rising transitional note between 'sun and sand' and 'Within the valley' is another classic BANKS moment, of which there are dozens on this record. And has there been a line so fraught as 'Forever caught in desert lands/ One has to learn to disbelieve the sea'?'Robbery, Assault and Battery' does what the awful 'Epping Forest' couldn't; freed from GABRIEL'S overindulgence, prog's playfulness is masterfully summarised. 'Ripples' is extraordinarily powerful, marred slightly by an overlong central transition section. Again, GABRIEL could do many things, but singing 'Sail away, away' wouldn't be one of them. Lovely big drum sound, and splendid effort from Mr RUTHERFORD. A faint echo of this song, 'Fading Lights', can be heard on 'We can Dance', but it's only an echo; this is the business. The title track is a fun piece, lovely clean pop allowing the humour of this band to rise to the surface again.Finally 'Los Endos.' An instrumental coda wich brings the musical themes of the album together, this really is redolent of the best of this album. Disparate themes welded together into five minutes of music which soars from peak to peak, a summary of a career together. Somewhere near the best five minutes of music on the planet.So come on, all you doubters. Cast aside your anti-COLLINS hatred. Give this a listen.And to think it so nearly didn't happen."
    },
    {
      "reviewer": "NJprogfan",
      "date": "Posted Wednesday, March 28, 2007",
      "rating": 4,
      "text": "This particular Genesis album was always a tough one for me to swallow. I miss Peter's vocalization and his off-beat lyrics, yet I can't help but think it was only a matter of time before the band imploded. Does this mean it's a bit of a letdown? Yes and no. Yes in the lyrical and theatrical department, no in the actually music and sound. Phil Collins may be a better overall singer, but he's not very strong when it comes to articulating the words. Peter had a way of phrasing the words that made you believe that what he was singing came straight from his heart and guts. Phil is a kind of 'American Idol' style singer, (he loves to sing Motown tunes) flashy but no substance, except for one track. When he sings 'Squonk' he uses every ounce of his voice singing high notes, low notes, even singing along with Tony's keyboards weaving in and out of the song masterly. It is without a doubt his finest performance with the band and without. It's a deceptively complex song that you may not think so a few times around, but once you get past the simple structure you'll notice Phil's incredible drumming, Mike's bass, (which is always overshadowed) and Steve's nimble but wonderful guitar. Oh, and of course the master Tony's keys! 'Squonk' is one of my favorite prog songs to blast with my car windows down. The rest of the album sneaks up on you. With the exception of 'Dance On A Voilcano', (which sounds like a track from their early days) and 'Los Endos', the album has many hidden gems amongst the simpleness. In 'Entangled', Tony's Mellotron is gorgeous. In 'Mad Man Moon' there is a fantastic middle instrumental section. \"Robbery, Asault and Battery' has a complex mid- section that is as progressive as anything they've ever done. 'Ripples' is haunting and 'A Trick Of A Tail' is whimsical. But it's 'Squonk' that is the highlight for me. The fact that the melody is the fading melody at the end of 'Los Endos' justifies my review thank you very much. Sure I miss Peter, but this album and the next few are still must haves for any prog fans. Can't give it a 5-star rating if you compare it with their other early albums, but it's oh so close. 4.5 stars!"
    },
    {
      "reviewer": "Garion81",
      "date": "Posted Saturday, April 21, 2007",
      "rating": 5,
      "text": "This is one of Genesis finest hours. The writing, the playing, the production and yes even the vocals are the band in it's prime. I pull this one at least once a month still. I never skip a track and to me that is the mark of great 5 star album. With the departure of Peter Gabriel the band found its own strength in the remaining members and the work really shines in the eclectic numbers on here. Dance on a Volcano, Squonk, Entangled, Mad Man Moon and Los Endos have very little in common with each other but all seem to be tied together by the familiarity of the instruments and players who play them. Soaring and blistering in some places, thoughtful and introspective in others Genesis gives up a performance for the ages. It is one of the albums I can point to and say this is a perfect example of prog rock.The artwork on the cover is quite amusing and associates to the varied songs on the album. This was the best produced Genesis album to date as some of the earlier recordings have shown the lack of top notch facilities and sound. (Don't get me wrong I love them all just making an honest observation)This is 5 star. No doubt in my mind."
    },
    {
      "reviewer": "progaardvark",
      "date": "Posted Thursday, June 21, 2007",
      "rating": 5,
      "text": "The year 1976 brought us a new Genesis. Gone was their beloved lead singer Peter Gabriel who would venture into a successful solo career and now the vocals come forward from behind the drum set. Along with Gabriel's departure came a new and refreshing Genesis sound, a hybrid of sorts mixing the almost medieval and symphonic sound of their past with a more modern approach to songwriting, plus a much better recording production.I must say the band did quite wonderful on their own with Phil Collins taking the lead. There isn't a weak song, nor a pinch of filler on A Trick of the Tail, albeit a slight nod towards the radio-friendly side of things. The music is quite original, even if not as complicated as some of their earlier masterpieces (with the exception of Dance on a Volcano). The topics are all interesting and there's even a bit of subtle humor in places. I find that Banks' keyboard work seems to dominate in the mix.This is definitely not as good as their 1970-1973 period, but it certainly is a masterpiece nonetheless. Easily another five star effort from this amazing band. Highly recommended and essential."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Monday, July 16, 2007",
      "rating": 5,
      "text": "It was around 1978 when I was over visiting a friend of a friend when he pulls this LP out of it's sleeve and says \"You guys should hear this\". Well, after listening a while I looked at my friend and we kind of smiled respectfully at each other about what we were hearing. The longer I listened the more I liked it. \"It\" was \"A Trick Of The Tail\" by GENESIS and this was my first experience with GENESIS. I sort of forgot about this record until they released the single \"Follow You, Follow Me\" and when I heard that GENESIS song on the radio I was reminded of that experience. It wouldn't be until \"Duke\" came out in 1980 that I would buy my first GENESIS record.\"Dance On A Volcano\" is such a good song ! Can these guys create a melody or what.The intro is fantasic and the mellotron during the verses is heavenly. I really like the line \"So you better start doing it right\". Hackett and Banks really shine on this song. \"Entangled\" has gentle vocals and acoustic guitars to start. The sound becomes fuller and the vocals sound double tracked as the guitar is strummed. Haunting synths,12 string guitar and mellotron to close it out. \"Squonk\" is another good one with pulsating keys as the drums pound. The vocal melody 2 minutes in is a highlight. \"Mad Man Moon\" is a ballad with fragile vocals, piano and floods of mellotron. The piano melody recalls \"Firth Of Fifth\". The tempo picks up 5 minutes in before it settles back down with mellotron.\"Robbery, Assault & Battery\" has theatrical vocals while the chorus just doesn't do it for me. The best part of the song is 4 1/2 minutes in as Banks shines.This song is not one of my favourites. \"Ripples\" is my favourite. It's a song about getting old and it's so beautiful. Acoustic guitar, piano and vocals lead the way. The chorus is so uplifting. The synths to close out the album are great. \"A Trick Of The Tail\" is somewhat catchy but far from being the best track. \"Los Endos\" is an instrumental that gives each member an opportunity to show off their talents. The mellotron that rolls in 3 1/2 minutes is very haunting. There is a reprise of a passage of \"Squonk\" late in the song.These guys didn't miss a beat when Gabriel left. These are some of the most amazing songs that i've ever heard."
    },
    {
      "reviewer": "fuxi",
      "date": "Posted Sunday, July 22, 2007",
      "rating": 4,
      "text": "A TRICK OF THE TAIL proved a triumph for all concerned. The only thing you could possibly find fault with is the words. Having lost, in Peter Gabriel, one of prog's most gifted lyricists, the band sometimes resort to childish whimsy. But their composing and playing had never been better.TRICK is a remarkably well-balanced record. Eight compositions of similar length follow each other smoothly. The original A-side, in particular, comes across as a perfect sequence. The grandiose riff of \"Squonk\", the third track, comes as a natural continuation of the dreamlike keyboards solo which ended the acoustic splendour of \"Entangled\". (I'd never thought a song about a rat-like creature, which dissolves itself in tears, could sound so exciting.) And \"Mad Man Moon\" has to be the most rapturous melody Tony Banks ever wrote. (Wonder who was responsible for \"The Carpet Crawl\"?) Its mellotron arrangement is delightful, and Phil Collins sings exquisitely - particularly that final verse which goes: 'Within the valley of shadowless death they pray for thunderclouds and rain, but to the multitude who stand in the rain, heaven is where the sun shines'. \"Mad Man Moon\" makes the heart melt, so let's forgive Tony for his rambling, incoherent lyrics.\"Robbery, Assault and Battery\" is memorable for its extensive keyboards solo, superbly accompanied by the rhythm section. Both \"Ripples\" and the title track are unspectacular, although they have a funny way of lodging in your mind. And \"Los Endos\", as all Genesis fans will tell you, is simply one of the most joyful pieces of instrumental music the band ever recorded."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Monday, July 30, 2007",
      "rating": 2,
      "text": "Am I the only person who chokes in outrage that this tepid, gutless piece of ham-fisted key-driven \"symphonic\" mediocrity rates so high? Where are the thoughtful compositions and interesting instrumental parts? Where are the exciting and dramatic lyrics? This is Genesis at their worst; at least I can tap my foot and get into the groove of \"Land of Confusion\"-- I can't do anything here but cringe at Bank's boring melodies and laugh as Hakcett's spineless wimperings masquerading as lead guitar. I tried so hard to discover the appeal to this one, given its overwhelmingly good reviews, but found nothing but bland monotony.Coming from a later generation, Genesis holds no emotional appeal to me, and when I am offered so many other exciting options, choices like this are boring, and not worthy of attention.Songwriting: 2 Instrumental Performances: 2 Lyrics/Vocals: 2 Style/Emotion/Replay: 2"
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Tuesday, August 7, 2007",
      "rating": 4,
      "text": "I was 16 at the time this one came out and when I think of that year (1976) this is the main soundtrack. I must have litened to this album more than 500 times on that year alone! Still, for old Genesis fans like me, everything changed. With the loss of Gabriel Genesis music also lost some of its the edge. A trick Of The Tale was, in many ways, the start of their pop-rock period, although that was not clear at the moment. And, besides, it was also very good music.Genesis could survive Gabriel�s exit, but it was a whole new band. I really loved how Phill Collins handle well the vocals. The music may be less intricated and ambitious, but still retained enough early elements to make it an essential item for anyone who loves prog music. Only Robbery, Assault and Battery never really captivate my imagination. It�s not a bad song, really, but it is not par to the rest of the tracks, all excellent ones. There�s magic all over this CD, specially during the acoustic parts with some of Banks best mellotron works. The cover art is awesome even today. Also production wise this album was an importante step ahead for the band.Conclusion: a transitional album that still carries much of their earlier works. Mid period Genesis (with hackett) may not have the same impact as their masterpieces, but it was a new music with lots of merits and very enjoyable songs. Four solid stars."
    },
    {
      "reviewer": "stefro",
      "date": "Posted Thursday, August 30, 2007",
      "rating": 5,
      "text": "So, it's 1975, PETER GABRIEL has just left GENESIS, and the music press are preparing the groups obituaries. Surely you cannot have a GENESIS without their enigmatic frontman and vocalist, that just wouldn't work, would it? For many fans, critics, writers and assorted commentators, this was it. The end. No more Genesis. Gabriel was the lifeblood of the group, the magnetic stage presence that the fans affixed their gaze upon during their heady live shows. Without him(and his crazy costumes), the band would be missing a huge part of it's identity, and the general consensus was that GENESIS were finished. Not so. Gabriel might have written a large percentage of the lyrics and sang 95% of the lead vocals, but the music was produced by the band. After a series of not-quite-good-enough auditions for a new front-man, the remaining members decided that the best man for the job would be the little known PHIL COLLINS, the bands second drummer after original tub-thumper JOHN MAYHEW bailed out after TRESPASS, and also a former child TV star. Needless to say the experiment turned out to be one of the greatest decisions regarding late 20th century popular music. Charisma Records, the groups label, was run by a man named TONY STRATTON-SMITH, and he gushed at the time(after hearing Collins sing for the first time): \"He sounds more like Peter Gabriel than Peter Gabriel!\". So, it was this record, the groups first with Collins as lead singer, and the first ever Genesis record without any input from Gabriel, that continued the bands musical evolution when so many thought it was the end. More like the middle, really. The album itself(Long intro I know, sorry!), is possibly GENESIS' most complete work. Shorn of Gabriels lyrical and musical demands, the songs seem more relaxed in mood and much less fraught with the kind of crazy imagery so beloved of their ex-lead singer. Album opener DANCE ON A VOLCANO sounds like a sequel to SELLING ENGLAND BY THE POUNDS 'MOONLIT KNIGHT', eschewing the giddy guitar histrionics for a more structured approach involving some thrilling organ workouts from TONY BANKS. ENTANGLED, a beautifully sedate and almost psychadelic swirl of acoustic strumming and mellotronic meanderings shows that the band were capable of writing sensitive ballads, and not just surreal epics featuring bizarre characters. ENTANGLED is a gem of a song, and allows the listener a bit of breathing space before storming head-first into the riff-tastic beginning of SQUONK. Bassist MIKE RUTHERFORD admits that he didn't actually like the opening guitar riff for SQUONk, but, perserverance on the bands behalf helped him see the light and the riff stayed. It's a true GENESIS classic, featuring yet more stunning organ work from Mr Banks. Other highlights on the album include the eponymous title-track, a lightly-ambling, whimsical and very english prog- folk workout, whilst LP-closer LOS ENDOS thrills and delights with it's stunning battery of drum attacks and chiming guitar licks, courtesy of STEVE HACKETT, who, it must be said, is not given a lot of time to express himself here. A TRICK OF THE TAIL marks a creative high-point for the band as a foursome, as later efforts failed to reach he heights achived on songs such as SQONK and ENTANGLED. The band obviosuly felt they had something to prove now that Gabriel was gone, and prove something they did, producing a genuine English symphonic prog classic that still stands up as an excellent example of the genre."
    },
    {
      "reviewer": "Dim",
      "date": "Posted Monday, September 10, 2007",
      "rating": 3,
      "text": "It was very hard for me to rate this album, I was stuck between a three star and four star rating, but ultimately came up with a three. Why, because after many many listens and quite a few discussions on this site and outside this site, people immedietly change their views of the band, as if it isnt the same group that released Selling England, Nursery Cryme, or Foxtrot, and to be completely honest, it is almost a completely different sound. The lyrics are much less forboding and mysterious as Gabriel left them, and are much more warmer and well, British. The music has also lost it's jauntiness, which can be a good or bad thing depending on your personal tastse. Dont get me wrong, The album is very beautiful, and will definately appeal more to the fan that never got into Peter Gabriel Genesis. Anyways, here's my initial review of the albums songs:The first time I put this album in, I was very excited and was placing it in very high hopes, for my dad told me it was easily Genesis' best album, and when dance on a volcana threw itself at me, the anticipation just grew. Dance is a really cool opener for two reasons, one beacause it started out electric which is a very non Genesis thing to do, one because it completely goes against every other genesis opener song. Either way great song, but a bit misleading, because it is basically the most fast paced and electric this album goes by far! Entangled is a jaw dropper, particularily for the extremely catchy chorus and eerie synth solo at the end. As far as lyrics go, one of the best on the album easily! The next song squonk, is a bit disapointing, because of the poppy synth riff that goes throughout the song, and strangely sounds a bit like the kind f riff the band was going to make ten years later and one less member. After this song, I find myself still anticipating a hckett solo or lead line since the opener, which barely makes the cut. Mad Man Moon is amazing lyrically, but musically, very awkward and somewhat boring, and easily one of Collins worse vocal performances. Robbery assault and Battery is a very fun song, filled with jaunty piano and awkward time signatures, good placement after the dull mad man moon. Ripples is my favirote song on the album, mostly because of it's complete and utter progness! Although it stays very mellow throughout the song, the chorus is awe inspiring, and the key oards are very smooth, along with very well written lyrics!The next two songs A trick of the tail have never eally popped out to me as I think they should, the title song is just piano and some otherwise corny lyrics, and the closer is a pretty cool instrumental, but lacking the dynamics to be a great, no solo's, no breaks, no speed up's, ect ect.The music of the album easily surpasses the vocals and lyrics. The mood is very mellow, 50% twelve string guitar, while the other 50% is keyboards and drums. ABSOLUTELY NO ELECTRICS, besides maybe two or three notes after Dance on a volcano, which really upsets me considering they have one of the greatest guitar palyers at the time. The keyboards are very innovative and creative, with some very cool Synths and moogs, combined with lots of piano's. Phil does an excellent job on drums, maybe except for the awkward keyboard solo on Robbery assault and barberry. As for the vocals, I dont think Phil really found his frontman vocals he learns to perfect on Duke and loses on invisible touch.Overall this album kinda disapointed me at first, but after many close listnes, i have come to appreciate the mellow atmosphere and pretty acoustics. The major mistake of the album was not showing off hackett nearly as much as he was!***3 stars!"
    },
    {
      "reviewer": "rushfan4",
      "date": "Posted Friday, September 28, 2007",
      "rating": 4,
      "text": "And Then There Were Four. A Trick of the Tail was the first Genesis album to feature Phil Collins on vocals after Peter Gabriel left the band to pursue a solo career. This is an excellent progressive rock album which provides much in the way of the classic Genesis sound but also foreshadows the poppier side that Genesis will later pursue. At this point, Phil hadn't quite found his \"pop voice\" yet and it appears that he was singing in Peter Gabriel-like style, probably to try and keep with the Genesis-like sound. To bring a perspective to my review I must reveal that I am a late comer to Prog Genesis. I grew up with 80's era Genesis and Phil Collins solo music so I am more familiar with the Pop Genesis material than I am with the Prog Genesis material. In a way, I have experienced Genesis in reverse since I knew them as a pop rock band before I knew them as a Prog band. Tracking backwards, A Trick of a Tail is an excellent bridge album for acclimating a pop rock Genesis fan to the prog side of Genesis. Now for my analysis of the individual songs:Dance on a Volcano - what a shock to Gabriel-era Genesis fans. The first song on the first album post-Gabriel is, egads, a dance song. OK, it is a lively prog rock song with excellent keyboards and drum work and some nice behind the scenes guitar work, but \"put your left foot first and move into the light\" might include the Hokey Pokey as its inspiration.Entangled - is a melodic song featuring some beautiful playing by Tony, Steve, and Mike. Even in their proggiest days Genesis has always excelled at performing prettier mellower songs (not quite a ballad per se, since it isn't a song about love). A song perhaps about the theater of dreams, possibly brought on by anesthetics. Interestingly forecasting the costs of the healthcare industry with \"you'll have no trouble until you catch your breath and the nurse will present you the bill\".Squonk - when I was a young child and we would go camping we would go \"snipe\" hunting. This was a make-believe character that was used as a way to entertain us kids as we would walk around the fields at night trying to find these snipes. I believe that my childhood snipe may have been related to the squonk. At any rate this is a pretty straight ahead song that tells a good story regarding hunting squonks. Possibly a commentary on fox hunting by the royals in England. This song reflects past prog Genesis in that it could be a leftover from Nursery Cryme with 2 or 3 references to nursery rhymes. In addition, Phil is singing multiple characters like Peter Gabriel did on previous albums. Phil sings as the hunter and as the squonk. He doesn't accomplish this as well as Peter Gabriel might have however, and this song is a disappointment to many Peter Gabriel-era fans. However, I like it and find it quite entertaining.Mad Man Moon - is another song on the mellow side of prog. It also promotes dream-like qualities and lyrically paints a very picturesque landscape with its many descriptive references. About half-way in it begins to rock a bit then it mellows out again and finally ends with the final minute of a very quiet musical passage.Robbery, Assault and Battery is another of the more \"controversial\" Phil Collins era songs that is equally liked and derided by Genesis fans. I find it to be a fun song that keeps a nice pace and quite enjoy the music and the humor of the story. Again Phil Collins sings different characters throughout the song in a \"tribute\" to Genesis' past, but again he doesn't quite do it as well as Peter Gabriel might have. Also, I find the chorus quite \"catchy\". Hopefully, it doesn't play on my internal ipod the rest of the day.Ripples is quite possibly the most beautiful song ever performed by Genesis. Again the lyrics are very visual and the guitar and organ/keyboard playing are very gentle. A possible reference point might be Take a Pebble from Emerson Lake and Palmer. I believe that it symbolizes \"embracing this moment in time\" because \"you're not getting any younger\".A Trick of the Tail is a song telling a fantasy story of a mythical \"beast that can talk\" that comes from a land of gold who is captured by humans and then tricks them into bringing him to his home where he then disappears back to his fantasy world of gold. This song features some nice guitars and even some nice drum playing by Phil, which is quite infrequent throughout this album. Another story that I quite enjoy with another \"catchy\" chorus.Los Endos - an excellent prog instrumental to end this album. Possibly another \"trick of the tail\", which if you were to think of this song as the tail of the album, it might trick you into thinking that Genesis were a progressive jazz band. The song does replay some of the themes encountered along the way throughout the album.All in all I believe this is an excellent album that would be an excellent addition to any prog music collection."
    },
    {
      "reviewer": "Moatilliatta",
      "date": "Posted Wednesday, November 14, 2007",
      "rating": 3,
      "text": "A Trick of the Tail is quite a noble attempt to move on after the departure of Peter Gabriel. It certainly showed that he wasn't the only creative force in the band, but at the same time it showed that he had a lot to do with the band's identity. The album sounds like a Genesis record, sure, but some of the musical quirks, especially the vocal theatrics are missing. Phil Collins was given some time to sing on past records, and we all knew that his tracks were among the weaker ones, but now he is at the helm all record long. He sings well - his voice is clean and smooth as I'm sure we all knew - but he simply lacks the charisma and command of Gabriel. On the positive side, this album sounds shockingly better than all of their albums. The production is thick and the atmosphere is saturated. The sound is superb, even for a 70's record. I wish the band could have had this production on their past three records! And as another positive note, a lot of the instrumental passages are strong and the band always sounds good. It's mostly the vocals and the writing that hinder the quality of this record. The songs simply aren't as memorable. I'm not captivated by any of the parts I feel like are supposed to captivate me. Et cetera.The start of this album is quite promising with \"Dance on a Volcano.\" Phil's entrance on this disc is stellar, the way the music shifts and the particular music that is going on at the time provides a great start. Besides that the song ends up lacking that character and memorability of the previous releases - it is hard to match, to be fair - it is a good tune, and unfortunately it's mostly downhill from here. I would like to know who is responsible for the refrain of \"Entangled.\" That has got to be the one of the most annoying choruses I've ever heard. The song is only slightly remdeemed by the instrumental part toward the end. The end is great, the first half is just that unpleasant. \"Squonk,\" unlike the name, is not an awesome, fun song, but rather a slower and less good \"Dance on a Volcano.\" \"Mad Man Moon\" is a highlight for me; there is good band interplay, melodies, structure, etc. \"Robbery, Assault and Battery\" is a pretty good one as well. \"Ripples\" is a bit dull. \"A Trick of the Tail\" has a great riff to start, one that would make a very good short, poppy song, but I think they didn't take the right direction with it. The instrumental closer, \"Los Endos,\" shows some fusion creeping into the mix, as Phil was involved in the fusion group Brand X at the time. They peppered some themes from the album into the piece and everything. It's another highlight.You can see that the band is not quite sure what to do and where to go now that Peter is gone, but the band tries to maintain their dignity and to a degree of sucess. We don't have to write them off yet. In fact, they will have one last stand with their next output before they collapse into mediocrity and worse. A Trick of the Tail is worth having if you find it in the bargain section of a used record store like I did, but don't pay full price for a new CD."
    },
    {
      "reviewer": "Tom Ozric",
      "date": "Posted Tuesday, November 20, 2007",
      "rating": 5,
      "text": "A Trick of the Tail has long been a personal favourite, and somewhat of a 'guaging stick' for me. It was the first 'authentic' prog album I ever bought (I had most early Floyd at this stage, thanks to 'Another Brick in the Wall' Part II, but wasn't even familiar with what 'Prog-Rock' was about, let alone certain genres of music in existence), so I am partially sentimental to this release, and still find it one of the (many) greats - pretty much as good as 'Selling England...' which I acquired shortly afterwards (circa 1987).From the outset, 'Dance on a Volcano' hit me hard. I loved the intro, and the way it struck me as 'listen to me, I have something to say'. What is this odd rhythm, is my record skipping ?? This was the album, by method of deduction, I figured out what the mysterious strings and choir sounds were - a Mellotron !!!! From then on, it was all Crimso, Moodies, Yes and most things 'tron. What a superb introduction to the 'fantastical world' it was.Continuing with 'Entangled', a tune that features one of the most powerful synth/ choir-reel mellotron sections I've ever heard. Simply breath-taking, mellow 'Floydian' 12-string (when did Floyd ever actually use a 12-string acoustic ??) arrangement and then that insanely magical passage - I'm totally blown away by this stage. 'Squonk' is next, which sounded more 'harder' but full of imagery from another place (just the right concoction a 15 year old needed at that stage !!). Rounding off Side 1 was 'Mad Man Moon', one of Keyboardist Tony Banks' compositions, something of a 'ballad', but beautifully arranged, utilising his keyboard rig of the time (Piano, ARP Synth and Mellotron, don't recall organ in this one).Side 2 started with 'Robbery, Assault and Battery', again showing off the band's instrumental prowess, fully symphonic, quirky character role-play in Phil Collins' singing/lyrics, and more show-offy playing from all concerned. The long track, 'Ripples' (8mins 4secs), is an acoustically based track and sounds wonderful and inspired. It contains a lovely, classically oriented instrumental part. Title-track is a catchy and accessible song but no less engaging regardless. Closing (mainly instrumental) piece, 'Los Endos', was/is the most appropriate ending to this superb display of instrumental/lyrical dexterity, and to this prog listener, remains one of the highest ranking prog albums I listen to. Full score."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Thursday, November 22, 2007",
      "rating": 4,
      "text": "The first album with Phil Collins as the lead singer in Genesis, was A Trick of the Tail. The loss of Peter Gabriel was huge, but somehow the others managed to carry on in a decent fashion. Let there be no doubt, I like Peter Gabriel Genesis a lot better than Phil Collins Genesis, but I still like the three first albums with Collins very much. I think they are very essential to prog heads.A Trick of the Tail starts with Dance On a Volcano with it�s strange rythm and generally exciting melodic approach. There are some pretty complicated instrumental parts in the song which I find very interesting. This is a classic Genesis song.Entangled is the next song, and what a beautiful song. The 12 string guitars are fully displayed in the beginning of the song, and once the keyboard sets in this song goes from beautiful to Godly. This is symphonic prog at it�s best. Really essential. The ending of the song is so overwhelming that it takes my breath away.I had to get used to Squonk before I could fully appreciate it, but now it is one of my favorite songs on the album. Really emotive and captivating even though this is one of the more rock like songs on the album.Mad Man Moon is a favorite of mine. I just love the piano from Tony Banks on this song. It�s so inspiring and beautiful. I think Phil Collins delivers his best vocal perfomance of the album on this song. This is really emotive.Robbery, Assault & Battery is maybe the weakest song on the album, and the one that reminds me the most of Peter Gabriel. He would have made this song a winner. It just doesn�t work when Phil Collins tries to be funny and sing different voices. But I�ve grown used to it and of course I enjoy it.Ripples is the most Pop like song on the album. The chorus is almost in a vein where I can�t stand it, but only almost and in fact I find it to be a beautiful song. Not the best on the album though.A Trick Of The Tail is one of my favorite songs with a great humour ( and not once do I think of Peter Gabriel) and a nice melody. This is not the most progressive song, but I still think it is a very strong song.Los Endos is the most complex song on the album, it is an instrumental track with themes from most of the other songs on the album. This was a Genesis live favorite and I must say that I think this sounds like it would be better live than it is in the studio version. It�s not bad at all, I just feel it has a live feeling that this studio version doesn�t honour. A good track though.Beneath all my criticism I hope it shines through that I really like this album, and I would recommend it to anyone into prog rock. Even though there is a big difference between Peter Gabriel Genesis and Phil Collins Genesis some of the earlier releases from the later are very essential to prog heads.This is not a masterpiece, but very close to being one. 4 stars is fair."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Sunday, March 9, 2008",
      "rating": 3,
      "text": "Review 14, A Trick Of The Tail, Genesis, 1976 StarStarStarStar StarAfter the departure of Peter Gabriel, Genesis' sound really does take a drastic change. For some people this is a welcome development, but not so much for me.Firstly, Collins takes over lead vocals. I think the issue here is not his voice, which I, personally, enjoy on all the previous albums, and on the following Wind & Wuthering, but that he's not that confident with it, and doesn't really make the songs his own on this album. Occasionally he adopts weird accents on Dance On A Volcano, Mad Man Moon and Robbery..., but it just doesn't pay off for him as much as it did for Gabriel. The lyrics are still very good, but the relatively non-distinctive nature of Collins' vocals here do obscure that a little, so they originally felt like repeated pop choruses, even when they aren't.Secondly, the music is somewhat less explosive. There are far fewer great rock moments, and nothing like Fly On A Windshield or Firth Of Fifth. For me, at least, this meant it's taken a lot longer to acquire and get used to, and puts it somewhat behind the Gabriel era albums for me.Anyway, they say she comes on a pale horse, onto the music:Dance On A Volcano was a little difficult for me to get into, but I now do enjoy it. Great opening, mainly guitar-based, good drumming, a great quirky bass part from Rutherford, and overall a very enjoyable track.Entangled is an odd creature. On the verses and the instrumental second half, good, enjoyable acoustic guitars from Hackett and Rutherford, here, and banks provides excellent synth and mellotron (I think) parts. Collins provides a nice vocal, and the song suits him. However, the choruses really don't work for me. I've never been a great fan of playing acoustics with too many chords, and this isn't an exception. The vocal harmonies aren't very distinctive, either. A very good song, I admit, but not one that grips me.'Like father, like son' A good, but simple drum-and-bass rhythm, with matching guitar, opens Squonk. Great vocals for decent lyrics, here, somewhat more assertive than on the rest of the album, I feel, though I wish they were a little more prominent in the mix. I love the drums on this one. One of my favourites from the album.Mad Man Moon is one of the most beautifully opened songs I've heard so far, with stunning piano and keys, emotive vocals, perfect background electrics from Hackett, and an uncharacteristically quiet performance on the percussion from Collins. Oddly enough, it merges into something with a more Latin feel, with strange percussion that sounds like castanets, cheerful and classical-styled piano juxtaposed. This is followed by the strange Sandman section, with odd, but intelligent lyrics, accented vocals. After that brief interlude, it returns to an even finer rendition of the opening, 'Within the valley of shadowless death', with a superb return to the piano theme, even better guitar minimalism and percussion, and a great ending from banks. Lyrically, this is certainly my favourite song from the album, and probably for Genesis as a whole. Essential listening for Genesis fans.Robbery Assault And Battery is yet another weird case, where nothing manages to offend, and I love the electric guitar and bass, and the drumming's quite catchy. The cockney vocals are amusing enough, and there are two great short instrumental sections near the end and at the end, respectively. I think it's the silly keyboards here that put me off the song as a whole. A good song, and I think I should like it more than I do.Throughout Ripples, much like Entangled, I love the piano-and-guitar verses, with superb vocals, but I don't enjoy the chorus and its harmonies much. Good lyrics, great piano, and a decent instrumental section towards the end. I prefer my soft songs staying relatively soft throughout, rather than doing what these two do, which is start with a beautiful melody and then go to a generic chorus at a slightly louder volume.Oddly, I really enjoy the pop-ish ATOTT. A thoroughly enjoyable short song, with great guitar from Hackett, and acceptable vocals and lyrics, with some great harmonies, plenty of bombastic silliness. I don't know what so many people dislike about it, but unlike the rest of the album, I liked this one on the first listen.Los Endos is essentially a medley of tunes from the rest of the album, together with the legendary 'There's an angel standing in the sun!' of Supper's Ready, and a couple of weird shimmerings and strange percussion things indicative of what the band would do with the instrumentals on the next album. This, however, is much more catchy and enjoyable than them, with the rhythm section standing out a little more than Banks and Hackett.In the end, not my favourite, but a solid four star effort. Perhaps not recommended to those who prefer the harder rock aspects of Gabriel-era Genesis, or those who healthily dislike acoustics. If, like me, you fall partly into the first of those two categories, it may need a fair few spins to grow on you.Rating: Four Stars, though personally a borderline three Favourite Track: Mad Man MoonEdit: just saying that I am getting fonder and fonder of this. Hackett's subtleties are becoming thoroughly, thoroughly enjoyable, and the album as a whole has grown on me massively since I wrote the review. Not love at first listen, but nonetheless, love."
    },
    {
      "reviewer": "Roland113",
      "date": "Posted Monday, May 19, 2008",
      "rating": 5,
      "text": "A Trick of the Tail - ReviewWell what can I say that hasn't been said by various reviewers before me?I gave this album a five star rating as it is my all time favorite album, without question.We'll go song by song then finish up with a couple of general comments.1) Dance on a Volcano simply rocks (10/10). The beginning of the post Gabriel era starts out with a bang as the powerful intro starts us out. The song weaves through the chaos and hell of a volcano as an allegory to love. One of the highlights is Mike Rutherford's bass, especially towards the end. 2) Entangled is hauntingly beautiful (10/10). The first half is a lovely guitar and vocal bit, the harmonies on the chorus are fantastic. Follow this up with Tony Banks atmosphere and you have a lullaby for the ages. 3) Squonk is simple and powerful (9/10). \"Like Father Like Son\" the immortal words that got Phil Collins the gig, blare out and grab you. This is not The Lamb. 4) Mad Man Moon is chock full of proggy goodness (10/10). Tony Banks' piano work is outstanding, Phil's voice, soulful. 5) Robbery, Assault and Battery is fun (7/10). A rollicking tale of cops and robbers, not the deepest song on the album, but fun nonetheless. 6) Ripples is a sad lament (9/10). A somewhat sad song exploring the passing of youth, \"Ripples never come back\" Phil mourns in one of their most beautiful ballads. 7) A Trick of the Tail always makes me smile (10/10). The story of a creature, bored with his life and seeking adventure. He finds that adventure in the form of humanity. Maybe the grass really isn't greener. In all honesty, this is not terribly progish, but still a fantastic song. 8) Los Endos sums up the whole she-bang (10/10). A jazzy, Santanaesque vamp recalling many themes of the album. The reverse snare transition to the Squonk theme is otherworldly.Throughout the entire album (with the exception of the instrumental 'Los Endos'), the focus remains on story telling. The characters on the front of the album only give a hint of the depth that each of them have. The sadness of the seamstress looking in the mirror gives but a hint of the emotion of Ripples. The mirth of the creature, the surprise of the robber. Each one has their story.The musicianship is wonderful as well. Each of the four have their moments of brilliance and put forth a solid effort. Everyone is showcased on 'Dance on a Volcano' and 'Los Endos'.All in all, this remains my favorite Genesis album, and in fact, my favorite album of all time. If you write this off as the beginning of the end, then I believe that you'll miss out on a wonderful set of music."
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Saturday, July 19, 2008",
      "rating": 5,
      "text": "Mad Man PhilGenesis is a remarkable group. Usually a really great band has one or maybe even two members that stand out as having something really special, Genesis had (at least)fiveunique talents among its ranks! When Peter Gabriel left, Phil Collins stepped up and started singing, revealing that he is every bit as good as Gabriel was! Who would have believed that one of the best drummers in the world also was a great vocalist? Gabriel went on to a successful solo career and Collins brought the band onwards to new heights. A few years later Rutherford would similarly step up and take over guitar duties when Steve Hackett left and 'then there were three' and the rest is history, as they say.A Trick Of The Tale is actually my favourite Genesis album and one of my personal favourite albums of all time. There is nothing I do not like about it. Everything from the lyrics to the detailed art work to the vocals, the guitars, the keyboards, the drums, etc. Only a handful albums in my collection is as close to perfect as A Trick Of The Tale. Phil really grew with the challenge and he sings extremely well on this album as well as drum like a mad man on Los Endos. This song became a standing concert closer on most subsequent Genesis tours and Steve Hackett plays it too with his own band. Steve is one of my favourite guitar players of all time and A Trick Of The Tale might be his finest hour. Tony and Mike are doing an excellent job too.The dramatic Dance On A Volcano opens the album with an almost metal riff. Entangled and Ripples are much softer songs with soaring keyboards and guitars. Los Endos is a Jazz-rock/Fusion instrumental reprising a theme from Dance On A Volcano that is a perfect (and unusual) way to end the album. All the songs are simply great and the whole album holds together very well.My re-mastered CD version is the new CD/SACD & DVD version and I think the sound is great on the CD and the visual extras are worth while for fans.This may not be as groundbreaking as earlier Genesis albums, but this is still a masterpiece!"
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Saturday, August 2, 2008",
      "rating": 5,
      "text": "ah..yeah!So avantgarde and so great!You need that music to feel the world,amazing!So different Genesis album,but in same time exceptional one.This album is a mixture between compound metre,ballads and avantgarde progressive elements tough for understanding.Perfect rock songs like Vance on a Volcano and Los Endos.Ballads like Entangled and part of Mad Man Moon and of course A Trick of the Tail.Little avantgarde like all but first two and last two.The characteristic of the album is frequent tempo changes.Typical progressive rock album of high quality!"
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Monday, September 1, 2008",
      "rating": 3,
      "text": "This album is the first one in the Genesis canon that I happened to listen to. While it's not that bad of an album, I've heard some better efforts from them with Peter Gabriel in their line-up. Not that A TRICK OF THE TAIL is horrible by any means, but the whole of the album sounds too ''pretty'' for my liking.Take the title track; it has that immediate infectiousness of any delicate art-pop song, but either I played it too much or it's overbearing prettiness got to me and I really can't listen to that song with the same scope as most proggers. This album sounds like the end result of a serious band trying to merge art and pop into one package of which the end result sounds flat out boring to my ears.Only certain songs can please me at certain times and there isn't a reason why I prefer some songs to others. Take ''Entangled'' and ''Ripples...''; both are very long, very quiet acoustic numbers that are meant to be very pretty, but it so happens that ''Ripples...'' does nothing but bore me while ''Entangled'' can keep my interest for a while.For the most part, there's not much life being pumped into the band here, other than Mike's bass which is astounding. ''Robbery, Assault and Battery'' and ''Los Endos'' are the least boring of the batch, and I like ''Entangled'' very much, but it's too sleepy, serious and pretty for me to really take to heart. It's missing that bite that Peter Gabriel possessed on their earlier classics."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Sunday, October 19, 2008",
      "rating": 4,
      "text": "No trick of the earGenesis' first album without Peter Gabriel would find them walking of unfamiliar grounds in terms of direction and composition, yet somehow they managed to churn out something befitting of the ''classic'' Genesis sound. Everyone is still at the top of their game and Hackett seems to have turned the volume knob from 5 to 11 as he's much more dominant in this carnation of the band. Phil has taken on the vocal parts - but for all those nervous about how it sounds, don't be worried at the moment, since for this album and the next he'd be trying his best to sound just like Gabriel, and succeeding to a large degree. He still takes a proud seat behind the drums and proves that he's still a capable drummer, meaning that later album's drum machines would not yet be in use. There are tunes on the album that can rival some of the best that the band has released, and with their poppier side starting to shine through this album can very very accessible for those weary about more sophisticated works from the band likeSelling England By The Pound.What really makes this album great are the songs that have a perfect combination of the band's later and older sound. This album really is a transitional work, and though it has its feet set more firmly in the band's 70s works than the later stuff, it really does have a ''catchy'' feel to it. Likely the best example of this is the title track,A Trick of The Tailfeatures a sing-along chorus and yet an incredibly ''progressive'' air to it with Hackett's superb playing and Bank's backing atmospheres and frontwards keys.Squonkshows the band inLed Zeppelinmode with a chunky riff and aggressive vocals - a side of Genesis not often seen.Robbery, Assault And Batteryis another more upbeat tune with story-telling lyrics and some very impressive instrumental parts.But the best had yet to be mentioned. Two songs on this album epitomize what Genesis does best, the openingDance On A Volcanois a majestic powerhouse with an unforgettable intro from Hackett. A speedy pace brings back memories ofDancing With The Moonlit Knightand excellent keyboard solos from Banks in the middle and end really show off some ''classic'' Genesis.Los Endosis an amazing instrumental that ends the album by revisiting themes used throughout the record. Colins is on fire on this track, and listening to him go mad on the skins is almost enough to make any progger forget about what he was about to do to the band on their upcoming albums. Almost. This is one of Genesis' more speedy moments, and this song really rocks! Something you don't often hear about the band.Other songs on the album are pleasant, if not as impressive. Most of them feature the same kind of playing that you'd expect from the band, and some very impressive solos. Still, these songs don't necessarily stand out above the rest, although a Genesis nut would tend to disagree with this statement.Entangledis a slow and pretty piece featuring a somewhat haunting chorus, and in a similar vein is the lengthyRipples. While these songs are quite good, this album is a its best when the band is trying something new, not just sticking to what they know.In the end this is still a classic Genesis, and indeed, a classic prog album. While it may not have quite the same punch as some of their other material, this album is undeniably great. 4 volcanoes out of 5 - the band would mature for the second (and last) album with this line-up, but this album is definitely worth investigating for any prog fan. An excellent addition to your collection."
    },
    {
      "reviewer": "progrules",
      "date": "Posted Saturday, December 27, 2008",
      "rating": 4,
      "text": "This going to be my last Genesis review because it's the last one I had to do of their great era and we all know which era that is. Like previous (Nursery Cryme) also this one has me in doubt for a long time now what the rating will have to be. Again it's in between 3 and 4 stars to me and again the song by song rating will have to bring the decision.Dance on a Vulcano is one of the better to me. Classic track in the Genesis history I believe. So typical for what they are about, second part is really special, first half more accessible, great composition (4*).Entangled is more of a ballad, a good one but not one of their all time best to me though the mellotron towards the end will always be something special of course (3,25*).Squonk is one of those songs I don't really have a downright opinion about. It's a good song but average for Genesis standard (3,25*).Mad Man Moon is more interesting to me, more versatile, better composition than previous song. Great track (3,75*).Robbery, Assault and Battery was always the stand out song for me on this album, accessible and recognizable, first signs of a more popular sounding Genesis ? (4*)Ripples is another highlight, a wonderful song mainly thanks to great vocals by Phil (3,75-4*).A Trick of the Tail is the shortest track of the album. The title track is just as Robbery a more popular one proving that Genesis is slowly but surely leaving their symphonical touch as they had a few years before this (3,5*).Los Endos is the closing instrumental track closing the album in style (3,5*).In fact I expected this album to finish above the 3,5 average and it did. But not really in a convincing way. If I compare it to my previously reviewed Nursery Cryme I think this one is slightly better overall but it lacks the real highlight that a song like Musical Box is. Still 4 stars."
    },
    {
      "reviewer": "lazland",
      "date": "Posted Saturday, January 17, 2009",
      "rating": 5,
      "text": "I'm listening to this now, and have been whilst writing reviews of a couple of other LPs - I nearly forgot just how good this album is.Written after PG left, it is a bold and stunning statement by a group of songwriters who refused to give up after their most recognisable element left.Dance With A Volcano has exceptionally complex vocal and instrumental arrangements, whilst Entangled is simply a stunning ballad, beautifully sung by Collins with the first hint of the surround keyboard wall of sound that Banks would make very much his own.Squonk is again a very complex piece of musical arrangement and is simply fun. Mad Man Moon is for me the finest Banks composition ever - a lovely ballad with delicate keyboards and a very sympathetic treatment by Collins.Robbery Assault & Battery is great fun, whilst Ripples finally convinces all just how crucial Steve Hackett was to this band. A story of growing old and lamenting that process, his guitar solo simply cries out to us in that story.The title track has been attracting some radio airplay recently and the testament to Los Endos is that it is still played by Hackett and the band in gigs to this day, instrumentally exceptional and a joy to listen to digitally with decent surround sound speakers.I opened up the sack, and all that I found was a pool of tears, just a pool of tears. What a work of genius and proof that Genesis were NOT just about Gabriel, but a collective of superb songwriters and performers.An essential addition to any prog rock collection."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Friday, February 13, 2009",
      "rating": 3,
      "text": "It is always troubling when a lead singer leaves a band, particularly a band that derived so much of its sound from that person's voice, and so much creativity out of that person's mind. Even though Peter Gabriel was not with them, Genesis proved that they could produce noteworthy progressive rock. Phil Collins has a more melodic vocal style than that of his predecessor, which is not to claim in anyway that he is superior; whereas Gabriel was entertainingly dramatic, Collins shows that he is more of a pop singer than anything. Regardless, he serves his band well, and does a fine job throughout the album. Tony Banks is really the star of the album, as nearly all of the compositions here rely so heavily on his keyboards. Guitarist Steve Hackett and bassist Mike Rutherford do not stand out much at all, even if the former does bring back to the mind of the listener his brilliant moments in works like \"Firth of Fifth\" or \"Hairless Heart\" with that swelling guitar of his. Overall, this is a fine album, very consistent, with no single track standing too highly above the others (a trait consistent with all the Genesis releases up until this point). The whole album, however, does pale a bit in comparison to earlier endeavors.\"Dance on a Volcano\" Hackett's guitar and Banks's synthesizer take to the fore in this opening track. The bass and drumming are almost just as strong, and Collins does his best to fill some amazingly big shoes. More than anything, though, this is Banks's song, as his synthetic sounds dominate the last part of the song. The tones do sound like carryovers from the previous album.\"Entangled\" More in the vein of Genesis's first few major albums, this track relies heavily on acoustic guitars, not the least of which is the fat sound of the twelve-string. With an amazing vocal melody, the song does not fail to please; the layers of guitars are great, and the harmonies are incredibly enjoyable also.\"Squonk\" A strong step toward the 1980s sound where Genesis was heading, \"Squonk\" does boast a very good melody, even if the instrumentation is largely lacking. The music exists as a vehicle for the narrative lyrics. This was also the audition piece, according to the band, that Collins performed to become the new lead singer for Genesis.\"Mad Man Moon\" Although it begins with piano and flute, the song is largely based around Banks's Mellotron and piano. The instrumental middle section is somehow dark and splendid, evocative of the previous album, featuring fast riffs on synthesizer and piano.\"Robbery, Assault, and Battery\" Upbeat and amusing, this track hearkens back to the more histrionic approach of Peter Gabriel, with Gabriel singing in different voices to convey the story. It has a heavier sound, again looking-forward to the 1980s sound the band would soon adopt, except for Banks's impressive keyboard soloing over an odd time signature, which is reminiscent of his glorious work during the second part of \"The Cinema Show.\"\"Ripples\" The quiet moment of the album (and strangely the longest track on the album), this is largely dependant on the twelve-string acoustic guitar as many classic Genesis songs had been. This is by far the most pleasant song on the album, with delightful lyrics and a lovely melody. During the instrumental section, the volume of Hackett's lead guitar swells in, with Banks responsible for most of the accompaniment. The music build to a final, majestic repeating of the refrain.\"A Trick of the Tail\" The title track has a fun melody and enjoyable lyrics. For once, Rutherford stands out a bit more, his bass carrying the main theme. The words describe a devilish-looking creature who left his home to come to Earth, but wound up in a freak show. No one believed his story of homeland. Despite its structural simplicity, Genesis has strangely enough never performed this song live.\"Los Endos\" Peaceful electric guitar and synthesizers eventually give way to a charging rhythm and chunky bass. Banks' lead synthesizer tone is the same as that on \"Riding the Scree\" from the previous album. The piece includes excerpts from three different pieces, namely \"It's Yourself\" (a B-side to \"Ripples\"), \"Dance on a Volcano,\" and \"Squonk.\" During the final moments of the song, as it is fading out, Collins sings some of the last lyrics of \"Supper's Ready,\" perhaps as a tribute to their departed vocalist."
    },
    {
      "reviewer": "Nightfly",
      "date": "Posted Tuesday, February 17, 2009",
      "rating": 5,
      "text": "After the departure of Peter Gabriel Genesis had to prove they could still cut it without their charismatic frontman. Not only did they prove they could, but A Trick Of The Tail for me is a superior album to their last to feature Gabriel, The Lamb Lies Down On Broadway. The Lamb, due to Gabriel's insistence to write all the lyrics and plenty of them there were too, left little room for musical manoeuvres thus it lacked the longer tracks with all the excellent instrumental interludes that the band did so well. While A Trick Of The Tail contains 8 roughly equal length (give or take a couple of minutes) tracks it offered far more scope for Genesis to display their musical chops and thus bears more resemblance to the likes of Selling England By The Pound than The Lamb.It's a beautiful warm sounding album containing some of the bands most sublime moments with Entangled, Mad Man Moon and best of all Ripples which even my wife who hates Prog likes. While these more subdued pieces are all lovely songs the band also find time for their more explosive and dynamic moments. Dance On A Volcano is a fantastic opener, the scene being set by chiming twelve strings before the track explodes into life. Squonk is as near as Genesis had yet got to a straight forward rock song with it's simple John Bonham influenced rhythm from Phil Collins on drums. Robbery, Assault and Battery is a cousin of Harold The Barrel from Nursery Cryme with a short but superb instrumental section. The title track, while being the weakest song on the album is pleasant enough and the album closes with the blistering Los Endos, a stunning instrumental which in parts revisits themes visited earlier on the record. Such is the bands faith in it that it remained in their live set for the rest of their career.A fantastic album then, despite the fact that guitarist Steve Hackett does not feature as much as he could, no doubt in part down to the fact that he didn't have a lot of ideas to bring to the table, having used them all up on his first solo album, Voyage Of The Acolyte. Nevertheless it remains an essential seventies symphonic prog album that any fan of the genre will surely enjoy."
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Friday, March 27, 2009",
      "rating": 4,
      "text": "Back with a Vengeance, Losing the Rough EdgesThe first words we hear from now lead singer Phil Collins on _Trick of the Tail_ is \"Holy Mother of God you got to go faster than that..\" and already the music is heavier, more crazily syncopated, and better produced than anything Genesis had ever created. The boys were making an emphatic statement that they were just fine without Peter Gabriel, thank you, and in fact were \"Gonna start doing it right.\" Having felt pushed into the background during the exhausting Lamb tour, Genesis had some fire that was ready to explode. The result of course is the song Dance on a Volcano.Quickly though, we see that this new Genesis is not going to be all fire. Phil Collins' much smoother voice finds its own element in softer material, starting with Entangled, a solid story-song. While one could imagine Gabriel doing the verses, with the grand chorus, a new Genesis sounds emerges. Harmony vocals with big echoes in lockstep, something absent for the most part since Anthony Phillips' departure, now return. This quiet balladry reaches its peak on Ripples, a beautiful song that again seems initially reminiscent but builds to a huge, strummy \"Sail Away\" refrain.Squonk, the third song, points to the future of the band, beginning with a plodding 4/4 and shimmery guitars. Very behind the beat, it wouldn't be out of place on pre-Invisible Touch 80's Genesis albums (though we'd have been gleeful if that sound reached this level in those days). Collins sounds like himself, rather than imitating Gabriel, which he does frequently on this album. Despite this, he lacks Gabriel's expressive range, his level of eccentricity, and frankly, his level of literacy. Though the lyrics here are fine, none match the nuance of Gabriel-era Genesis. Collins' sense of melody and a hook are excellent, however, and on the albums namesake track, the English whimsy that had always been a part of Genesis reaches a previously unreached peak.Despite a mild mid-album lull with Mad Man Moon and Robbery, Assault, and Battery, the overall quality of the songwriting here is quite good and the performances are extraordinary. The ending instrumental, Los Endos, is a part of the Genesis canon for good reason. Finally returning to the fire and energy that they opened with, the band shows us some of their astounding virtuosity in a frenetic finish. The rhythm section races along at breakneck pace before slowing into a dreamy key sequence and finally some reprises of the melodic themes of the album.All in all, the boys succeeded in shedding their dramatic star in convincing fashion. It is indeed an excellent addition to any prog collection."
    },
    {
      "reviewer": "progkidjoel",
      "date": "Posted Friday, May 1, 2009",
      "rating": 5,
      "text": "Genesis: A Trick Of The Tail.Review by ProgkidjoelGenesis' \"A Trick of The Tail\" is the first post-Gabriel Era Genesis album, and possibly the best. This album, although only 8 tracks in length, never ceases to amaze, entertain or amuse the listener.1. Dance On A Volcano (5:53) One of my favourite Genesis tracks ever, this great track opens with a flowing melody and an interesting guitar and drum pattern. Quite a challenging listen for the first few tries, this song is sure to amaze and amuse. Phil Collin's vocals were particularly strong on this track, and led alot of the musical brilliance to be found on the first track of this album.[4 Stars out of 5]2. Entangled (6:28) A slow, flowing, harmonic piece which carries on a great lyric with yet again great vocals. Quite remmenisent of \"The Musical Box\" from Gabriel-era Genesis, this track is one of my favourites of the album. The lyrics to this track are the leading star, and boy, do they shine.[4.5 Stars out of 5]3. Squonk (6:27) A squonk: (Not a word for word quote) Is a beast, which when threatened, scared or entrapped can dissolve itself into tears. My favourite track from this album, and one of Genesis' best ever. The drum track to this song is absolutely great, powerful and rhythmic, yet at the same time, incredibly metronomic in a way which lets the vocals flow over the top. The keyboards at the chorus to this song are fantastic, and so is the Lyric. One of my favourite Genesis lyrics ever, \"If you don't stand up, you don't stand a chance\" is a great explanation of a Squonk.[5 Stars out of 5]4. Mad Man Moon (7:35) One of the coolest prog tracks I'd heard up to that point, this flowing, piano-led ballad is fantastic. One of the very first songs I ever learnt on piano, I love this song to bits and will never forget it.[5 Stars out of 5]5. Robbery, Assault & Battery (6:15) More of a comedy than a song, this track is as amusing as it is fantastic and reminiscent of Gabriel-Era Genesis. The lyrics convey the story of this track fantastically, and never cease to entertain, even after numerous listens. The instrumentals on this track are also very great, and add to the overall depth of this track.[4 Stars out of 5]6. Ripples (8:03) Another semi-space rock track, which is quite similiar to entangled, this is quite an interesting track. It's high vocals and flowing piano melody at the chorus are quite deep, and make this song feel very... Thick? In an emotive way. Deep would be a better word to use. A great track, none the less.[4 Stars out of 5]7. A Trick Of The Tail (4:34) One of the best EVER Genesis' tracks, the title track of this album tells the tale of a beast, who left his home in search of adventure, only to be captured and riticuled by humans. This is one of the defining tracks of Collins-era Genesis, and should not be overlooked. Not only one of the most memorable title tracks ever, but this song delivers brilliance in a very \"Supper's Ready\" way, and does nothing other than entertain and engage both the old and new Genesis fan from beggining to end.[5 Stars out of 5]8. Los Endos (5:46) My least favourite track from this album, I didn't see what the point in adding this track was. Its a flowing epilogue to a great album, displaying the dynamics, elements and harmonies from the best tracks on the album, but never the less, I found it incredibly dull in comparison to the rest of this great album.[3.5 Stars out of 5]Closing thoughts:The production value on this album was great, albeit a little bit too treble concentrated. Where the bass is visible, it is great, but it's a shame these moments are too scarce. An easily reccomendable, 5/5 album for any proggy, old or young, Gabriel or Genesis, symphonic or Neo.Final rating: 5/5 Stars (NOT an average) -Joel G"
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Sunday, September 20, 2009",
      "rating": 3,
      "text": "A Trick of the Tail is the last interesting Genesis album. Not that they wouldn't do any good songs anymore, but here there are still enough of them to satisfy our thirst. But rating it above the Lamb Lies Down on Broadway? with dreary sentimental stuff like Entangled or Mad Man Moon? You must be kidding.The reason for the many good songs is the genius of Steve Hackett of course. His trademark style is all over this album making it almost as good as his first solo album Voyage of the Acolyte. Almost, we must admit, because there's a few occasion where Collins takes the spotlight and gives us a first idea of the bland soft pop direction he would steer Genesis in. Entangled has a nice closing section but the pop song at the heart of it is a punishment to endure. The same can be said for the lackluster Mad Man Moon and Ripples.Now, that brings us to the reason why you can't convince me this deserves more then 3 stars. All good tracks here appear in a better version on Seconds Out, so if you get that live album instead, you get all the good tracks from this one plus a good deal of classic Genesis tracks in very pleasing renditions by Phil."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Monday, December 14, 2009",
      "rating": 3,
      "text": "This, the first Genesis album without long time front man Peter Gabriel, shows promise, but also shows a few signs of the morass the band will fall into just a few albums later.Banks and Hackett seem particularly charged on the bookend pieces of the album,Dance On A VolcanoandLos Endos. Their performance exceeds most of their previous output. This song is forceful and strong, with unexpectedly powerful solos from both guitar and keyboards.Unfortunately, between the bookends are much lesser songs.Squonkis lumbering prog that never overcomes it's slow pace.Mad Man Moon,Robbery, Assault & BatteryandRipplesare all plain MOR, with proggy breaks that save them from total worthlessness.EntangledandA Trick Of The Tailare light prog, nothing more.At least this album has some value."
    },
    {
      "reviewer": "friso",
      "date": "Posted Sunday, December 27, 2009",
      "rating": 3,
      "text": "Genesis - A Trick of the Tail (1976)This is one of the early Genesis albums that's very hard to rate. It has some moments of brilliance, but it also has weaker parts. Furthermore the recording is done quite bad. The strange out of space sound of tracks like Dance on a Vulcano and Squonk is just horrible. Why this thick, sticky recording? Why not record all instruments in a way it doesn't sound like one big blur? Is this modern? It does give the record an early pre-neoprog sound.Two songs are standouts on this album. Dance of a Vulcano is a very progressive track with a great main theme in 5/8. Throughout the track new melodies make this a very enjoyable song. Follow-up Entangled is one of my favourite Genesis tracks. The great gentle acoustic guitar parts in the beginning with the warm vocals of Phil Collings are truly emotional and effect my mood. The symphonic solo parts are uncomplicated but very effective. This is a great progressive ballad!From this point the quality begins to decline. Squonk has both good parts and bad parts but mainly suffers from 'modern' recording technologies and far-far-far-away lyrics from Phil Collins. Mad Man Moon is a bit better with a Kayak-like piano part in the middle of the song, but this song also introduces the mellow Genesis ballad style that would begin to bore on Wind and Wuthering.Robbery Assault and Battery isn't my cup of thee. I don't like the structure and the vocals on this song. The compositions has some potential though. Ripples isn't very memorable as is the title track that has just a nice main theme. The instrumental ending (Los Endos) is as good as the first two tracks and has a very progressive sound. Most of the melodies and sounds are taken from other songs of the album.Conclusion. An album with highlights and songs that leave me indifferent. The recording could have been much better and more human. This would have saved it from losing a star and going to three stars. Some tracks are quite essential progressive listening, others are not so important. Still this is must-have for fans of the band, excellent for fans of the genre and interesting for those interested in the neo-progressive genre. Three stars."
    },
    {
      "reviewer": "kenethlevine",
      "date": "Posted Wednesday, December 30, 2009",
      "rating": 4,
      "text": "GENESIS under Peter Gabriel's tutelage was a tough nut to crack. Brilliantly powerful at times and overly fanciful and obtuse at others, some of my favourites and duds came out of that era. In contrast, the two transitional albums before STEVE HACKETT left were warmer, more accessible, and more melodic while generally lacking in the genius of earlier works. It has been pointed out that \"Trick of the Tail\" and \"Wind and Wuthering\" might have been, in the final analysis, more influential to the modern prog movement than \"The Lamb\", and indeed more of a midwife in the birth of the neo prog movement. Of the two albums, this first is the stronger, due to the greater involvement of Hackett, the more inventive arrangements, and greater vitality.Phil Collins perches atop the vocalist stool surprisingly easily, and shines on the three best tracks - \"Entangled\", \"Squonk\" and \"Ripples\". The first is Hackett all the way, a simple almost CSN rivalling folk tune that ultimately scores via one of the most gorgeous mellotron choir passages ever conceived. \"Squonk\" is a precursor to Mike Rutherford's later work, at turns ripping and reflective, managing to garner sympathy for the poor and clearly unappealing rat-like critter. \"Ripples\" is another Hackett gem that extrapolates to his late 1970s solo work. Apart from the sparkling chorus, the instrumental section merges several melodies and might eclipse \"Firth of Fifth\" as a hair raising experience.Other good tunes include \"Mad Man Moon\", the fanciful title cut that smells like a wood nymph tail, and the monster closing instrumental \"Los Endos\". Even if \"Robber Assault and Battery\" sounds too much like what the group would later become, and \"Dance on a Volcano\" is as welcome as a skin eruption, tails wins heads down."
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Sunday, January 3, 2010",
      "rating": 3,
      "text": "Beginning of the EndThe first irony is that the loss of Gabriel assured the band were a shadow of their former self, even as their commercial viability would eventually reach the stratosphere. The second is that the band were becoming sonically more pleasing as they had less to say, they were becoming better musicians as they lost the quality in songwriting that gave the instrumental work purpose. How much of this was the result of Gabriel being the soul of the band will never be known and doesn't really matter. Sure, the decline could have continued even had he not left. His departure only meant it would be a certainty sooner than later. The band survived the loss of one of its emotional anchors in Ant Phillips. It would not survive losing the balance from the purist Genesis perspective. Commercial achievement is another thing altogether and something I don't care about. But at the very core issue of substance and gravitas, Trick of the Tail lacks what Selling England and its predecessors had in spades. Gone is the magic of getting lost in their world and its subtle dark overtones, replaced by plastic and a nice hum for your day.Trick of the Tail is wall to wall flowery prose without that indescribable Genesis spirit of the Trespass-Selling England years. With Collins ascension the songwriting would receive a boost in the separate areas of fusion and pop sensibilities. They would try out these interesting fusion inspired ideas to only limited success. Even at this stage you can clearly hear the beginnings of the mastery they would find in the embrace of mainstream, catchy directions. This is the beginning of the Genesis pop period even if it is still largely hidden within the prog cloak. \"Robbery\" and \"Ripples\" would lead to \"Your own special way\" which leads to \"Follow you follow me,\" and we all know where it ended up. Of course there is still plenty of entertainment here for the wider Genesis fan and I'm not saying it's a total disaster. Just that we have moved into a lukewarm 3 star territory and that's being generous. As a vocalist Collins lacks the passion and depth of Peter Gabriel. As a songwriter he proved not a capable replacement either which is one reason Trick is the beginning of the end of progressive Genesis. Some claim it the first neo-prog album. I'm not sure about that, but I am sure it's a shadow of the band I really love."
    },
    {
      "reviewer": "Marty McFly",
      "date": "Posted Saturday, January 9, 2010",
      "rating": 4,
      "text": "You better start doing it alright. Indeed, they just started, however, without Gabriel (who knows after all, whose fault it was, all we know is what they told us). So this is album of great expectations, both positive and negative ones, everyone wanted to know, how it will sound like without him. For prog's sake, Collins sounds exactly like Gabriel, I didn't notice any change here, which is of course sinister.Dance on a Volcanois great \"first after\" song, one of these A-class ones. Almost romantic melodies, that's my impression about most of songs here. Problem with writing reviews on this Genesis period is that most of elements in their music are the same. Still new and original, finding new way how to do these sounds, but you simply can recognize that it's Gen. At least till \"Wind\"4(+), end is pleasant (reprise) type of song. Like a knight, who stops traveling, turns around and overlooks his album and say: \"We have done it, it's good and we can get away with it.\""
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Monday, May 17, 2010",
      "rating": 5,
      "text": "The genie had escaped from the bottle and Genesis were free againPerhaps the overly creative Peter Gabriel was actually stifling the creativity of Genesis by overpowering them with his own creative juices. After Peter Gabriel left, many feel that the magic was extracted from the band, in a sense the cork had been popped and the genie had escaped from the bottle. Gabriel went on to do other great things and left the band dangling by a thread with the reluctant Phil Collins to take up where Gabriel left off. \"We came close to calling it a day when Pete left,\" Rutherford mentioned in an interview, \"It wasn't that we lost our nerve. We were always confident we could write the music, because Tony and I had done most of 'The Lamb.' It was just a question of whether the public would accept us.\" There was a lot of misconception that the band could not continue sans Gabriel. After the enormously popular \"The Lamb Lies Down In Broadway\" the band had to come up with something extraordinary as there was such an expectation with this new lineup. Could Genesis pull it off without the enigmatic Gabriel? The answer is a bonafide yes. This is perhaps one of the best Post Gabriel Genesis albums of all time. The musicianship is absolutely brilliant when you have the likes of Hackett guitar extraordinaire with, Banks, masterful on keyboards and mellotron, Rutherford, bass rhythm professional, and of course, percussionist Collins on lead vocals.It begins with the progalicious off kilter rhythms ofDance on a Volcanowith Banks, Rutherford, Hackett and Collins in full flight, a force to be reckoned with. The intricate time signatures are astonishing, a mixture of jazz fusion and complex melodies. I love the way the drums are off beat, not quite in time with the signature, but the off kilter metrical pattern is consistently off the beat and it works so well. The lyrics are quite amusing nonsense, and the time sig is chaotic in a passage of proggy delight,\"On your left and on your right, Crosses are green and crosses are blue, Your friends didn't make it through. Out of the night and out of the dark, Into the fire and into the fight, Well that's the way the heroes go, Ho! Ho! Ho!\"There is a chilling self prophecy towards the end with the estranged vocals\"Let the dance begin\", and we all know the \"We Can't Dance\" album and how that shaped their music for the worst, becoming commercial and radio friendly. In any case this opening track is brilliant Genesis and a killer to present the new Genesis. Hackett's guitar riffs are infectious and unforgettable on this track. This is the best track on the album, a tour de force of proggy rhythms and virtuoso musicianship.Entangledhas an excellent Hackett 12 string intro and the soft vocals of Collins accompanying. The track is essentially a folk ballad, the type that would grace every Genesis album from here on with Collins at the helm. The lyrics are all about a patient who dreams disturbing things, there is no slipperman or fox here, just a simple melodic balladic form,\"Madrigal music is playing, Voices can faintly be heard, \"Please leave this patient undisturbed.\" Sentenced to drift far away now, Nothing is quite what it seems, Sometimes entangled in your own dreams.\". The harmonies are quite nice, and even pastoral at times, especially some of those swells on the keyboards that add an ethereal quality. The end synth break is a highlight, showcasing Banks inimitable flair.Squonkhas a solid steady rhythm with very familiar lyrical style, the nursery rhyme or is that cryme style,\"All the King's horses and all the King's men, Could never put a smile on that face.\" The lyrics are very fairy tale in style, \"He's a sly one, he's a shy one, Wouldn't you be too. Scared to be left all on his own. Hasn't a, hasn't a friend to play with, the Ugly Duckling, The pressure on, the bubble will burst before our eyes.\"The story is all about the furry little squonk and it makes references to all sort of chidren's literature such as 'Snow White';\"Mirror mirror on the wall, His heart was broken long before he ever came to you...\"So Genesis were still maintaining the thematic content of past albums that was centred on fairy tales and nonsense rhymes which is nice to see. The lyrics that refers to the 'Trick of the tail' is here too,\"Now listen here, listen to me, don't you run away now, I am a friend, I'd really like to play with you. Making noises my little furry friend would make, I'll trick him, then I'll kick him into my sack. You better watch out... You better watch out.\"A great song that is quite popular among Genesis freaks.Mad Man Moonbegins with a dreamy flute sound and very soft piano. Collins gently sings in a melancholy way while the mellotron plays underneath,\"Was it summer when the river ran dry, Or was it just another dam. When the evil of a snowflake in June, Could still be a source of relief. O how I love you, I once cried long ago, But I was the one who decided to go. To search beyond the final crest, Though I'd heard it said just birds could dwell so high.\"This is a very pastoral song which changes feel at 2:45 with a piano interlude, played to perfection by Banks. This is a quiet sleeper track.Robbery, Assault and Batteryhas some of the more character driven lyrics we have become used to from Gabriel, but this time Collins plays the very English characters,\"Slipping between them he ought to have seen then, The eyes and their owner so near. With torch shining bright he strode on in the night, Till he came to the room with the safe.\"Collins uses a tough cockney accent on the next sections,\"Hello son, I hope you're having fun.\" \"You've got it wrong Sir, I'm only the cleaner.\" With that he fired, the other saying as he died, \"You've done me wrong,\" it's the same old song forever.\"The chorus is memorable, melodic and easy to sing along to in a live performance,\"Robbery, assault and battery, The felon and his felony...\"There are some compelling time sig changes and Banks is allowed to shine with his scintillating keyboard lead breaks. The section at 3:20 is great sounding like the type of style on \"Foxtrot\". The cathedral grinding pipe organ sound at 4:30 is majestic and powerful. The verses return, the storyteller vocals sing,\"I've got clean away but I'll be back some day, Just the combination will have changed. Some day they'll catch me, to a chain they'll attach me, Until that day I'll ride the old crime wave. If they try to hold me for trial, I'll stay out of jail by paying my bail, And after I'll go to the court of appeal saying, \"You've done me wrong,\" it's the same old song forever.\"This line repeats until the song ends. I like the style of this old school Genesis track.The last three tracks are featured many times in live performances as a trilogy and indeed on compilations. I had heard them many times but on this album they made a perfect ending to the album.Ripplesbegins immediately with trademark 12 string Hackett brilliance. The melody is very strong and memorable, one of the best of Collins quieter moments with the band. There is an uplifting chorus that soars,\"Sail away, away, Ripples never come back. They've gone to the other side. Look into the pool, Ripples never come back, Dive to the bottom and go to the top, To see where they have gone. Oh, they've gone to the other side...\"I like the instrumental break with violin style guitar and very well executed piano flourishes and an extended passage of synth. A fan favourite and performed live it is a gem.A Trick of the Tailis a bit of a transition between two treasures. The lyrics are a real feature telling the bizarre tale of a beast.\"And wept as they led him away to a cage, Beast that can talk, read the sign. The creatures they pushed and they prodded his frame, And questioned his story again. But soon they grew bored of their prey, Beast that can talk? More like a freak or publicity stunt...\"The melody is whimsical matching the Beowulf style lyrics. I always liked this as it is so different than anything else on the album, and a lot of fun, not taking itself seriously. I can understand why many feel this to e a low point on the album but it resonates with me, especially the infectious chorus,\"They've got no horns and they've got no tail, They don't even know of our existence. Am I wrong to believe in a city of gold, That lies in the deep distance, he cried and wept.\"The quest for the beast is humorous but it is intriguing, and streets ahead of any of those love ballads that were soon to permeate the genesis catalogue in the dreadful 80s.Los Endosis a true classic that has ended many Genesis concerts, full of incredible instrumentation and shades of light and dark textures. The drums, the tom toms are frenetic and driving, the guitar is riffing eloquent, and the bass is a key rhythm powerhouse. It settles into the familiar 6 chord keyboard pads that all Genesis fans know. Banks is absolutely stunning on this instrumental. At 4 minutes in there is a choral section and gradually building keyboard motif, until there is a type of reprise of album tracks, you can determine the various melodies. Collins even subliminally has a few lines of singing,\"There's an angel standing in the sun, Free to get back home.\". Then it fades into the distance. This was the perfect way to end an excellent album, with the band demonstrating their uncompromising musical genius.Overall, \"A Trick of the Tail\" is a wonderful beginning to the new lineup without Gabriel, proving the band can do incredible things even without their frontman, flutist. The songs will grow on you after a while and some have become part of Genesis folklore now, especially the last three tracks and the opening track. This progressive excellence was not to last unfortunately. There were three more solid albums with prog elements until 1981 when the band sold out to mainstream commercial radio snapping their prog apron strings once and for all and effectively destroying the trademark sound to become marketable to a mainstream target audience; adoring females. The music on this album is well accomplished and many guitarists love to emulate the work of Hackett on this and keyboardists can revel in the talents of Banks. This is a very pleasurable album with much to recommend it; one of the best from 1976. I was not going to go as far as to call it a masterpiece on first listen, but it really grew on me and I get the chills when I hear some of that work from Hackett, and Collins is at his best here, therefore it is perhaps the best work Genesis did sans Gabriel, and that is worthy of 5 stars without question."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Saturday, June 5, 2010",
      "rating": 3,
      "text": "Trick is one of those albums that you could take a lot of perspectives toward. First, you could be thrilled that Genesis were continuing and just happy to have more. Conversely, you could forever be longing for the Gabriel days and just not terribly interested in whatever came next. Or, you could have been hoping that without Gabriel, the players would be able to really cut things loose and focus primarily on extraordinary instrumental work, as could be found in Selling England and Foxtrot.I suppose I fall somewhere toward the latter option, as I certainly believe the Gabe's contributions were far from perfect, but I also enjoyed a good deal of the creative songwriting and instrumentation that were hallmarks of early Genesis.Instead, in Trick of the Tail, we have the slow trend toward pop, with plenty of prog mixed in. I'd agree that some prog is better than no prog, but in my opinion, the prog content in Trick is much lessened than in their previous albums. The good news is that this still puts this album ahead of many other prog albums!Highlights: Dance on a Volcano, Robbery, Assault and Battery, and Los Endos. Here, the prog is solid but not great, or consistent for that matter. There is plenty of experimentation in rhythm, such as the 13/8 flight of fancy in Robbery. In some ways, Los Endos eliminates the need for some of the other tracks, such as Squonk, because I would have preferred them to just rock out a bit longer on the closer than plod along for 6 minutes of Squonk.The rest? It's all solid, but I find some of it somewhat dull (Entangled, Moon, Ripples), even with the nice 12-strings and spacey keys throughout.So, A Trick of the Tail is good prog, and is also a good prog album (including a major plus for the album cover and sleeve), but is never great to my ears. I come back to it only rarely."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Thursday, September 16, 2010",
      "rating": 5,
      "text": "1. \"Dance On A Volcano\" (5:53) Great opening--especially the second section. Genesis is not dead! Not sure what the song is about, but it works for me! (8.75/10)2. \"Entangled\" (6:28) IMO, one of Genesis's greatest songs--top five! Tony's eerie solo, the 12-strings and bass pedals are awesome. Steve's mixed way too quietly! (10/10)3. \"Squonk\" (6:27) Great opening guitar hook, good vocals with really weak lyrics (Is this the pre-history to \"A Trick of the Tail\"?). The song really never goes anywhere. (It was pretty boring--a letdown--in concert.) (8.5/10)4. \"Mad Man Moon\" (7:35) Beautiful song, sensitive, melodic, varied and rich. One of Tony Banks's most majestic. (13.5/15)5. \"Robbery, Assault & Battery\" (6:15) Genesis had a habit of laying down some really interesting, really beautiful music and then, IMO, ruining it with either horrible lyrics or over-dramatic presentation. This is one of those songs. 8/10 musically + 2/10 lyrics and presentation = average of (7/10)6. \"Ripples\" (8:03) A song I can never seem to hear too often or too much. I was always disappointed Hackett's guitar was mixed so far in the background and so thin. (13.5/15)7. \"A Trick Of The Tail\" (4:34) is actually a very cute, bouncy song. Theatric and mythic with a modern moral. A nice change of pace. Tight presentation; no fluff or excess. (9.5/10)8. \"Los Endos\" (5:46) An awesome overture/finale of this new adventure in Genesis world. (Great concert closer teamed with \"Dance on a Volcano\" and with Chester and Phil pounding away together in the background.) (9.5/10)\"Trick\" is not a bad album. In fact, it is a rather good album. Why they mixed Hackett so quietly into the mix, I'll never know, but I love hearing the drums, basses, and keys.I really get the argument that this album may mark the beginning of the Neo Prog era--that the \"classic\" prog era was over. There is just something 'different' about this and its counterpart \"Voyage of the Acolyte.\"B+/4.5; a near-masterpiece of progressive rock music despite the fact that it holds a much dearer place in my heart."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Wednesday, December 8, 2010",
      "rating": 4,
      "text": "The first release from a shaken Genesis was also the last truly consistent studio release of theirs! The band did astonishingly well without Gabriel's father figure and proved that they had what was needed in order to continue on their own.Dance On A Volcanohas everything that I love about great Genesis compositions - sharp melodies, amazing interplay between the members and a touch of music magic! If there is any real criticism that can be uttered about this release then it would be pointed towards the lyrics. If you don't believe me then try closely examining the lyrics toEntangledand tell me that you actually consider them to be worthy of the music that they accompany.The rest of the material, leading up toRipples, isn't as masterful as the two opening tracks but they do a good job of expanding the band's sound to new areas where the collective hasn't yet traveled. BothSquonkandMad Man Moonfeature great instrumental arrangements even if the compositions themselves might not be top notch. Still it's the ballads that seem to dominate this album and they get to a hauntingly beautiful conclusion withRipples. Steve Hackett's guitar, towards the end of the track, can only be resembled to that of a cherry on top of a perfect desert that you want to consume over and over again!Since I'm still talking about the individual tracks, I might as well come out and admit thatLos Endoshas never been a favorite of mine. Yes, it's a fun little conclusion to the album but it adds nothing to the already quite impressive album for me. This is something that I really can't explain, but if there are others who agree with me then please let your voice be heard. In conclusion,A Trick Of The Tailis a great Genesis album that returned the band to the formula ofSelling England By The Poundand showed the world that the quartet still had what it took in order to conceive great music.***** star songs: Dance On A Volcano (5:53) Entangled (6:28) Ripples (8:03)**** star songs: Squonk (6:27) Mad Man Moon (7:35) Robbery, Assault & Battery (6:15) Los Endos (5:46)*** star songs: A Trick Of The Tail (4:34)"
    },
    {
      "reviewer": "colorofmoney91",
      "date": "Posted Friday, April 8, 2011",
      "rating": 4,
      "text": "A Trick of the Tail is the album that marks the era where Phil Collins starts his role as the lead vocalist for Genesis, and I always considered him to be superior to Gabriel in vocal style for being more controlled and serious.\"Dance on a Volcano\" features some nice technical chops that I don't recall hearing much of in Genesis' earlier material, and is kind of aggressive. The main motif of the song is quite catchy, and makes the track stand out more than it would otherwise, as nothing else really is significant other than the technical musicianship.\"Entangled\" is a very beautiful acoustic-folk ballad that really reaches me emotionally. I've always felt that Genesis had strength in writing these beautiful acoustic songs. This track is soothing and I consider it to be stretched out to a very appropriate length at almost 7 minutes, and the ghostly effects near the end really do wonders for the atmosphere. This is one my personal favorites from this album.I consider \"Squonk\" to be one of the earliest examples of neo-prog. It's progressive and lightly poppy with very strong synths throughout that give the song a heavy, monstrous vibe. The track is really catchy, and Collins really lets his vocals shine. This very strong track is one of the best on the album.\"Mad Man Moon\" is a beautiful track with lots of soothing mellotron, and the vocals on this track really shows how Phil Collins vocals suit this style of softer songwriting much better than Gabriel. The song moves through a few passages that are all beautiful, and this track really sounds like it could have been a Renaissance song from the Ashes are Burning album. Very beautiful indeed.\"Robbery, Assault & Battery\" is a slightly bouncy and poppy song with nice staccato mellotron lines, and despite its name it is actually quite a fun song. The chorus is very catchy and is easy to sing along to, and kind remind me of \"I Know What I Like\" from Selling England by the Pound. It eventually progresses into a nice solo on the keys backed by funky bass that takes up most of the track.\"Ripples\" is another slowly paced song that is similar to \"Mad Man Moon\", but gets slightly more aggressive in the middle. The song goes from beautiful folky guitar picking, to fantastic piano lines set to a fast paced beat during the second half of the track. The light guitar solo near the end is very ethereal and calming. Collins again lets his voice shine, and this is one of the best tracks on the album.The title track is another bouncy and poppy prog rock song that is highly enjoyable. This track also reminds me of \"I Know What I Like\". The beat is steady throughout which makes this very accessible to anyone.\"Los Endos\" is an aggressive and bass-heavy song, with a very symphonic feel to it. It progresses through a few different passages, but maintains an excited feel throughout and is the best ending for a Genesis album that I've ever heard. Very strong instrumental ending to a fantastic album.I feel like Gabriel leaving the band was mostly a good thing, and that Collins at the front profoundly improved the songwriting. Every song here is memorable and enjoyable, and often beautiful. Collins has a voice that suits the band far better, and I would highly recommend this album to any symphonic prog fans, even though I'm not really one."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Sunday, October 9, 2011",
      "rating": 5,
      "text": "Whilst Phil Collins' tenure as Genesis lead singer would eventually wind up with the band abandoning their prog rock past almost completely, it couldn't have started out better. A Trick of the Tail is a resurgence of the nostalgic, pastoral style of Nursery Cryme (complete with preoccupation with Victoriana), but on top of that presents some of the best instrumental performances from the band, with Dance On a Volcano, Squonk, and Los Endos being particularly worthy of mention.On top of that, Phil really comes into his own as a singer on songs such as the comedic and whimsical Robbery Assault and Battery (which like the best Gabriel era material manages to be whimsical without being embarrassing) or the emotionally moving Ripples. In presenting an updated vision of the pastoral prog of Genesis' earliest days, A Trick of the Tail and its successor go a long way in making sure the Phil Collins era has at least a few albums worthy of the band's illustrious past. It doesn't quite make up for We Can't Dance or Invisible Touch, but let's be honest, neither does Nursery Cryme or Selling England By the Pound."
    },
    {
      "reviewer": "rogerthat",
      "date": "Posted Sunday, July 15, 2012",
      "rating": 4,
      "text": "Genesis had a seriously talented bunch of musicians but what they lost with the exit of Gabriel was a measure of character and personality. Consummate professionals that they were, they could still put together excellent albums. But the most immediately striking aspect of A Trick of A Tail is it does not even attempt to make a statement and is safely along the lines of what Genesis fans would expect from their band. This might please those who disliked the alleged pretentiousness of Lamb Lies Down On Broadway (the charting performance seems to suggest as much) but it is what makes me hesitate using the greatest superlatives to describe the album.The lack of a statement is also evidenced in the unusual diversity of styles (for a Genesis album) utilized here. It does not, however, seem to be the Lamb-like diversity of brilliance flowing from a band at its very peak and indicates confusion and irresolution to me. Dance on a volcano and Los Endos mildly evoke the fusion scene, Entangled is gentle and pastoral while Mad Mad Moon and Robbery Assault and Battery seem to be rooted in the SEBTP style.As the above might indicate, Genesis don't really evidence much growth here. Perhaps, the prevailing circumstances forced their hand and they wanted to stabilize the ship at this stage. I don't know if that's all there is to it, though, because Genesis would continue to be somewhat stagnant for the next couple of albums before taking artistic left turns in the pursuit of commercial success. It could be that their ambitions had reached a dead end and there was nowhere left for them to develop their signature further.Whatever it may be, this somewhat takes the sheen off the musical experience. Ripples is the only track that brings something fresh to the table. Clearly Hackett driven (even though Banks drowns his wailing guitar in a wall of keyboard), it brings forth a soaring, ethereal, and yet emotional, dreaminess and utilizes Collins's ability to stay melodic even as he hits powerful high notes well. One of my all time favourite Genesis tracks.Right, Collins! This is Collins's first major outing as a singer to the best of my knowledge. Overall, he makes the transition a lot smoother than it should have been because he doesn't, ultimately, sound completely unlike Gabriel. He sings Squonk with the kind of gusto that might have been beyond Gabriel's reach. But his lack of confidence hurts when the music is sentimental or humorous and he is further crippled in his attempts by Banks's unconvincing lyrics.Banks's lyrics serve to underline the problem that haunts this otherwise excellent release: the lack of a clear vision or the power to articulate it emphatically. The production meantime is topnotch. Like SEBTP, the overall mix of styles and sonic elements puts this album a bit too squarely in the 'happy and clean' basket and there's not much darkness to contend with.4 stars then for a Genesis release that is hard to go wrong with and yet one that is, at least for me, hard to love to pieces."
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Monday, January 21, 2013",
      "rating": 4,
      "text": "Princess Diana's favourite album. The first without Gabriel and the first to actually sell decently. This greatly outsold all the band's previous efforts, going to #3 in the UK. However, the content itself sounds just like Gabriel-era Genesis...only without the Gabriel. I don't know if I prefer Peter or Phil in the lead vocalist spot. What I do know is that the band actually auditioned vocalists to fill Peter's shoes. One day Phil sang the song \"Squonk\" and the other members decided he would do. The sound and production here is a vast improvement over all previous albums and the music benefits from it. Like SEBTP, this is a long single album(for the time) being over 50 minutes long.Gabriel left because he complained the band was interfering with his family time. The other four wrote the majority of the music for The Lamb without him. It seems only natural that they could make another album by themselves. \"Mad Man Moon\" and \"Ripples\" were always my least favourite tracks on the album. The rest of it is some of the best music the band has ever made. \"Mad Man Moon\" starts off melancholic and easy-going. Later it gets more classical sounding. Once the drums enter the song gets more interesting. \"Ripples\" opens with vocals and 12-string guitar in a ballad/folk kind of way. Drums come in during the second chorus. Then it changes to more classical sounding with backwards guitar.\"Dance On A Volcano\" is one of the best openers of any Genesis album. Love the 'squeek, squeek'. What a great middle section; intense stuff. And what's more intense? The 'dance' at the end. Great stuff, just as essential Genesis as anything on their previous albums. \"Entangled\" is one of the band's most hauntingly beautiful songs ever. Collins was going to end up singing this song no matter what...because there are no drums(ha). Features the other dudes on 12 string guitars. Excellent overdubbed harmony vocals. I love how the keyboards gradually get added and by the end they overwhelm the whole song. That ending section is one of the greatest things you will ever hear on a Genesis album: superb mix of Mellotron choir, synth and 12-string guitar.\"Squonk\" is a highlight. What a groove! Always loved that keyboard melody before and after the 'chorus' part. Collins certainly shows that he is a capable vocalist for this song. The ending section is great although I wish it didn't fade out so quickly. \"Robbery, Assault & Battery\" is another highlight. Features some of Tony Banks' best ever keyboard work. Collins' drumming and vocals are great in this track. That middle section is just pure awesomeness. One of the band's most unique songs. The title track points towards the band's more radio-friendly future in a way that say, songs like \"I Know What I Like\" and \"Counting Out Time\" did not. It is the most 'single' oriented track on the album. The lyrics however are not your typical pop fare: humans being judged by creatures they don't even know exist.The best part is at the end...literally, \"Los Endos\". For many reasons, one of which is the incorporation of other songs into it. The beginning comes from another song called \"It's Yourself\" which the band wrote around this time but recorded later as a B-side. Towards the end both \"Dance\" and \"Squonk\" are reprised. When the track is fading out you hear Collins sing: \"there's an angel standing in the sun...free to get back home\". Those are lyrics from \"Supper's Ready\". Apart from that the track is completely instrumental. Love the jungle type rhythm used. The way the track just morphs and changes is brilliant. Just before \"Squonk\" is reprised is the best part: the drums, Mellotron and synth. Excellent.One of the groups' best efforts and the last really super terrific awesome one. The followup Wind & Wuthering is similar but not quite as strong (with even more hints of their radio- friendly future). After that Hackett leaves. They would get less proggy after he left yet sell way more albums. Gabriel would soon start his own solo career which would take him in a different direction entirely (although both would end up making R&B-influenced pop/rock hits in the 1980s). I would give this a 4.5 but \"Mad Man Moon\" and \"Ripples\" are going to make me knock it down to a solid 4 stars."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Monday, August 14, 2017",
      "rating": 5,
      "text": "Review N� 131'A Trick Of The Tail' is the seventh studio album of Genesis and was released in 1976. This is another album that represents another turning point into their discography. It's even considered by some people the first neo-prog album in rock history. After the release of the sixth Genesis' studio album 'The Lamb Lies Down On Broadway' in 1974 and during the live tour of that album in May of 1975, Peter Gabriel announced that he was leaving the group. At the time, and after the band auditioned over 400 lead singers to find a replacement front man to the group, and because Phil Collins had already provided some vocal work on Genesis, they decided that he was the right man to replace Gabriel.So, that change transformed the band from a quintet to a quartet. If the problem of the singer became resolved, it raised the problem of a drummer for their live shows. So, they decided to engage Chester Thompson which is an American drummer and session musician who played with Weather Report and Frank Zappa, to perform on their live shows.'A Trick Of The Tail' has eight tracks. The first track 'Dance On A Volcano' written by Tony Banks, Steve Hackett, Mike Rutherford and Phil Collins is a great opener for the album. This is a very progressive song full of frantic rhythmic variations. It's also a song with a beautiful melody and complex musical changes which correspond completely to the great expectations created around this new studio work. The second track 'Entangled' written by Banks and Hackett is a very beautiful pastoral piece of music that features a superb acoustic guitar work by Hackett accentuated by a fantastic mellotron work by Banks. It's a wonderful and melodic song that makes us glide and dream. The third track 'Squonk' written by Banks and Rutherford is a song with a fantastic and memorable opening and it has also a remarkable fantastic drumming work made by Collins. This is a very simple song with great choral work. The fourth track 'Mad Man Moon' written by Banks is one of the most beautiful songs of the album and is one of my favourites too. We can even say that this is one of the most beautiful songs ever created by Genesis. It's also a song with beautiful chorus and a wonderful keyboard work by Banks. It became as one of the most beloved songs of Genesis, especially in Hackett's musical era. This is really a truly fantastic progressive track. The fifth track 'Robbery, Assault and Battery' written by Banks and Collins is a very good song and particularly it has great imaginative rhythms and time changes. It's a song also with a fantastic instrumental middle section with great individual performances by all band's members. The sixth track 'Ripples' written by Banks and Rutherford is a very calm and beautiful song. It's a song with nice guitar and keyboard musical textures. In reality, Hackett's guitar work is absolutely stunning, accompanied by a soft and wonderful keyboard work by Banks. This track represents the quiet and calm track on the album. The seventh track is the title track 'A Trick Of The Tail'. It was written by Banks and represents a very accessible track with very interesting lyrics. However, this is, in my humble opinion, one of the less progressive songs on the album and it sounds more like a song made to be released as a single hit. So, despite be a very nice song, I sincerely think this is the weakest and less interesting track on the album. In reality, it seems to be more a pop song than a track of a progressive album. The eighth track 'Los Endos' written by Banks, Hackett, Rutherford and Collins, is a fantastic instrumental progressive piece of music and represents my favourite track on the album. I even dare to say, that this is undoubtedly one of the favourite tracks of all Genesis' fans. It's the track that serves to resume the all album because it has some musical elements of all the other tracks. This is a very energetic track that closes the album wonderfully. It's interesting to note that 'Los Endos' became an emblematic song for the group and for the fans too. It became part of the alignment of the songs chosen to be part of almost all of their live shows and became commonly used to close almost all of them.Conclusion: 'A Trick Of The Tail' is the first album released by Genesis as a quartet and without their front man and song writer Peter Gabriel. I have no doubt in saying that it was, for sure, a horrible moment for them. Certainly, Collins was very nervous wondering if Genesis' fans would accept him as the new front man of the group. However, and despite the loss of Gabriel, the group continued to deliver excellent musical moments for their fans, and 'A Trick Of The Tail' represents an excellent example of that. With this album, Genesis found new musical direction instead of simply revisited their musical past work. As I wrote above, some people consider that 'A Trick Of The Tail' was the first neo-prog album in the history, but others consider that was 'Market Square Heroes', the debut EP of Marillion released in 1982. Anyway and furthermore, 'A Trick Of The Tail' remains as an important milestone in the progressive rock music and in particular to the neo-prog sub-genre. It reveals also and undoubtedly that this is an album with great quality of Genesis. This is in reality an essential album for everyone who really loves progressive rock music with great beauty.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "patrickq",
      "date": "Posted Saturday, March 2, 2019",
      "rating": 4,
      "text": "Although Genesis probably tried to avoid alienating fans of their recently departed lead vocalist Peter Gabriel, new lead singer Phil Collins puts his mark onA Trick of the Tailalmost immediately. \"Dance on a Volcano\" doesn't sound like a Peter Gabriel song, so it's kind of surprising that it's album opener. On the other hand, there's no other song here that grabs the listener like this one. After a false ending beginning around 4:45, the madness continues for another minute before wrapping up nicely, preparing the listener for a lighter song.\"Entangled\" is the first of three or four songs onA Trick of the Tailwhich I can imagine Gabriel singing without much adjustment to the arrangement. It almost perfectly captures the sense of moving between dreaming and waking, and its use of what I assume are multiple 12-string guitars harkens back to some of the band's earlier arrangements. \"Entangled\" also contains some of the best vocal harmonies the band ever recorded.The title song is also a strong offering, and another sci-fi tale along the lines of \"Get 'em Out By Friday\" or \"Keep It Dark,\" although its storyline is more comprehensible. The melodious \"Ripples...\" is also said to have an otherworldly plot. As nice as \"Ripples...\" is - - and itisvery nice - - there just isn't eight minutes of material here. I feel the same way about closing song, the instrumental \"Los Endos,\" which recycles some themes from \"Squonk\" and \"Dance on a Volcano.\" It's a solid track, just a little long.The only song I'm not especially fond of is \"Mad Man Moon.\" It's a little tedious in my opinion; there's nothing here that the band wouldn't top less than a year later on \"All in a Mouse's Night.\" The remaining two tracks, \"Squonk\" and \"Robbery, Assault and Battery\" are both good songs, but they sound a bit tepid here compared to the live versions released onSeconds Outin 1977.The production quality onA Trick of the Tailis better than that of the band's previous album,The Lamb Lies Down on Broadway. The mix is much more integrated - - the instruments, and especially the vocals, sound much more like parts of a cohesive whole than they had on prior albums. Some of this may be due to burying Collins's voice in the mix, but whatever it is, it works.On the whole,A Trick of the Tailis one of Genesis's best three or four studio albums. There's no \"Supper's Ready\" here, but this album contains textbook examples of heavy Genesis (\"Dance on a Volcano\") and light Genesis (\"Entangled\"). Highly recommended to anyone who figures that all Collins-era Genesis must sound likeInvisible Touch!"
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Sunday, July 12, 2020",
      "rating": 4,
      "text": "After the successful LLDB making up for an absence as notorious as Peter Gabriel, the visible image and dominant presence of Genesis was not easy. Strenuous and sterile auditions saw countless possible replacements pass unsuccessful.And the answer they were looking for outside was at home. Phil Collins, impeccable in percussion forever, takes on the role of singer and did it well. He is not Gabriel, that is clear, despite his efforts to look like him. But A Trick of the Trail is a very good proposal that continues with the progressive cleanliness. It also adds more accessible and less intricate elements, what doesn't mean that it didn't detract from the final result, supported by those excellent musicians who are Hackett and Banks.The album began in such a good way, with the bombastic Dance on a Volcano. Followed by the deeply melancholic and perhaps for that reason beautiful Entangled, by Hackett's 12-string guitars and Banks' final mellotron. In my opinion, this is the best Genesis ballad in their discography. The fantasy and powerful Squonk reminds us that the mythological characters are still part of their inspiration. And then, we enjoy Banks' mastery of keyboards with Mad Man Moon and Robbery, Assault, and Battery. The last is also the closest reference to his previous records. Both the extensive ballad Ripples and the surprising pop-twinned song A Trick of The Tail are its least highlights. The album closes with Los Endos, an excellent instrumental execution.In short terms, A Trick of The Trail is an excellent album in which Genesis began to say goodbye to the more progressive Genesis. They did that respecting its past while continuing looking into the future, what constitutes its greatest merit."
    },
    {
      "reviewer": "The Crow",
      "date": "Posted Thursday, November 17, 2022",
      "rating": 5,
      "text": "Genesis demonstrated with \"A Trick of the Tail\" that they were much more than a group at the service of Peter Gabriel.In fact, for my taste this first album with Phil Collins on vocals is perhaps my favorite of the group, undoubtedly surpassing the sometimes irregular \"The Lamb Lies Down on Broadway\", and equaling in quality to sacred cows like \"Foxtrot\" and \"Selling England by the Pound\", but with the difference of having a superior singer.Listening to \"A Trick of the Tail\" you can sort of guess some of the pop influences that would predominate on later records, but the mix of this accessibility with a still very progressive style had an absolutely wonderful result.Very very recommended for any music fan!Best Tracks: there's not a single song on the record that's less than great, but Squonk is one of my favorites from the entire Genesis catalogue, and I also love the infectious energy of Robbery, Assault and Battery.My Rating: *****"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "albumd61c.html",
  "last_parsed": "2025-05-18T00:23:44.029625"
}