{
  "album_title": "RED",
  "artist_name": "King Crimson",
  "artist_page_link_local": "artist7cff.html?id=191",
  "year": 1974,
  "rating_value": 4.57,
  "rating_count": null,
  "review_count": null,
  "genre": "Eclectic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/191/cover_3611412112016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Red",
      "duration": "6:17",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Fallen Angel",
      "duration": "6:03",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "One More Red Nightmare",
      "duration": "7:10",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Providence (8:10) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Starless",
      "duration": "12:17",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "* Instrumental improv recorded at Palace Theatre, Providence, Rhode Island, US, June 30, 1974",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Red (Pre-overdub trio version)",
      "duration": "6:27",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Fallen Angel (Instrumental - Pre-overdub trio version)",
      "duration": "6:26",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Providence (Unedited Live version taken from 'The Great Deceiver')",
      "duration": "10:04",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Bonus DVD-Video from 2009 remastered/remixed Anniv. edition",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "DVD1 - DVD5 Original album new mix  in Stereo Hi Res",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": "Bonus",
      "title": "tracks in Stereo Hi Res -",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 11,
      "title": "DVD6 \tRed (Pre-overdub trio version)",
      "duration": "6:27",
      "is_sub_track": false
    },
    {
      "number": 12,
      "title": "DVD7 \tFallen Angel (Instrumental - Pre-overdub trio version)",
      "duration": "6:26",
      "is_sub_track": false
    },
    {
      "number": 13,
      "title": "DVD8 \tProvidence (Unedited Live version taken from 'The Great Deceiver')",
      "duration": "10:04",
      "is_sub_track": false
    },
    {
      "number": 14,
      "title": "DVD9 \tA Voyage To The Centre Of The Cosmos (Improv taken from The Great Deceiver)",
      "duration": "16:50",
      "is_sub_track": false
    },
    {
      "number": 15,
      "title": "DVD10-DVD14 Original album new Hi Res 5.1 Surround mix",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": "Bonus",
      "title": "Tracks in Hi Res 5.1 Surround mix -",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 16,
      "title": "DVD15  \tFallen Angel (Instrumental - Pre-overdub trio version)",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 17,
      "title": "DVD16 \tProvidence (Unedited Live version taken from 'The Great Deceiver')",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 18,
      "title": "DVD17 \tA Voyage To The Centre Of The Cosmos (Improv taken from The Great Deceiver)",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": "Video",
      "title": "content (Mono Audio) -",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 19,
      "title": "Video 1 \tLark's Tongues In Aspic: Part II",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 20,
      "title": "Video 2 \tThe Night Watch",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 21,
      "title": "Video 3 \tLament",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 22,
      "title": "Video 4 \tStarless",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 23,
      "title": "1.6 \tProvidence (Unedited Live version taken from 'The Great Deceiver')",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 24,
      "title": "1.7 \tStarless (Live, recorded at Casino Arena, Asbury Park, June 26, 1974)",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 25,
      "title": "2.1 - 2.5  New Stereo Mix by Fripp & Steven Wilson",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": "Bonus",
      "title": "Tracks -",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 26,
      "title": "2.6 \tRed (Pre-overdub trio version)",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 27,
      "title": "2.7 \tFallen Angel  (Instrumental - Pre-overdub trio version)",
      "duration": null,
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Tuesday, February 3, 2004",
      "rating": 4,
      "text": "Seeing Red, Robert??This album is a posthumous album, since the group had disbanded on \"god-knows-what\" whim from the omnipotent master and guardian of the faith Fripp. An unusual album cover for a group that had placed a strong emphasis on album illustration (if you'll forget the Live albums and the previous SABB), maybe indicating that the album was dumped on the market as an afterthought. But if every afterthought was so thoughtful as Red, we'd never end a debate.Red (the title track) is probably the most over-rated number from Crimson and the fact that the title track is the most often covered Crimson tunes only confirms this to me - it is one of the simplest one also. As the previous album line-up had been reduced from a quintet to a quartet, David Cross also had left reducing Crimson down to a trio, by this album, pushing Fripp to think about his \"small mobile units\" concept ramblings about his group.As stated before Red is a very popular track both among fans and other groups, and although I loved it back then, I now have grown a bit tired of it since I heard it too many times. Providence is unfortunately similar to Moonchild in its free jazz noodlings but Moonchild at least had some evident structure in its start. Fallen Angel is excellent and one of my favourite of Crimson all tracks but the real treat here is the Crimson Finale that even Fripp thought it would be the appropriate swansong for KC, Starless. This number brings you back to ITCOTCK with McDonald, to Lizard and Island with Collins and to Aspic with Cross. A fitting adieu and a masterful closing of the loop! Too bad the guys playing on it did not know (except for Fripp that is) that this would be the final track of KC for a while!!That track closed every night at the only bar I ever really hung around as it was the only prog cafe to my knowledge and a fitting goodbye to every one of the buddies and the excellent night spend there. Patrick Joly, this review and Lark's Tongue review are dedicated to you!!!"
    },
    {
      "reviewer": "lor68",
      "date": "Posted Saturday, April 3, 2004",
      "rating": 4,
      "text": "My favourite \" CRIMSON album\", an excellent piece of intelligent music for all seasons, whose moods will be partially emulated by the superband \"UK\"... \"Red\" (the title track) is exceptional. \"Starless\" instead is probably the best track of the album, a stunning mini-suite, characterized by the crepuscular vocal interpretation by John WETTON, but also an incredible final instrumental excursion by BRUFORD and FRIPP. Thanks to a memorable crescendo!! Despite of being more accessible, in comparison for example to \"Lark's Tongue in Aspic\", this album is always stunning, even when WETTON leads the band to some more melodic fields of exploration (the most accessible song \"One more Red Nightmare\" is a remarkable example).Highly recommended!!"
    },
    {
      "reviewer": "philippe",
      "date": "Posted Monday, April 5, 2004",
      "rating": 4,
      "text": "A surrealistic & distorted atmosphere prevails along this album. There's a lot of original ideas here... each track is different from an other. The title track delivers a straight progressive instrumental improvisation built around a reccurent theme lead by Fripp very personnal guitar playing. The second track is a more melodic rock structured song, sustained by well found sax & guitar arrengements. \"Providence\" is near to contemporary and dodecaphonic music with a nice 'Zappa' flavour. Finally, \"Starless\" which closes the album is a nostalgic tune with an intense sax solo part. This album hasen't aged and is a good start for beginners."
    },
    {
      "reviewer": "greenback",
      "date": "Posted Sunday, April 11, 2004",
      "rating": 3,
      "text": "I do not like when FRIPP sounds his rhythmic guitar like that! It's almost grunge: listen to \"Red\". Awful! He should have put some cleanness in his sound! IMO FRIPP always had some problems with his rhythmic sound.\"Falling Angel\" is decent, despite they have made better smooth songs. \"One More Red Nightmare\" is totally awful! WETTON sings really bad on it! Even his bass is grunge! The violin on \"Providence\" is particularly irritating! \"Starless\" is probably the best one: more conventional CRIMSON stuff full of relaxing mellotron and the usual FRIPP's tender and melancholic high note guitar sound.Ancestor of the grunge, it's one of their worst albums. I cannot listen to it entirely!"
    },
    {
      "reviewer": "daveconn",
      "date": "Posted Saturday, May 1, 2004",
      "rating": 4,
      "text": "Less is more on \"Red\", where the trio of BRUFORD, FRIPP and WETTON execute lucid arrangements of top-shelf material. The opening title track picks up where \"Fracture\" left off, an angular, instrumentally daunting composition that presages the style expounded on in 1981's \"Discipline\". \"Fallen Angel\" and \"One More Red Nightmare\" move with purpose, a pair of songs that rank with CRIMSON's best. On side two, violinst DAVID CROSS and a handful of ex-Crimsonites are re-admitted to the fold for the experimental art jazz of \"Providence\" and the brilliant song, \"Starless.\" This last track reveals a restraint not found in the band's earlier work -- from FRIPP's deceptively simple guitar solo to BRUFORD's studied manipulation of percussion, \"Starless\" proves the pinky of God is more powerful than the hands of man.Not everyone is enamored of \"Red\" - one critic called the final track \"listless\" -- but for those that have been watching Crimson closely to this point, it's a near-final step in evolution."
    },
    {
      "reviewer": "James Lee",
      "date": "Posted Saturday, June 12, 2004",
      "rating": 4,
      "text": "Wow, KING CRIMSON really knows how to open an album! The first thundering notes of \"Red\" put it right alongside \"Lark's Tounges\" (any part) and \"Fracture\" as a classic KC style sonic blast. The song, and the album overall, is a bit more focused than previous efforts; having pared down the lineup and the chaos a little works well for a closing statement to this version of the band. \"Fallen Angel\" is a lovely melodic composition, in the same realm as \"The Night Watch\" or \"Book of Saturdays\"; the refrain wears on me just a little but I'm always transfixed by Fripp's beautiful, restrained lead playing on this one. \"One More Red Nightmare\" is less appealing to me, but like \"Providence\" contains some memorable instrumental moments among the improvisation- largely from the guest players, who sound unexpectedly at home in the mix (Mel Collins...do I have to tell anyone where else to find him?). This pair of songs is where I sometimes lose a little bit of interest, though, as they do not rise to the standards of the rest of \"Red\". Forget about the complaints, though, because the album climaxes in \"Starless\", arguably one of the band's finest works; from an instantly lovely melancholy opening to the minimalist and funky/noisy sections (elements of the \"Discipline\" era can be heard in their prototypical form) and finally to a short but stirring conclusion, the band and guest musicians are nothing less than magnificent. It is simultaneously the culmination of everything the band has done before and also notably unique among the band's songs. If only the recording quality were a little better...but if you like \"Starless and Bible Black\" as much as I do, you'll find \"Red\" full of wonderful moments, a few surprises, and maybe the best KING CRIMSON song ever recorded."
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Sunday, July 11, 2004",
      "rating": 3,
      "text": "Crimson or red?I've never really got past \"In the court of the Crimson King\" with King Crimson. After that, they moved more and more towards jazz, with increasingly less rock in evidence. \"Red\" redresses the balance slightly, and thus I found it more enjoyable than most of their output.John Wetton's influence both in terms of songwriting and performance enhanced the finished product considerably. With only five tracks in total, they are inevitably pretty long, with \"Starless\" being the longest at 12 minutes. It's probably also the best track, with the mellotron sound which made their first album so distinctive much in evidence. This gives the track a welcome retro feel. The jazz influence is however still very much there, with improvised sax and guitar rather outstaying their welcome.The other tracks range from the more rock based \"Red\" and \"One more red nightmare\" to the softer \"Fallen apart\" and the rather uninspired \"Providence\".Overall, the rock aspects of the album are reasonably enjoyable, but personally, I'm left cold by the improvisational and jazz inspired parts."
    },
    {
      "reviewer": "Chris S",
      "date": "Posted Sunday, August 15, 2004",
      "rating": 4,
      "text": "A very strong album and while more simplified in parts RED has the distinction of also probably being the most popular KC album. Well that's what most people tend to suggest! The title track for me and ' providence' the most likely gems on an excellent release. 30 Years young or old depending on how you want to look at it :-)"
    },
    {
      "reviewer": "Man With Hat",
      "date": "Posted Wednesday, August 25, 2004",
      "rating": 5,
      "text": "Red. It is a very good album. The band really puts forth great music. Fripp is insane with some of the songs, but it all comes out good. Red is an incredible song, as are the next two. Then Providence comes along. A very pecular song. But, that is why it is great. It is one of the strangest arrangments i have ever heard, but it comes off beautifly, and one the first improv since their previous album. The final song is one of the best pieces of music in all of progressive rock, nay, all of music. Starless is a masterpiece...the slow build, the great bass and drum work, the quiet starkness of the beginning, and then...everything explodes. Literally. Frantic. Exciting. Exhilerating. The entire band lets the music soar off their instruments. A climax like this one has never again been replicated.All in all, this may not be thier best album, but it's very good. It is essential for the mere fact that it contains Starless, a song every proghead needs to hear. A great example of progressive rock. Every prog fan should hear this album. Highly Recommended."
    },
    {
      "reviewer": "Philo",
      "date": "Posted Saturday, August 28, 2004",
      "rating": 5,
      "text": "The colour red conjures up images of angst, aggression, anger. Looking at the back cover of this album and seeing a gauge where the needle is in the red, I was sure I knew where King Crimson were going and I was certainly infatuated by the tone of this monstrous album. Stripped of the overindulgence of earlier albums Red is a raw and bruising album that takes it's cue from Larks Tongues In Aspic and it's followup, Starless And Bible Black but it moves ahead of those two and seeks out a darker and more undertone identity moved through swathes of distortion and hypnotic repetitive riffing, but that is not just the story. Red has the ability to turn on and turn up and pull back on the power where necessary and no more so than on the standout 12 minute plus opus \"Starless\" which starts of with a layer of mellotron augmented with some sympathetic guitar before the mood turns and brutality returns. John Wetton's raw voice brings a realism to the music and though \"Starless\" is a song of epic proportions there is no large scenes of pomposity that graced and flooded earlier King Crimson songs, and certainly no medieval grace that tarnished others. Everything is saturated and built with layers of intense distortion which makes Wetton's bass sound quite menacing along side Fripp's guitar but rather than thrash out big loud riffs much of the material on Red is well composed and each section is coherent and tautly conceived, Bill Brufords's drumming and timing is as potent as ever adding his own texture to the music. Listen to the very moment that the opening song \"Red\" starts. The big crashing chord starts on a half beat sounds almost discordant, yet harmonious, and gives the listener the direct intention for the rest of the album. Red is King Crimson stripped down to three piece and playing with dark brooding music with splashes of wood wind that actually drive that menacing feeling where the opposite might would have been assumed. It's a well crafted piece of music, heavy complex, stinging and sympathetic. Essential."
    },
    {
      "reviewer": "frenchie",
      "date": "Posted Thursday, November 18, 2004",
      "rating": 5,
      "text": "I have heard a lot of anticipation about this album but didn't know what to expect after i finally got it. Obviously the line-up has changed quite a bit, with only Robert Fripp surviving from the original line up of the debut album which completely blew me away. It is a shame to say goodbye to David Cross but i think King Crimson proved they could manage brilliantly as a three piece.Bill Bruford gives an immense performance on the drums throughout the whole album, whether its him whacking away on the powerful intro track or his quiter drumming to fit in with the mellower sections of the album. It really looks like he has settled in well after leaving YES, and he managed to record on masterpiece albums with 2 of the biggest prog bands ever.This album opens with the title track, \"Red\". This is a powerful and menacing instrumental. I cant get over how lush their style of playing and their distortion is. I think this sound has had a strong influence on bands to follow. I also saw a strong grunge sound with Robert Fripps guitar on this album, so i am guessing they inspired bands like Pixies and Pearl Jam. This opening instrumental really grabs the attention of the listener. I guess it does show some similarities to the opening track on their debut, \"21st Century Schizoid Man\" as it uses distortion to its advantage. This is one of the main influences to set King Crimson aside from other prog bands of the time. The use of saxophones and violins also made them stand out and they used these features to their maximum ability on this album.\"Fallen Angel\" is an excellent piece. The vocals just blew me away. I love the way the mellow opening with the lush acoustic picking (it sounds like it anway) comes in after the opening verse (around 50 secs i think). This progresses beautifully into that lush distortion and the mixture of this, the vocals and sax absolutely blows me away. This is one of the albums most incredible music and is probably my favourite track on the album.\"One More Red Nightmare\" is a close contender and another excellent piece.Again there is a perfect blend of the three main members and the additional saxaphones, oboes and so forth. This song tries to expand that sound furthur and it works wonderfully. One of the most emotional parts on this song, and the whole album is when the distortion comes in at 2:05ish and is followed by a lovely drum rumble by Bill.\"Providence is one of the most progressive pieces on the album and rather experimental. It kind of reminds me of the last 9 odd minutes of \"moonchild\" which was track 4 on \"In the Court of the Crimson King\". The distorted guitar is less apparent hear but there are some interesting experimental effects used and the additional musicians really get to show off their stuff here. It is a beautiful piece and very good to listen to.\"Starless\" is a dark, expansive piece that closes the album, i found this piece to be excellently arranged. I am not sure if it is a continuation of the last album or anything but i love the way the lyrics link to their previous effort, \"Starless and Bible Black\". This piece is the most progressive on the album, which makes it rather captivating. It kind of sums up by combining all the different sounds and moods on the album and is a real wonder.Red offers immense musician work, vocals, lyrics, production and arrangement. This album sounds a lot more stripped down and simplistically arranged than their monster debut but it has just as much depth, which makes it so special. Red is a defining album of King Crimson as well as progressive rock and an essential purchase for any rock collection as there is a little something for everyone on this album."
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Wednesday, February 16, 2005",
      "rating": 5,
      "text": "Of all three masterpieces that King Crimson recorded during the brief Wetton-era, this is my favourite one. Following in the same harsh road of its predecessor \"Starless and Bible Black\", \"Red\", while not portraying the massive sophistication of \"Larks' Tongues\", nevertheless manages to enhance the red hot energy that the band already mastered, taking it up to a higher level of excitement and compositional inventiveness than the band had ever known before: and of course, the level was kept evenly according to high standards from day one (that is, the release of \"In the Court of the Crimson King\"). It may sound a bit ironic since the group's line-up was reduced to a trio format in these \"Red\" days, but yes, KC found its way to retain their frontal rocking power and make it stronger while decreasing in size. The opening title track is a lesson in hard rocking and clever dissonances, taught through a strategy of inventive chord progressions, effective interplaying, and a fluid connection between the reiterated main motif and the sinister intersection. This same harsh approach can also be found in many passages included in the remaining repertoire, but the track 'Red' is the most emblematic of the album's overall direction. 'Fallen Angel' combines the clever hard rock ordainment with beautiful acoustic guitar based sections for the verses: there is a notable contrast between the controlled textures played by the mellotron, oboe and lead guitar during the verses and the freer lines played by the cornet during the choruses, which establish a frontal counterpoint to Fripp's minimalistic riffs. Things again get harder, and also a bit jazzier, in 'One More Red Nightmare': once again, a wind instrument - this time, a tenor sax - serves as an accomplished guest in charge of adding fuel to the fire of rock'n'roll during the subtly complex instrumental passages. 'Providence' is basically a reminder of the \"Starless and Bible Black\" days. A testament of Cross' input to the band during this era, the 'Providence' jamming is initially led by him on violin until Fripp assumes the leading role, a status that eventually both will share during the last portion; the rhythm duet plays beautifully, paying close attention to what is demanded from them and how it is demanded. It's really amazing how this improv stuff can sound so ordained in a way. But the breathtaking gem is yet to come, and that is the closure 'Starless', arguably the best KC song ever. This song starts as a typically Crimsonian ballad, with a mellotron that leads the way by displaying haunting harmonic layers and a slow tempo delivered with absolute distinction by Wetton and Bruford: the guitar leads serve as a counterpoint to the mellotron, while the soprano sax flies as a counterpoint to Wetton's sung lines. No other melody could fit better the lyrics, which compellingly portray the absolute darkness of the inner self in contrast to the shades of light exposed in the outside world during the last minutes of twilight. After this enormously beautiful passage, here comes the most famous minimalistic guitar solo in prog history: Fripp's one color musical picture is ornamented by Wetton's wicked bass and Bruford's percussive implements, until the drums join in for the explosive partial climax that soon leads to a fiery jam. After the alternate solos on sax and guitar during the jam, the initial motif is reprised for the definitive climax. So captivating and so disturbing at the same time. a perfect ending for one of those KC perfect masterpieces --- 5 stars!![I dedicate this review to my beloved \"Starless\" friend Beatriz]"
    },
    {
      "reviewer": "Bj-1",
      "date": "Posted Tuesday, March 1, 2005",
      "rating": 4,
      "text": "After two great and very experimental albums with Larks Tongues and SaBB, violinist David Cross leaves the band and Red takes a somewhat more straightforward approach in the music, a little emptier, but this time with an even denser power from the band, primary led by Bruford and Wetton who sound absolutely great here. Backed up with some mean guitar lines and licks from Fripp, the music frequently sounds dark, heavy and intense (notably on title track and last half of Starless), and a good jazz influence is present with the woodwinds featured on some of the tracks, but it's also probably one of KCrimson's most accessible albums from their 69-74 era due to slightly less chaotic song structures overall. We do get another improv too with 'Providence' and it fits the mood of the album very well though it was recorded live with Cross before he left, while 'Fallen Angel' is a far grittier ballad than 'Exiles' or 'Night Watch'. The best tracks are the Red ones and Starless which are among their strongest ones from this time. A very solid album overall, recommended for newer fans too. 4.5/5"
    },
    {
      "reviewer": "el b�thy",
      "date": "Posted Wednesday, March 16, 2005",
      "rating": 4,
      "text": "In some ways better than \"Larks...\" and \"Starless...\" in other not. While \"Red\" in not as complex and hasn�t got that many solos as \"Larks...\" and \"Starless...\" it is in some ays a better , because the whole album creates a special mood like the first albums (\"In the court...\", \"Lizard\", \"Islands\"). All the songs are fantastic , but I specially don�t like the saz parts in \"One more red nightmare\"...I find them a litle bit too long. \"Red\" (the song) is the best track, with al least 3 very distortionated guitars and good drums by mr. Bruford. Almoust perfect...almoust"
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Friday, April 29, 2005",
      "rating": 5,
      "text": "This is easily one of my favorite albums of all time. It was metal before metal existed. King Crimson was always known for releasing albums that never sounded the same. This album sounds very different from the first album, this album is very different from Discipline. Anyway, this album is the culmination of all the hard work from Guitar Maestro Robert Fripp, bassist John Wetton, and drummer extraordinaire Bill Bruford.The opening track is a killer instrumental with some very powerful guitar riffs from Fripp, an enjoyable bass line from Wetton, and a killer drum track from Bruford. This like most instrumentals has its ups and its downs, its loud moments, and its softer moments. I remember listening to it for the first time and thinking that this was the best thing I've heard in a while. The next song \"Fallen Angel\" has some very strong guitar from Fripp, some enjoyable violins from David Cross, and an all around good performance from the rhythym section. Going from quiet gentle guitar to a crunchy distorted sound, the song pulls it's weight around. The next track, \"One More Red Nightmare\" has some of the best drumming from Bruford ever heard of record. Each fill is precise and is incredible every time you listen to it. A very enjoyable bass line and riff are encased in this excellent song. After that, the second instrumental \"Providence\" comes through the speakers. Most consider this just to be album filler, but I really enjoy the gradual intensity, starting out quiet and slowly picking up pace. The final song \"Starless\" is considered to be the gem of the album. With some emotional guitar and mellotron from Fripp, some great drumming from Bruford, and a great vocal performance from Wetton, this song carries its weight. Starting out as a vocal track, the song quickly turns into an instrumental jam, comprising of the final 5 or 6 minutes.Overall, this is a very enjoyable album. No progressive rock fan should be without it. This gets my highest recommendation."
    },
    {
      "reviewer": "FishyMonkey",
      "date": "Posted Wednesday, June 8, 2005",
      "rating": 4,
      "text": "When I first heard Krimson, I didn't like them. They were too trippy, no structure, nothing. How wrong I was, for sure. King Crimson has since become my second favorite band of all time. Their songs are daring, fun, trippy, and heavy and sometimes very mellow. This album ahs everything. The dominating opening riff in Red gets your attention right away...then they hook you with crazy drum fills. The next song, Fallen Angel, is a great ballad that really builds to something awesome. It starts off with some cool, evil sounding harmonies, then goes into a mellow section with some great lyrics. Great song, although not overly memorable. It does meander a bit in the beginning, but then begins to kick ass.One More Red Nightmare is probably my favorite song. It features the best drumming...ever. Period. The chorus is marvelous with clapping and all and great singing. The solo sections are also a great listen. Providence is a strange one, with about half of it leaving you going...WTF? But then it picks up halfway through with some crazy soloes and musicianship. It's an alright song, but it kinda brings this album down.Starless is an awesome closer. It starts out fairly mellow with catchy singing that's very beautiful. It builds a ton throughout the song and makes for a great listen. At some points it feels experimental, others psychadelic, and others symphony. There's really no hard rock in this one unlike Red and One More Red Nightmare. This song has EVERYTHING you could ever want in a song. Perfection.This...is a must-have. Buy it."
    },
    {
      "reviewer": "Eetu Pellonpaa",
      "date": "Posted Thursday, June 23, 2005",
      "rating": 5,
      "text": "A wonderful, dark artifact immortalizing the magic which King Crimson managed to conjure in the early 1970's. This album succeeds conjure that even better than their classic \"Larks' Tongues in Aspic\" album, as it has much stronger material on it, even some live improvisation from the concert stage where this band truly hit their top notes. Before this album's studio takes were recorded, the band had started to disintegrate as David Cross has quitted from the group. He is still present at the mysterious and nightmarish improvisation \"Providence\". Many dislike this blow, but I think it's very good, not as constructive as the jams from 1973, but it sounds more like a modern classical music played with rock instruments. The opening title track \"Red\" is also a classic, as it is so pure, constructed force of sound. Next two composed pieces \"Fallen Angel\" and \"One More Red Nightmare\" are then artistic and jazzy hard rock tunes, which never got to be played on the stage as Fripp quitted the band before touring. The final track \"Starless\" was a familiar number to the audiences of their earlier concerts, and it's recorded here with slightly fixed lyrics and Mel Collin's saxophones. If You like this album, I recommend seriously to get some of their live albums from the 1973-1974 periods for Your listening."
    },
    {
      "reviewer": "Blacksword",
      "date": "Posted Tuesday, July 5, 2005",
      "rating": 4,
      "text": "I respect Fripp and all he has done for progressive music, but I have never been a fan of King Crimson. 'Red' however is a fine prog rock album, with emphasis on the ROCK. From the chaotic and exhilerating instrumental title track that opens the album, to Wettons grungy vocals on 'Fallen Angel' you can hear why Kurt Cobain thought this to be the best album ever recorded.The line up at this stage was just a trio; Fripp, Wetton and Bruford (and a few guests of course) and its works perfectly. 'One more Red Nightmare' is a classic, with funny lyrics about Wettons apparent fear of flying, and some excellent funky drumming from Bruford. 'Starless' is what I would call a 'Mellotron' classic, slow, moody almost sinister but with an undercurrent of beauty, thanks mainly to Fripps slow melodic guitar part.A good album to coax newcomers to prog into the genre! Unlike alot of KC's work, this album is quite direct and listernable. The indulgence and, what I regard as the lack of direction, of 'In the Wake of Posseidon' and 'Larks...' is not really in evidence here. A good solid rock album, with prog sensitivity."
    },
    {
      "reviewer": "kunangkunangku",
      "date": "Posted Tuesday, August 2, 2005",
      "rating": 4,
      "text": "An album half the normal price but worth at least twice of it.Too good to be true?Well, in my case, regarding this album, that is what actually happens. I bought the CD brand new at a big record store in Jakarta for an improbable price (only five bucks!) and yet, as I already knew from my past collection of cassettes version, the music it kept inside is of high praise effort.This album features five incredibly solid songs that can be described as a last-gasp effort of a band in its death throes (Robert Fripp, its founder, disbanded this version of King Crimson after recording this album). This fact alone makes it impressive. Few bands, as far as I know, could have produce an album as good as this when they were in the path to be buried.We can only guess what factors contributed to that particular achievement. Probably, among others, it was the fact that, beside the core members of the band, Fripp also successfully assembled those from the group's past -- Mel Collins, Ian McDonald and Marc Charig. Why? Because their performances put colorfully surprising sounds into the overall heavy and noisy (Metal? Grunge? Whatever you name it) materials played by Fripp, John Wetton and Bill Bruford.The name King Crimson and the \"legion\" of musicians involved supposedly speak for itself. However, if they are not enough, there is of course another better way to for you to check out: try the first track \"Red\" (you can download it here for free), which is pretty much sum up the whole of the album. For devoted fans, surely there is no other way than go to the record store and buy the CD."
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Friday, August 5, 2005",
      "rating": 4,
      "text": "This album is easily King Crimson at their best I believe (I do not own the majority of their albums). Still, I am confident that this band had not achieved better music than here. This is probably their heaviest album.Red 5/10 : This is an instrumental song that is very good in moments. The problem is that the guitar sound is not my taste, some riffs are not that good, and it overstays its welcome.Fallen Angel 9/10 : Now, this is what a song should be like!! This is King Crimson at their very best, creating a piece of art that contrasts heaviness with tranquility. The heavy spiraling guitar riff is mesmerizing, and the drumming here is something to pay attention to.One More Red Nightmare 6/10 : This is a good long King Crimson track with a good rhythm section.Providence 4.5/10 : This is like Moonchild, but somewhat better and less messy. It is basically a jam.Starless 10/10 : Ok, it is strange not to call this a work of art. Starting as a mellotron drenched ballad ... it is unexpected that it will change into one of the wildest, most creative, and scariest instrumental breaks ever put on record. It has a bass line and a rhythm section following what I think is a time signature of 13/8, and a 'two-note' guitar solo... yes! two notes! (G and F#). As crazy as it sounds, it actually works and Bill Brufford played some of the best percussion ever. The ending of the song is the band going berserk on a breathtaking loud jam.In conclusion, I have to say that this is King Crimson's overall best album, even if it has spotty songs like Providence, and Red.My Grade : B-"
    },
    {
      "reviewer": "richardh",
      "date": "Posted Saturday, August 6, 2005",
      "rating": 5,
      "text": "Now this is what I really like! At this time King Crimson had slimmed down to a three peice with Robert Fripp(guitars, keyboards etc),John Wetton (bass and vocals) and Bill Bruford (drums).Now I've never been the greatest Bruford fan and tend to think him a little overrated but his drumming here is fantastc.All three peice bands need a great drummer and in fact the ablity to hold your own in a three peice line up is the measure of a great player IMO (think Carl Palmer,Neil Peart,Phil Collins(late seventies post Hackett)) and you get my drift).Bruford plays with superb control and is very heavy.He drives this album mostly.The exception is the song 'Fallen Angel' which for me is one the most beautifull songs ever written.There is also the more experimental 'Providence' which I like.But prog wise the other tracks are exceptional and on their own warrant giving this album 5 stars.Strange to think that Fripp almost gave it all up after this! Easily in the top ten best prog albums.A must have for any serious prog lover."
    },
    {
      "reviewer": "Hangedman",
      "date": "Posted Thursday, August 25, 2005",
      "rating": 5,
      "text": "I'm not lying when I say that \"Red\" by King Crimson is my all time favorite album of any genre. This piece was originally intended to be the final King Crimson album, and what a finale it would have been. Hard, emotional, almost grunge like even. The simple black cover, with the trio (Fripp, Bruford, Wetton) and a speedometer on the back seems to fit the album perfectly. These songs are essentially the last words of the Bruford- Wetton era Crimson and a testament to everything the band had achieved before this release. I warn however, do not purchase this album expecting what you heard on \"In The Court Of The Crimson King\", because it is completely different. Try to accept that a band can change styles to avoid stagnation, and why would you buy something new if you wanted it to be exactly the same as something else?What happens if you take King Crimson and put them on the streets for a year? You get \"Red\". The songs are much more rhythm based than they ever have before, and have a much more violent and angry tone to them. The drumming and bass together are viscous enough to break your nose, and Fripp plays appropriate riff like guitar to go along for the most part. There is of course still the horn sections, mellotron, violin and a couple of other instruments so as to retain the \"symphonic\" rock feel. Crimson proves they can rock as hard as any mid seventies metal band, and still retain a respectable level of writing and fusion on this one.The level Muscianmanship on this album is excellent, and easily puts Bill Bruford into the contenders for best rock drummers of all time. The lyrics are all powerful and fit perfectly with the music and Wetton's style of singing. The most astounding part of the album though is that it manages to break the barrier that makes prog unacceptable with normal music fans. Its catchy, its concise, its easy to swallow, and it is instantly memorable (all with the exception of \"Providence\"). All that and it still manages to be full out progressive rock.There are a few problems with the editing, sometimes its hard to make out some of the drumming intricacies. Other times the vocals don't sound 100% clear. Generally though its well done.All of the songs but \"Providence\" are exceptionally strong. \"Red\" opens the album with a bang, with some impressive trio oriented patterns. Sets the mood for the rest of the album perfectly. \"Fallen Angel\" begins comparatively gentle, and becomes heart wrenching as Wetton cries \"Fallen Angel\" while what's probably my favorite guitar riff of all time plays and the horns come in, culminating into a scream to the heavens for revenge. \"One More Red Nightmare\" gains points for the only prog song I can think of effectively using clapping as part of the percussion. Its upbeat, and has a great chorus. Sounding nothing like King Crimson ever has. \"Starless\" is the best song on the album, and is an alternate to an older King Crimson track. Its more similar to old Crimson, yet at the same time translates to the style of this album flawlessly. Has incredible buildup, and one of the most impressive instrumental rock sections of all time. The different movements of this song mold together seamlessly, and is the best possible way to send off the band. \"Providence\" is weak in comparison to the rest of the album, and it reminds me very much of the King Crimson song \"Moonchild\". It begins with a jam like section, with some interesting violin and comes into a beat nearing the end that's quite good. Unfortunately it doesn't hold together all that well as a song, and is mostly used as a buffer to let one relax before starless.This album is truly worthy of a 5 star rating, if you like any music at all you'll find at least one thing you like on it. I can honestly say its the most essential piece of music in my collection, and would be the first thing to save in a fire after living creatures."
    },
    {
      "reviewer": "Eclipse",
      "date": "Posted Tuesday, September 20, 2005",
      "rating": 5,
      "text": "Not perfect - but almost there - this CRIMSONian masterpiece was meant to be their last album (being \"Starless\" their to be final epic), but FRIPP changed his mind and returned to action on the 80's on a series of several weaker albums that honestly don't make justice to their golden 60's and 70's times, with huge influence from Adrian Belew (who was a member of a band called TALKING HEADS, which influenced a lot to the new KC sound...in a not so good way i could say).Ok, returning to Red, i have to admit that this album took me by surprise because i was never friendly to heavy music, and this is perhaps their most violent work, with several strong guitar riffs and noisier parts that differ a lot from the mellower songs from LTIA, for example, like \"Exiles\" or their whole romantic era from the debut to Islands - being Lizard not so mellow and a bit heavy but not so much as this one. The title track is a clear example of this. From the opening riffs to the middle eerie section reaching several guitar horizons that don't get annyoing and in fact they bring some catchy \"futuristic\" sounds or something along those lines all i have to say is that i love the song. Then we are led to a mellow \"Fallen Angel\" which becomes a bit violent on the ending to maintain the album's true soul. See the difference? Each KING CRIMSON album sounds very different from each other, just like PINK FLOYD's ones. This may be due to the constant line-up changes of course, but if FRIPP was / is the mastermind all i have to admit is that the guy is a genius for sustaining such a project as KC during more than 30 years and still making great music, not being locked to an alienated formula as some prog bands so \"umprogressively\" did (like YES, always sounding the same on each album...). Those two first songs showed the very different pace of style again made by Fripp and his mates, and it only gets confirmed on the third track, \"One More Red Nightmare\", containing both a catchy melody and also some awful vocals by WETTON, though they aren't important, since the melody makes the song very superior (what a great drummer Bill is! And what great arrangements - vocal + sax and some \"claps\", truly addictive music!). From the first three numbers this one is the best , but their magnum-opus from the Wetton era called \"Starless\" will come soon making this sound very inferior. Yes, after \"Providence\", an experimental track that works perfectly where \"Moonchild\" failed, we are led to the amazing beauty of \"Starless\" with a passionate guitar playing by Fripp and some amazing vocals by Wetton (i wish that he sang well like that on the other songs) driven by a mellotron. Touchy music. After the vocals the music starts getting heavier again gradually rising the tone until it reaches a climax making an amazing outro jamming guitar and sax in a dramatic and beautiful ending which is pure magic, and then the album ends.This in my opinion is where KING CRIMSON stops being interesting for me in terms of full albums. I enjoy some stuff from the following eras but none of them match the amazeness contained in this first decade of career. From 1980 on i think i'd only like a \"best of\" with songs like \"Elephant Talk\" or \"Sleepless\" but nothing that would be for the faint of the heart as this initial years were.Essential prog, as most of the preceeding albums by the kings."
    },
    {
      "reviewer": "Yanns",
      "date": "Posted Wednesday, October 5, 2005",
      "rating": 4,
      "text": "Now, although I give this the same rating as Larks' and Lizard, Red is undoubtedly better than those two. However, I cannot give this masterpiece status: that is reserved for the incredibly select few, and this album lacks something to fill it out all the way. Fantastic album, though. Definitely worth your money if you are a prog fan.On Red, King Crimson was narrowed down to 3 people, their core from the 73-74 period. Wetton's vocals are great here, especially on Fallen Angel and Starless, and Fripp's guitar is the same menacing work it always has been. Bruford proves that he could be the most intelligent and creative drum player ever. This tight pack of 3 delivers a fantastic album from beginning to, well, almost.Red: Legendary instrumental track by King Crimson. For pretty good reason, too. That thick bombastic riff is terrific, although I can't help but feel that it becomes slightly repetitive. Maybe over 6 minutes was a bit long for this song, but it is great nonetheless.Fallen Angel: As Red dies down, one of KC's loveliest songs comes on. As I said, Wetton's vocals are very strong here. I find that he shines best on the slower-type songs. Exiles is a good example if this too. Fallen Angel is a fantastic composition, but not yet the best on the album.One More Red Nightmare: Another strong song on this album. There is one part that absolutely MUST be noted: BRUFORD'S DRUM FILLS ARE INCREDIBLE. That has to be noted. It proves how strong he was. Like Red, it gets a little repetitive, but not so much to complain about.Providence: Hehe. Yup. King Crimson always has a song like this. They certainly were experimental, and this here proves it. I mean, it is good, but it can't measure up to other songs around it. And then...Starless: Is it KC's best song? Boy, tough question, but the question might very well be yes. I mean, the emotion is pounded out here, and the chills set in every time. And, when it can get no better, it enters the ending instrumental section, and it multiplies even further. The horn work is phenomenal. The theme in this song is beyond chilling. You should know this song, period.Definitely a fantastic album, but not like their debut. Give it a listen if you fancy the prog genre. 4/5 stars."
    },
    {
      "reviewer": "Raff",
      "date": "Posted Monday, November 21, 2005",
      "rating": 5,
      "text": "A monumental album that blends the best of both worlds - the romantic grandiosity of King Crimson's Mellotron-soaked first, historic line-up, and the jagged, improvisational feel of the Wetton-Bruford-Cross era - \"Red\" is an undisputed masterpiece. Easier on the ear than its dark, brooding predecessor, \"Starless and Bible Black\", it showcases the individual abilities of the musicians involved while at the same time emphasising the seamless results of their teamwork.The title-track opens the album in true KC style with one of the greatest instrumentals of all time, in which Fripp's strident guitar is pushed aggressively to the fore on Bruford and Wetton's pulsating rythmic background. \"Fallen Angels\" starts in a rather low-key mood, making immediately clear that Wetton has taken gigantic steps forward as a lead singer; then climaxes with a jazzy, horn-filled section. Wetton's vast improvement as a vocalist also comes across in \"One More Red Nightmare\" , an out-and- out rocker that he carries off with panache. The instrumental, heavily improvisational \"Providence\" is the only track here that could be termed as filler - or at least part of it could. It's undeniably a bit too long, and its unstructured, loose feel clashes with the rest of this superbly constructed album.\"Red\" ends with the bang which is \"Starless\", 12 minutes of pure prog heaven, one of those tracks which deservedly top many people's all-time favourites lists. Introduced by wistful Mellotron strains, it sees Wetton's best-ever Lake impersonation (and I mean it as a compliment), followed by a tense, almost menacing mid-section which culminates in a reprise of the main theme, a heady, majestic blend of horns, Mellotron and violin. Utterly fantastic.KC split after this album, only to reform seven years later with a new line-up and the excellent \"Discipline\". It is rare for a band to end its career with such an unadulterated display of greatness, but KC have always proved the exception to any rule."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Friday, January 6, 2006",
      "rating": 4,
      "text": "The V.U. meter's in the red, ya know.To me, any project including Bill Bruford is a seal of instant quality. Could this guy be involved with an half-assed record, knowing his sense of judgment and his tendency to 'rule' in studio? Sure, ego trips made a ton of genius band go berserk, but bizarrely, this works well!Bruford's drum signature is as big as Moon, Collins or Peart, and frankly his work is nothing short of perfect on Red. Bruford is precise, furiously fast and logical so the timing and the gap fillings are well supported. The drums are a huge part (perhaps the biggest) of the success of Red, thanks to him. Fripp is there to conduct (I suppose) and his playing is easy to follow. I do appreciate Wetton's voice although it's not as pushed as Asia. His bass lines needs a good listen to analyse, and I'm planning to invest more time on that later. I never thought of it, but this could be the birth of heavy metal as we know it. But this is a primitive form of metal, waging more on tension (mellotron, single note guitar and saxophone) than brutal force. Somebody told me this was cacophonic at times and hard to follow. Man, maybe I'm a better listener than I thought or this is much easier material to handle than I heard!And what's with the Ankedoten gang claiming their allegeance to this album. Did their identity is only based on Providence (which in my case, did not gave me a hard time to tame) ?In a way I'm kind of a wee bit disappointed, expecting more heavier, distorded and chaotic material. Oh well, I'm growing more and more a fan of the Crimson King these days. What an amazing band, despite the constant changes!"
    },
    {
      "reviewer": "memowakeman",
      "date": "Posted Wednesday, April 19, 2006",
      "rating": 5,
      "text": "What can i say about King Crimson? One of the best bands of progressive rock ever! Despite line-up changes, inner problems between Mr. Fripp against another member, different ideas, nowadays King Crimson is still alive, and making excellent music.Redis an album from 1974, what a great year in prog scene, the line up here is Robert Fripp, Wetton ,Bruford as members of KC, with Mel Collins on sax and David Cross on violins, this is another transition era, before Red, there are 2 beautiful albums, Starless and Bible Black and that masterpiece called Lark`s Tongues in Aspic, so after both albums, whan can we expect?, of course another masterpiece, and with Red, they gave us what we wanted, A Masterpiece!.The opening self titled track \"Red\", wow, that incredible and powerful song, i really love it because it is really powerful, guitar is incredible, excellent Mr. Fripp as always, another thing, if you have any doubt about Wetton`s bass playing, believ me, he is great , bass sound can be maybe crude, but its perfect here, what a musicians, the quality of this music is simply awesome, Red is an instrumental song it is the perfect song to open a perfect album. \"Fallen Angel\" : What a great song, here we can listen for the first time Wetton`s voice andof course Mel Collin`s exquisite sax, it makes an special sound that i cant really describe, i dont knoe if this is symphonic, or jazzy influenced, why not avant - garde, but what im sure is that is a superb sound. \"One More Red Nightmare\" is my less favorite, not as strong as Red for example, with nice bass lines , great drums, Bruford work is great here, always with his particular style of drumming, and the song with some good changes. \"Providence\" is maybe the strangest song here, is probably the most special and difficult song to appreciate, at the beggining it sounds like an improvisation, maybe it was , (turn off the lights and close your eyes, this song makes you shake ) its a bit dark but its amazing, David Cross with his beautiful violin sound makes it great . And to finish a great album, \"Starless\", the great and Beautiful Starless, this is my favorite King Crimson song it is simply awesome, first of all, mellotron intro its marvelous, i cant move while i listen to it, then the guitar with the most excellent sound, the first part is beautiful , mellotron, voice, guitar and a necessary and beautiful saxophone, next a soft moment, and suddenly a perfect harmony between bass , sax, violin, drums and guitar playing amazingly until the end.So whats next?, if you havent heard Red yet, run to a store or buy it online, its necessary, great album, absolutely recommended. Of Course im going to give it 5 stars."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Friday, April 21, 2006",
      "rating": 4,
      "text": "This album was special for me because by the time it was released it became rarities at my country for one reason: it's difficult to get the cassette while I could not afford to buy an LP. What happened then I was having my blank cassette recorded with this album from an LP collection of my friend in Bandung. By then it was already 1980. But it's okay, at least I got the full set in my cassette. Couple of years later I upgraded to CD format.As far as John Wetton concerns, this was his last album with King Crimson. The band entered the Olympic Studios in Barnes to record the eighth King Crimson album. Some industry critics reckoned that this was going to be the heaviest Crimson album todate. Wetton had been thinking about asking Crimson founder Ian McDonald to do some playing.The opening track, \"Red\" is quite interesting stuff. I can hear clearly the influence of the band's later work. Key characteristic of the track is Bruford's powerful drumming that drives the whole song forward. Of course, Fripp's guitar work is as usual . stunning! \"Fallen Angel\" is very memorable to me as it was one of radio hits in Bandung at typical rock programs by Radio Bonkenk (now defunct). It's basically a ballad but it moves forward into a bit of complex pieces with excellent brass tones that remind me to \"Lizard\" album. \"One More Red Nightmare\" is a cheerful track with blistering Fripp's guitar work augmented with clapping hands. It's so dynamic and energetic. There are some nice trilling sax notes during the interlude part..\"Providence\" is an ambient style with David Cross' violin puts angular notes, combined with Fripp's guitar. Each instrument makes an entrance to the music in a seemingly unrelated fashion and it goes into a jazzy style. Fripp and Wetton collaboratively make their efforts with their respective instruments. Excellent track.\"Starless\" is the legendary track that has characterized the music of early King Crimson. It has a gentle mellotron work that provides a foundation over which melodic guitar notes are entering the music in a smooth way. Nice voice of Wetton comes in, accompanied by soprano sax. This is a great track! It's definitely a dark song, despite Wetton's melancholic vocal delivery. This has become one of my King Crimson's favorite tracks.Despite not so good sonic quality of the record, this is an excellent album of the early King Crimson sound.Keep on proggin' ..!Peace on earth and mercy mild - GW"
    },
    {
      "reviewer": "Andrea Cortese",
      "date": "Posted Tuesday, April 25, 2006",
      "rating": 4,
      "text": "This was the first \"goodbye-album\" for King Crimson. Robert Fripp decided to leave fans with one of the most memorable instrumental tracks ever. The self-titled opener is what any musician and songwriter wish to compose, one day. A strong effort, well performed, with stunning dark passages and with that famous crescendo! Visionary rock from the genious of the band's mastermind.I see many people sayying this is the best Crimson's album after their miliar stone of the '69. The first side is the best, indeed! I cannot judge the second at the same level, though. The main problem with it is the second part of both Providence and Starless. Too much noises. In my honest opinion, these two songs (excellent by the way) lack in coherence.And that is the problem with the rating. Five stars are not assured, even if the opus almost reaches the goal. \"One More Red Nightmare\" is my most favourite sung-track from Red. The dark guitar riff is its precious trademark."
    },
    {
      "reviewer": "Guillermo",
      "date": "Posted Thursday, June 22, 2006",
      "rating": 4,
      "text": "David Cross left the band after their last tour, previous to the recording of this album, but he appears as guest in this album in some parts. So, the band`s last line-up of the seventies was a trio, Bruford-Fripp-Wetton (drums-guitar-bass) augmented by some guest musicians. It is maybe the \"heaviest\" album released by this band in the seventies, and it is maybe the best from their 1972-74 period.\"Red\" is a heavy instrumental piece played by the trio, with several guitars and very good drums by Bruford.\"Fallen Angel\" is less heavy than the previous song, but it is also good.\"One More Red Nightmare\" is another heavy song, composed by Fripp and Wetton, and it has interesting bass, drums and percussion.\"Providence\" is a song which sounds improvised, not very interesting for me.\"Starless\" is a very good song, a sad song in parts, a heavy song in other parts, with saxes and mellotron. it sounds like King Crimson`s \"Swan Song\", a \"Farewell song\", like the band knew that it was their last album. Ian McDonald appears playing saxes, with Mel Collins too, two former members of the band as guests. It is curious that this song is only called \"Starless\" because the lyrics say in some parts \"Starless and Bible Black\", which is the title of an instrumental piece released in the \"Starless and Bible Black\" album! Wettn also performed a brief version of this song during ASIA`s 1990-1991 reunion tour, and he maybe also has played this song in his concerts as a soloist.It seems that Bruford and Wetton were expecting to go on tour after the recording of this album, but Fripp said that the band was finished.Apart from the \"USA\" live album released in 1975, I consider this album as being the last very good album from this band. The music of the next line-ups of this band, with Adrian Belew, was not as interesting for me than the music they recorded between 1969 and 1974."
    },
    {
      "reviewer": "GoldenSpiral",
      "date": "Posted Thursday, July 20, 2006",
      "rating": 5,
      "text": "This record has been reviewed a great deal already, so I probably can't say what hasn't already been said. Instead I'll reinforce. If you only get one King Crimson album, you should strongly consider making it this one. This is the record that has it all, a true prog rock essential. From the thick and heavy guitars in 'Red', to the dissonant ambience of 'Providence', the perfect one note solo in 'Starless', to the mournful chourus of 'Fallen Angel'. King Crimson continues to evolve their sound and progress and break genre, all the while staying true to their mission of making great progressive music. This album should be a mainstay for all fans of progressive music, whether you are into symphonic, metal, experimental or otherwise, this record has influenced them all."
    },
    {
      "reviewer": "Melomaniac",
      "date": "Posted Saturday, July 29, 2006",
      "rating": 5,
      "text": "My personal favorite from the Crimson King. From beginning to end. Their heaviest, most concise output from the 70's. Very avant-guarde for the era, very dark. It's as if Lark's Tongues and Starless were only preparing the ground for this one (I still love both, but they seemed to be made more of improvisation sessions rather than writing sessions). Fans of Voivod will discover one of Piggy's greatest influences in Robert Fripp, especially on this album.Bill Bruford is equal to his formidable self as always, creative and tight. Wetton's bass playing on this album is my favorite from him (though his playing on U.K's two albums are not far behind) and I also enjoy his singing (not always on pitch, but intense) and Fripp's work is amazing, both on guitars and mellotrons. Every guest musician is used wisely also.I love every song, album closer \"Starless\" in particular (my favorite KC song, period). From the gentle mellotron intro to the climactic finale which gives me goose bumps EVERY TIME I hear it. A good album closer, and a fitting ending, if KC had not rebanded in the 80's.Five stars.Cheers to all !"
    },
    {
      "reviewer": "Australian",
      "date": "Posted Wednesday, August 16, 2006",
      "rating": 3,
      "text": "The thing I find most impressive about \"Red\" is that it was made while King Crimson was on the verge of separation. Violinist David Cross walked out half way through the making of \"Red\", though he left a very noticeable impression in the music. King Crimson was reduced to three members, Fripp, Wetton and Bruford, who did a remarkable thing creating this album.\"Red\" is quite a dark album and the overall mood of it is sullen and pessimistic, but at the same time it isn't. The music alternates between the two moods; \"Fallen Angel\" is good example of this. Fallen Angel may seem like a dark song, but if you figure out the lyrics, then you will see how it makes sense. \"Red\" is also a bit heavier than most other King Crimson albums and the title song, \"Red\" is quite a heavy number. It consists of a relatively simple theme which is repeated several times in higher positions. There is a violin interlude before the main theme starts again.David Cross really left an impression in \"Providence\", the opening two minutes is basically a violin solo. The song then gradually breaks out into chaotic music which rises and subsides throughout the song. \"Another Red Nightmare\" follows a similar path to \"Red\", but it also has vocals on it. Most of the song is again instrumental. The closing track is quite possibly the best song King Crimson ever wrote. \"Starless\" is a beautiful twelve minute progressive wonder, whose second section is a large crescendo before a fantastic finish. Personally I enjoy the first four minutes of the song a lot, this section is made exceptionally good by the wind instruments. David Cross, again left his mark in this song.1.Red (3/5) 2.Fallen Angel (3/5) 3.Another Red Nightmare (3/5) 4.Providence (3/5) 5.Starless (5/5) Total = 17 divided by 5 (number of songs) = 3.4 = 4 stars Good, but non-essential\"Red\" is a very solid effort and it goes to show that bands under pressure can sometimes produce good works. I recommend \"Red\" to basically all prog fans, though I think it lacks creativity to be a masterpiece."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Wednesday, October 25, 2006",
      "rating": 4,
      "text": "Classic Crimson.Arguably their best release, King Crimson's Red is a polished effort that is signified with class and grace. The album opens with a bang, with sonic tension that KC had become the masters of. This is my favorite work from Wetton, who's playing really shines through here. Significantly less rocking here in favor of a more artistry is change for the better, however, we still have some fairly heavy and intense moments, especially the end of Starless and much of the title track Red.The track that really bothers me here is Providence, which is similar to a worse version of Moonchild. The free rolling nothingness brings no satisfaction to me, and I can't help but skip to the last and significantly better final track.Starless can only be described as \"majestic like\" with moving passages and a lusious middle section. This is my favorite Crimson song, the most polished and a great culmination of their overall effort. A jazzy feel, with wild saxes towards the end sets up for the chaotic closing. A superb effort. The last real great Crimson album."
    },
    {
      "reviewer": "1800iareyay",
      "date": "Posted Sunday, December 3, 2006",
      "rating": 4,
      "text": "Red was the last Crimson album of the 70s, and was intended to be the final KC album period. Thus, Robert Fripp went to great lengths to craft a fitting swan song. The result was one of KC's greatest works. Red marks the first time the King travelled with so few minstrels: David's departure reduced Crimso to a trio. However, each member works overtime to fill the gaps. The album also is perhaps the heaviest in Fripp's discography. The Encyclopedia of Heavy Metal dubbed Red the greatest heavy metal album made by a non heavy metal band. The album seems to be founded upon the tritone, which had been successfully resurrected by Sabbath's Tony Iommi.The title track opens with a very Sabbath like tempo and a profound heaviness. It is one of Fripp's best instrumentals (IMO trailing only behind Larks' Tongue).\"Fallen Angel\" features great vocals by Wetton and is a beautiful track that balances the heaviness of the opener. Very effective use of horns.\"One More Red Nightmare\" has an addictive percussion pattern with a great riff. This is the most accessible song on the album, but even that is too weird for most.\"Providence\" is a misstep. The in-studio improv tends to drag in some sections. It is still a decent track and worth a listen, but the versions of Great Deceiver are better in my opinion.The album closes with the mighty \"Starless\". John Wetton is usually ignored for his bass skill since he was replaced by the greatest prog bassist ever, Tony Levin. However, this track should disprove any opinion that he is lacking. His vocals are powerful as well. This is on of KC's finest tracks, and it was a fitting send-offRed is probably KC's third best album after the debut and Larks' Tongue. Providence's meandering jams prevent it from being a five star album, but it comes oh so close.Grade: B+"
    },
    {
      "reviewer": "Seyo",
      "date": "Posted Friday, February 9, 2007",
      "rating": 4,
      "text": "\"Red\" is generally considered a masterpiece and I would hardly make a case for the opposite. However, if I compare it to a previous masterpiece of the same line-up (\"Larks Tongues in Aspic\", in case you wonder), I find this slightly less interesting. It may be due to overall, too dark and metallic sound on this album, which is sometimes raw as a bloddy steak. That's fine, but I would prefer slightly \"well-done\" meal in order to digest it. Be sure, I am talking about finesse things, while \"Starless\" and \"Fallen Angel\" would alone deserve 4,5 stars. This is an excellent album and in view of it being the last studio effort of the classic CRIMSON can only add more value. But, as I said, I will not rate it \"masterpice\" only because a general sensation of its production and sound."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Sunday, March 25, 2007",
      "rating": 5,
      "text": "I love how heavy this record is. I'm a huge fan of their \"Power To Believe\" album too, but what is special about this record is the liberal use of mellotron. And being a big fan of ANEKDOTEN I can hear that they were influenced big time from this record especially when listening to the song \"Starless\".\"Red\" is one of the best instrumentals I have ever heard. Over 6 minutes of bliss ! Fripp is nothing short of incredible. Check out Bruford too, simply amazing ! I read where Bruford said he left YES because he felt he had learned all he was going to learn from being in that band. And he jumped ship to KING CRIMSON in part to learn from the genius percussionist Mr.Muir, who stayed with the band for \"Larks' Tongues In Aspic\" only. Bruford seems like a much better drummer at this point in his career, much better then I thought he was anyway. \"Fallen Angel\" is where we get to hear Wetton for the first time on this album. I really enjoy his singing and maybe it's just me but he always seems so happy in all the pictures I see of him with KING CRIMSON, like he's died and gone to heaven or something. Some beautiful mellotron, flute and sax in this one. The song gets more intense at the 3 minute mark.\"One More Red Nightmare\" opens with heavy guitar and bass.Nice. And check out the drumming ! Sax 3 minutes in followed by some more great drumming. The long sax solo is incredible. \"Providence\" is an improvised jam that works for me. Opening with violin we start to hear KING CRIMSON's experimental side as we hear various sounds like flute, violin, guitar etc. slice through the soundscape. The drums and guitar start to take over and it ends beautifully. Nice bass solo from Wetton as well. \"Starless\" could be the best track i've ever heard ! Opening with light drums and mellotron, it sounds so beautiful. Sax and violin come in and I love the way the guitar and soundscape builds until Fripp sets it on fire.There is another great sax solo after 9 minutes as the mellotron from the beginning comes back, but only it's all more powerful than before. What an ending !Another masterpiece from Fripp and company and \"Red\" just might be their best."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Monday, April 16, 2007",
      "rating": 4,
      "text": "The KC before their split. Shall I get another feeling about this album ? If I except \"ITCOTKK\" and \"ITWOTP\", I have never been really enthusiastic with their work to say the least.The title track is a good number : very scary like KC could be (sounds pretty much similar to \"Fracture\"). Strong guitar for this hypnotic number. The whole band is very strong, and at least I can find a structure to this song. One of the best KC song ever. I must say that the next track, \"Fallen Angel\" is also very pleasant. Very nice vocals, and again the symphonic side of the band is explorated here, which is fine as far as I am concerned. These two tracks bring me back years ago, I must say. What a good surprise !I wouldn't joke too much with the following \"One More Red Nightmare\". Not that it is a bad track; no on the contrary : this is another decent number. The little brother of the opening track \"Red\" and therefore maybe a bit useless. Same scary and repetitive mood. But, hey ! I far much prefer to hear these type of songs than the usual jazzy and improv stuff which KC produced too often for my ears. Great sax in the finale. Another good song (three in a row) !In comparison by most KC album, this one is easier for the casual fan (who I am). Some purists might argue that this is not KC at their best, but my opinion differs sustantially. This album is close to be their best one, only surpassed by \"ITCOTCK\" to be honest. Just a shame that a track like \"Providence\" took its place here. It is almost eight minutes of boredom and completely useless. Fortunately, it will be the only song of this caliber here. Dull, dull, dull.The closing number is probably one of their most symphonic and beautiful number. On par with \"Epitaph\", \"ITCOTCK\" and \"ITWOTP\". By chance, it is also the longest composition. The mellotron is just sublime. It is a shivery track. Full of emotion and beauty. What a great track, my friends!This is one of the good reasons to keep on listening different KC albums, sometimes with lots of difficulty. But my patience has been rewarded and this track only should please any music lover.The melody is just fantastic. The sax is great and Wetton is very good (both on the vocals and on the bass). The middle part is a bit weaker (for about two minutes) but this is definitevely one of their best number ever (at least on my scale). The finale brings me really close to paradise (well, I guess this is paradise...).Four stars."
    },
    {
      "reviewer": "febus",
      "date": "Posted Saturday, April 21, 2007",
      "rating": 5,
      "text": "THE CROWNING KCRIMSON PINNACLE.What is there to add that haven't been written before? not much, i am afraid! We have on the cover just 3 members left of this line -up. A grinning J.Wetton and 2 serious looking Bill Bruford and Robert Fripp. But David Cross is still credited with '' thanks to'' . Also guess who is back? Not only the brilliant IAN MCDONALD is back to the nest ,but his successor , the great MEL COLLINS is present as well. How can you have CRIMSON betterthan that?I am not here to detail the songs of this album; you know them by heart and most of you love them to death. From the metal symphonic of ''RED'' to the Crimson anthem ''STARLESS'' we're going from wonder to wonder. There are no simple songs; just listen to FALLEN ANGEL or ONE MORE RED NIGHTMARE, the musicianship of all the players is incredible, original, creative. (listen to Bruford on ONE MORE RED NIGHTMARE) .Fripp is absolutely top form and what else to say about J. Wetton.I know, I know! there is also PROVIDENCE! It won't be definitely part of any ''Best OF'' album. But Crimson has always been on the inpredictable side. You wouldn't expect anything else from them. If PROVIDENCE is not on par with the rest of the album, this is still listenable starting slowly with Cross Violin and buiding up with a mean Wetton bass and the entrance of Bruford and Fripp. Just listening to it, now!! not bad.I was very, very diasappointed back then when i heard that Fripp was closing the shop. Bruford and Wetton were eager to keep going and wanted I McDonald to stay in the band. But Fripp decided otherwise. God knows what would have this line-up brought us. We'll never know. R. Fripp will reform K. Crimson 7 years later for new adventures ( but not too pleasant to my ears)If i have to go on exile on a desert island with only one CD to take with me, it will be this one! So i can only give 5 stars to the greatest prog CD IMO."
    },
    {
      "reviewer": "The Pessimist",
      "date": "Posted Sunday, June 17, 2007",
      "rating": 5,
      "text": "I think this is the best album that Crimson have created by far. It is consistently dotted with melodious licks - vocally and instrumentally - that are extremely satisfying to a prog rock ear. Furthermore, the musicianship is good: from the unique technique of Fripp's guitar playing to the technically perfect drumming of Bruford to the thick, solid bass of Wetton. The simple - yet astounding - arrangements, marvelous musicianship and great melody lines make this album a must have on any self respecting prog fan's shelf.The opening song has the word PROG written all over it, with shifting 4/4, 7/4 time signatures and its \"loop\" song format, this is by far the best instrumental that Crimson have ever come out with (Level Five from \"The Power to Believe\" album is questionable). Gaps between riffs leave Bruford space for some elaborate drum fills whilst Fripp's snappy riffs and Wetton's bass lines keep the song steadily intact. This may not be the strongest song from the album, but it is a cracking opener and portrays the heavy atmosphere of the rest of the disc perfectly.The tracks \"Fallen Angel\" and \"One More Red Nightmare\" are my personal favourites, and could easily pass as regular rock tracks from the 70s. Fallen Angel is a nice ballad with flowing melodies and not a bad idea in sight; it even leaves the prog trend and actually has lyrics that mean something! This not only could appeal to most prog fans but even a few mainstream music fans as well. One More Red Nightmare is a heavy jazzesque number with Fripp's guitar powering the most of the song and a very good sax solo within the outro section. Bruford's drumming, once again is also to be noted for.The penultimate track - Providence - is probably the weakest track of them all, with absolutely no melody, no structure and no appealing qualities whatsoever. It was blatantly created merely to fill up space on the album, and in my opinion should have been replaced with another decent song to match up to the master levels of the rest of the album. However, the final and best song on the album - Starless - is an absolute masterpiece of prog rock and is highly underrated amongst musicians. The opening 4-5 minutes is an excellent piece of work with a catchy, mysterious melody and some beautifully simple guitaring from Fripp. The build up, by far, is the best part of the song and should be respected and looked up to by all prog musicians nowadays. Some may criticize that Fripp's one note solos are extremely tedious, however, if you are paying attention to the theme of the song, then you would realise that the quite, atmospheric minimalism is the whole idea, and it begins to pick up considerably when the drums kick in. Finally, to finish the song and the album, there is the huge, heavy, jazzy, proggy, complex movement that everyone anticipate at the end of the song, and is filled in with a 13/8 time signature and a kickass sax solo from Mel Collins on Soprano. A true gem to finish off an album.All in all, I am giving this album a 5/5 not because of the album in general, but because of the high and supreme quality of the good stuff within the album (all bar Providence) and is a vital album in prog rock history."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Tuesday, August 21, 2007",
      "rating": 4,
      "text": "The least jazzy, and the nearest to rock, of all KING CRIMSON'S early albums, 'Red' is a triumphant conclusion to KC mark 1.Carrying on in the tradition of insipid KING CRIMSON vocalists, JOHN WETTON nearly spoils the show again. But there are very few vocals on this album, fortunately. 'Red' is mainly a vehicle for FRIPP and BRUFORD to lay out their 1974 vision of where rock might go next - a vision not picked up for 15 years, until it was incorporated into Seattle's grunge sound. 'Red', 'One More Red Nightmare' and 'Starless' are outstanding (almost) instrumental excursions deep into a dark and distorted universe, the door to which was prised open five years earler by '21st Century Schizoid Man.'The excursion starts right from the first note. Unlike the experimental 'Lark's Tongue in Aspic', 'Red' slams you with a full-body press. 'Red' is simple (for KING CRIMSON anyway) raw power, but no less effective for that. 'Fallen Angel' is relatively anonymous, and 'Providence' is the obligatory experimental noodling track. Compartmentalising the music like this helps the new listener assimilate the album more easily, meaning that 'Red' is possibly the most accessible KING CRIMSON album, but in the end it is the first KC album listeners usually tire of.I like this album much more than 'In The Court of the Crimson King', but for the purposes of this review I will not rate it as highly. By now the progressive rock beast had become a lumbering dinosaur, and the small punky mammals were assembling to take the behemoth's place. KING CRIMSON'S 'Red' did nothing but accelerate the process. Though the music is better, there is no compelling reason to recommend this album as deserving of a place in everyone's music collection.The next time we see KING CRIMSON is in the tame Jurassic Park of the early 1980s, a resurrected dinosaur that would better have been left to rot."
    },
    {
      "reviewer": "Prog-jester",
      "date": "Posted Wednesday, August 29, 2007",
      "rating": 5,
      "text": "Probably, the best KC album. Dark, intense, heavy, melancholic, groovy, eclectic, progressive after all! Recommended for beginners as well – you won’t find here anything shocking on side A, “Fallen Angel” is even a bit poppy, while “Red” is another public’s favourite preserved till our times in KC live repertoire. “Providence” fits well here, IMHO, much more than “Moonchild” in ITCOTCK. Closing “Starless” epic is a Mesiterwerk of 69-74 Crimso, the most appropriate song to finish with…and I guess they were aware of this too. At least, Bobby was ;)."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Thursday, September 6, 2007",
      "rating": 4,
      "text": "King Crimson goes heavy, and I like it! A year ago this would have been a masterpiece in my book, but my prog pallette has expanded, and parts of this album have not aged as well as others to my ears.Red. Some absolutely gruesome (in a good way) bass and guitar tones here. In the right mood, these distortions can be just what I need, though be careful how often you listen to this, because it can grow old quickly with overplay. Played in the dark, especially while alone or driving at night, this one can be spooky and frightening, especially the creepy middle section.Fallen Angel, One More Red Nightmare. Heavy, grungy and jazzy, these songs are a strange brew of more distorted guitar and bass, rather catchy melodies, with some banging and clanging of \"devices\" to keep you awake. Solid tunes that can get a bit stale over time, and little virtuosic playing to keep your attention, though they do contain a unique array of drones and tones.Providence. More Crimson improv--either you like it or you don't. I usually resist the urge to skip it, thinking I'll eventually \"get it\", but I'm still waiting on that revelation.Starless. If you like prog, you NEED this song. A haunting mellotron intro kicks things off with Wetton's best vocals. Then things drop into plodding 13/4 time. Don't be fooled: as opposed to many epics that slow down, this song is definitely going somewhere. I can't get enough of Wetton's distorted bass here, and all the instruments build in intensity. This is one unstoppable freight train once it gets rolling, and double-time jam is simply amazing every time. Of course, once the mellotron sweeps in for the ending refrain, your mind has been blown and face has been melted by the sheer prog insanity. I'm quite confident that I will NEVER get enough of this song.Great album if you're in an angry mood, and Starless is breathtaking any time and worth the purchase by itself. Unfortunately one song cannot make a masterpiece album, but Crimson are certainly to be commended for this effort."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Monday, September 17, 2007",
      "rating": 4,
      "text": "A welcome increase in the band's intensity and dark inklings, creating one of the most memorable KC albums with stellar performances from every member. Fripp cranks out especially savage guitar shrieks and intricate solos, Wetton's bass dances in a dark miasma of thundering intensity and Bruford's busy drumming is in peak form. Incorporation of woodwinds and mellotron is smartly done as well. Easily a highlight in the group's career and a great starting place for fans interested in learning more about classic Crimson (I recommend working backwards from here)."
    },
    {
      "reviewer": "FruMp",
      "date": "Posted Thursday, September 20, 2007",
      "rating": 5,
      "text": "Red is one of King Crimson's heaviest albums and also one of their best although it does have some fairly major flaws.The instrumentation on this album is superb, Bill Bruford puts in one of the best performances of his illustrious career on this album with some very interesting heavy, technical and jazzy drumming, Fripp is up to his old tricks with his distinctive guitar technique and John Wetton on bass holds it all together with some fat grooves.Red is a fantastic opening track, very heavy, excellent riffs and the band just gels together really well easily one of the best tracks on the album. Fallen angel is quite a mellow song, fairly poppy, not bad although nothing really worth writing home about. The band then ventures once again into heavy territory with the appropriately named One more red nightmare and it is easily the best song on the album, Bruford is in blistering form, there are some excellent riffs going on here and some great severely flanged clap sounds before it all descends into a slow groovy jam with some weird and wonderful wah action from Fripp, the highlight of the album.As i mentioned earlier this album has some major flaws, the main one being the song providence, nothing much goes on here, nothing at all really it's a waste of 8 or so minutes, this is one thing I really dislike about King Crimson, these long avant-garde songs (like moonchild on ITCOTCK) where nothing really happens, it just seems a waste of time, 5 minutes worth of Providence is practically silence and then it eventuates in nothing but a mindless disjointed mess at the end where everyone pretty much does what they like.The album is the finished off with starless which starts off as a melancholy song with that famous mellotron sound in the intro, it's very reminiscent of earlier works I quite like the main song part of Starless which goes for around 4 minutes before another 4 minutes of building before the song launches into a high speed jazz groove to finish the album in spectacular style, a very well written song.Overall this a good album it has some fantastic songs and is well worth listening to for any prog fan, it's just there are a few weak points that hold it back and one or 2 songs that you might want to skip."
    },
    {
      "reviewer": "jammun",
      "date": "Posted Sunday, October 28, 2007",
      "rating": 5,
      "text": "Red is the final studio album from this incarnation of KC. What's unique about Red is that final albums are usually throwaways, meant to meet some contractual requirement. But in Red we have yet another five star KC release. They seem to have put their all into this one. There are some longer cuts -- Red and Providence -- similar to those found on the previous album, but here they are more fully developed and seem to have more purpose -- the overall composition and playing is superior. Another Red Nightmare and Fallen Angel fulfil the usual rock and ballad tendencies. I don't mean to elide over these songs; they are all of usual KC quality. However, there's the one song that stands out, which is fittingly the final one:Starless.The best song KC has recorded, before or since. Fripp felt this was the end of KC, and wrote a stirring Epitaph, play on words obviously intended. Think about it:Q: What is starless (and Bible black)? A: Death. Q: What supposedly happens as you die? A: Your life flashes before you in a matter of minutes (it takes about 12:18, apparently (at least on my edition).The song starts out at a dirge-like pace and tone, completely drenched in Mellotron and Fripp's guitars, all with a ambiance that is a throwback to the first album. We haven't heard this since those first few albums; we seem to be reliving something here. Then in the second verse we get a little saxophone thrown in. Haven't heard much sax since the early era either; we seem to be reliving something here. KC's life is sonically flashing before our eyes (ears). The song wends its way to Fripp's initial solo, which resembles nothing so much as the repetitive pealing of church bells, announcing the funeral, or perhaps memorializing the passing, of KC. This then evolves into a virtual reiteration of the innovations unvealed on 21st Century Schizoid Man. The pace of the song suddenly picks up, the jazz influence exerts itself in blaring saxes and guitar riffs. It's a completely self-contained alternate realization of the first song on the first KC album. KC is reliving it's life, just prior to death, which comes, sadly -- for who wants to lose an old friend -- with the final fade out. I cannot think of any other way to interpret this song, or to explain the impact it has on me. Wetton and Bruford are summoned to evoke 6-7 years of KC history, and both deliver impeccable performances, with Wetton's vocals and bass driving the song and Bruford completely unleashed to play what he will. Both deliver standout performances. Mel Collins sounds like he never left the band. The lyrics are self-explanatory in this context.With hindsight, we know that Fripp believes in reincarnation, at least of KC. But at the time, this was KC's farewell, and it is for an opportunity to spend an hour or two of our existences with music such as presented on Red that we listen to progressive rock at all."
    },
    {
      "reviewer": "The Prognaut",
      "date": "Posted Tuesday, November 20, 2007",
      "rating": 5,
      "text": "For my first KC review around here, I chose this record because it happens to be one of my all times favorite albums. I discovered \"Red\" a long ago within my inner progressive pursuit, I would say I first put hands on it maybe ten or twelve years ago and I must say it blew my mind right away. Although it wasn't my very first encounter with the band commanded by eternal Robert FRIPP, it seemed quite different to me from the previously heard. Off the get-go, one of the most revealing things on the record that caught my eye, was the featuring line-up. And indeed I wasn't impressed in vain.Title song is as harsh as soft on the ears. It breaks out of this strident guitar that announces the scent of a solid rock song. But as the passage flows, the ambiance turns kind of mysterious and creepy thanks to the low spoken voice of this eloquent cello which captures the scene in a morbid, acid way. The song retakes from where it was left behind and carries on through pure rhythmic music just to the point where it crashes irremediably marvelous onto this unexpected ending. Great parte prima.Next song on the road to earthly holiness would be \"Fallen Angel\". I could even say I fell in love with it out of the first spin on my old, dusty turntable. The canvas depicted in here blends perfectly along the leading sounds coming out of the sax and the upbeat drums played modestly by Master Bill BRUFORD. I think of this wonderful piece of music as one of those smooth danceable ballads rarely found within the depths of Prog Rock. The track distills heavenly rich, relaxing all your senses into unconsciousness and further on. It really gives me the spiritual creeps.If it wasn't enough, the album increases its perfection as it moves on to following episode. \"One More Red Nightmare\" is in my humble opinion, the suitable pretext to Mr. BRUFORD to show what he's got under his sleeve. The execution of that drum kit appears to be somehow hidden behind an unspoken genius. I picture this track as this kind of enticing, seductive scene were the instruments meet face to face with the leading drums and cymbals, unable to do nothing but to surrender to the spell of the mystic rhythm.\"Providence\". It is indeed providential. An almost mute violin held in hand by David CROSS starts to clear the air into this anguishing mood that slowly invites the rest of the instruments to this melodic soir�e. The unease display of virtuosity gathers in expectation just to leave the listener floating around his self-created thoughts, wondering if there will ever be a finishing line drawn between unrevealed feelings and apparent reality.The best come right at the ending for those who can wait. The perfect epilog to a marvelously crafted masterpiece. \"Starless\", briefly detailed, is entirely from beginning to end, a post-modernist waltz exquisitely arranged and executed. The lyrics intertwine smoothly with the instrumentation in this sort of musical conspiracy that's given to birth once in a lifetime. The ravishing melodic composure is unrepeatable and perpetual. It manages to shake you off any unpleasant feeling juts to find yourself wandering around your very insides up to the tip of your fingers reaching for a dreamlike state of mind. Many times, I've found myself spending entire evenings spinning this track back and forth just to untangle my head off the rest of the thoughts swirling inside me to stretch my mind and to quench my thirst of complete relaxation. A real Progressive Rock cornerstone that would never stop twanging off through your ears, straight to your skin.Any respectable collection should proudly display this album. Top class compliments to KING CRIMSON and top ratings for \"Red\" that has shown for over thirty years, nothing but constant amazement. No less."
    },
    {
      "reviewer": "LinusW",
      "date": "Posted Monday, February 11, 2008",
      "rating": 4,
      "text": "Being my first whole album exposure to King Crimson, Red feels very dark and atmospheric. The music is far from minimalistic, but it has a pleasant stripped-down take on the music. As if it was played in a vacuum. Every note truly pierces the listeners ears, making it really hard to lose attention. It's also one of many few albums in which the saxophones are one-hundred percent enjoyable.The five songs (a total of 40 minutes) are all good in their own way, although Starless must be considered the true masterpiece here. The strings (guess it's mellotron) and saxophones in the beginning, accompanied by Wetton's vocals and bass takes this song up to ethereal levels before leaving room for the rough bass sounds (reminds me of Entwistle) and spooky guitar that transports us to the finale of from time to time jazzy improv (that's how it feels). Great tune!Providende has some serious problems to recover after the way too long 'intro' filled with squeaky violin noise, and Red, although I loved it the first times, grows repetitive with time.One thing that baffles me when listening to Red is its heaviness, and it's not heavy as in 'heavy metal', for those of you who might interpret it that way. No, its heaviness lies both in the instrumentation and in the deeply emotional maelstrom the albums develops into. It's hard not to be affected by its starkness and I always feel vaguely apathetic (in a good way...) when the last tone fades out.Even if this isn't your music, you should at least try it once only for the experience.//Linus"
    },
    {
      "reviewer": "crimson87",
      "date": "Posted Tuesday, February 12, 2008",
      "rating": 5,
      "text": "Red is another masterpiece brought to us by the Crimson King .First of all : In which genre would you put this album? I�d say that this is heavy jazz , but even that weird term does not describe the record as a whole .If i had to talk about the individual performance of each musician , the word superb may sound even insultating, David Cross fills the album with insane violin textures (mostly the black sheep Providence , which I love) , and Wetton , Fripp and Bruford they prove a statement that the drummer said 20 years after : When you wanna hear where music is going in the future , you put on a king Crimson album . Well it is easy for bands nowdays to sound harder than this but , who on earth has done an album as dark as this one !!! , and in 1975!! and not sounding as deppresive as porcupine tree or cliched as grunge albums!!.Just the crimson king."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Sunday, February 24, 2008",
      "rating": 5,
      "text": "What a great conclusion to an amazing King Crimson era!Redis an essential album not only for fans of the band but almost everyone who loves rock music. The sound of this music is universal and sounds as fresh and exciting today as it did the year it was released.What makes this album so special to me is its vintage 70's-sound and dark atmosphere, which can partially be attributed to the album cover, that makes the record a very fulfilling experience no matter when you listen to it. The album quickly takes the dark tone with the opening title-track and features some of the classic King Crimson music during the course of the mere 6 minutes.Fallen Angelis as beautiful as a John Wetton-sung ballad can ever get while the quirkyOne More Red Nightmareand liveProvidenceshow a broader scope of the band's ability without diverging too much from the overall mood of the previous two tracks. Finally it'sStarlessthat hits the last nail into this solid classic of an album.I want to keep things short since there is really no point of even trying to prove to anyone that this is an essential album. If you have not yet heard it then you're clearly not a big fan of rock music to begin with!***** songs: Red (6:16) Fallen Angel (6:03) Starless (12:16)**** songs: One More Red Nightmare (7:10) Providence (8:10)Total Rating: 4,62"
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Friday, May 2, 2008",
      "rating": 4,
      "text": "Red is King Crimson�s seventh album and the last one of the second era in their discography. The band is cut down to a trio of Robert Fripp, John Wetton and Bill Bruford but with the assistance of Mark Charig, Mel collins, David Cross, Ian McDonald and Robin Miller on winds and strings. This might be my favorite King Crimson album. I have made some harsh reviews of Larks� Tongues in Aspic and particularly of Starless and Bible Black as I felt there were way too much instrumental avant garde noodling instead of structured songs and with Red it seems like King Crimson have listened to my criticism ( for the most part anyway).The album consists of five songs and three of them are nearly masterpieces, one is very good and one is unfortunately useless to me.Red, One More Red Nightmare and Starless are some of the best songs in King Crimson�s discography and well worth your money. Fallen Angel is a pretty good song too while I can�t stand Providence that sounds like the jam like songs on Starless and Bible Black. I�m sorry but to me it�s a waste of 8 precious minutes of my life.The musicianship is astonishing on Red. It�s like they knew this would be their last album together, because every last juice is pressed out of those instruments. They play like their lives depended on it. It�s so enjoyable to be witness to. This is one of the best perfomances on any prog rock album I have heard so far.The production is really impressive too. It�s clearly the best production on any King Crimson album up until then. It�s dark but still every instrument is clearly heard in the mix. Even John Wetton�s voice is better than on most of the albums he appears on and that�s a positive thing coming from my mouth as I�m not a big John Wetton fan. I�m of course only talking about his vocals here as his bass playing is of high quality.This is a very good album even though it has flaws like Providence. It deserves 4 stars in my book. It�s no doubt one of the most groundbreaking prog rock releases ever and highly recommedable even though I wouldn�t call it a masterpiece."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Tuesday, May 6, 2008",
      "rating": 5,
      "text": "Red AlertIt's quite well known that over the years King Crimson has produced music that has been ahead of it's time. Indeed, the band gets credited for inventing genres decades away from when they started. The band has been influential to countless artists thanks to how fresh edgy their music has always been.Of course, the band itself has also shifted and evolved. For the first decade of their existence no two albums had the same line up of musicians attending, with only Robert Fripp remaining by the time the band reached it's fourth album. Musically as well, by the time 1974 rolled around the band had shifted dramatically from the jazz-hard rock prog they started playing on albums likeIn The Court Of The Crimson KingandIn The Wake Of Poseidon. Since their reincarnation that started withLarks Tongues In Aspicthe band had moved onto a much more ''improvisational'' approach, their albums ripe with long, drawn out instrumental bouts of musical wizardry which was somewhat abused by the following albumStarless And Bible Black.History lesson aside,Redis the end of this era of the band, after this album the band wouldn't release another album until 1981'sDiscipline. What this album represents is Crimson's creative zenith from that time. Somewhat unlike previous albums in that this one houses much less instrumental tracks than it's older brothers, this one finds Crimson hitting a niche. WhileStarless.felt loose and flexible,Redfeels very tight in structure.Still with a few instrumental tracks (something Krimson always excelled at), tracks like the explosive openerRedand the mellow yet intensely dramaticProvidenceprovide the feeling that links this album to their last couple, with excellent musicianship close in tow.The rest of the songs are somewhat different than the Crimson most people remember. The melancholicFallen Angelshows that Wetton actually has a lot of emotion behind his voice while the beatarificOne More Red Nightmareshows a heavy and rockish side of the band not seen sinceCat Food(although much better played and less radio-friendly sounding than that song).Starlesshas to be the album's standout however, as a song that is seemingly brethren toMoonchildwith it's opening emotional vocals leading into the long and drawn out jam session (this one noisier than the very very quietMoonchild).Likely the heaviest album by Crimson to this point in their career and one of the best, this one is recommended to all, especially those who like a little bombastic power behind their music. Being such a monumental landmark of an album that has many modern artists claiming influence by it (and for good reason) it would be hard to give this one any less than 5 stars. Not Crimson's easiest album to get into by any means, but certainly the best since their debut."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Wednesday, May 7, 2008",
      "rating": 4,
      "text": "King Crimson is more a band I artistically respect rather than listen to with immense infatuation. RED is a King Crimson album that has everything that I could ask for in prog except for a good replayability factor. With songs like the proto-metal fests in the title track and ''One More Red Nightmare'', the delicate ''Fallen Angel'' and the classic ''Starless'', anyone interested in the prog rock world should discover the album. It has Wetton's unique bass sound, Fripp's guitar wizardry, Bruford's precise drumming and a smattering of other odd instruments like sax, violin and cornet. In my mind, all of these songs are very good, but none reach the heights of ''great'' other than ''Starless''; plus, it's one of those albums I simply overplayed to the point of boredom. Don't get me wrong, this is a powerful prog rock album that shouldn't be missed out on. Get it with the warning that it might get old if played way too much, although that should apply to every album.Also, I happen to like the live improvisation ''Providence'', featuring Wetton's commanding bass performance."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Tuesday, May 13, 2008",
      "rating": 3,
      "text": "Review 29, Red, King Crimson, 1974StarStarStarStarThree features mark this album very prominently. First, Fripp's decided to be 'more of a guitarist' for the album, and thus contributes some shrieking and powerful work, even if the smaller line-up gives him less opportunities to strut his stuff in solos. Second, the trio have some difficulties in handling a rich sound without occasionally repeating themselves, and guest musicians are a limited help. Finally, it's consistently pretty heavy, for a Crimson record, which may be more pleasing to some than to others. Personally, I really like the album, but it simply never reaches (even on Starless) any of the glorious heights of Larks' or Fracture. Providence, Starless and One More Red Nightmare are great tracks, but the opener and Fallen Angel drag a little. It comes highly recommended, but is by no means the high point of Crimson.Red launches off the album in classic style, with a screaming Fripp guitar and rolling percussion from Bruford. Fripp begins the song with his continued riff, while Wetton changes what the bass is doing often and without much notice. Bruford contributes with an excellent, varied drum part (of course), and the warping nature of all three musicians is consistently interesting. After an unusual slower break, with just as much edge as the main song, the riff kicks in again. The problem with this song is not the composition or the playing, which is top notch throughout, but the feel, which is simply as if you are listening to the same thing constantly, and the lack of any imagery associated with the song. As much as I intellectually reason that I'm not, it feels as if I am simply hearing the same idea for 6:20. I think the sheer musicality of the piece just makes it difficult for me to connect.Fallen Angel is another similar dose of music. I like just about all of the components, but the end result doesn't actually affect me that much. From the throbbing, thick guitar and mellotron of the opening, Fripp's acoustic and a characteristic soft Bruford-Wetton rhythm section spring out, foreshadowing a later line of the chorus. John Wetton's excellent vocal carries the song neatly, with the acoustic supplementing the ideas. A rather noisy burst, particularly from Bruford, gives way to the chorus-line (a rather awkward 'Faaaaalleen Aaaaaangeel'), and an interesting oboe-cornet duo. The core trio dominate the song again until the return of the vocals with electrics and oboe instead dominating it. Fripp does a good job of mocking a sax. Again, all the components are here, even if I'm not a great fan of fades or that tiresome chorus-line, but the emotional resonance is lacking.One More Red Nightmare is where the album really takes off for me, with its slightly more upbeat tune and political sarcasm. A saxophone shows up for the extended instrumental break, which is dominated by Bruford's rolling percussion and Fripp's combination of 3-second solos and rhythmic playing. Very nicely done, because as well as being great music in and of itself, it contributes to the militaristic, yet sarcastic atmosphere of the song and leads up very neatly to the return of the vocals. An obscenely thick bass sound hums throughout the remainder of the song, while the sax, probably McDonald, continues to throw out a stream of notes. Very abruptly, it simply stops. Great, high energy Crimson, with matching lyrics.Providence is another of the extended Crimson jams that you might well find on Starless And Bible Black. Fortunately, it's more of the Fracture kind, with a steadily increasing power and violin and thick, very powerful playing from Wetton and Fripp combined with occasional atmospheric touches from Bruford. For the first five or so minutes, it's constantly almost spinning out of control, yet constantly being reigned in. Cross provides an unusually anarchic lead-in to the monstrous main theme, with Wetton then standing out in the improvisation with several improvised solos while Fripp and Bruford hold the piece down. Rolling Bruford percussion leads up to a couple of lightning-fast Fripp solos, which in turn lead to a chaotic cooperation from everyone, which in turn leads back to Cross. Everything flows perfectly, with duets, solos and group moments combining effortlessly. An absolutely superb piece of work, improvisational or not, even if it may take some time to grow.Starless is the album's obvious choice, with its combination of a very nice, intensely melodic opening, with humming mellotron, a high emotional guitar part, a deeply moving vocal from Wetton (with accompanying, excellent, if very dark lyrics from Richard Palmer-James), and a softer rhythm section that moves the song and holds up a basic, gentle feel at the same time. Saxophones (and David Cross, on violin, though he's somewhat quietened by the mix) glide along with the verses, combining in perfectly.After the third verse, almost five minutes into the song, the extended jamming session begins, with the shrieking violin from Cross reaching an emotional height not yet handled by the album. The clopping and tingling percussion and cymbals from Bruford are superbly timed and handled, while Fripp pulls off some surprisingly convincing two-note solos. Wetton's overwhelming bass continues hold up the basic framework of the piece together. After this slow escalation has reached a steady climax, a punchy, almost-electronic bass-guitar duo leads us back to a much faster section with a fast, spinning sax, which eventually echoes the vocal melody before leading us back to another brief fast-paced monster jam, with some brilliant playing from Fripp and Wetton, shrieking out of control, as well as some very neat foreshadowing. The overwhelming bass part moves on powerfully to a final conclusion, with the saxophone slowly leading us to a humming close.Not an easy album to describe, because it just isn't. The sounds and combination are sometimes difficult to recognise, and the music is top notch throughout. The only way this fails to grip as fully as possibly is emotionally and experimentally, with Fallen Angel and Red not conveying really any imagery at all. Pleasant to listen to, but not nearly as enjoyable as Larks' or Starless And Bible Black, and not as interesting to me, either. It is, however, essential for any collection, and I'm sure there are many who consider this a full-fledged masterpiece.Rating: Four StarsFavourite Track: ProvidenceEdit: well, down to three. It's all in the general cuts and the so forth. Yes, well, I haven't listened to this once in a long time, relative to the huge number of plays Starless and Larks' have got... I suppose that's because I feel they have something more to offer me... this doesn't really do that, though it is a good album."
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Saturday, July 19, 2008",
      "rating": 3,
      "text": "One more red nightmareKing Crimson is not among my favourite bands and in my opinion they never again did anything that compares with the groundbreaking debut album from 1969, a seminal Prog recording. Red is among the better albums though, but the 12 minute closer, Starless, is the only song here that deserves the masterpiece status that this album has received (and the only song with which King Crimson again reached the high standards set by In The Court Of The Crimson King. The band is now down to a trio with John Wetton and Bill Bruford accompanying the ever present Robert Fripp.The opening title track is an instrumental primarily based variations on just a single riff. The guitar sound is heavy and quite unique. Fallen Angel and One More Red Nightmare are the more melodic tracks of the album, nice but nothing that blows my mind. Providence is a pointless experimental piece that goes absolutely nowhere. This is the kind of thing that the band (sadly) would do more of on the other Wetton-era albums.I find Red a bit overrated and it is hardly the masterpiece people say it is. The inclusion of Providence alone guarantees this album a less-than-four-star rating. But with some good songs in the middle and a fantastic ending, this album is still a good one; recommended for the wonderful Starless alone."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Saturday, August 30, 2008",
      "rating": 4,
      "text": "I have never hidden that KING CRIMSON, specially after \"Larks Togues in Aspic\" is not my cup of tea, I like experimentation as any Progressive Rock fan (If not, I would be listening Rap), but always believed that Fripp and Co. went too far in some occasions.Albums as Thrak sound to me as if a group of workers from a moving company were throwing the instruments to the floor, but at the same time I can't stop recognizing the genius behind this cacophony, mainly in albums like \"Red\" which have a solid melodic structure and learned (not without effort) to enjoy.Some people ask me: Why review an album from a band that you don't like? The answer is simple, only being free from the heavy burden of being a fan, a reviewer can give a totally impartial opinion, I try to do this with bands as GENESIS or ANGLAGARD, but you never leave the subjective component behind, so in the case of KING CRIMSON is easier, because I respect them, but I'm not remotely a fan.The album starts with the title song \"Red\", after a short distorted intro, the warm and familiar voice of John Wetton receives the listener friendlier than usual, no elaborate arrangements or complex structures, just John's voice, Fripps extraordinaire guitar work and Bill drums with the guest creating a Jazzy background. Of course we would be talking about a different band if the song didn't got more elaborate as it advances, but this time I find coherence and logic, special mention for Bill Bruford's work in the drums, is simply outstanding. Sometimes less complexity is better and this is one of this cases, love this track from start to end.\"Fallen Angel\" continues in the jazzy vein of the previous track, but this time Ian Mc' Donald's subtle sax adds extra beauty, while Fripp creates a solid sonic wall and John Wetton delights with a fantastic bass performance. It's interesting to see how the song goes in crescendo but in a determined point always gives a step back and starts all over again, magnificent work.Having a strong case of aerophobia, \"One More Red Nightmare\" has a special meaning for me, Robert Fripp has to be a genius to musically demonstrate exactly what I feel when I climb to a plane, the conflictive sound with distorted vocals describes perfectly the terror I feel.I believe that if an artist must be judged for something, is for his ability to transmit what he's playing, and \"One More Red Nightmare\" does it perfectly. The haunting and repetitive guitar section is simply breathtaking, leaves me extenuated each time I listen it as if I was leaving a plane.And the lyrics are just perfect, I heard myself repeating similar words hundreds oof times at 10,000 feet, only a person who feels what they play and say can appreciate how accurate this track is. Call me masochist.maybe I am, but I love this song.\"Providence\" is one of those tracks that make me dislike most KING CRIMSON, maybe I'm too close minded for this kind of experimentation, I don't know, but I always believed a song needs a melodic structure, some coherence and logic, for me \"Providence\" is just a collection of random sounds that say nothing, sorry, but I can't deal with this.Now we go to the opposite side of the musical spectrum, from cacophony without sense (for me), to one of the most beautiful melodies in Progressive Rock history, so sweet and nostalgic that is hard to believe KING CRIMSON is responsible for such a masterpiece.Doesn't matter the difficulty to catalogue it in any known genre, being that we have a lot of Jazz, elements of the Power Ballad, radical changes, aggressive guitar and bass collision with the most melancholic keys and winds and Bill Bruford keeping a low profile and allowing Fripp and Wetton to be the stars, everything conspires to make of \"Starless\" the best KING CRIMSON song ever (IMO of course).Before \"Providence\" I was ready to rate \"Red\" with five stars, but after the same song my personal rating went down to three, only \"Starless\" is able to rise it to four solid stars."
    },
    {
      "reviewer": "The Whistler",
      "date": "Posted Wednesday, October 1, 2008",
      "rating": 4,
      "text": "(Starless and 4.5)Okay, serious time. There are some bands that have an album that really define art in rock at the time. Tull did it in 1972; Pink Floyd in 1979. King Crimson revolutionized the concept of art in rock in 1969, and again in 1973, and then fully cemented that revolution in 1975. To strike with lightning once is hard enough, and most bands can't even try. To strike with lightning more than once is...almost impossible.Simply put, Red is an amazing album. It's not perfect; it's probably not as good as Larks Tongues, lacking the earlier album's consistency. However, it holds just as well written material, and perhaps hits even harder (made all the more impressive considering that Fripp and the gang had just ridden off the heels of the scattered, confusing, and thoroughly unsatisfying Starless and Bible Black, which I've largely erased from my memory).We open with the title track, something which you might not even associate with Crimso. \"Red\" is a fully instrumental riff-fest, almost Sabbath-esque in its slow, crushing heaviness. However, Sabbath was never this complex, deep, or COLD. In fact, \"Red\" stands as one of the coldest tunes I've ever heard, especially when the cellos pick up towards the center.Even better is \"Fallen Angel,\" a gorgeous, gorgeous ballad with a wonderful, hard-hitting melody that hits all the harder when it picks up in heaviness. Wait a second...gorgeous ballad...heavy? Fear not! \"Angel\" is one of those rare, rare occasions when something is both beautiful AND rocks. And it really does, when the complex-as-get- out/layered-to-death instrumental section takes over in all its blazing glory, and not a SHRED of emotion is sacrificed. Pretty much perfect.\"One More Red Nightmare\" closes the first side with another brutally evil riff, wonderful percussion and fantastic lyrics about a plane trip gone wrong. But then, it all speeds up, and turns into a great excuse for some good old fashioned saxophone jamming. Ha! When's the last time you heard a sax on a Crimso record, eh? Too long, right?However, just in case you forgot that this was King Crimson, we have to have at least ONE lousy improv ala Starless and Bible Black. \"Providence\" is the tune that keeps the album from ever getting higher than a solid 4.5. Now, I dig improv as much as the next guy, but only when it's attached to an actual melody. You can get largely the same effect by watching somebody scratching a bird cage with a coat hanger for eight minutes, only \"Providence\" is slightly less interesting; the only part that sounds halfway decent is the end when Bruford kicks in, but by then, it's all over.Luckily, we close with \"Starless,\" which has nothing to do with Bible Black. Well, except the lyrics. It opens as a beautiful mellotron drenched sax ballad, with one of Wetton's finest vocal performances. Then, it quietly shifts to a fascinating build, where you have the choice to focus on Fripp's ever angering guitar riff, Wetton's ever changing bass melody, or Bruford's ever weirdening drum effects. In the end, all the tension is released in a heart pounding sax solo, where the original tune is replayed with EVERYONE busting their guts out, and never once losing sight of the tune's beauty. Basically, a prog rock orgasm. Hmm...rocking but beautiful? Isn't that the second time I've said that this album? The last time that happened was Thick as a Brick...Like I said, Red's not perfect, but a landmark nonetheless. And I DO have trouble choosing a favorite song; I'm pretty sure the best is \"Fallen Angel,\" but \"Starless\" is just so damn strong! Oh well. Emotions will certainly run high spinning this record. It IS possible to overrated it, but only a fool would deny the overall importance of the album.Half the reason it's so good, and I think this is vital, is the fact that it was the last King Crimson album. It's sort of like The Doors' L.A. Woman, another amazing swan song. The core trio is in top form here: Fripp is as impressive as ever, Wetton sings like his life depends on every line, and this might be THE Bruford album; and, realizing that no one, let alone themselves, cares, the band pulls out all stops: art metal rockers and jazz ballads, whistling up session players and old friends for guest spots. I mean, even \"Providence,\" as dull as it is, is part of the formula, and Red wouldn't be Red without it.Love it or hate it, Red is an important part of prog rock history (and music history in general; it invented grunge, didn't it? And I HATE grunge, but I LOVE this. Go figure). The fact that it's also a really, really good album chock full of amazing songs...is like a wonderful side effect."
    },
    {
      "reviewer": "LiquidEternity",
      "date": "Posted Thursday, October 9, 2008",
      "rating": 5,
      "text": "Though King Crimson made some terrific albums before and after, I wholeheartedly believe that this is the band's strongest release, the apex of their progressive discography.The energy, the aggression, the creativity, the talent, the unique blend of melody and dissonance, the haunting soundscapes--all are here, and all are at their best here. Robert Fripp is at his ultimate best playing the guitar, from deadly riffs to power drill solos to gentle melodies to wild improvisations. John Wetton's voice not only sounds wonderful here, but it fits the music exactly like it should. Bill Bruford drums like an absolutely madman when he should, and I can't think of any drummer who grooves and slams as tastefully as he does here. A few spots from guest musicians rounds out the sound, blessing the fans of King Crimson with a wonderfully well rounded album full of inspiring melodies, explosive musical action, and what I believe is the best song the band ever wrote.The first side opens with the title track, an aggressive (some would even say it's the first progressive metal song ever recorded) instrumental with darkly distorted guitars and wonderful harmonies. The drums fairly annihilate standards of rhythm, though not always in a manner as obvious as it would seem they should. As much as I love this track, it's very easily summed up and hard to keep talking about.Fallen Angel sounds at first like it might be one of those standard King Crimson ballad bits, but that would be a grave error. What we have here is, after a fair bit of wonderful vocal extravagance from Wetton (and yes, he sounds absolutely amazing here), a heavy middle section. In this section comes Fripp on the guitar, rocking the power drill and absolutely tearing up his guitar in pursuit of what may be the most impressive solo in his career. It wraps up nicely with the vocals carrying out the melody, sounding so melancholic and haunting yet not depressive at all.One More Red Nightmare draws a lot of flak from people, though I can't see why. What we have is an interestingly laid out riff that gives Bruford massive amounts of room to groove. Give it a high-energy verse with a catchy melody and (gasp!) handclaps, and you've got an exciting tune that even someone not so into progressive music can sit down and enjoy as a quality song. The saxophone here lays down some wonderful counterpoint and syncopation as it concludes the song with an extended solo section. Very much a fun, rocking song.The weakest track on the album is the experimental and slightly noodly sounscape Providence, which, I think, when compared with the other same sorts of songs by the band, is second only to The Devil's Triangle in terms of compositional structure and overall effectiveness. It builds with some spectacular bass by Wetton (and I mean spectacular), grinding to a very awesome conclusive climax, preparing the listener in the only way possible for the album closer.Starless wraps up Red quite effectively. I do consider this to be the best song the band ever wrote. The first four minutes are a gentle sort of throwback to earlier Crimson spacey tunes, with the mellotron backing John Wetton's strongest vocal performance that I have ever come across. After the third chorus, however, the song switches into a minimalist soundscape. Bruford then takes over, with the guitar and bass locked in a groove, and he kicks some serious funk into the song for a good length. It all comes to a head with some interesting delay effects on the guitar and an absolutely sick bass riff that would make just about anyone who tries to write parts for that instrument jealous. It is a song that must be heard, and it must be heard multiple times.This is, in my opinion, the strongest album that King Crimson every wrote, as well as being powerfully accessible. People who are not very familiar with the band can dive right in and enjoy the first half of the LP for sure, and the second half eventually. I'd highly recommend this to anyone who enjoys progressive music that isn't just the standard sorts like Yes and Genesis. King Crimson were still the prog rebels in this era (in truth, they are now, still), and this aggressive album does dramatic and powerful things with music without being too pretentious or painfully indigestible.Yeah. As highly recommended as I know how. Probably the best-constructed album of the 70s."
    },
    {
      "reviewer": "CCVP",
      "date": "Posted Thursday, October 30, 2008",
      "rating": 5,
      "text": "This is it! The pinnacle of all King Crimson's career, the probable pinnacle of progressive rock, the last chapter of King Crimson as we knew it and an undeniable piece of art of a splitting-up bandBeing the last King Crimson release during the 70's, and only being released one month after Robert Fripp disbanded a band that is a fundamental pillar of progressive rock as we knew in the past, today and probably in the future for generations to come, Red is the ultimate proof of Fripp's and Crimson's brilliance in almost every aspect, as far as progressive rock goes. Uniting the band's traditional innovation, experimentation, jazzy improvisation, music writing skills and musicianship, Red took both King Crimson's albums from 73 and 74 and upgraded them to a never seen before display of recorded jam sessions, with unmatched professionalism.However, Red was only able to be so good because the band got smaller, their songs became less unnecessarily complex and more focused. Actually, that is exactly the greatest flaw of Lark's Tongues and Starless and Bible Black: they lacked FOCUS. Wile both albums were great, its excesses compromised their final objective, which was to deliver great music, because, lets face it, without focus music is nothing but random notes being played, something that can be seen a lot in Starless and sometimes in Lark's Tongues. So when King Crimson made their music more focused they were able to surpass all albums they did before, because in Red all notes played and all drums or percussion hit are meaningful.A lot of that band focus in Red may be due to the leading role that Robert Fripp's guitars have. I mean, here the guitars have the highlights in almost every music instead of that answering-questioning game between the guitars and saxes / violins or between the saxes and the violins or between any other instrument. Here, the music is pretty much straightforward, having the guitars in the main or leading role and all other instruments are supporting the guitar, though it may not look like so sometimes.And that is exact reason why i love Red so much. That is why Red, alongside with Gentle Giant'sIn a Glass House, is my favorite progressive rock album of all time: it's simple, straightforward, spontaneous, innovative, traditional (because it still bares thetraditionalKing Crimson style), focused, beautiful and sounds forever fresh and edgy. Also, the songs are all great, almost reaching perfection, showing that the band was able to deliver a wondrous musical experience throughout the album with great constancy and balance (though with the help of some invited musicians), what some other traditional bands lack in their albums released at the same year as Red. The instrumental work is also amazing, much like in other King Crimson albums. As a side note, i would like to sign Bill Bruford's exceptional drum work, as always.Grade and Final ThoughtsWell, i don't think that there is another way to express why i appreciate and love this album so much. i mean, the songs just can't get much better that this, the instrumental work is fantastic, the album has a big number of exceptional qualities and, to top it all, is the last Crimson document in the 70's, closing the initial part of their careers the best way the possibly could with a studio album. I seriously cannot understands how can someone rate this below 5 stars or, even worse, below 4 stars."
    },
    {
      "reviewer": "ProgBagel",
      "date": "Posted Monday, November 24, 2008",
      "rating": 5,
      "text": "King Crimson - 'Red' 5 starsThe ultimate jam record.This album is pretty much a set of jams in my mind. In that case, this is the best collection of jams I have ever heard. A good amount of this was recorded live, so that contributes extra to that true jamming feel. The songs are extremely tight, and have some fantastic vocal and bass work by John Wetton.This album featured plenty of guitar overdubs, which was virtually impossible to deal without since King Crimson's sound has always been so big, and there were only three members here. An important adds on was Mel Collin's who contributes his best work in the closing epic 'Starless'. Wetton's sound on this album is probably my favorite bass work of any musician. There has never been a louder and heavier bass in a mix before, and I find it to be incredible. The end of 'Providence' in particular, brings the instrument into its height.'Starless' has to go down as the best Crimson track hands down. From the somber beginning and slow rhythm section, leads to one of the biggest build-ups. Haunting, yet beautiful, it finally goes into a jam where Mel Collins illuminates his signature sax style like never before. Wetton's heavy bass with Bruford providing back-up brings this behemoth to its end.Any fan of music in general can find promise in this record. I would even call this album to be Crimson's most accessible due to it just having lots of rock elements, but turned the volume and virtiousticity up about twenty notches."
    },
    {
      "reviewer": "progrules",
      "date": "Posted Tuesday, January 27, 2009",
      "rating": 3,
      "text": "It took some guts to try another KC album after the huge disappointment of Lark's Tongue for me. But after hearing the streamsong Red that was still on our site a while ago and reading some comments that Red was something totally different where the overall sound and style is concerned I gave this one a try at last.I always liked Red, a song that is about the opposite of the dull and a-melodic Lark's Tongue songs. Red is fierce, kind of hard rock you might say, great song. So that's at least a good opener bringing me in a more positive mood than the predecessor. Next song, Fallen Angel, is more of a regular song, in between the two mentioned styles. Nice track but nothing great. One more Red Nightmare is again more in the style of the opener, albeit less rough and more melodic even. Good track. With Providence alas we go back to Lark's style or even worse. This is the kind of experimental music I detest, it's wasted on me completely. Still slightly better than the average Lark's Tongue standard. The album closes with Starless, a famous song but new to me. I can't say I missed out on something outstanding or magnum opus like all those years but I don't think everybody will agree with me. It's a good epical song no doubt but better epics have been written in those days and then this is only a bit of a pale one.All in all Red is a lot better than Lark's Tongue to me but that is not a surprise really. Anybody who knows my taste knows that the more energetic stuff has my preference. And that is what is present on this album. A well deserved 3 stars this time."
    },
    {
      "reviewer": "The Sleepwalker",
      "date": "Posted Saturday, February 7, 2009",
      "rating": 4,
      "text": "The Career of the band King Crimson has known several style's, eclectic, experimental, jazzy. This album is one of the three metal albums, together with Larks' Tongues In Aspic and Starless and Bible black. I don't think these albums can be called metal, though they often are. The albums do have some heavily overdriven and distorted guitars, but I rather call it heavy prog. Red is made up of five different songs, most of them are pretty heavy.Red: The first track on the album is an instrumental which is based around Robert Fripp's distorted guitar. The song has a catchy riff, and a slow, heavy solo. the song is pretty good, though it is a bit too much of the same, compared to other King Crimson guitar based instrumentals as Fracture, from the Starless and Bible Black album, this one isn't very strong, but still a nice opener of the album.Fallen Angel: One of my favourites of the album. It's a ballad which starts with a violin intro and is mostly acoustic guitar driven. After a while Robert Fripp starts playing a very catchy, strong riff. The song is based around Wetton's vocals, but also has a jazzy interlude. One of the most beautiful heavy songs i've ever heard, definitely one of my favorites.One More Red Nightmare: Just as the previous two songs, this one has a strong and catchy riff. The verses of this strong aren't really that strong, the lyrics don't really interrest me, though John Wetton has great vocals in this song (as always). The middle section of this song is kind of jazzy, compareable to the jazzy interlude of Fallen Angel.Providence: By far the least good song of the album, it's an improvisation which can also be found on the live album The Great Deciever. The song opens with creepy violin and guitars, bass and drums will join the violin later in the song. I love the violin as an instrument, I also love the violin used by King Crimson in songs as Exiles, but I don't seem to like it in this song. The song lacks structure, and I know KC can give improvisations structure, several live album contain those.Starless: The longest song of the album, and probably the best. it starts out with a overdriven guitar with tone turned down, so it has a very characteristic sound. The guitar in the intro is often replaced by violin in life performances. the vocal part of the song sounds pretty sad and the lyrics are nice, too. after a while, the calm part is over, the song turns into some sort of improvisation. Robert gives a way a guitar solo... of two different notes. The chaotic, instrumental Starless goes on for a few minutes and then the song is finished, just as the album.39 minutes are pretty short, definitely for a great album as Red, I would have loved to hear some more songs of this King Crimson style. The final album of the 70's King Crimson is one of their best."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Friday, February 13, 2009",
      "rating": 4,
      "text": "This album ranks among my favorite King Crimson albums. The title track, which stands with my favorite instrumentals, is powerful and exhibits exceptional musicianship right off the bat. Overall the album is extremely good, but one lengthy track really fouls the whole affair.\"Red\" The title track is one of the greatest progressive rock instrumentals ever written, better than either part of \"Larks' Tongues in Aspic,\" and \"The Devil's Triangle.\" The main sections are genius, and rank among King Crimson's best. Bruford's drumming here is phenomenal. The music features the perfect blend of dynamics, managing to work together the loud, cacophonic interplay of instruments and quieter, more refined moments. It is harsh, grating, and explosive- everything one would expect from the perfect King Crimson instrumental.\"Fallen Angel\" Opening with a synthesizer and stringed instruments, this had been my favorite on the album for a long time. Wetton's voice is most pleasant here, as is Fripp's guitar. The dynamic horn and static electric guitar work against each other in such a way that the end result is very satisfying. The music transitions from calm to harsh and many places in between.\"One More Red Nightmare\" This song has a menacing introduction but groovy verses. It has a similar sound to the title track, and a great guitar part that gets smothered by hand claps (even the drumming and bass playing get drowned out a bit). An alto saxophone solo occurs during this section, as well as in the end. The cheesy hand clapping almost ruins this song, though.\"Providence\" It seems King Crimson can't put out an album without messing around. Why it has to be the second longest track on the album is beyond me, but it is. David Cross's violin very beautifully begins this eerie piece of nonsense. It is a tad more coherent than \"Moonchild\" from the debut album, but that is saying very little. The band jams a bit towards end, with Wetton's distorted bass, Cross' violin, Fripp's guitar, and Bruford keeping beat, but it's not a pleasant track to listen to in my opinion.\"Starless\" The title of this one comes from the previous album. It hearkens back to several other King Crimson songs, having Mellotron, saxophone, and a verse-chorus structure. Fripp satisfies himself with a mere two notes during the rather lengthy section in 13/8, during which Wetton employs a distorted bass and Bruford builds the rhythm with creative drumming. An amazing saxophone takes over with impressive drumming thereafter, also reprising part of the vocal melody. While not my favorite King Crimson track, this one does deliver."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Tuesday, March 24, 2009",
      "rating": 5,
      "text": "Believe the Hype - this is RED hot!An excellent album and one of the best of the Krims. An album that delivers on every level from the incredible musical virtuosity of the title track to the inspired mini epic length Starless, the CD is all that we love about King Crimson - complex musical genius and lyrics that transcend the norm, lots of jazz fusion and weird drum patterns, and strange instruments mixed with guitars and drums. Every track on this CD is a bonafide classic. Fallen Angel is beautiful and mystifying, One More red Nightmare is a catchy 7 minute little gem that is one of the best from the band, Providence is what it is - lots of kanoodling with strange instruments that is highly intriguing music. Then there is the absolutely brilliant Starless! Flawless, from end to end of its 12 minute length.Unlike the disappointing content of Starless and Bible Black, Red is essential Krimson. Incredible guitar from Fripp is complemented by the intricate time signature patterns of Buford and Wetton is at his best. This lineup of Krimson is about as good as it gets and many fans would agree that it was these musicians that formulated the best material in the huge repertoire of the band. Many of these tracks found their way to the best of Krimson Cd collections available and for good reason.As usual the booklet is excellent with lots of interesting info about the making of this album, the live shows and the songs. There is little else that needs to be said except this is one of those CDs you will not want to miss out on. So try it as soon as you get a chance and I am sure you will be absolutely delighted."
    },
    {
      "reviewer": "lazland",
      "date": "Posted Saturday, April 25, 2009",
      "rating": 4,
      "text": "Easily my favourite King Crimson LP, this heavy album still rates in many magazine polls as amongst the best heavy rock LPs of all time. It was such a pity that this proved to be the swansong of the Wetton, Bruford, and Fripp incarnation of the band, and indeed the '70's incarnation, as Fripp called it a day soon after.The title track absolutely blasts out of a decent set of speakers. Thundrous riffs intermingle with incredibly paced drumming, this is as hard as KC got in this period, and it certainly still holds its own now.I really enjoy both Fallen Angel, especially Wetton's vocals, and One More Red Nightmare again moves at a cracking pace, with a great sax solo put in to boot.The disappointment, and the track which prevents it from being a perfect five stars, is Providence, a pointless piece of noodling, especially the Cross violin parts, it really feels out of place in all around it.This is a shame, because the actual KC swansong, Starless, is one of the finest prog rock tracks ever written, and still my personal favourite mellotron moment at the end of the track, when the instrument blasts out to the accompaniment of woodwind and a huge bassline from Wetton. His vocals are extremely delicate, and Fripp, who knew he was disbanding the outfit, puts in a really thoughtful guitar piece, which extends for many minutes without ever losing the listener's attention. This, of course, is simply the buildup to one of the most explosive ends to a track ever written.Four stars, but, if you forget Providence, one of the most essential purchases for any prog collection, and worth buying for Red & Starless alone."
    },
    {
      "reviewer": "Dobermensch",
      "date": "Posted Friday, May 29, 2009",
      "rating": 4,
      "text": "Like \"Q\" magazine once stated - 'Red' is a heavy album - but it's heavy in an atmospheric crushing way. It's very different from past KC albums - whereas this is played as if it's the last album they'll ever record, which I guess in a way, it was. It sounds terminal - in a 'Swans' kind of way. Now that's the way I like music to sound! Forget about the poor cover. Crikey... I bought 'Islands' thinking that it would be a great album, solely on the sleeve design. How wrong could I be!For what seems like a simple record on first listen, this is actually an incredibly difficult score which is coped with brilliantly by Bruford's drums (he appears transformed after the help of Jamie Muir on Lark's Tongue...) and John Wetton's vocals which fit perfectly this kind of music.This seems to be the Crimson record you guys over there in the United Snakes of America seem to love. It certainly has a 'rockier' edge to it than other King Crimson records. The undoubted highlight is \"Starless\" - the last track - and probably the best track they ever laid down. Surprising really when you consider that half way through - there's a one finger guitar solo by Robert Fripp. In a mere 12 minutes I'm left bewildered - not knowing if I'm sad, depressed or elated. An excellent album."
    },
    {
      "reviewer": "Kazuhiro",
      "date": "Posted Thursday, July 23, 2009",
      "rating": 4,
      "text": "After the declaration of the dissolution of the band had been formally announced by Robert Fripp, this work that hit their totaling 8 work eyes was released. The work of KC until this time was famous because the member's composition was different every time the album was announced. The fact with the flow that neither belongs to the band like KC is interesting though the member who was on the register to Larks 'Tongues In Aspic also did the activity of music in various fields.How to repulsion to Fripp by the member and music to catch might have differed in no small way. However, they always catch the flow in the age and have evolved. After having ended the tour in the contract, the line of Burrell-Collins-Wallace-Fripp faced the state of the division of the band. It is guessed also that it is an event received at the same time by relations of a black magic element of Fripp. Sinfield might have been puzzled to such an event, too.However, the flow of the band that changed it radically did not arrive at the member's continuation either. The flow of the band from Larks 'Tongues In Aspic might have been a flow with the tension indeed. And, the band had formally announced the declaration of dissolution before announcing this album.Five guests' in addition to the line of Fripp-Wetton-Bruford musician is participating in the recording in this album. Dissolution was declared by Fripp though the rumor said that Ian McDonald that participated in the recording of the album would return to the band was circulated.The photograph of the meter is adopted on the back side of the album art. And, the photograph of member's face comes out in the art in the table. In these events, it is one of the topics to have called various guesses among listeners."
    },
    {
      "reviewer": "tszirmay",
      "date": "Posted Saturday, August 1, 2009",
      "rating": 5,
      "text": "Mean, portentous, dark, brooding, verging on schizoid, insane, outrageous, completely inspiring and modern after nearly 35 years of presence. There are few recordings before and ever since that thrusts a listener beyond the pale, throttling wildly into the deepest sonic chasms. \"Red\" is an iconic slab of progressive rock concrete, with a trio of destructive power mongers in Bill Bruford, John Wetton and Robert Fripp. Their pedigree needs not to be even broached, as it has now entered legend. I have surreptitiously played this album to uninitiated youngsters convinced that Metallica were the prophets of hard edged rock music and their collective jaws are still lying in some drool-drenched puddle somewhere. This is a black and red experience, the rage from the buzz saw guitar is ominous, the grimy bass pummeling with brutish abandon while Bruford bashes boldly. \"Red\" conjures images of bleeding violence, slashing with crazed fury and eruptive decadence, an outright musical lesson to all fret aces, bass babies and drummer boys. The volcanic brew verges on tectonic fractures, profoundly harsh and disturbing. \"Fallen Angel\" is a much needed respite from the preceding turbulence with some soft reeds, acoustic guitar and a wispy Wetton vocal , all held together by a hardwood staircase guitar riff that uses the feral sax as a railing and some inventive BB percussive drumming that keeps the premise intricate and bizarre. \"One More Red Nightmare\" I guess says it all in the title, a simply amazing ICBM prog workout that has hissing gases spewing from the boosters, BB plowing manically in polyphonic glee, cymbals splashing wildly, while Fripp and Wetton keep it all focused on the ground zero target. A bestial slice of ultra-modern progressive rock that deserves an even wider audience of admirers, the main riff is unrelenting in its sonic carnage. (I had the kids gaping on this one!). Red marked the end of a career for this devastating crew, surely one of the top line-ups anywhere, issuing three bona fide jewels that still stand the test of time. Again, breathing space is needed after such an onslaught, \"Providence\" gladly obliging with David Cross shining on violin, sinuously carving gentle pools of cat gut frenzy, disjointed and oblique at first until the hyper-trebly bass cattily establishes its torture. King Crimson at its most experimental (or just plain mental!), Fripp scratching and clawing his black and venerable Gibson Les Paul giving the green light for some serious jamming and colossal interplay between the lads (I just follow the growling bass, lest I get too lost in maelstrom). A classic piece of genius, though not exactly easy listening or romantic candle light music (darn I should try it next time, see if I can get slapped earlier!). The closer is arguably KC's finest moment (with Epitaph), a brooding epic loaded to the gills in phosphorescent melancholia, a scintillating opus that has all the needed atmospherics, with massive torrents of mellotron and a whimsically despondent saxophone wailing away the pain of the universe as expressed by Wetton's lush voice. The instrumental section is utterly preposterous, Fripp's jangling guitar keeps things emotional and intense, Wetton's subtle bass foraging a path into the sonic forests where Bruford drops assorted percussive acorns. When the binary beat kicks in, the rapture is complete. Hectic, paranoid, manic, disturbing, chaotic and magnificent. The sax solo is one for the ages and the crashing exit that recalls the main theme, mellotron ablaze and smoking. A monument of perfection for the ages. 5 Cigarettes, Ice Cream and Portraits of the Virgin Mary."
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Monday, September 28, 2009",
      "rating": 4,
      "text": "Red was not my favorite KC album, and still I heard it till it wore out. My cousine gave me as a birthday gift when I was 15 and she didn�t like it at all, which was predicable. But I loved it! It had a bitter/sweet taste for me because by the time i got it I knew that the great King Crimson was no more. And at 15 you think they�d be gone forever (and, in a way, they were). But the music inside was marvelous. Probably the `heaviest� KC album till then, it proved the magic between Fripp�s awesome and original guitar technique, Bill Brufford�s ingenious drumming and the down to earth bass and vocals of John Wetton. David Cross had left the band during those sessions but his violin playing is very present here.And It is only ironic that this final work had the presence of such legendary bandmates of the past as guests: from the initial period we have founder member Ian Mcdonald, from their jazz period of Lizzard comes Marc Charing and from the chaotic Islands, Robin Miller. All to give their farwell to the Crimson King (no hard feeling!). The music inside is very inspired and powerful, with the title track becoming one ofo the most well know nCrimson tracks, even if it is totally instrumental and a bit too heavy for their style. Fallen Angel is one of their most poignant numbers and One More Red Nightmare is a personal favorite of mine. Second side was not really my fave at the time but now with the CD edition I can see they as good as the others.While I still think that Lark�s Tongues In Aspic is their best of that period, Red is an excellent work that any prog lover should have. A strong album that closes one of the many phases of one of the most important prog bands of all times. RAting: soemthing between 4 and 4,5 stars. Highly recommended."
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Thursday, October 22, 2009",
      "rating": 4,
      "text": "'Red' - King Crimson (74/100)King Crimson'sRedhas long reminded me of another classic prog record from 1974, that beingYes' fantasticRelayer. Although the sounds of the two bands are little alike, both albums share a similar role and place in their native discographies. Superficially,RedandRelayerare the seventh LP for each band; more importantly however, they structurally reflect and intensify each band's longstanding masterpiece. In the case ofYes,Close to the Edgewas (and arguably still is) that band's institutional zenith, andRelayersought to take its three-song structure to new heights and chaos. In the case of King Crimson, there's no doubt that the magnum opus in question wasIn the Court of the Crimson King, and whileRedhas long since earned a wide following unto its own, there is the far-reaching sense listening to this album that Robert Fripp and company were, in part, trying to see how much further they could push that structure of album. It wasn'tKing Crimson's first attempt to reinvent their debut (their sophomoricIn the Wake of Poseidonwas an obvious copy ofIn the Court) but it's certainly the finest. The dark, progressive proto-metal heard onRedis undoubtedly years ahead of its time, but many of the stylistic and structural flaws of the debut have leaked into the sound here. Prog rock fans from here to sunset will attest thatRedis a masterpiece tier godhood, but it seems to me like the album's glaringly inconsistent pace and quality has held it back from the excellent record it could have been.Yes, I have the audacity to callRed- one of this genre's most beloved albums- less than a masterpiece. If you haven't seen fit to track down my home address with the hopes of poisoning me with anthrax yet, I'll assume we're able to agree at least that even the most historically acclaimed albums should be open to scrutiny and criticism. In the case ofRed, it is a tricky situation, because parts of the record are groundbreaking to the point where the rest of the world wouldn't catch up to them for years. The oppressive title track and opening instrumental \"Red\" is precursor to progressive metal by over a decade. The gorgeous and mournful \"Starless\" is blessed with one of the richest guitar tones I've ever heard on a record. The ecstatic fusion blow-up at the album's end conjures almost as much awe as the glorious mid-section to \"21st Century Schizoid Man\". Like I said, there is the brilliance of a genius present here, but something's still missing.UnlikeIn the Wake of Poseidon, I don't thinkRedis held underneath the shadow ofKing Crimson's most obvious achievement.In the Court of the Crimson Kingis still a far better album in my books, butRedseesKing Crimsontaking a totally different route with the structure. In this case, the debut's structure I've been referring to so often relates to the five song formula, wherein the first song will kick things off with an explosive bang, the second track will be soft, the third will try to strike a balance, the fourth will be long and experimental, and the fifth will be an epic that finally seeks to knock the first off its throne. \"Red\" is nowhere near as monumental as \"21st Century Schizoid Man\", but the impressive effect is still there, and the almost dystopian atmosphere sets the tone for the rest of the album. The soft quasi-ballad \"Fallen Angel\" draws a strong, darker parallel with \"I Talk to the Wind\", and so forth... Further comparisons between the two albums may only serve to take the focus away fromRedas an artistic work of its own; it is enough to say thatRedfollows the same arc, albeit on a much darker wavelength.The title track and \"Starless\" are easily the best things the album has to offer. On top of the foreboding timbre, \"Red\" is a superbly written track: it is meticulous, calculating and offers none of the symphonic warmth offered by other progressive acts of the day. On the other hand, \"Starless\" embraces that warmth; the guitar tone and central melody is heartbreaking the first time you hear it, and while the track eventually deteriorates back into the dissonance of \"Red\" for a time, it ultimately peaks with an explosive saxophone solo that brings all of the life back at once.The other three songs here are unfortunately far less impressive than the masterpieces that bookend the record. \"Fallen Angel\" starts off as a good change of pace from the title track, but plain vocals (offered here by John Wetton) and painfully irrelevant lyrics keep this ballad from ever striking an emotional note. \"One More Red Nightmare\" definitely reflects the first song in the guitar tone and generally jarring atmosphere, but once again, John Wetton's vocal parts feel underwhelming and needless; the purely instrumental sections remain as compelling as ever, but the rest of the song feels half-baked and fails to reach me. \"Providence\" recalls the puzzling boredom of the extended \"Moonchild\" offIn the Court of the Crimson King, except in this case, there is no beautiful song buried within the meandering to make it really worth it. It's not so irritating as \"One More Red Nightmare\", but it's generally uninteresting and seems to serve no purpose on the album, save as a way to build up anticipation for \"Starless\".King Crimsonhave musicianship and guts enough to survive in virtually any incarnation, with any number of musicians. Outside ofRush, it's uncommon to see a trio playing prog rock, but listening toRed, it usually sounds like Fripp, Wetton and Bruford actually benefited from having less cooks in the kitchen. If anything feels out of place or less impressive, the finger should be pointed at Wetton's vocals. He's a decent singer, but lacks the softness in tone or charisma to have compensated forKing Crimson's otherwise unfeeling nature. Greg Lake did a noble job of it- I cannot say I feel the same for any of the vocals here, those on \"Starless\" included. Maybe it's that his voice and demeanour here are a little too severe. Greg Lake balanced outKing Crimsonwith sensitivity, and Adrian Belew (KC's next vocalist following their hiatus) had wild humour and charisma in his delivery. CouldRedhave truly existed with either? I'm not sure, but the way things have been left,Redfeels awfully dry.King Crimson's defacto 'other great album' is cold, unfeeling and ominous. Those are some of its best qualities. Whatever its flaws, it's a vastly memorable album. Yet, try as I might, I can't dissociate my impression of the album from the perceived format and structure of the band's debut. It's not necessarily a bad thing to revisit a structure that 'works' (I actually think ofYes'Relayermore highly thanClose to the Edge) but in doing so, it's brought the flaws of the debut along with it. That's not counting the problems it made on its own."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Tuesday, October 27, 2009",
      "rating": 5,
      "text": "The most heavy KC album from their seventies! Real rock and real prog!Now as a trio, the band missed their over loaded constructions, their not often very successful mixtures of prog and jazz. And they got a drive and more clear structure. So, some kind of power trio plus highest level jazz section. The result is what you're expecting: perfect progresive rock of high energy.Possibly one of the best KC line up recorded this last album of the decade and they put in this music everything they collected during some years of their activities.I can hear many moments from KC great debut album there, but at the same time, there are some new sounds, which will be realized only in \"Discipline\"! What a great work!This album is very popular between KC fans, but some of them don't like it because of it's simplicity and heaviness. It's difficult to comment these points of view, it's more question of taste. As for me, I think after their fantastic debut album, KC first time rich so high point with their music after some years of experimenting and all the line of successful and average albums. Their final work and the best result of first period of activity."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Thursday, October 29, 2009",
      "rating": 5,
      "text": "With Red comes an end to Crimson's most highly valued period for many fans. And it's sure a fine way to exit.I must be one of the few who never cared much for the two preceding releases with Wetton. Those albums always sounded detached and disinterested to me. Even though I devour every live album from those years, the studio albums didn't do it for me. No so with this one. It is sharp, vigorous and uncompromising. And those songs, so dark and heavy, even though the distortion knob is hardly on.The debut excluded, KC never needed a wall of sound to make their point. Red is the ultimate exercise in stripping down progressive rock to its bare essence. And such a dry sound can only be pulled off by the best possible musicians. Indeed, for me a true virtuoso knows when less is more, when silence works better then plastering every whole, when his instrument should lead and when he should step down. A good musician will try to overwhelm you with his skills, a great one has the self-aware confidence to just give you that one progression that is genius and throw away everything else.Only at the very very end they let go of their restraint and conclude with an ecstatic finale soaked in mellotron. It's one of the last great moments of the instrument and the end of an epoch. At least till a bunch of nerdy Swedes hit upon one in an antique store in the early 90ties and decided to form a band. But that's another story.In the Court of the Crimson King was a key album in the birth of prog and could boast an impressive offspring consisting of ELP, Yes, Genesis and VDGG. In 1974 most of those bands were past their prime but not King Crimson. They simply produced their second crucial prog masterpiece and ignited a next generation of progressive rock bands. Its repercussions in rock music are still felt today."
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Friday, October 30, 2009",
      "rating": 4,
      "text": "King Crimson at its best!!!I'm listening to the seventh studio album by King Crimson - Red - with great pleasure. I truly believe this album is band's best one. It contains a lot of special ideas. If we back in 1974 it's we won't listen to any metal music, because it still doesn't exist in it's real term of the genre; but this album is direct predecessor to the metal music, combined with intelligent jazz rock fusion and some other totally unknow elements for the commercial market, which seems great in my opinion. This magic number - 7th album is the answer this time. The 7th album = the best album. The experimentation with the sound is very well balanced and measured, without needless and strange sounds like in other King Crimson's albums. The line-up is... historic in my opinion - Robert Fripp, John Wetton and Bill Bruford with some exceptional session musicians. All songs are interesting, memorable, catchy and well-structured.All around the album you can feel the dark mood and the low-pitched tunes of the guitars. Everything on the album reveal a dark and grief picture of human consciousness. The variety of the instruments is remarkable.Flaws (reasons) for not giving 5 stars rating (despite Red is very close to 5 stars rating):1. The presence of solid number of repetitions.2. The presence of scraping sound.3. Unpolished sound.Final rating: circa 4,25 stars, but surely over 4!"
    },
    {
      "reviewer": "stefro",
      "date": "Posted Thursday, November 26, 2009",
      "rating": 5,
      "text": "After the post-psychedelia of their groundbreaking debut, 1974's \"Red\" is surely the next best thing Crimson have produced in the long and varied career of their enigmatic leader Robert Fripp. Featuring John Wetton(bass) and Bill Bruford(drums) as the only two other core members of the group - but with contributions from several members past including David Cross(violin) - \"Red\" is a ultra-heavy, proto-metallic, operatic prog masterpiee that has more in common with the discordant soundscapes of Van Der Graaf Generator than with likes of Yes and Genesis. The eponymously-titled opening track features a crunching metal riff that souds like you've heard it a thousand times before, and that's because you have been hearing the likes of Metallica, Black Sabbath and Tool all mimicking the blistering guitar conjured up by Fripp. Compared to their aforementioned debut, and albums such as \"In The Wake Of Poseidon\" and \"Lizard\", \"Red\" does show some simlarities. The epic-yet-maudlin instrimental sections the band are famed for juxtapose almost perfectly with this new, streamlined, metallic incarnation of King Crimson, with this mixture beautifully evident on the yearning \"Fallen Angel\". \"One More Red Nightmare\" rocks things up a bit more, throwing a faint hint of boogie rock 'n' roll into the sonic blender and stylistically reminiscent of their early single 'Cat Food\" which was released post \"In The Court...\". The one disappointment on \"Red\" is the indulgent \"Providence\", a track that forgoes melody in favour of eerie experimental noises, seemingly-random drum licks and lots of pointless noodling. However, the albums closing track, the superb \"Starless\"(a reworking of a track from their previous album\" amps up the progress-o-meter to the hilt, throwing a violent jazz-rock workout into a dramatic twelve-minute- plus operatic epic that features achingly-beatiful vocals from Wetton. Despite their longevity, and the fact that Fripp has continued to make albums well into the 1990's, King Crimson's peak was from 1969 to 1982. During that period they produced a series of classic albums filled with Fripp's trademark flourishes that appealed to Progressive Rock fans AND fans of Indie, Metal and Jazz. Undoubtedly one the grouo's finest achievements, \"Red\" is a darkly-honed classic and a key album in the development of both metal and prog-metal that saw Fripp stripping down, vamping up and rocking down.... STEFAN TURNER, LONDON, 2009"
    },
    {
      "reviewer": "Muzikman",
      "date": "Posted Sunday, November 29, 2009",
      "rating": 5,
      "text": "Red (1974) is one of those albums that should be in the dictionary under progressive rock. The three main members Robert Fripp (guitar and mellotron), Bill Bruford (percussion) and John Wetton (bass, vocals) were on the brink of imploding and in the midst of a creative summit while recording this session. Unfortunately they did break up after this important work and a new lineup would not emerge again until 1981.Although the core trio made the King Crimson machine complete, they had some genuine professionals that made their overall sound more interesting and progressive bent towards the jazz fusion side of the equation. David Cross (violin), Mel Collins (soprano sax), Ian McDonald (alto sax), Robin Miller (oboe) and Marc Charig (cornet) were all major contributors to the embellishment of their prog rock jazz fusion sound that they mastered so completely on Red. Make no mistake about it; there are three men on the cover of this album for a very good reason. What they created could be classified as many things including prog rock, metal, jazz, fusion, and any combination thereof. Mainly this was a power trio having their way in the studio and then using the other instruments as window dressing.John Wetton did a superb job with his vocals considering that the music's time signature was exceptionally difficult to sing along to much less play and how he ever held his notes and delivered the lyrics on key and with plenty of rhythm amazes me. This was nothing like the vocal parts he would provide for the super group Asia for instance, it is worlds away. Bruford was spot on as usual and the brilliantly talented leader Robert Fripp offered up some amazing guitar playing to constantly challenge his mates to step up to the plate and reach his level of proficiency, and of course they all did and that is why this album is so brilliant.Fripp is well known for being a taskmaster and difficult to understand (check out Bill Bruford's biography). Being a musical genius and reticent to boot made his approach a bit interesting to decipher for his contributors. Nevertheless sheer brilliance was the end result of Red.This double disc 40th anniversary edition gives fans a special package to covet this time with many sound options, videos, and a specially prepared booklet with commentary and pictures. In 2000 this was remastered as well however it did not have all the goodies that this version does. The CD now includes bonus tracks of \"Red\" (trio version), \"Fallen Angel\" (instrumental trio version) and \"Providence\" (full version), which in their own right are exceptional takes that are fully realized and quite enjoyable.On the DVD you have many different options for your listening experience including 5.1 surround sound, DVD-A, High Resolution Stereo Mix 24bit/48khz and DVD-A players can access a 5.1 Lossless audio mix and Lossless Stereo Mix 24bit 96khz. Confused yet? The choices are as complex as the music! I listened to the CD first then popped the DVD into my PC and discovered a folder that popped up with the contents of the disc that did not allow me to play the music so I had to go look at my drives and choose the one the disc was in then click on it and it finally launched my Windows Media Player. Once I did that I thought I was on my way but could not click on any of the menu choices displayed on my screen so I had to click on the sidebar links to initiate any of the audio tracks or any of the four rare videos from a 1974 French TV program. I did get to take all of this in but it was not a seamless process to say the least. The video content was typical for the time frame and fans have been yearning for this footage for years now so it is big bonus. The videos include \"Larks' Tongues In Aspic: Part II\", \"The Night Watch\" and \"Lament\" and \"Starless\". All the technical issues were forgiven once I was able to listen and view all that was available on this set. Perhaps it was only my copy that suffered from these inadequacies from a technical aspect but it did happen every time I put the DVD in.Red remains a monumental progressive rock accomplishment to this day and one hell of a way to kick the series of 40th anniversary reissues that will be coming our way. If it wasn't for the technical issues I would have given this a perfect 5/5 star rating.I can still hear Fripp's guitar lines from \"Red\" as it has taken up permanent residence between my ears, which makes me want to hear it all even more. This one will never leave you once you hear it and if you love prog rock you probably already have a copy but maybe not this one yet.4.5/5 StarsKeith \"MuzikMan\" Hannaleck�MuzikReviews.com"
    },
    {
      "reviewer": "fuxi",
      "date": "Posted Tuesday, February 2, 2010",
      "rating": 4,
      "text": "I never thought of RED as one of King Crimson's top albums. When it comes to the Bruford-Wetton incarnation of the band, I find LARKS' TONGUES far more satisfying. It must be admitted that RED's opening and closing tracks (the title tune and \"Starless\") are two of KC's most memorable pieces, but the rest of the album seems a bit of a mishmash. \"Providence\" is a delightful improvisation which keeps getting stronger every time I listen to it, but it does feel out of place among much poppier songs, you can tell it was only meant as filler, it comes into its own when you hear in its proper context (on THE GREAT DECEIVER box set). \"Fallen Angel\" and \"One More Red Nightmare\" are fairly conventional and rather noisy rock songs, not half as charming as \"The Nightwatch\" or \"Easy Money\".However, all Crimso freaks will find the 2009 \"40th Anniversary Edition\" of this album an essential purchase, for at least two reasons:1. Two of the bonus tracks, the so-called Trio Versions of both \"Red\" and \"Fallen Angel\", sound incredibly powerful and pure. These stripped-down versions have never been released elsewhere; I assume they were used as base for the official recording, but you can hear Messrs. Fripp, Wetton and Bruford more loudly, crisply and distinctly than ever. It's as if the three of them (without cellos, this time) are laying down \"Red\" right in the middle of your living room. Flabbergasting!2. The 1974 French TV footage (included in the second disc) may be in mono, but it offers something many of you will have longed to see: Fripp, Cross, Wetton and Bruford performing all of \"Larks' Tongues pt. II\", \"Lament\" and \"Starless\" absolutely live in the TV studio, with great gusto. (\"The Nightwatch\" is there as well, but it is spoiled somewhat by primitive video trickery.) It's a pity those French cameramen focus mainly on Cross and Fripp, especially during the first half of the performance. They must have thought: \"Who cares about rhythm sections?\" During \"Lament\" and \"Starless\" you at least get to see Wetton singing (and what a magical vocalist he is!) and it finally dawns on the cameramen that Bruford, too, is someone they should keep an eye on.Anyhow, strongly recommended!"
    },
    {
      "reviewer": "The T",
      "date": "Posted Sunday, February 28, 2010",
      "rating": 4,
      "text": "Now THIS is some serious improvement.After two semi-disastrous albums, Fripp proved once again that he still had it in him to write actual songs with something resembling a structure and a musical goal. The leap in quality experienced in \"Red\" over what occured in \"Starless and Bible Black\" and \"Larks' Tongues in Aspic\" is nothing short of gigantic. It actually seems like if the band had suddenly waken up from a long, dreadful opium dream and decided to write music.From the beginning, the album shows what a capable musician Fripp really is with the fantastic \"Red\", a glorious instrumental with a terrific riff and actual development of ideas. Probably the best song (instrumental piece really) KING CRIMSON ever released since the days of their legendary debut. What follows is an extremely competent song with Wetton in top form, reminding us that, given actual musical material, he could perform at a very high level. Another success comes next, called \"Another Red Nightmare\", much in the spirit of the title-track, with a tremendous drum work by Bruford.Of course, Fripp couldn't be Fripp if he didn't include a more \"experimental\" side to his music on every album. \"Providence\" has the now customary strings opening the track in true atonal fashion, again, bringing back awful memories of the past, with little sense or purpose. I guess he just HAD to have his \"uber-prog\" moment, which most likely would have got him rave comments from rock fans who had never heard music of the kind before (too bad they hadn't tried music written over 50 years earlier). The good thing is that the good side of KING CRIMSON returns for a final tour-de-force in \"Starless\", which despite its name has nothing to do with the terrible album that preceded this one and which includes some seriously haunting, dark, thoughtful rock music.It's a pity that the band would never be the same again after \"Red\", because with this album they proved they actually could make good music together. A fantastic album marred by one\"let's-jam-again-we're-prog-after-all\"track, worthy of 5 stars if \"Providence\" wasn't there to reminds us that, after all, Fripp and Wetton and Bruford were just normal, error- prone human beings."
    },
    {
      "reviewer": "EatThatPhonebook",
      "date": "Posted Thursday, March 18, 2010",
      "rating": 4,
      "text": "8/10\"Red\" is one of King Crimson's highest peaks.\"Red\" is considered by many one of the band's greatest albums, and certainly it is one of their most successful ones. It didn't take me too much to appreciate this: everything in this album is perfect, and nothing needs to be listened again: love at first listen, basically.It is hard to not notice that the sound is a lot rougher, heavier, less dreamy and more rockish ( if we exclude \"Starless\", the album's zenit) than the previous albums: the jazzy, refined and delicate sound of the first albums, or the more bizarre and eerie sound, from the \" Lark's Tongues In Aspic\", another masterpiece by the band, are the two sounds that so far the band was able to create. Now, like I said, the sound is impressively changed: more guitars, less keyboards and mellotron ( once again \"Starless\" is an exception), the bass is pondering more than usual, and Bill Bruford's drumming is at it's peak. Special mention for Cross, on violin, which makes the atmosphere more tense and suspended when played.the title track opens the album. It is rather simple to listen to, compared to other prog songs: it's an instrumental piece, but it could easily have lyrics. Generally, the song is brilliant, with a great, but studied melody and awesome passages from different parts of the song. Truly a KC classic.\"Fallen Angel\" is the song that least impressed me. John Wetton's voice is good, even though not as much as Greg Lake, and he shows himself well in this piece. It might sound like a sort of ballad,even though, you can't technically define it that way. But nobody prohibits me for saying that it is slower.\"One More Red Nightmare\" has a similar melody to \"Red\", although this song is little less creepy, thanks to the addiction of vocals. Personally, I love this song, and I think it's one of those songs that you'll always remember. Bruford's drumming here is sublime, and Fripp shows what he's got as well.\"Providence\" is an eight minute improvisation, where the atmosphere is always incredibly tense, and always seems like it will turn into an explosive and violent riff. The violin here is absolutely amazing, a brilliant piece of music, one of the band's greatest, most impressive, and most successful improvisation pieces.\"Starless\" is the masterpiece of the band: a melancholic, mellotron driven piece is hearable in the beginning, with a stunning vocal performance by John Wetton. the sax gives a wonderful touch to it. Initially I wasn't crazy about this song, I admit it: I realize now how powerful and wonderfully done it is. A second part comes in after a few minutes, where the guitar plays a few notes, as some creepy surrounding is quite hearable. The ascending climax is inevitable, as the bass comes in, as well as some strange, LTIA like percussion. At the culmination of this part, the band is going pretty much wild, until a new part arrives, a lot faster, where a great sax solo takes place, while the rest of the band keep the rhythm. The main melody is soon after repeated, but the atmosphere now is a lot more tense and wild. The last minute is a reprise to the mellotron driven melody of the beginning, only with a pondering bass and guitar that accompanies. So ends a wonderful piece of music.OK, I'll admit: it wasn't quite love at first site, especially because of \"Starless\", which seemed at the time a little excessive. I am proud to say that I now love this album, and that it definitely is an essential part of your progressive rock collection, because of its historical importance."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Friday, June 11, 2010",
      "rating": 5,
      "text": "Hiding behind a not very good cover design is one of the grandest prog albums ever created. This, the heaviest King Crimson album of all, marked the end of this period of the band. Robert Fripp actually suffered some sort of mental breakdown while recording this album (in interviews, he described it as \"the top of my head blew off\"), and the pain actually elevates the music to another level. While Fripp's guitar rips through each composition, Bruford and Wetton play as amazingly as I have ever hear either play (and I have more than a few album of each).The vocal songs,Fallen Angel,One More Red NightmareandStarlessstill rank as my favorites of all Crimson songs with vocals, and Wetton's bull moose voice actually sounds good on each of these.Red, song that Fripp like enough to play in later KC groups, is also one that I've heard covered by more different bands than any other of their compositions (The version by Either/Orchestra is worth searching for). andProvidenceis still one of the best improvs by this band (although the longer edit of it is still preferable).One thing to note: shortly after this album was released was when Fripp committed the unforgivable sin of announcing that the seventies crew of prog bands were \"dinosaurs\", giving the music journalism toadies fodder for their tirades against the genre in favor of the simplistic pap that they could more easily understand.Despite that, this album is still a work of brilliance."
    },
    {
      "reviewer": "Marty McFly",
      "date": "Posted Saturday, July 3, 2010",
      "rating": 5,
      "text": "If there is killer, melodic, dark and raw track out there in the world of Prog, it'sRed, piece of eponymous album.Fallen Angelis different, pleasant track which has all best Pop elements balanced the finest attributes that forms mild/calm Prog songs. So much that only Pop feeling you'll get will be in the first part (little tingling of Caravan). I don't have to say that this tracks comes as complete surprise after darkness of of first track. It's dark anyway, but not from beginning, as Red shoved. Actually, forget about Pop element completely (I'm not sure why I get this feeling every time I listen first minute of the song. Probably because of unequally set paces of songs confuses me). Fallen Angels ends in beautiful saxophone/guitar moments.One More Red Nightmarecontinues what previous song's second part set. Cleverly.Providenceis atmospheric track, reminding me twisted version of Moonchild a bit. Not exactly my cup of tea, but it works anyway (a little bit).Starlesswith its mellotron and equally mellow saxophone and all these other elements that makes King Crimsons KC.5(-), high standard."
    },
    {
      "reviewer": "friso",
      "date": "Posted Thursday, August 5, 2010",
      "rating": 5,
      "text": "King Crimson - Red (1974)The birth of modern progressive metal.The second period King Crimson had already released two good albums in the heavy metal King Crimson style, opposing to their symphonic/avant style of the first four albums. By now King Crimson was reduces to a trio, Fripp, Wetton and Bruford. With Collins, Cross and McDonald on board during the recording sessions this team can be rightfully called a super-group.This record has a few elements that make it almost perfect. First of all, the modern heavy metal guitar sound of Fripp. It would take others (and perhaps even KC themselves) a decade before they could recreate this amazing dissonant distorted metal sound, which is actually pretty accessible. The bass-lines of Wetton are amazing and I even like Bruford's drumming on this album, normally I dislike his sound/style.The element that makes this a masterpiece is the perfect balance between innovative/progressive/avant factors and accessibility. There are little disturbing moments and the experimental parts are all very good. The form of the album is also amazing. Three great heavy metal prog styles tracks on side one, an extended improvisation and a long epical track on side two.Opening track 'Red' stands out as THE prog-metal track, a blueprint for the genre. Fallen Angel is a very strong metal track with great vocals and wide variety of emotions. The instrumental parts still sound very modern. This is also the case with One more Red Nightmare, which also has some first period KC influences with a wind-section etc. Providence is an improvisational styled track with much dissonance and little logic for the common listener. This is perhaps the hardest moment of the album. I myself like it, because is almost fires us into the last track: Starless. Starless is an epic with such an emotional value it can stand on it's own as being a farewell to King Crimson's second period. This twelve minute track has a sound and feel that reminds me of the epics of the first two King Crimson albums. The mellotrons are back, the wind-sections are strong and the guitars are pleasant. An essential track for the progressive genre and a favorite for many fans of the band.Conclusion. It's hard for me to believe this album was recorded in the same year as Camel's Mirage, Genesis' Lamb and Yes' Relayer. This albums sounds way more modern and it's sound hasn't aged at all. This album is a breakthrough and it's a pity the band had fallen apart before the recording sessions were finished. There was no tour and the album became a commercial flop. Still it is rightfully regarded as one of the most important albums of the genre. Five stars. A masterpiece."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Tuesday, November 23, 2010",
      "rating": 4,
      "text": "As Ivan Melgar stated, I appreciate the genius behind (or within) the cacophony. There is definitely genius--and often even melody--among KC's outpouring. Here it is brimming, but I'm so sorry to report that I believe the voice of John Wetton to be a down-point to anything he ever touched--even UK. He has such trouble finding the center of a note and slides so awkwardly from note to note that it's . . . almost embarrassing. Needless to say, the songs on this album with less singing stand out for me.Red (8/10) is KC approaching its best--though there's not enough Fripp experimentation, not enough Bruford wildness. The band is waiting the talents of Tony Levin in order to really go to places no other band can ever go.\"Fallen Angel\" (6/10) has moments--instrumentally. But, Wetton's voice.\"One More Red Nightmare\" (9/10) is a great song, despite Wetton's vocals. Bruford gets to really play--as do the adjunct band members.\"Providence\" ( 7/10) begins as a variation on the 'five men in five different rooms' approach of \"Moonchild\" et al. before going into a jazz-funk thing. Some now-signature Frippisms are contained herein. Bruford and Fripp must have really loved creating this. Wetton's bass sounds awful. Listening to this makes me marvel that people can complain about Genesis' \"The Waiting Room\" when there is KC?\"Starless\" (9/10) starts with mellotron, Giles-like drums, and some heavy-on-the-sustain guitar soloing--harkening back to the In The Court of the Crimson King album. . . Until Wetton begins to sing. He is no Greg lake, though there are definite similarities in voice. Maybe that's why so many people 'like' or even praise his singing?! The addition of sax is innocuous. The music and mood change at the 4:25 mark. Is this where Post Rock/Math Rock came from? I certainly lose a little respect for ANEKDOTEN's masterpiece, \"Hole\" when I listen to this: its the same! Just when Bruford's really having fun, the song switches (8:45), bridging into a fast jazz/Canterbury-type of thing. 10:05 turns to a JAN GARBAREK-like break before breaking out into full jamming until recovering with the opening melody/theme, albeit a lot heavier, with a minute to finish.Certainly an experimental and seminal prog album, however, IMHO, denigrated mainly by the presence of John Wetton. Therefore, I cannot in good conscience give it masterpiece status--iconic though it may be."
    },
    {
      "reviewer": "tarkus1980",
      "date": "Posted Tuesday, November 30, 2010",
      "rating": 5,
      "text": "My first ever King Crimson listening experience came with this album, back in April of 1998, during my senior year at the Illinois Mathematics and Science Academy (a 3-yr residential high school). One Saturday night, my theoretical girlfriend and I planned to watchThe Blues Brothersin her dormitory, but I had some time to kill before then. One of my friends, a guy by the name of Andrew Baran who was into Crimson and Zappa, popped over to my room with a copy ofRedin hand, insisting that I had to listen to this ASAP. He popped it in, and for the next forty minutes, this album scared the living daylights out of me - everything was so loud and distorted and unconventional in so many ways that it blew my Moody Blues-addled mind (NOTE: I still love the Moodies) - this was back when I thought that Led Zeppelin was the hardest music imaginable. I was scared off Crimson for the next two years or so - eventually, I could get intoCourt, but it was still a long time before I could enjoy any other King Crimson.Time heals all wounds, however, and I can tell you now that, if you're going to buy only one King Crimson studio album, it should beRed. Released a month after Fripp \"permanently\" broke up the band, consisting mostly of outtakes from the previous sessions, this is just about the perfect melding of the initial incarnation of the band (ieCourtandWake) with the mid-70's version. By this time, the band had officially dropped down to a trio - Cross had formally left - but the album contains several \"featured players\" from King Crimson's past - besides Cross, there's Mel Collins, Marc Charig, and even Ian McDonald (who supposedly was going to become a fulltime member again, before Fripp decided to blow the band up) to give the new stylistics a healthy dose of the past.This album also features a relatively trivial, yet very important new aspect for the band - this album is loud and distorted and heavy in a way that the music world had rarely seen before. While Black Sabbath and company had firmly staked out their claim by this time to defining heavy metal as we know it,Redis arguably one of the first albums to take heaviness and move it in a direction that can be described as \"proto-grunge.\" The heavy parts are distorted into oblivion, and the riffs and melodies are such that this only enhances the experience.It also helps greatly that this album consists of actual, you know,songs. Much of it consists of improvised jamming, of course, but the framing of the improvs is, at the most base level, regular rock songs and ballads. Sure, it's tweaked and messed with far more than would be normal songs, but the framing not only makes sense, it's danged accessible! Heavy and complex as hell, but accessible!Indeed, the opening title track, a Fripp-written instrumental, is everything \"Fracture\" wanted to be but failed to achieve. It's, well, it's a rock song, with verses and a chorus and a \"middle 8\" and all - it's just that it has no vocals. The various riffs RULE, the distorted guitar-bass interplay will make you feel like your face is getting sandblasted off, and the middle section, with what I guessed was Cross working with Wetton's bass (my brother informed me that it is actually Marc Charig playing bowed double bass, but others have told me it was somebody else) over Fripp's riffage, is one of the spookiest themes ever conceived by the band. In some ways, I prefer later live versions of the track - I like it when the guitar in the middle is louder and more echoey - but no other version quite has this level of intensity.Up next is a mournful ballad, the eerie-as-hell \"Fallen Angel.\" The lyrics are actually quite nice - a sad tale of one's younger brother getting stabbed to death by street thugs in New York City. Wetton's vocals give both a warm sense of longing and a cold, detached stately feel, particularly in the chorus, and that's definitely nothing short of remarkable. As for the music, the main melody is impeccable, while the instrumental parts, from distorted backwards violins to creepy guitar arpeggios to free jamming by whatever instruments were available to Bruford's masterful drumming (this is not a trivial statement - Bruford's work on this album may very well be my favorite studio performance by any drummer ever), successfully make this an emotive experience not routinely found on a Crimson album. Hell, even Fripp's parts are potentially tear-jerking, and the last time that could be said was on, sheesh, \"Epitaph.\"The next track is a slight,slightletdown, but it still rules pretty fiercely. \"One More Red Nightmare\" is a paranoid diatribe about being afraid of flying, with a good but NOT great riff serving as the foundation, yet it manages to still be great thanks to (a) Bruford's drumming (take note especially of the parts where it sounds like he's drumming on sheet metal) and (b) Wetton's vocals that depict the paranoia as well as anybody else in the world could. Damn, damn, the drumming on this track rules - the syncopated rhythm that Bruford uses again and again is one of the coolest things I've ever heard in my life. The midsong jam is a bit excessive, but still, I guess it does a plenty good job of depicting the nightmare foretold in the title, and again, the drumming! And yeah, I'm not quite sure why there's rhythmic handclapping during the jam, but whatever - the drumming! SHEESH.The next track also doesn't help matters much, but it could still be much worse. \"Providence\" is a full-fledged improv, based around Cross' violin, but superior to most of the previous album in that it really has a dark, deathly mood to it that makes it creepier than anything there. 8 minutes is a bit excessive for such a piece, but the manner in which the violin crashes into the distorted bass and Fripp's various lines is such that the flow of the album doesn't seem affected for the worse much at all. Put another way, I could listen to \"Providence\" ten times in a row and not get as tired of it as I would to one listen of \"We'll Let You Know.\"All of this, however, is childsplay to the fifth and final track, the 12:18 \"Starless.\" This track has grown on me to the point where it is, by far, my favorite King Crimson piece ever - the rest of the album could be outtakes fromLizard(which I hate) and I'd still give it a high *** if it contained this here track. Nowhere else on the album does theCourt+Larksfeel come across stronger, and nowhere else in their whole catalogue does Crimson come up with something so emotive and yet so complex at the same time. The opening theme is simply gorgeous - some lovely mellotron laying the foundation, Fripp playing lines as beautiful as the ones in \"Epitaph,\" and solid basslines and subtle percussion giving just enough color. The vocal melody is the best this incarnation of the band ever came up with, Wetton's singing reaches its peak, approaching Lake levels of bliss, and even the lyrics are good this time around, matching the imagery of the music so very very well. Yet this opening is only just the beginning - after John has gone through the three verses, all singing stops, and a a lengthy instrumental passage begins to close out the song. But how does the passage begin? With some unnecessary, perfunctory assault of complexity for its own sake, the kind I'd fear Fripp would want to embrace afterSABB?Nope - as if to play a sick joke on KC fans, Fripp begins playing ... a one-note guitar solo. Again and again and again and again. Around this, though, the band builds the tension to a level unheard of in rock music to that point, not even within their own \"Talking Drum.\" Wetton underlays Fripp with an interesting repeated theme, there's some bits and pieces of eerie violin scrapings in the background, and eventually Bruford starts banging on a woodblock at seemingly random (but actually quite calculated) intervals. Slowly but surely, things start getting a little louder - Fripp starts climbing the scale very very slowly, Wetton's bass increases in volume, and then Bruford starts using his regular drum kit. And so it keeps going like this - everything slowly gets louder and louder, more and more distorted, more rhythmic, and your brain wants it to resolve so badly but it just keeps going and going ... until Fripp stops playing around, and we get a sequence of Fripp playing call-and- response with his own distorted playing, building up the tension even MORE. Finally, the band breaks into a saxophone-led jam, with Wetton and Bruford holding down an incredibly intense and tight rhythm. This slows down a bit, Ian plays some more while Bruford rides his cymbal, and then the one-note solo starts again, only this time distorted to the hilt and with everybody going balls out. And then, the grand reprise - the part coming out of the jam, where the saxophone begins playing the guitar theme laid out by Fripp at the very beginning, while the mellotron comes back into play, is quite possibly the greatest passage ever conceived by the band. Complex, sure, but emotional as hell in its complexity - hell, even Bruford's drumming in that part makes me want to cry.So yeah, this is the best studio album Crimson ever did. There's enough here and there to slightly annoy me, but make no mistake - that's just nitpicking. I am dreadfully fond of this album, and hope that you will join me in that assessment. If Crimson had never reformed, this would undoubtedly be one of the greatest farewells of all time, and that is not something to be taken lightly."
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Thursday, March 3, 2011",
      "rating": 4,
      "text": "Featuring possibly the lamest album cover in Crimson's entire discography, this is a very heavy album for the mid-70s. David Cross is now gone and the band are left as a \"power trio\". Fripp ended the band after this was recorded but before it was released. Oddly enough, some former members of Crimson appear here as if the whole thing was planned as a swan song to begin with. Crimson co-founder Ian McDonald plays sax and in fact wanted to rejoin the group and continue without Fripp. Wetton and Bruford wanted to continue as well, but Fripp decided there would be no KC without him. Bruford would be a session musician for a few years; Wetton joined Uriah Heep; and McDonald ended up in Foreigner.Besides McDonald, Mel Collins also plays some sax. In addition, some of the reed players from the Sinflield-era are present as well. Not only do some of the guest musicians recall earlier Crimson, but Red has some similarities to ITCOTKC as well. Both have 5 songs, one of them being a pointless improvisation. The first tracks on both albums are also the most rocking. The second songs on both albums are ballads. The last songs on both albums are the most varied. On Red, Bruford is getting more interesting as a drummer and Wetton's singing is improving.In some ways you could call the title track one of the very first \"prog metal\" songs. One of KC's best instrumentals. Love the riffs here. The cello(?) part in the middle is sublime. Apparently, Fripp did not like Bruford's drumming on this song; he wanted more of a typical hard rock style drumming. \"Fallen Angel\" is the only song to feature acoustic guitar. Basically a ballad with more upbeat drumming. A good song but it's the least 'proggy' on the album. Nice use of guest musicians here. Fripp seems to be inspired by the Beatles' \"I Want You(She's So Heavy)\"; he uses different variations on that riff on the album.Next to the title track, \"One More Red Nightmare\" is my favourite song on side one. Bruford's drumming here is very inventive. I like the oddball handclap sounds(supposedly that is Bruford hitting a broken cymbal). Nice sax solo during the middle section. More \"I Want You\" inspired guitar playing towards the end with some more sax. \"Providence\" is actually an edited improv recorded live in Providence, Rhode Island. The full version can be heard on the box set The Great Deceiver. As that box set proves, KC did much better improvs at the time than this. This is similar to the more avant and experimetal improvs on Starless And Bible Black. Being a live recording, this is the only song to feature Cross. It stands out like a sore thumb to the rest of the album. This album loses a whole star because of this track.An earlier version of \"Starless\" was supposed to be the title track of SABB, but Fripp and Bruford didn't like it. Supposedly Wetton wrote some of the lyrics to the final version, in addition to the lyrics of Richard Palmer-James. This version is the highlight of the album and one of Crimson's best songs. The guitar and Mellotron melodies at the beginning and end are just fantastic. The addition of guest musicians makes this the definitive version. I love how the Mellotron dies out and is replaced by a cello(?) for a moment. Later a repeated bass part sets up the piece for some minimalistic guitar playing and odd sounds. This part becomes more intense and louder as it progresses. After 9 minutes goes into a jazzy section with sax. The main theme is reprised on some wind instrument briefly and the band comes back full throttle with Fripp doing an amazing solo on one string. Main theme comes back at the end in a very majestic fashion. Superb - one of the greatest endings to any song ever.Basically a trio, Fripp overdubs his guitar a lot on Red. This album was definitely a major influence on later, more harder-edged prog bands. It's hard to say what they could have come up with after this...with or without Fripp. It may have been better than this, or alternately, nowhere near as good. Overall, this is a great album but \"Providence\" stops everything dead in it's tracks. Of all the improvs they recorded at the time, why did they choose that one? 4 stars."
    },
    {
      "reviewer": "colorofmoney91",
      "date": "Posted Friday, April 8, 2011",
      "rating": 5,
      "text": "After the less than satisfying Starless and Bible Black, King Crimson come in very strong with Red, definitely one of their best albums. This is one of early King Crimson's heaviest albums, with a direct focus on hard rock and metal immediately coming through on the strong instrumental title track that features superb musicianship from the whole band. Along with the title track, this album brought some of King Crimson's most popular material, such as \"Fallen Angel\" and \"Starless\", two absolutely beautiful tracks. \"One More Red Nightmare\" is rather heavy and rhythmic and sounds like a definite precursor and influence for bands like Zu.This is a highly recommended masterpiece by King Crimson. Every track is pure gold."
    },
    {
      "reviewer": "Anthony H.",
      "date": "Posted Monday, May 16, 2011",
      "rating": 5,
      "text": "King Crimson:Red[1974]Rating: 9/10On paper,Redshould have been a disaster. King Crimson was in its final stages during this album's recording (although Fripp would reform the group nearly a decade later with a different lineup); in fact, the band was officially disbanded months before this album was released. The band is reduced to a trio here due to Cross's departure, although his violin does appear on the album and many session musicians were employed, including former band-mates Ian McDonald and Mel Collins, both of whom have a strong presence on this album. Regardless, it's clear thatRedwas recorded by a band that seriously lacked cohesion. One would thus expect it to be somewhat of a mess. On the contrary,Redturned out to be one of King Crimson's greatest. This is the band's heaviest album, with many moments having a downright metal feel. The entire package is full of energy and emotion, creating a fitting swansong for what may be King Crimson's most esteemed era.\"Red\" is an intensely energetic opener with a legendary main riff and an absolutely stunning rhythm section. Bruford is at his finest here. Wetton's vocals enter on \"Fallen Angel.\" This track begins in quite a mellow fashion, building up to intense guitar riffing and sax soloing. This is yet another masterful composition. \"One More Red Nightmare\" continues with jaw-dropping drumming. Wetton lays down some incredibly catchy vocals in the verses, and the sax sounds wonderful during the instrumental sections. \"Providence\" is a lengthy experimental improvisation. Cross's violin takes center-stage for most of this track, but heavy bass, drums, and guitar enter in halfway though. This track is most often compared to \"Moonchild\", but as much as I love that track, I find \"Providence\" to be far superior to it. The closing track \"Starless\" is absolutely flawless. Mellotron and sax accompany Wetton's vocals on the mellow first section. The intensity slowly builds, and fantastic energetic jazz-rock takes over.Redis an absolutely sublime piece of work, and is probably the second most essential King Crimson album afterItCotCK. It's unfortunate that this was the last album to feature this spectacular lineup; I would have liked to see this style progress further. Every musician plays together seamlessly here. This is probably one of the most intense prog-rock albums of the 70s, as well. In fact, this is a strong contender for the first prog-metal album. This is a creative height for the band, and is certainly essential for anybody progressive/art rock fan."
    },
    {
      "reviewer": "Wicket",
      "date": "Posted Tuesday, June 28, 2011",
      "rating": 4,
      "text": "Quite possibly the last great complete progressive outing by the forefathers of the very genre.That hardly makes it their very best, though.Indeed, \"Red\" was the last album released under the King Crimson moniker before \"Discipline\" heralded in the '80's. The decent song lengths already pulled me in from a standstill, and I figured this would be just like albums such as \"Court Of The Crimson King\" and \"Starless And Bible Black\". Well, after turning the volume up on track #1, \"Red\", I got a mixed result.It may have been only a 5 year separation, but the sound is drastically different from \"21st Century Schizoid Man\". Instantly, my audible canal was bombarded with a harsh, heavy sound, quite possibly the band's take on the hard rock sound the 70's were mostly famed for. However, further listens lead me into a slow chugging of a string section, something I would've expected from King Crimson, but it's darker. A darker sound I hear. Through that, however, I take notice in Bill Bruford's exceptional drumming while still yearning for more out of Robert Fripp's guitar, and out of it all, just like the very last chord, I'm left hanging over a cliff, expecting more.Thus, the smooth touch of \"Fallen Angel\" plays, and John Wetton's smooth voice changes the mood in an uplifting ballad of sorts. But at this point, I notice a huge change in the sound of King Crimson, and it's only 1974! The bland synthesizer chords and electronic drumming of the 1980's haven't kicked in yet, so why does it feel like I've already lost touch with the band? Luckily, the blaring cornet of Mark Charig snaps me out of it, and I continue to listen to Bruford's playing, as I, a drummer myself, continue to take notice. Fripp's 5 chord progression towards the end of the piece lightens my spirit, although Charig's cornet makes me feel like I just listened to a slow ballad by a Californian ska band. Hmm....\"One More Red Nightmare\" begins in a dark, foreboding tone, instantly grasping my attention in the thought that this track will bring me to terms with this album and that I haven't lost touch with King Crimson. However, Wetton's voice brings with it a sort of cheesy chorus and stupid clapping that makes me feel like the '80's came early, but once the singing stops, I feel the energy from Fripp's guitar again in another dark and heavy tone. Thus, the song begins this \"tug-a-war\" effect, where the musicianship of Bruford and Fripp bring the progressive tone, and then suddenly Wetton drags me into this funky 2-step that seems to be quite out of the ordinary, even for King Crimson's standards, which were quite out of the ordinary.Then there's \"Providence\", which really is dark and foreboding. Although I'm not a huge horror movie fan and not too big on ambien soundscapes, the instant cutoff from \"Nightmare\" wakes me up to a lone violin. This could be the King Crimson I heard from albums past. And then...the squealing of the violins, and the slow drone. I'm literally shivering at this point. By this point, I'm also sold on this album. However, the errie xylophone somehow brings me to a quandry: How come it took me 20 minutes and half of the album to come to a favorable conclusion? Usually an album by a band that pretty much began the genre of progressive rock in 1969, especially only after 5 years, should automatically be a hit. It just seemed like the filler tracks were the first tracks, and the real treats were hiding in the back. 5 minutes in, \"Providence\" already has me sold, with Bruford backing another eerie bass line and Fripp just, well, playing whatever the hell he likes.That brought me to the fifth and final track, \"Starless\", which obviously meant something: This album was entertaining enough for me to listen the whole way through to the final track, which was entirely true. Of course, by the slow intro, and due to the fact I naturally think way too far into things sometimes, I've pretty much come to a conclusion that this album is indecisive to me. I don't love it, but I don't hate it, and for a music lover like me, that decision is a rare one for me to make. The smooth jazz feel of \"Starless\" already has me hooked, but I'm still stuck on the first three tracks. The progressive style is there, but so too is the creeping white elephant that is, was, and always will be \"commercialism\". Naturally, during this point in time, every rock band at some point submitted to the 80's and created garbage for their record labels, but King Crimson still breathed some life into prog with \"Theela Hun Ginjeet\" off of \"Discipline\" and \"Three Is A Perfect Pair\" off the same album, before dying with a gasp of coroded ash with \"Larks' Tongues in Aspic, Pt. III\".Of course, that being said, I don't hate this album. Far from it (I still am listening to it occasionally), but the disc still pales in comparison to \"Court\" and \"Starless\". In fact, it is that fifth track that I still bear a smile to, especially the last 3 minutes. However, putting it all into perspective, it was the last two tracks that hailed back to the wonderfully progressive days of 1970, but it was the first three tracks that already foreshadowed the doom of so many heavy hitting rock and roll bands, a fate that King Crimson would soon endure and, unfortunately, never recover from. Sure, the atonal chords of \"The ConstruKtion Of Light\" were interesting, about for a good 5 minutes. But it just seems to be \"Red\", that last great epic to be released under King Crimson, a band name that, in my humble opinion, will forever go down as the single forefather to the birth of progressive rock."
    },
    {
      "reviewer": "thehallway",
      "date": "Posted Wednesday, September 7, 2011",
      "rating": 5,
      "text": "Red is a near-perfect album from a band who rightly decided to stop their career while they were at a peak. It attempts to blend everything unquestionably King Crimson from the previous six albums to create a big, special finale. Due to the line-up, it sounds more like Larks' Tongues in Aspic than anything else, but that is by no means a bad thing. If nothing else, it is easily Robert Fripp's best album, for he has let go of some of his nervous 'subdued' playing and is happy to unleash layers and layers of metallic guitar lines. This, combined with John Wetton's typically punchy bass warbles and Bill Bruford's eclectic drum patterns, makes for a very heavy, \"proto-metal\" album that nevertheless contains some beautiful and tranquil moments.The title track is an instrumental workout built around a sequence of tri-tone riffs (what a surprise, Fripp) played through four times with a dark cello solo in the middle. Of the songs of this type in the Crimson catalogue, it isn't the best, but it certainly opens the album with a bang. 'Fallen Angel' is a very decent number that juxtaposes heavy guitar chords and sweet oboe melodies, with John's singing at its very best. The closer to side one, aptly titled 'One More Red Nightmare', is a more upbeat offering with a focus on Bill's percussion (big sheets of metal and flangey hand-claps) and what Ithinkis a Mel Collins sax solo. It is one of KC's most rocking songs, but of course, the lyrics remain dark and devilish.Side two offers an improv in 'Providence', which is not my favourite improvised piece but it makes good use of the timbres in the bass, guitar and David Cross's violin. When the drums properly enter, it just sounds messy. 'Starless and Bible Black' is a for menacing improv to me, which people seem to overlook, not that many people are fond of 'Providence'. The comparison's to the vibraphone noodling on 'Moonchild' are way off though. Then there is 'Starless'.Woah.By far King Crimson's best song, and my personal favourite progressive rock song that isn't 20 minutes long, 'Starless' offers on a plate every single musical trick that this band is capable of. It starts as a beautiful Mellotron ballad, which there has been one of on every previous KC album, but none quite so moving. Fripp turns off the distortion and delivers a chilling melody that reminds us of the 'Court of the Crimson King' days. Wetton shines again in the verses, which he wrote, and is helped along by subtle sax and cello. When we modulate to C after the final epic chorus, things quieten down and we are treated to some 'Lark's Tongues' style tension-building. Once again, there have been long, drawn-out crecendos on previous KC albums, but this one is the best. The thick bassline is in 13/8, and Fripp's minimalistic guitar notes are the most tense thing ever, especially when you know what it is building up towards. Bruford showcases his percussion arsenal here, but just as things reach a 'Talking Drum' level of chaos, everything stops, leaving a few clean guitars stereo- panning on the dominant note, ready to.............unleash the most monstrously explosive saxophone solo you will ever hear, over the same riff but about 5x faster. This thrill ride tops the battle-section of 'Lizard', and is even more climactic than 'Fracture'. After the speedy jazz rock section, more distorted guitars come in, and soon we are hearing that same Mellotron from earlier in the piece. Talk about a recapitulation! Woodwinds give us that beautiful melody, but the volume remains high, and it all winds down to a halt soon enough, leaving us totally exhausted.I could talk about 'Starless' all day long. It is a masterpiece. The other songs on this album are very close too, making for a rather easy five stars. Fripp wanted to move on, but it's clear that he also wanted to go out on a high, and just make the best album he can. Red is not particularly progressive; all of the styles and song structures are things that have already been developed on previous albums. But this one executes everything perfectly, and is rightfully considered to be this band's peak."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Sunday, September 18, 2011",
      "rating": 5,
      "text": "Robert Fripp's decision to bring King Crimson to a close following this album (at least until it regenerated Doctor Who style into the avant-New Wave beast of the 1980s) was baffling at the time to those around him - not least remaining band members John Wetton and Bill Bruford. But I think with the more time passes, the more the decision looks like a stroke of genius. Fripp's predictions about the \"dinosaurs\" of rock music coming to a bad end turned out to be all too true when the punk revolution happened.Sure, we might bemoan the lack of respect given to musicianship and technical accomplishment during the white heat of punk, but both of those important things crept back into rock afterwards, and the DIY ethos of the punks - which held that anyone could and should be able to put together a band - recalls Fripp's own belief that it would be \"small, mobile, intelligent units\" that survived after the fall of the dinosaurs. And it has to be said that Fripp chose precisely the moment to cash his chips, selling up just as the peak of prog's mainstream success was passing by. This decision saved King Crimson from the humiliating fate of many of their contemporaries in the late 1970s or early 1980s - not for them the commercial pandering of 90125-era Yes, or Invisible Touch-era Genesis, or Gentle Giant's last three albums. Fripp's decision saved the band from a situation in which they would have to choose between their musical integrity and commercial success; his subsequent revivals of King Crimson have come about because he had a sound that needed to come out under the KC name, not in response to crass commercial considerations.Robert's predictions about the music industry as a whole took longer to come true, but the dawning of the Internet age and their shambolic response to it also appears to have proved Fripp right. The fact is that if you want to make experimental, cutting-edge, avant-garde progressive music, you're much better off following the mobile unit approach, and whilst Fripp might have arrived at these realisations through a somewhat cranky route, it's hard to deny that his predictions were right - and came years before anyone else saw it, with the possible exception of Peter Hammill (as seen on Nadir's Big Chance).It was against this background that Red was produced - with Fripp undergoing this enormous personal change, having the unintended and beneficial side effect of Fripp exerting less control over the recording process which he had previously been inclined to. Not that he needed to; it's clear on here that his collaborators are as much in tune with what needs to be accomplished on the record as he is. A classic from beginning to end, from the furious instrumental Red to the hauntingly beautiful Starless (which others have pointed out is rather like a potted history of the band from 1969 to 1974 in its musical structure), Red more than any other album from the 1973-1974 lineup of King Crimson showcases a powerful vision of the future of music, one which in some respects we still haven't caught up to. In the Court of the Crimson King set the blueprint for most of the progressive rock scene, particularly the more symphonic end of it. Red, quite simply, is the peak of the form. There have been new albums since then that have added their own spin to the genre, but I can think of precious few that reach this level of accomplishment."
    },
    {
      "reviewer": "rogerthat",
      "date": "Posted Saturday, December 3, 2011",
      "rating": 5,
      "text": "If you haven't heard King Crimson, you haven't heard prog. And if you haven't heard the Red album, you haven't heard King Crimson. I don't mean to say by this that you would and should by all means rate the Red album a superlative effort as much as I do. But, from a more detached standpoint, a fan of 60s and 70s rock would revise his opinion of rock's reach and possibilities once he gets to know the Red album.Personally, it is my favourite King Crimson album and also my favourite prog rock album bar none. There is a timelessness about this album that only the best of music captures. Heavy metal crush meets jazzy laziness. Robert Fripp's textures at times point the way to the punk years that lay ahead, grunge even. But mellotron, saxophone and cello are also employed on this album. The everlasting appeal of the album lies, partly, in that the band embraces a wide, diverse and sumptuous palate of sounds.They are also surprisingly effective in projecting emotion, for a band often regarded as cold and clinical. Perhaps, it is the absence of dramatic baggage compared to the other prog heavyweights of the time Genesis, Yes, Jethro Tull and ELP. It is something that can sometimes make their music come across as self indulgent, if intriguing, jams. Here, it enables them to render downbeat pathos like Fallen Angel delicately in a manner that Yes or Genesis may have found tougher to capture with their wall of sound approach. Because they are not habituated to emoting a whole lot, they seem to be secure from the perils of overemoting and there is a down to earth quality about this album that I have rarely come across in prog.By far, though, the most unique aspect of this album is its construct. I was not born in the 70s but reproductions of newspaper clippings on King Crimson album sleeves nevertheless drop clues to how the musicians went about it. Bill Bruford mentions, ostensibly at the time of the making of Larks Tongue in Aspic, that they are attempting to marry improvisation and composition. That approach is brought to its most satisfactory fruition on Red album. Instead of jams, the band treats us to songs, to tunes that you can wrap around your head and feel compelled to put on repeat for days together. But an element of improvisation is still accommodated within this more formal approach, leaving ample room for the unexpected. It also brings about a feeling of listening to a band actually performing the music and not just well processed recordings. If the Red album is brilliantly conceived, it is even more brilliantly executed. Arguably the most outstanding ensemble in prog rock pulls out all stops here and Bruford especially shines, casting a shadow over his days with Yes.Onto individual tracks now. The title track makes for an electrifying opener. Fripp casts a spell of doom and menace on the listener from the get go with some crushing heavy guitar. Not content with that, we have some cello in the middle. What is this track....is it riffs or melodies or both? Fripp refines the approach employed on Larks Tongue in Aspic Part 2 and turns riffs inside out while simultaneously developing a coherent musical theme. Metallica before Metallica came into being?I have already dwelt on Fallen Angel. Moving onto One More Red Nightmare. Another menacing riff and a simply irresistible bass growl. I am not the biggest fan of John Wetton's singing and especially not with King Crimson but there's fortunately not much for him to do here other than iterate the short verse. Bruford's furious drum strokes compete with Ian McDonald's languid saxophone. The track captures for the first time on this album why this ensemble is so incredible as the band shuttle from trippy doom to languid jazz and back. More intriguingly, the whole saxophone solo is underpinned by a bassline that strongly evokes Warpigs! It's a wonder that they complete the puzzle so comprehensively but the outcome appears entirely natural and apt.Providence sticks out like a sore thumb. It is not necessarily the cacophonous mess it is sometimes made out to be and I think it is more organized that it is taken to be. Nevertheless, this is clearly their most overt stab at modern classical music since Moonchild. And it simply doesn't gel with the rest of the album. Where the other tracks on Red album are more immediately intelligible and reveal intricate detail upon closer listening, this is prog of the \"needs to be be sorted out\" variety. By itself, it is not a bad piece of music but it feels like a throwaway in how incongruous it is in the context of the album. Fortunately, at eight minutes, it is not too long for a proghead to endure!And those eight minutes are well worth enduring because they give way to Starless! Can you really ask for more from twelve minutes of music? There is a lovely vocal melody at the start accompanied by very sensitive playing by the ensemble, moving onto a slow but suspenseful crawl that leads into a blowout with the band absolutely on fire to close with a powerful re-iteration of the opening theme. In short, a kaleidoscope of emotions. Other than the vocal parts, the rest of the track once again appears loose with scope for expansion and contraction. And yet, there is not a moment too many of music in there, the entire track is very purposefully organized and performed brilliantly once again. Wetton's flat delivery fails to endear me again but with melodies this great, it is hard to go wrong. The above perhaps does not capture everything or even much of what makes this track so unforgettable but I am also anxious not to spoil it for you in case you have never heard it before.Time for the rating. Five stars are generally reserved for albums that are absolutely flawless and beyond reproach. But I have a different take on this. Firstly, I don't really know how to define flawless in a style of music where flawed is often beautiful and flawless is robotic and sterile. Secondly, when I look at album ratings, I take four star albums to be excellent ones that I need to get around to sooner or later and five star albums as the ones I absolutely need, the ones that will define the genre for me even if I choose not to dig deeper. And it seems incomprehensible to me that by any rating system, the Red album would be an album that anybody interested in prog should not have to listen to. If I were to list 10 albums that I would introduce to somebody new to prog to give him a good idea about its possibilities, Red album would most certainly be on that list.The flaws of Providence are easily forgiven, Red album is one of the brightest stars in the prog rock universe. Five stars."
    },
    {
      "reviewer": "FragileKings",
      "date": "Posted Friday, February 6, 2015",
      "rating": 4,
      "text": "I'll admit right up front that King Crimson has yet to really sink in for me. I have four albums now, and none of them move me to the point that I feel that I love them and that I can listen to them any time from front to back. Strangely enough though, each year that I have bought a King Crimson album there has been one song that has made it into my top ten most listened to songs purchased in that year. Since 2012, I have been making a playlist for all my purchases of each year and at the end of the year I can check to see which songs got the most play. In 2012 one song was \"One More Red Nightmare\" from this album here. In 2013 it was \"Larks' Tongues in Aspic Part One\" and in 2014 it was \"Thela Hun Ginjeet\" from \"Discipline\". So even though I still don't get King Crimson like some people do, I can find something to love from each album I've bought so far.\"Red\" was my second acquisition after the classic debut. \"In the Court of the Crimson King\" still leaves me wondering. I like \"21st Century Schizoid Man\" and the title track, but the rest of the album hasn't yet sunk in. So, what was it that prompted me to get \"Red\"? One was the reviews that I read that said \"Red\" had lots of good proto-metal on it. I'm a big fan of late sixties and early seventies heavy metal, or what they call these days \"proto-metal\", so that was a strong selling point for me. But more than that is the appearance of Bill Bruford on this album. I had recently been listening carefully to his drumming with Yes, especially on the first album and \"The Yes Album\" and I wanted more.Now I said that I haven't really been able to get into King Crimson and until the other night, \"Red\" was no exception. I loved \"One More Red Nightmare\" for almost everything about it. I don't like that sound that resembles an electronic handclap but the heavy guitar rocks and Bill Bruford gives such a fantastic performance here. Even John Wetton's vocal performance is actually quite suitable. I say this because one thing I do not like about \"Red\" and \"Larks' Tongues\" and even the UK debut is Wetton's singing. He does very well on Asia's debut but he doesn't strike me as having mastered control of his voice with King Crimson or UK. And that might be the main reason why the two KC albums of the seventies that I own have not left me in spasms of joy.But wait! I did say until the other night I could not get into King Crimson albums. The other night I gave this album my full attention and working around the vocal performances that sometimes made me wince (\"Fallen Angel\" and \"Starless and Bible Black\") I found that there was some excellent music and very cool sounds to enjoy. Of course the title track, an instrumental, is easy for me to like because of the heavy guitar and Bruford's drumming. A great start! \"Fallen Angel\" might not be so bad except for the vocals. A weak track for me though I'll admit the music is pretty good.I've already sung praises for \"One More Red Nightmare\" but I'll say again, Bruford's drumming is his best post Yes performance that I have heard. \"Providence\" actually was a third choice for me because of where the music gets to after 4:50. Up to then there is a slow building of scritchy scratchy violin, random percussion bits, some bass rumbles and hiccoughs, and a general feeling that the musicians are all playing extremely remotely from each other and just sending out signals to locate each other in deep space, working slowly towards getting together to finally actually make music. When this happens after 4:50, the effect is a great highlight of the album. John Wetton's bass and Bill Bruford's drumming really make this track. Robert Fripp adds some feedback and distortion and there's more violin and a bit of flute in parts, but I love the music mostly for Wetton and Bruford.\"Starless and Bible Black\" I had written off as another semi-ballad with Wetton's unimpressive vocals; however, I found that as the song gets moving along the music becomes really captivating. There's some great stuff happening there. As a result of my discoveries, I have come to think of this album not only as a remarkable piece of work for its reputation as one, but I have come to actually feel it's a remarkable piece of work. Hey, I'll give it four stars at least for what this album is to prog history, but now I'll give it four stars because I sincerely feel it deserves it.Why not five stars? Well, there's Wetton's vocals which for me at least have not come into full bloom yet. And in \"Providence\" the 4:50 of waiting for the musicians to coalesce their individual squawks, peeps, patters and rumbles is actually a bit long unless one is in the mood to have the patience to let it develop. I understand what they were doing. But it can sometimes seem like what I call \"being weird for the sake of weirdness\". But that's King Crimson, isn't it?"
    },
    {
      "reviewer": "Magnum Vaeltaja",
      "date": "Posted Wednesday, July 1, 2015",
      "rating": 4,
      "text": "Edit: As with a lot of King Crimson stuff, this one has grown considerably since my initial review (the very first review I wrote for the site, in fact!) over a year ago. Here goes.If you've read this far down the album's page, you should already know the history behind \"Red\". After David Cross left, King Crimson was left as a trio and Fripp had come to terms with the fact that by the end of 1974, King Crimson would be disbanded. This wasn't permanent, of course, but I always consider it to be the end of the \"true\" King Crimson. That probably sounds a little pretentious, but I really feel that with \"Red\", King Crimson had left their true swan song, and none of the albums under the KC name that have followed have been able to produce as much of a cohesive, immersive musical experience of we hear on this one.After the patchy half-studio, half-live \"Starless and Bible Black\", the hard-hitting title track opens up this one with the amps cranked to 11 and we know right away that Fripp & co. have a vision in mind with this album. The dark, brooding atmosphere, coupled with the stark album cover, tells us that this is going to be a different kind of King Crimson album. This is a more human, more moving collection of songs. Gone are the days of the idealist, escapist exercises in imagination of \"In The Wake of Poseidon\" or \"Islands\". Indeed, you won't find yourself daydreaming to \"Red\" the same way you might to \"Cadence and Cascade\" or \"Formentera Lady\", but the choice by King Crimson to make their send-off very down-to-Earth was an effective choice, and this is perhaps one of the first times that we can really empathise with a band who, to many, sounds very cold and impersonal.The highlight of the album, aside from the sombre \"Fallen Angel\", with its beautiful acoustic guitar and wind arrangements intertwined into Robert Fripp's domineering distorted riffs, is, of course, \"Starless\". There was really no better way to end the album than this one. I can't help but notice, when I listen to this one, that there are many callbacks and quotes of earlier King Crimson works. Indeed, Mel Collins' main saxophone melody is actually taken directly from the Bolero section of \"Lizard\", albeit rearranged for a 4/4 time signature. The tense middle section reminds me of a similar build-up in \"Pictures of A City\", only this time expanded out to a more complete potential. And the jazzy uptempo saxophone jam wouldn't seem out of place in \"Larks' Tongues In Aspic, Pt. 1\". The sum of the parts, of course, is more than just a collection of past ideas; it truly stands on its own as an independent unit. There's really no question why it's become as popular as it has among fans.My only complaint with this album is, as many others have stated, \"Providence\". Not because it's dissonant, though; King Crimson pulled that off with great success many other times on their earlier studio albums. Many are quick to compare it to \"Moonchild\", but I don't feel that analogy is apt. Where the jam in \"Moonchild\" was meant to lull you enough that the vast opening chords of \"The Court of The Crimson King\" would hit you like a freight train of sound, \"Providence\" does little to set up \"Starless\", except maybe for the fact that it makes you desperate to want to hear \"Starless\" start. The 8 minutes of this live improvisation are tense, but the tension is never released, the idea never develops into anything. Compared to many of the brilliant improvised works the band had been doing around this time, this was probably one of the poorest they could have chosen from.With the inclusion of \"Providence\", I can't bring myself to give this album a 5-star rating, as it isn't a masterpiece. Having said that, I really can't recommend it enough. \"Red\" is not just a treat for King Crimson fans, but it's also a fantastic introduction to the band. The fact that it sounds very modern (along with Van der Graaf Generator, this album is probably directly responsible for the \"dark, edgy prog\" aesthetic that's so prevalent today) might even make it more approachable to new listeners than \"In The Court of The Crimson King\". And if you're a metalhead, this is THE starting point to getting into prog. In all, a 4 star rating. An excellent, excellent, excellent addition to any music collection."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Friday, September 18, 2015",
      "rating": 5,
      "text": "Review N� 18King Crimson was founded in 1969 by guitarist Robert Fripp and drummer Michael Giles. King Crimson is probably the most innovative and experimental group that ever existed. The band is considered the founder of the progressive rock music, with their debut studio album \"In The Court Of The Crimson King\", released in 1969. The group's sound incorporated various musical influences, during their long history, ranging from jazz, classical, experimental, psychedelic, heavy metal, new wave, hard rock, folk and electronic. In my humble opinion, beyond King Crimson be the most experimental and innovator group in the progressive rock scene, it's the most eclectic too. In one occasion, someone even said that sometimes, the group makes a kind of an intelligent heavy metal sound.\"Red\" is their seventh studio album and was released in 1974. It was their last studio album in the 70's, before Fripp temporarily disbanded the group, in the same year. The album has been released later, in the same year, after their split and without the usual world live tour.The line up on the album is Robert Fripp (guitar and mellotron), John Wetton (vocals and bass guitar) and Bill Bruford (drums and percussion). The previous fourth band's member David Cross (violin), left the group in 1974, reducing the group as a trio. Nevertheless, the trio recorded the album with the help of Cross, as a guest musician. The album had also the participation of five other guest artists, Ian McDonald (alto saxophone), Mel Collins (soprano saxophone), Mark Charing (cornet), Robin Miller (oboe) and Richard Palmer-James (lyrics). McDonald and Collins are two other ex-members of the group. This trio is formed by three of the most brilliant musicians and instrumentalists who ever existed. Fripp, beyond the founder and leader of King Crimson, is considered one of the best musicians and guitarists. He also has collaborated with many other artists, all over the time. Wetton was one of the founder members, the front man and the principal songwriter of Asia. He was also member or cooperated with so many others bands and soloists all over the time, such as, Family, Roxy Music, Bryan Ferry, Uriah Heep, UK, Steve Hackett and Wishbone Ash, beyond his solo musical career. Bruford, was one of the founder members of Yes, and has been a prominent figure in the progressive rock movement. He made the live tour of \"Seconds Out\", as the drummer of Genesis, and has also a solo career of great success. Bruford is also considered one of the greatest drummers of all time.\"Red\" has five tracks. The first track \"Red\" written by Fripp is the title track song. It's an instrumental track, very powerful and heavy. It features heavy guitars, an incredible bass line and a unique drumming style. It shows clearly the band's ability to feature multiple time signatures in only one song. Despite being a song written in 1974, it sounds very futuristic, even now. The second track \"Fallen Angel\" written by Fripp, Wetton and Palmer- James is a very beautiful ballad with great vocal performance by Wetton. It has beautiful musical arrangements that include reverse delays and mellotron lines, which give to it a unique flavour. The third track \"One More Red Nightmare\" written by Fripp and Wetton is a very dynamic and energetic track with great guitar work. It has also an interesting sound, clapping hands. It features different time signatures with an unforgettable guitar riff, an impressive saxophone solo and the great ability of Wetton singing. The fourth track \"Providence\" written by Fripp, Wetton, Bruford and Palmer-James is other instrumental track, very experimental, and it's probably the most progressive song on the album. Here, we can appreciate the incredible communion between all band members. \"Providence\" was recorded live, and is the only live piece on the album. The fifth track \"Starless\" written by Fripp, Wetton, Bruford, Cross and Palmer-James is the lengthiest track on the album and is, for me, a really masterpiece, and is one of my favourite King Crimson songs. It's a great dark song with the Wetton's melancholic voice. This is a truly classic song, and I'm really glad that it has returned live on the Wetton's solo set list, in its full version. \"Starless\" represents the perfect end to a perfect album.Conclusion: \"Red\" is simply one of the best and most important albums in the history of the progressive rock music. \"Red\" is my second review of King Crimson's albums, after \"In The Court Of The Crimson King\". For me, these two magnificent albums are undoubtedly their best, and two of the best albums ever made. To Q magazine, \"Red\" is one of the fifty heaviest albums of all time. So, it's very common to consider \"Red\" as one of the most influential albums in the progressive metal style. So, because of that, King Crimson can be considered the pioneer of that type of music. If you don't have yet this pearl in your musical collection, buy it now and rapidly. Any King Crimson fan will want to add it into their musical collection. And after all, it has been reissued and remastered a few times, and all over the years.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Tuesday, July 23, 2019",
      "rating": 5,
      "text": "The third and final album of King Crimson's second (or third? or fourth?) phase, which began with Larks Tongues in Aspic (or with Islands?), \"Red\", can be considered as a middle ground between LTIA and Starless And Bible Black both as sound and as a composition and musical score. \"Red\" is not as geometric and slow, and redundant as LTIA, it's not even live and erratic and improvised like \"SABB\", of which it doesn't sound dry and fatal. The live songs here are only one, \"Providence\", and otherwise the work has been done in studio with very studied and stryted pieces, which collaborate Ian McDonald to the saxes (already appeared on the first record of KC), which gives a greater variety in the arrangements and evokes the sound of \"Islands\".\"Red\" (6:20) is an instrumental opening track built around a powerful guitar riff, doubled thanks to the overdubbing. The middle section includes an overdubbing cello performed by an uncredited session-man. The song is more conventional and predictable than the ones of the previous Lp, here Fripp follows a precise melody with his guitar. The track is good but lacks originality in his development and arrangement. Rating 7,5/8.\"Fallen Angel\" (6:00) contains the last acoustic guitar track recorded by Fripp with King Crimson and the cello of the anonymous musician of the previous track, but even the oboe (Robin Miller) and the cornet (Mark Charig): both previous collaborators of KC on Lizard (1970) and Islands (1971). Wetton's singing is good and the structure of the piece is conventional: verse-chorus (instrumetal break)- chorus - verse- chorus but here the musical score is more original than in the previous one and the arrangement is disturbing and dissonant, less conventional, and touch the climax in the instrumental section. Masterpiece. Rating 8,5/9.\"One More Red Nightmare\" (7:04) has got a frighteningly terrifying atmosphere, sounding similar to the previous one, centered on bass and guitar. The instrumental piece at the center of the track has something of the song \"Larks TIA\" but here is the McDonald's sax that produces a sound that also resembles \"Sailor's Tale\", from Islands (where at the sax there is Mel Collins). Anyway, here yuo can listen to a great musical orgasm. Masterpiece, 8.5.Rating Side A: 8,5.Side B.\"Providence\" (8:08), instrumental, is a live improvisation, it starts slowly, with Cross's violin painting chromatic lines worthy of a classical sonata, then performing in virtuosity, while behind it you can hear Fripp's heavy guitar, Bruford's percussion, describing a completely improvised abstract sound, until around the fifth minute Wetton's bass took the lead, followed by Fripp's abrasive guitar, the drum snare arrives and the song takes off for a pyrotechnic ending, which softens in the last 30 seconds. Masterpiece, 8.5.\"Starless\" (12:18), in the beginning, seems an epic melodic ballad as the ones on the debut album written by Ian McDonald, here on alto saxophone. Fripp's mellotron embellishes the sound that proceeds with Wetton's singing until four and a half minutes, when the structure of the song ends and begins an instrumental moment (that lasts 8 minutes) very dissonant with an atmosphere of terror, thriller mood, an obsessive and paranoid sound played by Fripp's guitar creeps into a devious progression dominated by Wetton's bass, until at the ninth minute the track becomes a free jazz - hard rock piece, thanks to McDonald's and Collins saxes; for a moment the initial melody appears again, before the ending, triggered. Fripp considered this piece as definitive, emblematic of the end of an era, and in fact after Starless he disbanded the group. Absolute masterpiece, Rating 9+.Rating Side B: 9.This album is a real masterpiece of progressive rock. The \"weakest\" song is the first: and I've said everything...Rating album: 9,5. Five Stars. Absolute masterpiece."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Thursday, June 8, 2023",
      "rating": 4,
      "text": "A few days before the release of \"Red\", the great Robert Fripp announced the end of King Crimson, something that could be expected given the controversial personality of the guitarist and songwriter. He said he was exhausted by the constant clashes with the music industry and also because he felt that the band had stopped evolving.However, the quality was not affected by these important factors, and \"Red\" ended up being one of King Crimson's most accomplished albums. The somber instrumental walls built by the trio (after the departure of David Cross in the middle of the recording process), are solidly sustained by the spontaneity of the musicians and their constant obsession to experiment beyond any boundaries.And in that sense, the album delivers memorable moments, such as the instrumental \"Red\" and its distorted and saturated riff, referenced as one of the inspirations for the grunge movement 15 years later; or the ballad \"Fallen Angel\", which ceases to be so as the song gains in intensity; or the timeless and extensive \"Starless\", where a deep melancholy guided by John Wetton's voice in the first minutes, combines with guitars, basses, Bill Bruford's jazzy drums and the saxophones of guests Ian MacDonald and Mel Collins, to take the song to the point of derangement, rearrange all the pieces and conclude in magnificent harmony. A crimsonian jewel and an unbeatable closing of the album.Undoubtedly \"Red\" is one of the maximum expressions of creativity in King Crimson's discography and a flag of progressive rock of all times.P.S. As nothing is definitive in this life, the \"final\" ending announced by Fripp was not, but only a long pause of 7 years until 1981's \"Discipline\".4 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "albumdfe8.html",
  "last_parsed": "2025-05-18T00:16:00.624641"
}