{
  "local_path": "C:\\Users\\salmo\\Documents\\GitHub\\AlbumExplore\\ProgArchives Data\\Website\\ProgArchives\\www.progarchives.com\\artist889a.html",
  "name": "MUSEO ROSENBACH",
  "genre": "Rock Progressivo Italiano",
  "country": "Italy",
  "biography": "Museo Rosenbach biography\n\nFounded in  Bordighera, Italy in 1971 - Disbanded in 1974 - Reformed in 1999 - Activity unknown since 2017\n\nThis is a one-shot-band including Pit Corradi (keyboards), Giancarlo Golzi (drums), Enzo Merogno (guitar/vocals), Alberto Moreno (bas/piano) and singer Stefano Galifi. In '73 they released \"Zarathustra\" (about Nietzsche's superman), this album is still considered as one of the masterpieces in the world of progrock. And it's one of the most sought after \"collector items\". In '92 the CD's \"Rare and Unreleased\" and \"Live\" '72 were released, both interesting but with inferior sound quality.  A new line-up with the drummer and the bass player who made the album \"Exit\" in 2000.\n\nThe album \"Zarathustra\" starts with the magnificent titletrack (five parts, almost 21 minutes). The foundation is a beautiful theme (like in \"Firth of Fifth\" from GENESIS) that returns in different climates (from dreamy to heavy and bombastic) and with different colouring of the instruments. The interplay between the electric guitar, keyboards (Hammond organ, synthesizer and piano), rhythm-section (propulsive and perfectly timed drumming) and strong and expressive Italian vocals is very captivating. It all creates a constant tension, topped by majestic eruptions of the Mellotron. The omni-presence of this instrument gives the titletrack the same thrilling impact as it does on the early albums from KING CRIMSON and GENESIS! The other three (shorter) tracks sound flowing and powerful with a lot of Hammond organ and guitarplay with echoes from Steve HACKETT. ESSENTIAL!\n\nA long anticipated return called \"Barbarica\" arrives in April 2013.\n\n-Erik Neuteboom-\n\nSee also:\n\n-\n\nWiKi\n\n-\n\nHERE",
  "albums": [
    {
      "title": "Zarathustra",
      "local_path": "album10f5.html",
      "year": 1973,
      "rating": 4.33,
      "type": "Studio Album"
    },
    {
      "title": "Exit",
      "local_path": "album9add-2.html",
      "year": 2000,
      "rating": 3.27,
      "type": "Studio Album"
    },
    {
      "title": "Barbarica",
      "local_path": "album8ac9-2.html",
      "year": 2013,
      "rating": 3.61,
      "type": "Studio Album"
    },
    {
      "title": "Live '72",
      "local_path": "album2cdc-2.html",
      "year": 1992,
      "rating": 1.67,
      "type": "Live Album"
    },
    {
      "title": "Zarathustra - Live in Studio",
      "local_path": "albumd7a7-2.html",
      "year": 2012,
      "rating": 4.04,
      "type": "Live Album"
    },
    {
      "title": "Live in Tokyo",
      "local_path": "album3339.html",
      "year": 2014,
      "rating": 4.34,
      "type": "Live Album"
    },
    {
      "title": "Rare and Unreleased",
      "local_path": "albuma7a7-2.html",
      "year": 1992,
      "rating": 3.21,
      "type": "Compilation"
    },
    {
      "title": "Rarities",
      "local_path": "album09cd.html",
      "year": 1992,
      "rating": 3.2,
      "type": "Compilation"
    }
  ],
  "scraped_at": "2025-05-18T00:37:59.428528"
}