{
  "album_title": "ZARATHUSTRA",
  "artist_name": "Museo Rosenbach",
  "artist_page_link_local": "artist889a.html?id=254",
  "year": 1973,
  "rating_value": 4.33,
  "rating_count": null,
  "review_count": null,
  "genre": "Rock Progressivo Italiano",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/254/cover_3392117102008.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Zarathustra",
      "duration": "20:49",
      "is_sub_track": false
    },
    {
      "number": "a",
      "title": "L'Ultimo Uomo",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "b",
      "title": "Il Re Di Ieri",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "c",
      "title": "Al Di La Del Bene E Del Male",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "d",
      "title": "Superuomo",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "e",
      "title": "Il Tempio Delle Clessidre",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 2,
      "title": "Degli Uomini",
      "duration": "4:05",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Della Natura",
      "duration": "8:31",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Dell'Eterno Ritorno",
      "duration": "6:19",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Marcelo",
      "date": "Posted Saturday, December 20, 2003",
      "rating": 5,
      "text": "Highly, highly and highly recommended! Most of the Italian progressive is fine and beautiful, but this album is the highest point. A conceptual album about the polemic Nietzsche's book \"Zarathustra\". Lots of keyboards driven heavy (but melodic) music, there's no any weak second all over the stuff. A party for Mellotron and vintage sounds lovers. Beyond Italian scene, \"Zarathustra\" is one of the best albums ever made. More than essential!"
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Thursday, February 26, 2004",
      "rating": 4,
      "text": "One of those legendary Italian one-shot album that is rightly regarded as a mini-masterpiece, Museo Rosenbach's sole official album must be in everyone's collection, should they have 10 Italian-prog albums in their shelves. This classic singer-led quintet presents an impressive symphonic prog, drenched in mellotron and other \"vintage\" keyboards. Based on a collage, the artwork is sufficiently hypnotizing visually to add some eeriness to their sonic meanderings to keep you fascinated.Opening on the sidelong 5-movements 20-mins+ epic title track, the soundscape gently rise from nowhere and explodes into your ears after some 90 seconds or so. Reminiscent of Trespass or Cryme-era Genesis but with an Italian twist and certain unpredictability, you navigate in familiar waters of the classic-era prog. With a little imagination and The Gabe's voice, you could imagine that this would be a long-lost Genesis album session from early 72, even if there is a little more (often-tasteful) heroics. The flipside feature three shorter tracks, ranging from 4 to 8-mins+, where the feeling is a bit different, like the particularly energetic (read harder) Degli Uomini, where the guitar flexes its muscles. The longer Della Natura is more typically Italian-dramatics, mixed with some ELP/Banco moods and riffs. Again the relatively heaviness and abrupt breaks of this track contrasts with the finely-crafted epic on the other side. The closing Eterno Ritorno is much in the same vein of its two companion pieces, but I find it a little less refined, nd maybe the drop that fills the bucket, just reaching the saturation level.As said above, Zarathustra is certainly one of the best albums to come from the peninsula, especially in the symphonic-prog genre, but it's not perfect either as the production is not up to UK standards and there are always the slightly excessive overflowings that come from that part of the continent"
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Sunday, March 14, 2004",
      "rating": 5,
      "text": "MUSEO ROSENBACH's \"Zarathustra\" is without a question one of my all time fav Ital-prog albums... and why not. \"Zarathustra\" is a Nietzsche'ian influenced album surrounded by loads of excellent guitar and keyboard work. MUSEO ROSENBACH blend organ (hammond and farfisa) with Mellotron overdosed passages. The guitar, bass and drum work on the album is also very well done. Vocals are strong and sung of course in Italian. If you are lucky enough to pick up the CD remastered version in Vinyl-like gatefold from Italy's BMG label you will be amazed with the sound and packaging. This is very powerful progressive rock and is essential in your collection."
    },
    {
      "reviewer": "Steve Hegede",
      "date": "Posted Sunday, March 21, 2004",
      "rating": 5,
      "text": "\"Zarathustra\" is another controversial progressive rock album. Many claim that it is best prog album album to come out of Italy during the 70's, while others claim that it's just basic hard rock with mellotron thrown in. I was quite moved after listening to \"Zarathustra\" for the first time because the themes, melodies, and mood-changes are really high-quality. The four awesome compositions (one is 20-minutes long) alternate from soft and delicate, to 70's heavy rock. In my opinion, \"Zarathustra\" is one of the best progressive rock albums out there."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Saturday, April 3, 2004",
      "rating": 4,
      "text": "Except on the weak production, this album is remarkable and characterized by a clever use of Mellotron keyboards, Hammond Organ and analogical synthesizers at times, quite powerful. The long title track is very \"FLOYDian\" in the mood and in other circumstances resembles the style of ELP in the lighter vein; nevertheless there's not much of the grandeur which instead characterized the albums by BANCO, Le ORME and early PFM , above all the mellow parts, and for this reason you can completely appreciate this album if you are fond of the most accessible \"classic prog\" (a style similar to that one of LANDBERK, naturally in their best - actually a few ones - moments!!). Recommended, it can complete your Italian prog collection of the seventies, even though it is not a masterpiece."
    },
    {
      "reviewer": "Proghead",
      "date": "Posted Wednesday, May 5, 2004",
      "rating": 5,
      "text": "What a wonderful way for me to get started on the Italian prog scene. It was 1993, I was 20, I was getting pretty much fed up with anything mainstream. This was still before the Internet (or at least, I never heard of the Internet in '93, although it did exist, but was more of a \"techno-geek\" sort of thing), and trying to get info on obscure prog rock was rather difficult. I was given a blank tape that had MUSEO ROSENBACH's \"Zarathustra\", because this guy knew that I was ready for more obscure prog rock, and knew that I wouldn't just casually step foot in a record store and find an LP of this. I have since bought the Italian BMG/Ricordi CD reissue.Let's get with the review on \"Zarathustra\". The original LP was released on the Ricordi label (which was also home to bands like BANCO and CERVELLO). The music tends to the more heavy, agressive end of the prog spectrum, not unlike IL BALLETTO DI BRONZO or BIGLIETTO PER L'INFERNO. Lots of great organ and Mellotron, aggressive guitars, and powerful vocals. Plus you can't beat that mystical atmosphere. The lyrics are said to be inspired by the works of Friederich Wilhelm Nietzsche and \"Thus Spoke Zarathustra\". Nietzsche was also greatly admired by those with far right-wing views, and because of that, prevented Museo Rosenbach from getting the attention they deserved (although how the band stood on political issues is anyone's guess, as Nietzsche did have lots of admirers of every political stripe). Right-wing or not, the band really knew how to dish out some truly killer Italian prog, as the side length title track demonstrates. The other three cuts, \"Degli Uomini\", \"Della Natura\", and \"Dell'Eterno Ritorno\" are all of the same quality, and I really can't seem to find any dead spots.It's amazing for the ten years I've been familiar with this album that I enjoy it just as much as I did back in '93. Yes, some might think there are better Italian prog albums out there, some might not like the production (many of these heavier Italian prog albums I've heard, like BIGLIETTO PER L'INFERNO, OSANNA, CERVELLO, and SEMIRAMIS all don't have the best production), but to me, this is a totally essential album."
    },
    {
      "reviewer": "Fitzcarraldo",
      "date": "Posted Thursday, May 6, 2004",
      "rating": 4,
      "text": "Quite heavy, dark progressive music this, but melodic nonetheless. It only really softens for any length of time on the excellent track 'Superuomo', one of the five tracks which together make up the title supertrack 'Zarathustra'. There is a lot of electric guitar, bass and drums in the fore, with some good Mellotron and Hammond work supporting it and taking the lead in several places. How to describe the music? A dash of BANCO DEL MUTUO SOCCORSO, THE DOORS, DEEP PURPLE and JOE COCKER, perhaps?! (It's cleverer and more complex than the music of the last three though.)The singer has the slightly rough singing voice characteristic of many male Italian rock and pop singers; perhaps that's why his nickname is Lupo (Wolf)! In my opinion his voice is not as pleasing as that of some of the other Italian prog rock bands' singers. I wish I could understand Italian better though, because the singing is full of passion and I suspect the lyrics are good.Taken as a whole the album does feel very slightly like a classical symphony, despite the electric guitar and drums; it's cleverly constructed music. The ending of the last track, 'Dell'Eterno Ritorno', while being totally modern instrumentally, reminds me of the ending of a fourth movement and nicely rounds off the album. Perhaps it's no coincidence that the album is divided into four principal pieces (equivalent to the four movements of a symphony). This may all sound like pretentious babble I know, but the more I listen to the album, the stronger this impression becomes. This is another album that really does deserve persevering with if you don't like it instantly.In my opinion \"Zarathustra\" is not the masterpiece claimed by some. However it is very good, sophisticated, heavy progressive music, and I am pleased to have it in my collection."
    },
    {
      "reviewer": "James Lee",
      "date": "Posted Tuesday, June 22, 2004",
      "rating": 4,
      "text": "Here's another gem from the annals of 70s Italian prog- this time with a slightly grittier feel. Despite the symphonic structures and accents, this is a notably heavy album for the time; I suppose you could call them the DEEP PURPLE of Italian prog.The title song is broken up into distinct movements, all of which feature excellent transitions, pacing, and stylistic continuity. One of my favorite prog (and classical) intro styles is to slowly build into a grand opening theme- \"L'ultimo uomo\" does a nice variation of that, then drops into a beautiful mellow verse for a while. Just when you think it's safe, here come the fuzzy guitars and big Hammond organ that characterize much of the album. \"Il re di teri\" makes the atmosphere a bit more eerie with a reverb-drenched piano and a Mello solo over organ and tremolo guitar before launching into a rocking section. \"Al di la...\" gets even heavier, with chanted vocals over a fuzzed-out backing. \"Superuomo\" has some chilling electric piano sounds and the fastest tempo on the album, which then fades out completely to be replaced by an increasingly heavy martial theme- the first in a series of permutations featuring organ and fuzz guitar leads. The conclusion, \"Il tempio delle clessidre\" reminds me quite a bit of the climax of PINK FLOYD's \"Echoes\".\"Degli uomini\" is more CRIMSON-sounding (down to the faint mellotron whine in the background), but with more blues-rock style in the guitar (not unlike Fripp's solo on VDGG's \"The Emperor in His War Room\"). It's quite good but seems to simply trail off after the vocals come in.\"Della natura\" gives us more of the same, with a little Mellotron (using the same tapes as Wakeman on \"Siberian Khatru\", in a more ambient way). There's some explosive keyboard and guitar work, verging on fusion territory. The tremolo electric piano is shiveringly effective, like a restrained Ray Manzarek, although the scatting vocal refrain is a bit disturbing. The finale of the song picks up the pieces and wraps it up with another FLOYD type climax.\"Dell'Eterno Ritorno\" is almost SABBATH-heavy at times, but also contains some nice flute sounds- actually not a million miles from moments on \"Aqualung\", even though the flutes here are simulated. There's even some rare acoustic guitars on this track, but they are buried a bit in the mix. Galifi gets to let loose a bit near the end, and the ragged vocal works well. The rolling conclusion sounds a little tacked-on, though.This is a grittier sound than most of the 70s italian proggers, and not just because the production was a bit murky; Stefano Lupo Galifi is a less operatic, more natural singer and the guitars have more of a blues rock sound- as heavy as CRIMSON but played in a funkier way, with a thick fuzztone that approaches Brian May's sound. The organ is the main focus, a big cathedral sound here and a dirty B3 lead there; the playing is great on all the keyboard parts ( the ambient electrics being my favorite). The band's sound is fairly constant from beginning to end- no odd stylistic changes, just the occasional reverb- soaked quiet segment to increase tension. The downside is that the band's sound can wear on you just a little by the end of the album, and their transitions sometimes lack cohesiveness. But if you're a fan of harder-edged 70s prog with plenty of tasty moments like me, you'll have no problem."
    },
    {
      "reviewer": "maani",
      "date": "Posted Monday, August 23, 2004",
      "rating": 5,
      "text": "I am notoriously stingy with 5-star reviews. Thus, I want to explain carefully why I am ready to put \"Zarathustra\" in the same pantheon as \"In The Court of the Crimson King,\" \"Piper at the Gates of Dawn,\" \"Foxtrot,\" \"Close to the Edge,\" \"Thick as a Brick,\" and \"In A Glass House,\" among others. Although it is not a \"seminal\" album like those noted above - and although it has some minor \"flaws\" (for example, the production is dated) - it nevertheless has a few things in its favor that far outweigh any minor quibbles, and definitely point to a legitimate \"masterpiece.\"Most important is its early arrival on the prog scene. Released in April 1973, the album was actually written during 1972: according to a Museo Rosenbach web site, all the tracks had been completed by mid- to late 1972. Thus, although the band claims Genesis as one of its major influences (along with Gentle Giant and Jethro Tull), it is highly unlikely that \"Zarathustra\" was influenced by \"Foxtrot,\" given that the latter was not released until October 1972. This means that the \"Zarathustra\" suite - all 21 minutes of it - was not a response to \"Supper's Ready,\" but was written contemporaneously with - and independent of - it. Based on this, and after numerous listenings, there is no question in my mind that the \"Zarathustra\" suite is every bit as creative and brilliant (re composition, musicianship, etc.) as \"Supper's Ready.\" Yes, I realize this will sound like \"blasphemy\" to many; however, although I, too, believe \"Supper's Ready\" (along with \"Thick as a Brick\") to be perhaps the earliest, most important and influential \"conceptual\" prog \"suite,\" the originality and execution of \"Zarathustra\" is every bit as creative, and proves itself worthy of the comparison. Indeed, had MR been as \"well-known\" as Genesis at the time, \"Zarathustra\" would probably have been just as influential as \"Supper's Ready.\"Also important to consider is that \"Zarathustra\" was MR's debut album. It took Gentle Giant three albums to get to their first conceptual \"quasi-masterpiece\" (\"Three Friends\"), Genesis four albums to get to \"Foxtrot\" (and \"Supper's Ready\"), and Jethro Tull five albums to get to \"Thick as a Brick\" - and none of the debut albums by any of these bands was anywhere near the masterpiece that \"Zarathustra\" is. Indeed, of the eight \"seminal\" progressive groups (Crimson, Floyd, Moody Blues, Genesis, Yes, Gentle Giant, Tull and ELP), only Crimson's \"Court\" and Floyd's \"Piper\" are equally great debuts (with ELP's debut coming pretty close).\"Zarathustra\" is certainly influenced. Indeed, one can even discern the exact influences: Genesis' \"Trespass\" (1971), Giant's \"Acquiring the Taste\" (1971) and \"Three Friends\" (June 1972), and Tull's \"Thick as a Brick\" (March 1972). Yet Museo Rosenbach not only \"filters\" those influences beautifully to create something both creative and compelling, but \"Zarathustra\" also clearly influenced those bands' later work (as well as many other bands). That is, \"Zarathustra\" both draws from and adds to some of the earliest works of Genesis, Yes, Gentle Giant, ELP, Crimson and Tull - an extremely rare, if not unique, occurrence in prog-rock, especially given the comparative obscurity of MR.The \"Zarathustra\" suite itself is one of the most beautifully and \"carefully\" crafted compositions in the history of progressive rock, and I use the word \"carefully\" in its literal sense: i.e., that great care was taken. The band neither rushes into things, nor lets things \"sit\" for too long. Every section - whether soft, smooth, slow and simple, or \"hard,\" rocking, fast and complex - is constructed for maximum effect, with minimal (if any) \"down\" time. And although the vocals are not always as \"immediate\" as a Gabriel or Anderson (Jon or Ian), Stefano Galifi moves between soft and subtle and \"immediate,\" using the natural raspiness in his voice to evoke a sense of \"urgency.\" (There are also some very nice \"choral\" parts, sung entirely by the group.) Perhaps most remarkably, Galifi and the band are able to convey the story of Nietzsche's \"Superman\" (in both lyrics and music) quite well even if one does not understand Italian. For all of these reasons, \"Zarathustra\" stands on its own as an incredibly creative, often brilliant, and extremely early (if not seminal) concept suite.The other three compositions (all of which are related, to one degree or another, to the Zarathustra story), vary in length from 4 to 8 minutes, and are all equally well-written and executed. (Indeed, the album is set up almost as a \"reverse\" of Foxtrot: i.e., imagine putting \"Supper's Ready\" first, and following it with \"Watcher of the Skies,\" \"Get'Em Out by Friday\" and \"Can Utility and the Coastliners.\")What makes any album a \"masterpiece?\" Obviously, there are the compositional, lyrical, musicianship, production and general execution elements. However, that is not enough. It must have something else: a quality that makes the album not only an exceptional achievement \"in its time,\" but also an achievement that \"transcends\" its time - and, indeed, makes the album \"timeless.\" Although, as noted, the production on \"Zarathustra\" sounds somewhat dated, it nevertheless \"transcends\" its time, and is not only a timeless masterpiece - in the truest sense of that word - but an exceptional, historically important album, and an absolute must-have for any serious prog-rock collection."
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Tuesday, November 16, 2004",
      "rating": 5,
      "text": "In the early Nineties I started to search for the Italian prog rock from the Seventies. The mail-order catalogues from the prog rock labels Laser's Edge en Syn-Phonic became my most important sources, I still enjoy the warm and enthusiastic descriptions from Ken Golden and Greg Walker about bands like Il BALLETTO DI BRONZO, CHERRY FIVE, I DIK DIK and EDGAR ALLEN POE. One often acclaimed group was MUESO ROSENBACH with their LP \"Zarathustra\" (about NIETZSCHE'S superman) from 1973. This album had such euphoric reviews that I decided to order it. Well, very soon I was mesmerized by the splendid title track, a 20 minute killer composition with echoes from GENESIS and KING CRIMSON. The foundation of this wonderful and moving song is a beautiful theme (like \"Firth Of Fifth\" from GENESIS) that returns in different climates (from dreamy to heavy and bombastic) and with different colouring of the instruments. The interplay between the electric guitar, keyboards (Hammond organ, synthesizer and piano), rhythm- section (propulsive and perfectly timed drumming) and strong and expressive Italian vocals is very captivating. It all creates a constant tension, topped by majestic eruptions of the Mellotron. These moments gives the title track the same compelling impact as it does on the early albums from KING CRIMSON, goose bumps all over my body! The other three (shorter) tracks sound flowing and powerful with a lot of Hammond organ and guitar play with echoes from Steve HACKETT. For me this CD is the absolute highlight of the lush and varied Italian prog rock scene in the Seventies. A MUST!"
    },
    {
      "reviewer": "NJprogfan",
      "date": "Posted Monday, June 6, 2005",
      "rating": 5,
      "text": "One of the top 5 Italian prog albums. With a powerful singer, (sounding like David \"Jimmy\" Spitaleri of Metammorfosi), a bit raspy and throaty but perfect for the sound, the music is played at breakneck speed. The first two parts/tracks of the song \"Zarathustra\" are somewhat quiet, ala PFM but 3 minutes into track one comes a burst of Mellotron, awesome! That Mellotron burst shows up at the end of the momumental track. The other three songs are just flat out organ, guitar freakouts with quiet parts sprinkled in to catch your breath. These guys can play! Influences are difficult. Others compare them to ELP, Deep Purple, and other harder sounding bands. I think they are extremely original, and sound like no one in particular. If you are interested in listening to Italian prog and want something heavy, (but not metallic) give this album a listen. Without a doubt, one of the best heavy symph albums you'll ever hear. An easy 5 star album."
    },
    {
      "reviewer": "Jimbo",
      "date": "Posted Wednesday, July 13, 2005",
      "rating": 3,
      "text": "I'm a strange person. Had you asked me about this album a year ago, I would've recommended this album to you heartily, claimingZarathustrais one of the best Italian prog albums. Now, one year later, after re-listening to it a few days ago, I simply have no idea what it is that most people (and myself earlier on!?) see in this. Museo Rosenbach, while a talented band, do not have the innovation and courage King Crimson had - a band they seem to admire so much. Nor do they have the balls and energy Deep Purple had - another band Museo Rosenbach could be compared to. They're simply a toned down version of these two bands. It is quite evident that this is an Italian band though, they have that certain \"sound\" that only Italian bands are capable of producing. Now, if you're a mellotron-maniac, or simply enjoy the sound of the legendary Hammond, you're bound to enjoy this album, but even those instruments do not always equal quality. Don't get me wrong though, I do like this album, especially the vocalist Stefano Lupi Galifi manages to impress me quite often with his rough, bluesy voice that brings a lot of colour to an otherwise slightly bland album. The music tends to be a bit on the dark side, with the mellotrons sending apocalyptic waves to your ears. I find it hard to find any real flaws in this album - lack of originality perhaps? There's something that slightly irritates me aboutZarathustra, I can't exactly put my finger on it. It simply doesn't appeal to me that much. It's good enough for an occasional spin, but at the moment even that sounds a tad tedious."
    },
    {
      "reviewer": "Progbear",
      "date": "Posted Monday, September 19, 2005",
      "rating": 2,
      "text": "This gets my vote for Most Overrated Italian Prog Album. Yes, there's TONS of Mellotron on the album, almost to the point of overkill. The problem is, it's not really used to any great effect.The lengthy suite, for me, is actually the album's nadir. Rather clumsily played, with obnoxious off-pitch vocals. And musically, it just doesn't hang together. Yes, they repeat the (admittedly rather rousing) opening theme at the end, but the middle of the suite is just a sloppy mess of sludgy hard rock sweetened with symphonic keyboards and an awkwardly-rendered 5/4 passage. This sounds like a heavy rock band trying to \"do\" prog as a lark, and reminds me more of Uriah Heep's \"Salisbury\" than \"real\" prog. And it's not even that good!The three tracks comprising the B-side are, if nothing else, an improvement. They're more convincingly \"progressive\" than the suite, that much is certain. But the vocals are still fairly poor, and there's not really anything here PFM or Banco couldn't do better with one hand tied behind their backs. In short: try before you buy."
    },
    {
      "reviewer": "Andrea Cortese",
      "date": "Posted Sunday, November 13, 2005",
      "rating": 5,
      "text": "\".clear Divine Essence is hiding in whom is living time's game and waiting for a different dawn.\"Another precious gem, another unique thunder in all the stormy and rich Italian prog scenario of the seventies! This time we have to discuss about a philosophical concept album based on the famous figure of Friedrich Nietzsche (1844-1900). All his themes are musically arranged: the denunciation of the millenary lies of the human society and the ideal of a SuperMan, someone who can go beyond all the current myths, founding a new himself on new true discovered values. Absolute moral freedom which is not, as the nazi reconstruction tried to make think of, the proclamation of superiority of a race on all the others! Paradoxally nietzschean SuperMan is not someone a-moral, but someone with great sense of True Morality, someone who manages to distinguish between good and evil without any conditioning!Did Museo Rosenbach reach the goal to explain musically the complex thought of this german philosopher? Listening to such an album the answer is very simple: Zarathustra is an exceptional album, very complex and well done.This is one of those albums you all must listen to, a heavy, melodic, intelligent and atmospheric Masterpiece: drums, timpani and bells played by Giancarlo Golzi, bass guitar and piano played by Alberto Moreno, mellotron, Hammond organ, Farfisa keyboard and vibraphone played by the master hands of Pit Corradi, very distinctive and touching vocals by Stefano \"Lupo\" (id est Wolf) Galifi.The long Zarathustra suite: L'Ultimo Uomo (the Last Man), Il Re Di Ieri (Yesterday's King), Al Di L� del Bene e del Male (Beyond Good and Evil), Superuomo (Superman), Il Tempio delle Clessidre (Hourglass' Temple) on side one is probably the best effort, with strong classical influences and powerful keyboards in evidence as in the Best italian prog tradition!Side two also, with three shorter tracks (Degli Uomini - About Men, Della Natura - About Nature, Dell'Eterno Ritorno - About Eternal Return) has some great moments. Della Natura is my favourite track of the side two! Yet the band was not so successful at the time the album was released (1973). They had problems for their supposed right-wing inclinations coming from the all-black cover, the Mussolini image in LP collage. Radios simply did not transmit their album!! What a pity!! Yet the lyrics have Nothing of political, only the explanation of the thought of Nietzsche!! That's incredible but true. So what was the problem with a band that was no left orientated, like the most part?Neither the band expressed their thought in the lyrics! Italy loses one of the best examples of the progressive rock genre to come from outside England!"
    },
    {
      "reviewer": "greenback",
      "date": "Posted Wednesday, May 17, 2006",
      "rating": 4,
      "text": "This album is highly acclaimed by many Italian symphonic progressive fans. I think it is a bit overrated. The music itself is very good, but definitely not a masterpiece. Actually, I find the music unequal; the melodies are often not really convincing or just simply not sufficient enough to be completely impressed. The rhythm and airs constantly change: it makes a VERY progressive album. The music seriously lacks follow-through, so that it often sounds like a series of independant parts sequenced together. The instruments are well played, but I find very little emotion involved, despite the presence of many floating mellotron passages. There are indeed TONS of mellotron arrangements, and I must admit it is one of the most melodic mellotron one can find in the progressive music. The omnipresent organ is rather dirty, sounding a bit like Focus or like on the PFM's Chocolate Kings album. The hard rock electric guitar is reminiscent of the progressive bands Osanna and Focus. The Italian lead vocals are too aggressive for nothing. The drums can be very fast and complex. Regarding influences, King Crimson circa Wake of Poseidon is inevitable."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Tuesday, September 12, 2006",
      "rating": 4,
      "text": "Progressivo Italiano is a genre I have started to delve into, and I have liked what I've found! The mellotron is overdone to an extent, however, I seem to enjoy the note choices more than I would from GENESIS. This is a very sharp and heavy record for the times, surely it put many people on the edge in that regard.It's not essential to understand what's being spoken. Myself I am not much into lyrics to begin with, as I much more enjoy what's actually being played than what's spoken or sung. I don't understand a word of what's being said here on this album, yet I still thoroughly enjoy it. The melodies are top notch, some of the best mellotron melodies I've heard. Although the production is not all there, it's still extremely enjoyable and intellectually stimulating. I'd love to hear a perfect modern release of this original.The \"big piece\" title track is full of wonderous instrumental interplay and driving guitar lines that really spice the piece up. A near masterpiece, and certainly a wonderful work of symphonic prog, regardless of language."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Thursday, September 21, 2006",
      "rating": 5,
      "text": "It's like this band was made for me. The ever-present mellotron and organ, combined with rough but excellent vocals, and they are all arranged perfectly. This album cries out \"Classic !\"The tone is set on the first song \"l'ultimo Uomo\". Soft vocals signal to your curiousity, and before you can prepare yourself you are sent sprawling by crushing riffs. \"Il Re Di Ieri\" starts eerily, again the soft vocals come in but this time your prepared for the avalanche of the organ and drums. The vocals here are sensational and this is one of my favourite parts of the record.The short \"Superuomo\" is a wondrous instrumental with some great drum work. \"Il Tempio Delle Clessidre\" is similar to \"Superuomo\" only longer and better. Outstanding ! \"Degli Uomini\" has a similar eerie start to it as \"Il Re Di Ieri\" as some very good guitar and vocals come in, heck everybody is going at it and then there is a quiet interlude. When the vocals come back gently you would think Peter Gabriel is making an appearance. Check out the way these guys play together on the instrumental \"Della Natura\", mind-numbing ! The last song puts the spotlight right on the vocalist and let's just say the spotlight isn't really needed.Masterpiece !"
    },
    {
      "reviewer": "Atkingani",
      "date": "Posted Sunday, April 29, 2007",
      "rating": 4,
      "text": "One of the great features of the progressive music is the possibility for an artist or band to sing and to be heard in their native languages. There isn't the obligatory commercial bias that every stuff must be recorded in English - really the dominating language and the most adequate when an international level is searched. But for the average prog fan even not speaking that particular language, the music and the way it is sung is enough to get into the climate of the song since emotions and feelings can be better expressed when artists are singing in their first language and consequently felt universally.MUSEO's \"Zarathustra\" falls entirely in that category where the native language - Italian, in this case, works almost perfectly and any sort of translation should be disappointing. I owned this work in the vinyl era but now I am reviewing it through a CD copy - I did it because \"Zarathustra\" had amazed me too much 30 years ago and still continues to amaze.I agree with previous reviews that MUSEO ROSENBACH bear influences from other bands, notably EL&P and KING CRIMSON and sometimes early PREMIATA stuff; but all artists, the more original they seem, have their own influences, it shall not be derogatory.The fact is that this work is better understood and accepted if heard like a single and long piece - no skips, no stops; even containing certain dull moments (just like Nietzsche's book) and even when sometimes musicianship overwhelms the history to be told. Amidst fantastic tunes and harmonies, it shall be pointed that the real climax occurs in the middle part of the album with 'Al di la del bene e del male' and 'Superuomo' tracks, truly a superb moment in the Italian progressive music.The abovementioned dull passages aren't enough to spoil the magnitude and solemnity of the entire work: an absolute milestone. Total: 4 stars."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Friday, August 24, 2007",
      "rating": 3,
      "text": "The destiny of this band is somewhat similar to \"Locanda Delle Fate\". A great album released in the seventies, some live stuff and a come back much, much later.This album is of course dominated by the \"Zarahustra\" suite. First two parts starts with difficulty but after a minute or so, each of them fully explodes. \"L'Ultimo Uomo\" being particularly successful. \"Superuomo\" probably being the harder one (the closest KC influenced one). And my fave is of course the most symphonic one : \"Il Tempio Delle Clessidre\". It is a short part, but full of passion : the keys are sublime and the guitar break will just blow you out. It could have lasted for ever ...\"Degli Uomini\" is my fave \"standard\" track. Fantastic rhythm during most of it; it will feature very melodic moments as well. Italian prog in all its splenour.\"Della Natura\" is a rather intricate song. It starts like an ELP track. It displays lots of theme changes; wild, symphonic (especially during some of the vocals), and before half time it turns definitely jazzier. This song is a bit hectic and incoherent. The last part (two minutes or so) being again full of lush mellotron.The closing number is again close to KC. Hard and dark intro, immediately followed by a more symphonic part which switch almost instantly into hard again. And so on for over eight minutes. This song really goes into plenty of directions and it's difficult to follow. But it is still a pleasant song.This is a good album of course; but I find that the great moments are somewhat too short and I will rate it substantially lower than most of my fellow reviewers. I far much preferred the debut form \"Locanda\".Three stars."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Monday, October 8, 2007",
      "rating": 4,
      "text": "An excellent album, representative of the better pure progressive albums of the early seventies, but not, in my view, the best to come from Italy, nor is it quite in the top echelon of symphonic prog.I'm reluctant to spend too long talking of the Italian-ness of the music. As with all countries, Italian prog comes in many colours, and this colour is somewhat darker than the gentle, melodic prog usually associated with Italy. As a non-Italian speaker I miss out on the lyrics, but they are infrequent enough for that not to be a significant disadvantage. Though I've always found Nietzsche interesting ...Instead, I'll focus on the music. It definitely has a symphonic feel, even if the long opening track, divided into five movements, doesn't have one recurring theme. To me it is reminiscent of a more baroque style, a great deal of fussy ornamentation and a stop/start rhythm that gives the feeling of many disconnected sections joined together. This prevents me fully entering into the music, though I do greatly enjoy the third and fifth parts. Overall, I find this track comparable to a combination of CAMEL in the quieter moments and JETHRO TULL and VAN DER GRAAF GENERATOR in the more driving sections. Imagine HAMMILL'S voice over JOHN EVAN's keyboards and you've got the idea.To me, the stronger tracks are the shorter offerings on Side 2. I particularly enjoy 'Della Natura', which demonstrates a musical tightness sometimes missing on the rest of the album. But nothing here brings my soul to attention.I don't drink often from this particular well. Others have done this sort of thing better. Stronger songwriting, particularly with regard to the title track, might have seen this launch this group into a successful career. Imagine what they might have become! Certainly worth a listen, but perhaps not the masterpiece it's often made out to be."
    },
    {
      "reviewer": "apps79",
      "date": "Posted Friday, April 4, 2008",
      "rating": 5,
      "text": "Considered by many as the ultimate 70's Italian symphonic/progressive rock album,MUSEO ROSENBACH's ''Zarathustra'' was released in April 1973.The band was formed in 1971,when two other acts ''La quinta strada'' and ''Il sistema'' joined forces,while at the same time the members were discovering the early 70's progressive rock wave.At the end of 1972 they were signed by Ricordi label and a few months later ''Zarathustra'' came out.You won't believe the unique experience you'll taste listening to this album.It is filled with endless changing tempos and climates,characterized by the heavy guitar playing,the stunning symphonic keyboard work (mainly Hammond organ and mellotron),the jazzy frenetic rhythm section and the harsh,deep vocals of singer Stefano Calliffi.Especially the sidelong self-titled epic track is the absolute definition of energetic,dynamic and high-class Italian symphonic progressive rock.Unfortunately,at the time of its release the album went widely unnoticed due to its dark atmosphere,the cover and the Nietzsche-inspired lyrics (coming from his ''Superman theory'').Do not commit a crime by passing by this work.We are talking about a masterpiece of music here with top-notch musicianship and a haunting atmosphere!A prog rock classic!"
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Tuesday, April 8, 2008",
      "rating": 3,
      "text": "While Italian prog has won my heart in a big way I have noticed something. It seems that some of the most acclaimed titles are not my favorite ones. My only theory is that some of these bands like Museo Rosenbach and New Trolls seem more influenced by English groups (notably Purple and Tull). I find that far less appealing than the small bands that perhaps had little travel outside of Italy and therefore have a more pure, local/regional sound. \"Zarathustra\" is certainly a respectable album made by talented folks, especially the drummer Giancarlo Golzi.The album consists largely of heavy organ-driven rock. It's a loud, heavy, Ritchie Blackmore/Jon Lord lovefest with obligatory mellotron here and there. It mostly is satisfied with rocking out and doesn't provide the unique flavor of albums/bands like Metamorfosi, Balletto, Semiramis, or Cervello.just to name a few of the better heavy albums. \"Della Natura\" is definitely the one that did work for me here, with some awesome nuanced playing and the cool chorus part. The relatively poor sound on the BMG cd probably doesn't help matters much; the quiet parts are very hard to hear without turning up to the point where the loud parts will blow the windows out. The vocalist is pretty good with a rough edge without being as annoying as the Trolls vocals. Zarathustra is a good album, just not a masterpiece in my opinion, but I'm in the minority."
    },
    {
      "reviewer": "LinusW",
      "date": "Posted Monday, May 19, 2008",
      "rating": 4,
      "text": "Cryptic, red-blooded and pulsating, Zarathustra is a ride of massive proportions. If you're looking for pastoral beauty, take a step back. Not to say that there isn't any, but the best part of the near forty minutes here take a more sinister, darker and heavier approach to the concepts usually found in Italian symphonic rock.Built around Nietzsche's work, the album's main focal point is the title piece, which consists of many shorter songs-within-a-song in true progressive spirit. Needless to say, the lyrics are lost for those who don't speak the language, and thus I cannot comment on whether the concept works or even exists. Based on track names alone, it does seem to make sense. I've never been hard on lyrics anyway, and when the music speaks for itself, all possible concerns about lost depth and philosophical comments are left behind.Zarathustra is definitely more aligned with the rest of the European prog scene, without losing a distinct Italian touch of melodrama and passion along the way. Instead of the rather delicate compositions provided by many of Museo Rosenbach's contemporaries, power is top priority. A rocking guitar takes a lot of space which, granted, gives the music a grittier, earthier flair together with a Hammond sound that would make Atomic Rooster proud. Drummer Giancarlo Golzi does a tremendous job behind the kit in delivering consistently powerful and interesting drum work. Once again: heavy. But on top of this are massive layers of atmospheric Mellotron, with sprinkles of different sorts of keys, both varied and beautifully arranged in a lot more interesting compositions than one first would think. And just because the guitar is prominent doesn't mean that it overshadows the keys in any way, this is still very keyboard-heavy music. Dotted across the album are also a number of softer interludes. With sublime and suggestive keys (sometimes piano) and gentle guitar, they are melodic and dramatic like early PFM. They often end in 'explosions', either from the combined forces of the band or in rough, raspy outburst from vocalist Stefano 'Lupo' Galifi. He's got a colourful voice, perhaps not of everybody's liking, but it is nothing if not passionate.Not much to complain about as it seems. But Zarathustra suffers from one small drawback. This one being that the band knows what they do well and thus never really broadens their horizons on the album. There are a lot of variations on themes used earlier, and the structural differences between the songs are never very big. Too often you find yourself thinking 'haven't I heard this before?' when spinning the album. And in order for it to reach the elusive masterpiece level, I just want more variation. Pauses, crescendos, interludes, rising and falling tension, all in a natural flow that enhances the musical storytelling. It exists in one form or another, but it's not perfected.A very enjoyable and balanced release, interesting for RPI fans, heavy prog fans and fans of more readily accepted symphonic bands.Excellent addition to any prog collection. 4 stars.//LinusW"
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Monday, July 7, 2008",
      "rating": 5,
      "text": "Many one-shoot bands from Italy have come to grace and enrich the 70s prog legacy, Museo Rosenbach being among the most celebrated ones. and quite deservedly so. Their \"Zarathustra\" album is a total epitome of what symphonic heavy prog is all about: mesmerizing organ and mellotron layers in harmony with robust guitar riffs and leads, powerful melodic structures craftily expanded through refined arrangements, a well-ordained sense of the epic, a clever management of the contrasts between the harder and the softer passages. The album's theme is a celebration of free will under the guiding light of Nietzsche's idea of the Superman: the goal is to get rid of the various oppressive moral traditions that have ruled Man through history and conquer a new ideal of freedom, recapturing the real self and achieving a renewed connection with the world around us. Surpassing the energy of New Trolls and predating the punch of Biglietto per l'Inferno, Museo Rosenbach stands out in that special progressive province that took place in Italy. Golzi's solid drumming and Galifi's robust singing are pertinently located in the band's overall sound. The keyboard department has a prominent use of mellotron over the Hammond organ and the Moog synth (the latter being used marginally). This album features one of the most appealing assets in a prog album - a sidelong suite, which in this case is titled like the album. 'Zarathustra' is one of the most prominent Italian prog suites: it certainly combines the drive of Ossana, the stylish splendor of PFM, the magic vibe of early KC and Genesis and the dynamics of Metamorfosi. The suite gets started with delicate flute mellotron soon joined by an overlapping string mellotron and the whole orchestrated band as the fanfare is stated. The first sung motif is delivered with a delicate magnificence that ultimately leads to the first partial finale. Section 2 starts with a mysterious piano prelude (performed by bassist Moreno), which eventually leads to a psychedelic baroque full band endeavor. The addition of some jazzy cadences in the rhythm basis allows the band to create a particular swing, which the band perpetuates in section 3 'Al di l� di Bene e di Male'. 'Superuomo' is the longest section, something the instrumentalists take advantage of to display a series of attractive motifs after the brief sung section. 'Il Tempio dell Clessidre' reprises section 1's closure and takes it to an epic dimension, which originates real, frontal progressive beauty all the way to the fade-out. The married organ and mellotron layers are literally unearthly, the guitar soloing is majestic, Golzi's rolls and fills enhance the overwhelming majesty - what a grand finale!, what a suite! This is definitely the album's highlight, but there is still more. and it is great, too. 'Degli Uomini' displays an interesting set of motifs in a Manieristic framework: the song's power is more subtle than patent. 'Della Natura' lasts 8 � minuts, which allows the band to explore the melodic variations more loosely. This track really shows the family air that links Museo to compatriot acts Alphataurus and Metamorfosi (perhaps Semiramis, too, but Museo is obviously more polished). The ceremonious moods that fill this song's last few minutes make it quite close to the suite's general undertones. 'Dell' Eterno Ritorno' occupies the album's last 6+ minutes. The opening synth arpeggios state an agile expectation that draws the band close to spacey prog, but soon the effect is retorted by yet another display of heavy prog with featured mellotron/organ. This track is less aggressive than most of the preceding pieces, but the usual references to Baroque and Manierism are obviously present. There is not much that I can really add to all the praise that \"Zarathustra\" has achieved by prog fans all over the world. I'll just finish this review by asserting my conviction that Museo Rosenbach has created a prog masterpiece."
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Sunday, December 7, 2008",
      "rating": 3,
      "text": "An interesting album, but it contains some of the moments I don't like in Dedicato a Frazz by Semiramis. And the most important moment is - the stoic strain! This is my feeling about this album (about Dedicato a Frazz by Semiramis,too). This is something with stagnation full of nervous parts. The songwriting is not something exceptional, in my opinion. I would like to notice the unique drum works on the album, made by Giancarlo Golzi - superb drummer!!! The musicianship is very good, but the songs contain unsuitable repeats. I would mark the best songs of the album for me - they are - Il re di ieri and Della natura. Of course, the album is good, but not essential for me. This stoic musical composition obstruct me to love this album (like it does with Semiramis and Le Orme). PFM and BMS are my type of italian bands. For Zarathustra by Museo Rosenbach 3.5 stars in my account!"
    },
    {
      "reviewer": "tszirmay",
      "date": "Posted Sunday, January 25, 2009",
      "rating": 3,
      "text": "I have tried to like this album for soooooo long without any success, though I have never been a fan of the heavier Italian Prog school (RDM, Osanna, Museo Rosenbach,Il Balletto di Bronzo etc..) , preferring the gentler , folkier stuff. I know that I will lose a lot of my fellow colleagues respect and I know that this album borders outright veneration by many PA members but I just never found it to be melodic enough, this will be my crucifixion and I will bear my cross. Being a light drinker, I attempted red wine, tequila, port and various other undisclosable stimulants as fuel to anesthetize my senses but this seminal ISP album never rung my bell. So, this time, I decided to give it another whirl, lights dimmed, candles ablaze and distractions eliminated. Certainly, the initial keyboard driven onslaught on \"L'Ultimo Uomo\" is impressive, Hammond organ, Farfisa e-piano and mellotrons gushing with rage, though the raspy vocals excite me not. \"Il Re di Ieri\" is a dreamier passage with Pit Corradi showing off his dexterous skill on his keyboard arsenal and drummer Giancarlo Golzi powering nicely, while the guitar seems muted at times and raunchy at others. \"Al di La.\" is average, nothing spectacular. The 6 minute + \"Superuomo\" is considered to be one of the crowning moments but is strangely unable to move me beyond the obvious technical qualities of the players. Good instrumental playing there is no doubt but I just can't feel the spirit, which seemed to have worked well on Le Orme's Collage or Goblin's Roller, two powerful ISP classics. \"Il Tempio\" does emote well as the grandiose mellotron propelled theme is majestic and deep; really love this track but its only 2 minutes and 52 seconds in length. \"Degli Uomini\" begins auspiciously with booming authority, the robust guitar meshing with the fiery massed keyboards and a slithering tempo that aims to please but turns rapidly into a rather mundane display that is no where near the splendor of an ELP or the romanticism of a Triumvirat, ruined by paltry vocals from Stefano \"Lupo\" Galifi, who does howl like a wolf (lupo). \"Della Natura\" is the longest track here and remains unable to shake the \"Speed King\" syndrome that I simply cannot get into. There is an entire pointless organ solo (yeah, you can really play) that is pure technique and no subtlety. The mid section with the dreamy e-piano and drum shuffle is genius though, ruined by some hard-rock \"daboo deeboo dadada-dah\" vocalizings that again impress me not. \"Dell'Eterno Ritorno\" is the finale and I guess I am hopelessly transfixed by my failure to adore this album. I truly am sorry but I fail to see the fantasy of this museum. I await the obvious tomatoes of ridicule. 3.5 thrusts from Zara, mostly for the reputation and the nice artwork."
    },
    {
      "reviewer": "Marty McFly",
      "date": "Posted Tuesday, November 10, 2009",
      "rating": 4,
      "text": "...and I let my mind flow away and enjoy this music fully as it is, while not focusing on anything particular, but just enjoying...I have to say that I've tried to read Zarathustra once, as it was rumoured to be the hardest book to read every written (I doubt it, with these holy books like Bible should be quite hard too, not that I've ever tried them, but you know). I failed to succeed and get myself over first few pages. So I postponed this book to time when I'll be wise and old (hehe, crazy idea). So I don't know exactly word-to-word what is inside, but I know few facts about it.And I know that this can't be less than 4-star work. But same as the book, this can't be hard to get into, as it's more than many can understand (I believe, in case of book it's truth for sure and here, well, there are clues hinting it). It's simply not \"Per Un Amico\", easy to get into, easy to enjoy. So what's better after all, is it really so easy to decide ?5(-) with little bit of confusion, as it's not easy material to comprehend. More listens will be needed for sure, we'll see soon. But for now, it's one of the best Italian things for sure. Just don't know how good. Closing tracks (2-3-4) are very epic ones with breathtaking keyboard solos."
    },
    {
      "reviewer": "andrea",
      "date": "Posted Saturday, March 20, 2010",
      "rating": 5,
      "text": "Museo Rosenbach are one of the many Italian prog band of the early seventies that had the just chance to release an album before disappear. Their debut album \"Zarathustra\" was released in 1973 and the line up featureed Stefano \"Lupo\" Galifi (vocals), Enzo Merogno (guitar, vocals), Pit Corradi (keyboards, mellotron), Alberto Moreno (bass, piano) and Giancarlo Golzi (drums, percussion, vocals). It's a concept album freely inspired by the work of philosopher Friedrich Nietzsche. According to the liner notes, the quest for the super?man described by Mauro La Luce's lyrics wasn't meant to exalt the violent leader of a new pure breed but the serene search for a human character who, living in communion with nature, tries to purify from every hypocrisy the human values... Despite the great quality of the music, on account of the controversial art cover and to the misunderstandings about the concept, Museo Rosenbach were treated as fascists by critics and part of the public and the album was quite unsuccessful determining the split up of the band. Nonetheless, as time passed by, this work has become a cult one for prog lovers...The opener is the long title track, a suite in five parts. The first part \"L'ultimo uomo\" (The last man) begins with a calm and solemn pace, then vocals that seem to come down from a distant place soar drawing a beautiful melody... \"Face of light, they told me about you / Your story lies in the echo of the mountains / Too high to descend into us.... Shabby shadow, empty glare of the ego / You don't need to understand the force / That pushes me to seek in the world...\". An instrumental crescendo leads to the second part, \"Il re di ieri\" (Yesterday king) and to its delicate piano and organ patterns... \"No, do not go on walking on never ending roads / You can already see in me what my father, God, taught to you... Love your Land, in her womb God will form itself\". The contrasts between a quiet church like atmosphere and some more aggressive rhythmic passages give to this track a very peculiar and dramatic feeling... On the third part of the suite, \"Al di l� del bene e del male\" (Beyond the good and the evil) tension rises while vocals try to evoke how pretentious are human laws drawing borders between good and evil... \"Ancient tables, divine wills in the past already divided the good and the evil / The man alone, far from God, cannot build his own moral / Run away from your will / Under these curtains lies a false wisdom / The truth is insulted / From the moral that you created no good will come...\". The fourth part, \"Superuomo\" (Super-man) begins quietly and in a more reflexive way suggesting that you have to choose among many answers about the sense of life what's the right one... \"Thousand traditions built a wall around me / Alone and without forces I get lost into my own words / And perhaps I'm looking for someone who has always walked behind me... / Now he is coming to life in me / I'm living the Super-man\". Then vocals give way to a crescendo of amazing shifting musical passages leading to the final solemn instrumental part \"Il tempio delle clessidre\" (The temple of the hourglasses)The other tracks are shorter but not less interesting. \"Degli uomini\" (About men) is as intense as an horseback ride. Vocals ask questions about war and peace, joy and pain, then a bittersweet reflection soars... \"Like Autumn, the world wants to wither / It offers swords to the sky overriding the loyalty / It grows up and, as time passes by, it kills its humanity\".\"Della natura\" (About nature) begins with a frenzy rhythm, then suddenly a suspicious and treacherous quiet comes down... \"Quietness falls over the night / Virgin in its mantle... The silence with its void lights the fear again / Terror, pregnant of magic as it is, makes Death's face come back in mind...\". Rhythm takes off again, then melts in a complex and more relaxed section while lyrics draw a quite different landscape where men live in harmony with nature and where silence is described as the singing of real poetry... \"My eyes are tired, I feel by now that I'm going to sleep / The dawn comes from quietness / Virgin in its own mantle, it lives and already thrills...\".\"Dell'eterno ritorno\" (About the eternal return) is about the eternal circle of life. Strange omens shake our certitudes while life comes to an end... The music is complex as usual, marching beats alternate with organ rides while soaring dramatic vocals depicts doubts and fading hopes... \"By now my future is already there / The road I will take leads where the man stops / And where the Eternal Return reign...\".On the whole a great album that suffered of the political climate of the early seventies in Italy and that deserves to be rediscovered. A must for every Italianprog collector!"
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Tuesday, April 27, 2010",
      "rating": 4,
      "text": "There's been a lot of RPI around the house lately. Even to the extent that also my cats picked up a few Italian phrases, like 'a-a-o!' (Hungry!), 'I a-a-o!!' (Really I'm starving!!) and 'rrra-o rrra-o!' (If you don't feed me now I'll bite your toes off!). One of the albums I've instructed them with is Museo Rosenbach's albumZarathustra. Mad dashes guaranteed!The band brings a very powerful version of symphonic rock, with elements reminding me of the early UK hardrock and my so beloved 71/72 Genesis sound. The groundwork is laid by the solid bass guitar and the dynamic drums, strong emotive vocals are added in due RPI fashion. The guitar, while not always prominent, is sure worth paying attention to, as Ritchie Blackmore's touch is clearly felt. Everything is covered under a soothing blanket of Hammond organ and mellotron. Delicious.Particularly so on the 20 minute epic. Right from the start it brings me into a 5 star mood. It begins with a romantic opening section and builds up into an organ heavy outburst, laying down a majestic theme that also closes the song. The way they build up the tension in the first 4 minutes is simply genius and creates a very strong and rousing effect. The remainder of this epic contains many moments of symphonic bliss, juggling influences from Deep Heep and Jethro Crimson. The Italian vocals and the unpredictable and imaginative composition make it into an unmistakably RPI album. Because of the many UK influences this album might serve as an excellent introduction for newbies in RPI. At least for me it did.The second half of the album is slightly more uneven.Degli Uominicontinues the style of the main track but sounds less appealing, with vocal melodies that are a bit forced even.Della Naturahowever is probably the best track on the album, with a beautiful interplay between all instruments and an insanely pleasant 'dada-tada' vocal section. The closing trackDell'eterno Ritornois a bit disappointing at first but it improves once it gets going.A masterpiece? Close but no. There are some imperfections here. There are issues with the mix, which sometimes suffers from vocals that are too loud and uneven volume gain; there are some unlucky fades and rough transgression and the epic especially never has the unifying vision of aTarkusorEchoesorSupper's Ready. But what I love so much about it is the passionate dedication and the almost naive imaginative power of this music. Every single note, every hit on the drum kit, and all vocals are brought with such a contagious fervour. Simply put, this band infects me with their love for their music.Zarathustraisn't a perfect album, it's not the most representative example of RPI and it's certainly not the pinnacle of it, but the emotional impact and hard rocking qualities here are too strong to resist for me. I simply can't stop listening to this album and that's an indication I never ignore. So I have to allow my subjective enjoyment to add one star to what the album most certainly deserves."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Friday, May 28, 2010",
      "rating": 4,
      "text": "Count me as one of those who hasn't yet been taken by this album. Definitely original and creative, and it also earns some bonus points as a debut, but there are a number of factors that keep this well out of masterpiece territory.First of all, to the reviewers who have likened Stefano's vocals to the Italian Joe Cocker, I couldn't agree more--he's raw and throaty, but also unique and fun. Also, I'd like to give credit for the creative cover, which is certainly reminiscent of another favorite cover of mine: Kansas' Masque, which would come two years after Zarathustra (though I doubt influenced by it).Highlights for me include most of the side-long epic, as well as Della Natura. The epic sure starts and ends well (I think we can all agree on that!), with a powerful mellotron/organ melody to kick things off, and revisited in a slower, more stately form to seal the deal. In between, things get quite hit or miss. There's a difference between delicate playing and simply killing the music off, and Museo veers more toward the latter too often here. Fortunately, there are plenty of good melodies and moments, however scattered they might be, to at least keep my interest. Della Natura is also in the same vein, with more rock perhaps, but similarly concluding with a stately outtro.Good stuff and worthwhile, but I would be most interested in hearing how the band would develop after a piece like this. I imagine they would have tightened things up and cranked out even better prog, but that's not how things worked out, so we'll have to appreciate the band largely on this piece. As such, Museo Rosebach provide a meaningful addition to the prog canon with Zarathustra."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Friday, July 16, 2010",
      "rating": 5,
      "text": "The only Museo Rosenbach album released in 1973 is one of the greatest RPI album (besides of Area's early albums) is my very personal opinion. In other words - this album is a bit different from huge amount of RPI albums coming from early 70-s.First of all, this album is real heavy symphonic progressive rock, melting UK heavy prog traditions with Italian melodies and vocals. Keyboards based (Hammond and mellotron), this album influenced by early Lord and Uriah Heep passages, as well as Jethro Tull folksy moments and King Crimson heavy tension. But at the same time , there are enough Italian musical tradition elements to make this album Italian Progressive Rock. Aggressive (Italian) vocals, heavy guitars, fast and complex drumming, keyboard passages - possibly you don't believe, but I am speaking about Italian progressive album!As often with specific genres, some will love this album and some will hate it. I can hardly accept many so-popular classic RPI albums because of their polished neo-classic sound, sugar overdose, just symbolic rock arrangements, etc. Then - besides of Area (another really great and untypical RPI band) Museo Rosenbach is on the top of my RPI list. For those searching their usual RPI sweetly-romantic sound, this album possibly will be too heavy, too raw and ... too British. OK, it's just question of taste.But I really can recommend this excellent work for everyone disappointed by \"regular\" RPI sound - Museo Rosenbah is rare Italian progressive ROCK band.My rating is 4,5 rounded to 5!"
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Thursday, December 2, 2010",
      "rating": 4,
      "text": "Since I joined PA a few years ago I found several 70�s one shot bands that were latter discovered by progsters and often their sole work is considered by many as a masterpiece, or at least a lost musical gem. While I don�t agree with a lot of reviews about them, sometimes you really find something that is just right. Italian band Museo Rosenbach�s Zarathustra is definitly a fantastic album that I had the delight to finally have the opportunity to listen to. It �s really hard to understand why such a terrific piece of progressive music went so unnoticed outside a small following they might had. A misinterpretation of the title song lyrics as some reviewers claim? Guess we�ll never know.But the music inside is VERY good. Not perfect, but still very striking and convincing. Still impressive after all these years. I specially loved the Zarathustra suite, with its four parts and 20 minutes duration: bombastic, heavy and beautiful. Lots of early King Crimson and ELP influences here, and yet they came up with something very strong and fairly original. Excellent keyboards parts (specially the organ and mellotron), fine guitars and a versatile rhythm section. Vocalist Stefano �Lupo� Galifi is brilliant, with a very good voice and excellent way of delivering it. The production unfortunatly is not as good as it should for such task, but that�s something to be expected for the period. The remaining tracks are also interesting, although not as powerful and focused as the main theme of the record. But they showed that Museo Rosenbach could go very far if they had the chance to go on with their recording career. But, alas, this was not to be...Conclusion: A record that I heard a lot of, mostly raving it, for a long time before I had the chance to actually buy it. And I can assure you all that it deserves almost every bit of its fame. If you�re into 70�s symphonic prog in general - and in the italian scene in particular - this is a must have. Rating: somenthing between 4 and 4.5 stars. Highly recommended!"
    },
    {
      "reviewer": "colorofmoney91",
      "date": "Posted Monday, April 11, 2011",
      "rating": 5,
      "text": "Everyone on this site knows about this album and it's status as a masterpiece of RPI. So, there isn't really much that I can say about it that hasn't been said. I guess I'll just say it all over again...But wow, what an epic journey this album turned out to be. I've recently decided to check out all the one-shot Italian prog bands from the '70s, and though I've known about this one for a while now, I decided to save it for a rainy day.The album starts off with the epic track, \"Zarathustra\", compiled of 5 different parts that all flow as one. One thing that came to mind is that this sounds like a very rich mix of Larks' Tongues in Aspic/Red era King Crimson and the symphonic qualities of what sounds like an improved version of Genesis. This epic is very powerful indeed, and the mood changes throughout run fluidly and flawlessly. Galifi's vocals are passionate, like in most RPI vocalists, and maintain a very manly feel. It's hard for me to pick out any standout moment from the epic because it all flows like I stated earlier, but \"Superuomo\" is the most elaborate portion and it is very rock-heavy with some guitar lines that really stick.After the epic title track, the remaining tracks sound just as epic but are only shorter in length. More of the same fantastic music that was present on side A. More fluid changes, heavy guitar, beautiful keys and soaring vocals. Even out of these individual tracks it's hard for me to pick a standout, but they all stand out! This is definitely one of those albums where skipping tracks doesn't cross the mind at all.If you ever get a chance, you should definitely jump at the opportunity to listen to this masterpiece of Italian progressive rock."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Tuesday, August 16, 2011",
      "rating": 3,
      "text": "Poor recording/production denies this album from any consideration of masterpiece status. The dynamics are too diverse and inconsistent, the recording too muddy, the sound attempting, IMO, to be too imitative of a combination of KC's \"In the Court of the Crimson King,\" ELP (especially \"Tarkus\"), or JETHRO TULL (\"Aqualung\"). The drums sound too much like filler--and they and the bass stand out front too much, often taking one's attention from the whole. And what's with the engineer's hand on the master volume nob! It's like a NEKTAR, ZAPPA, or early SANTANA listening experience: one never knows when or where the song starts, stops or segues because the fade in and fade out can seem to come from out of nowhere! Plus, not unlike ELP, I'm not quite sure what Museo Rosenbach are trying to accomplish with their music--the section changes are often so sudden and incongruous feeling.Curiously--and, again, unexpectedly--the album highlight for me is the little song from which we get a rather highly acclaimed album from Anno Domini 2010, \" Il tempio delle clessidre\" (9/10). \"Dell'eterno ritorno\" (8/10) is also pretty decent.3 stars. Could've been better with better mixing, recording, engineering."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Saturday, August 20, 2011",
      "rating": 4,
      "text": "One of the better \"one album wonder\" releases from the RPI scene in the 1970s. (Of course, Museo Rosenbach would eventually release more material, but it'd take a few decades and the prog boom of the early 1990s before that happened.) Apparently the album caused a bit of controversy when it was first released because of the inclusion of an image of Mussolini in the cover collage, which combined with the Nietzsche theme of the album, led to accusations of fascism. The accusation itself doesn't really hold water - Nietzsche's work was horrendously misrepresented by those fascists and Nazis that adopted it - but I have to admit that the cover was a stupid mistake on the part of the band, who should have realised that it would have opened old wounds.Still, the cover art is the only significant flaw to this album - what you get here is a delicious mix of progressive influences, most of which are typical of RPI from the period (hello, early Genesis), but which also includes a more aggressive keyboard approach reminiscent of classic Banco del Mutuo Soccorso. I wouldn't elevate it to the top rank of RPI albums from this period, but I certainly think it deserves consideration for anyone exploring the genre beyond the obvious classics."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Sunday, October 9, 2011",
      "rating": 4,
      "text": "Well I only knew this what supposed to be a legendary band couple of months ago and it really BLEW me away the first time I listened to it. No wonder this album has been one of important albums on this site. I can see how bold the music of Museo Rosenbach. It's maybe too personal to me as I always like the kind of Italian progressive music as you might have seen all the positive reviews that I have written on Italian prog bands.One of the reasons I like this album is its strong melody that sounds so particular Italian -- even though I know very little the local culture. Combined with the local language it sends great piece of music -- something that really stirs my emotion as I listen to the album from the opening track right through to the end. There is a very big component of symphonic music throughout the album with excellent performance when the musicians deliver their performance. There are great combination of musical silences with symphonic music. It sometimes change dramatically into faster tempo music like I can experience on the second track where the music blasts off suddenly into faster tempo. It's really nice.I would not comment on track by track basis as there have been so many reviews -- good ones -- about this excellent album. Some of music lovers consider this as classic and legendary. For me, I am happy having been associated with this site so that I finally know this wonderful album that is an excellent addition of the progressive music collection. Keep on proggin' ...!Peace on earth and mercy mild - GW"
    },
    {
      "reviewer": "GruvanDahlman",
      "date": "Posted Friday, December 16, 2011",
      "rating": 5,
      "text": "Every once in a while you stumble upon an album supposedly so great that it nearly defies description. Well, there are great albums, good albums and quite a lot of bad ones but there are also that percentage of albums that are simply extraordinary. Museo Rosenbachs sole album is certainly one of them. The title track is in itself a masterpiece, 20 minutes of pure prog bliss. A track lasting that long may well be wonderful but also riddled with uninteresting parts you'd rather skip but in this case the whole of the epic is so enjoyable that listenening to it is a gateway into another dimension, one where time obviously don't consist of the same minutes. Zarathustras 20 minutes feels like five. All the parts collected in this here track are perfect examples of prog-rock. For me there's true genius in making long tracks feel like a few minutes. The three remaining tracks are equally impressive with the mellotron and organ in the forefront. I really can't think of anything bad to say about this album. It's an amazing tour de force.The sound of Zarathustra is kind of hard to put into words, at least for me. Sure, there are some traces of the progressive Uriah Heep but also glimpses of Genesis or maybe even better, VDGG. It's certainly Italian and it's certainly symphonic but with that heavy edge which brings to it a raw feel, which I like alot. The music floats from one spectrum to the other. Hard, soft, melancholic, complex and everything in between. I've fallen in love with this album. It's utter pleasure."
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Wednesday, March 7, 2012",
      "rating": 4,
      "text": "Rocking RPI Album is Worth Some Extra Listening TimeI acquired ZARATHUSTRA in a glut of Italian prog about 2-3 years ago, and it frankly didn't leave much of an impression on me. I've recently been going through those albums one by one with much deeper listens. While a few albums have worn down with repeated careful scrutiny, this one keeps getting better. After several days of triple end over end playing time, I've been pleasantly rewarded by Museo Rosenbach in the classic manner of good prog.In general, ZARATHUSTRA incorporates much more classic hard rock guitar than most Italian prog. While many RPI bands use some guitar soloing a la Steve Hackett, Museo Rosenbach's Enzo Merogno gets in plenty of energetic riffage as well. Others have made comparisons to Deep Purple but the lines here are so much more complex. Alternating between unison, harmony, and counterpoint with the also wonderful keys, the guitar lines are much more composed parts of the music than solo spots.The introductory epic title track is a big chunk to bite off, especially at first, and this is probably why my first impression was not as strong as my current opinion. While this album does have sections of typical romantic Italian sentiment, it also has monstrously rocking passages where the whole band is simply humming. \"Della Natura\" has some deliciously intense work that looks ahead to modern bands like Anglagard. As a matter of fact, after making this connection, I am hearing connections to the 90's Swedes all over this record. In contrast, however, vocalist Stefano Lupo Galifi is featured prominently, and his rough baritone contrasts sharply with Anglagard's occasional wispy ornamentation. He simultaneously achieves a rocker's ability to be convincingly aggressive and the sense of Italian melodicism, and is perhaps my favorite of the RPI vocalists.While the compositions on this album are very good, this is not a virtuosic album. No single player takes a spot simply to show his skills. There are no big solo spots. The most impressive sections are instead when everyone is playing full bore in delightfully interconnected parts. This is not to say the players are weak. In fact, all nail their parts well. But this is a music about the song, about the big picture.I'm not ready to place this in the essential category, but without a doubt, this is an excellent addition to any prog collection."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Saturday, October 20, 2012",
      "rating": 5,
      "text": "A milestone RPI album, Museo Rosenbach's \"Zarathustra\" is brimming over with innovation and inventiveness with some extraordinary compositions and musicianship. The epic title track is a mesmirising masterpiece beginning with quiet reflective vocals in Italian and some weird music until the percussion cracks through and an uptempo sound is heard awash with Mellotron. There are 5 distinct sections to this colossal epic including a gentle piano passage, and flute that floats along a sustained shimmering keyboard motif. The buzzing low synth is heard at about 6 minutes in, and more of the vocals in the distance. Eventually a fast paced rhythm bursts forth and much more aggressive vox and keyboard lines. The 'Superuomo' segment is where I get most interested with its quirky vocals and Hammond lines over strong percussion attacks.The Mellotron takes over on the next track 'Degli uomini' that is at first instrumental. It has a smooth texture of organ and heavy guitar with percussion blasts. It changes in mood as the piece develops. The lead guitar is a dominant feature, and it has some grinding organ sounding like Procol Harum in places or Focus. Vocals finally join the sound just before it all goes quiet.'Della natura' is a faster piece with odd meters and frenetic organ shimmers. The vocals are again Italian and rather gentle coming in when the music dies down. A great polyrhythmic meter locks in as Mellotron bellows out over powerhouse drumming and bass motifs. The rhythms increase in pace and break away as more vocals blaze away, and then chiming vibes are heard on organ, sounding like Manzarek's style of The Doors. It is a dramatic song in every respect, with lots of twists and turns and definitely one of the highlights.The last track is 'Dell'eterno ritorno', a heavy guitar driven rocker, with some chaotic figures on keyboards, bass and percussion. It is a grand way to end such a classic album, going out with a bang not a whimper. It settles into a dreamy section and the vocals are multi tracked and emotional. Eventually it returns to the spasmodic fractured melody and then a striking percussive march over an organ phrase.This one really lives up to its massive reputation as yet another one shot album that blows the doors off conventional musicianship. It is up there with Dun's \"Eros\", Anglagard's \"Hybris\", Bubu's \"Anabelas\" and Yezda Urfa's self titled debut. Check it out even if you are not into jazz, as this album has a lot going on and is well worth the effort."
    },
    {
      "reviewer": "ALotOfBottle",
      "date": "Posted Friday, August 26, 2016",
      "rating": 5,
      "text": "\"I am a forest, and a night of dark trees: but he who is not afraid of my darkness, will find banks full of roses under my cypresses.\"The above statement is one of the maxims of Friedrich Nietzsche's work published between 1883 and 1885,Thus Spoke Zarathustra. Unorthodox, independent, critical, simply different, and much misunderstood, Nietzsche's hopes were for the work of his life to become somewhat of a guide for lost humanity. The philosopher, however, was met by great disappointment, dying in horrid suffering and depression.Exactly 90 years after the first part ofThus Spoke Zarathustra, a group of young musicians from Italy, Museo Rosenbach, were getting ready to record what would later turn out to be one of the lost treasures of Italian progressive rock music. But first, let's have a look at the act's roots.\"Museo Rosenbach was formed in Bordighera, a seaside town in the Liguria region, a few kilometers, from the French Côte d'Azur, in December 1971,\"recalls Alberto Moreno, the band's co-founder, bassist, and composer. Museo Rosenbach emerged from the fusion of the groups Quinta Strada and Il Sistema. In fact, Moreno and Co. inherited some material from the latter. However, the young musicians felt they were in need of a vocalist. The guitarist, Pierluigi \"Pit\" Corradi, suggested they recruit blues-influenced Stefano \"Lupo\" Galifi, whom he had met during his military service. The current trend in Italy was to name bands after buildings, so Moreno came up with an idea of a museum (Museo) fused with the last name of a German publisher, Ottoman Ernst Rosenbach, which he really liked the sound of. After many live performances around the country, the band was offered to record an album and entered the studio in February 1973.Similarly to Nietzsche's book, Museo Rosenbach's debut albumZarathustrais a bold, uncompromising statement. Musically, it could be said to derive its inspiration from many of contemporary bands like Genesis, Uriah Heep, Van Der Graaf Generator, and Pink Floyd, from the United Kingdom, as well as their countrymen, Banco del Mutuo Soccorso, Le Orme, Osanna, and Premiata Forneria Marconi. However, make no mistake, Museo Rosenbach's music cannot be compared to anything else in the world of music. Taking the power and might of Strauss' and Wagner's classical compositions, Museo Rosenbach make their elements shake hands with the heavy, raw quality of rock music, finding several common characteristics somewhere along the line. The music onZarathustrais as heavy as it is finesse and tasteful - full of crunchy, overdriven guitar sounds, deep, expressive Hammond organ tones, and mellow, cloudy Mellotron soundscapes alike. Furthermore and probably even more importantly, Rosenbach's debut, similarly to Nietzsche's original work, is rich in evocative images, in this case musical images. Numerous tensions and their releases, a wide plethora of constantly changing atmospheres and auras, emotional, soulful storytelling - all these elements predominate onZarathustra.Side one of the album is fully occupied by a multimovement suite \"Zarathustra\", consisting of five parts.\"We decided to build a suite that recounted Zarathustra's descent from the mountain after a period of meditation and his encounters with certain characters, who represent different schools of thought that the prophet criticizes,\"Confesses Moreno. He also remembers composing the piece in fragments - writing for a piano and then transcribing the piece for the whole band. The first movement, \"L'Ultimo Uomo\" opens in a gentle, yet confident manner. This part somewhat resembles the very first notes of Richard Strauss' pieceAlso Sprach Zarathustra, which the band admitted to, allegedly even opening their concerts with a portion of that composition. Then, the listener is suddenly approached by a more self-assured motif, creating an effect similar to a rising curtain. A silent part with Walter Franco's vocals follows, accompanied by echo and reverb, representing Zarathustra's descent from the mountain cave. After several repetitions, which are less gloomy, yet still very delicate, the majestic, heavy main theme of the movement kicks in with an interplay of Hammond organ, Mellotron, and guitar accompanied by a very heavy-hitting rhythm section. Only a few minutes in, the listener is already successfully invited to take part in the unique journey Museo Rosenbach are taking them on. The next movement, \"Il Re Di Ieri\", dominated by organ and piano, both drenched in reverb, alters the atmosphere, making it a bit unsettled. When the listener becomes slowly familiarized with the part, comes a short solo, utilizing a crispy Moog synthesizer timbre. Next come vocals from Giancarlo Golzi. All of the sudden, the rhythm section accompanied by a distorted guitar joins the spectacle, leading to \"Al Di La Del Bene E Del Male.\" This one takes no time to hesitate, since the very first notes, the character is heavy and rather aggressive. The movement features the whole band singing to illustrate the mass of the priests who denounce Zarathustra and his teachings. The following \"Superuomo\", pictures Zarathustra experiencing a moment of weakness, as Moreno explains. The mood here is rather melancholic and halting, before going through numerous dynamically contrasted, diverse passages, representing Zarathustra reclaiming his power. The closing movement, \"Il Tempio Delle Clessidre\", opens with a haunting, celestial Mellotron, recalling Genesis' \"Watcher of the Skies\", until the main theme from \"L'Ultimo Uomo\" returns in its full glory, featuring a very emotional guitar solo in between the layers of organ, strings, bass, and rapid drums. This longer moment, very powerful and majestic, isthemoment capable of bringing tears to one's eyes. The theme slowly descends towards silence.Although the epic resonance of the title suite might seem hard to top, side two stands very strong, somewhat complimenting \"Zarathustra.\" \"Degli Uomini\" opens with a high pitched Mellotron melody, which is quickly joined by the huge-sounding guitar and rhythm section. Going through dynamically contrasted sections, some based on the same melody put in different musical contexts, the track proves to be no worse than the overwhelming epic from side one in terms of composition and performance. \"Della Natura\" exposes its sophistication in the very first bars with a twisted organ melody. It is followed by a quieter vocal part, bringing Le Orme's most romantic moments to mind. It comes back after a brief instrumental interlude. The tension built is resolved in quite an opposite, baffling direction with a funky electric piano line. This leads to the loud chorus, which features very eccentric vocal parts. At one point, the atmosphere mellows out, repeating the Le Orme-like moment, which leads to a solo of interplaying Hammond organ, a Moog synthesizer, and screaming guitar. The closing track, \"Dell'Eterno Ritorno\" opens with a moment of abrupt heaviness, which quickly hides behind the constantly-developing passages, which, in my mind, really highlight every strength of the band - excellent compositional skill, a tremendous amount of instrumental know-how, and the ability to forge beautiful, striking instrument sounds. The track seems to finally settle in parts, but it's rather deceiving. After a few echoes of the previous motifs, the album closes with a symbolic Mellotron line.It's worth remarking that the album caused a lot of controversy when it first appeared on the market. Not entirely due to being a tribute to Friedrich Nietzsche and his controversial workThus Spoke Zarathustra, but rather to its artwork. It features a collage portraying a strange face, as Moreno indicates, that of Zarathustra, using images of jail bars, a countryside landscape, ancient buildings, and... a face of Benito Mussolini, a Nazi dictator from the period of World War II. Museo Rosenbach were accused of fascism, which in conjunction with poor marketing of the release and sheer bad luck (political protests at one of their biggest concerts, in Naples, unrelated to the band) led to the breakup of the band.Zarathustra, Museo Rosenbach's only opus before their reformation in the 90's, is, in my opinion, one of the best, most creative, original, accomplished records to come out of Italy. Although stylistically, it is closer to rock music, I believe this to encourage many of the qualities of classical music of the highest order.Zarathustrais an astonishingly addictive journey and something to be experienced. Words cannot truly reflect the nature of this music. A jewel of progressive rock music!"
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Monday, November 5, 2018",
      "rating": 5,
      "text": "Out of all the Italian prog bands that emerged in the early 70s, released a single album and then disbanded seemingly as quickly as they had formed, the gold medal has to belong to Sanremo's MUSEO ROSENBACH who in the prog heyday of 1973, released their sole album of the era: ZARATHUSTRA. Despite the legions of competition emerging from every nook and cranny of Italy with a huge portion of these bands releasing some of the highest quality prog albums ever to have been recorded, it is MUSEO ROSENBACH that has earned the honor of having delivered the absolute apex of Italian prog in the form of their controversial album that woefully got them completely censored and resulted in an unfortunate failure as far as sales of the initial release are concerned. Yet, time has been kind to one of Italy's most revered bands of the prog era and ZARATHUSTRA has become not only THE most popular prog album of the entire Italian scene but has also been claimed to be THE best prog album EVER. Well, i'm not sure about that, but let's just say that this quintet did a mighty fine job here.Initially the band formed under the moniker INAUGURAZIONE MUSEO ROSENBACH (Inauguration of the Rosenbach Museum) in 1971 from the ashes of two 60s bands from the local Sanremo scene: Quinta Strada and Il Sistema, the first of which was a mere cover band and the second a proto-prog outfit that wouldn't find an archival release until 1992. The initial lineup would include Leonardo Lagorio (sax, flute) who would move on to Celeste before the album was recorded and a singer named Walter Franco before the final lineup would cement into the classic form of ZARATHUSTRA. While many Italian bands were highly experimental in their variations on the symphonic prog meets classical operatic and jazzy touch sensibilities, MUSEO ROSENBACH seemed like they were the perfect band to represent the middle ground of the multitude of bands that emerged from the rich and prosperous Italian prog scene. On ZARATHUSTRA they delivered a well balanced album that almost seems like an ambassador of Italian prog in the modern era.As far as the name goes, it was very much en vogue for Italian prog bands to retain a sense of humility and associate themselves with mom and pop establishments thus Premiata Forneria Marconi (PFM) signified \"award-winning Marconi bakery\", Banco del Mutuo Soccorso \"bank of mutual relief\" and following suit, MUSEO ROSENBACH is simply derived as \"The Rosenbach Museum,\" the ROSENBACH part remaining somewhat of a mystery. It could either have been adopted from the Rosenbach Museum & Library in Philadelphia, PA or could have simply been taken from the German language where it means \"brook of roses.\" Either way, it sounds cool and that's what counts of course. ZARATHUSTRA is one of those albums that was utterly ignored and failed miserably during its initial release which inevitably forced the band to call it quits however in hind site, it is quite logical that this was so given that MUSEO ROSENBACH touched on subject matter that was waaaaay too sensitive for the time.It's completely amazing how far the rock genre had evolved in a single decade. A mere ten years prior The Beatles were only beginning and singing simple non-threatening love songs like \"Love Me Do\" and \"Please Please Me.\" Come ten years later, the progressive rock scene saw bands like MUSEO ROSENBACH tackling a sophisticated concept album based on Friedrich Nietzche's philosophical novel \"Thus Spoke Zarathustra,\" a highly complex reading the delved into the myriad themes ranging from eternal recurrence to will to power and criticisms of Christianity. Deemed as an expression of the Far-right at the time, MUSEO ROSENBACH found themselves boycotted by the RAI (Radiotelevisione italiana). Remember that this was the time when Mussolini fascism was fresh in the minds of the Italian populace and the cover art depicting the once tyrannical dictator rubbed many the wrong way and resulted in the virtual blacklisting of MUSEO ROSENBACH without a second thought.Despite the initial overreaction to the subject matter and cover art (which admittedly did not help the band one iota), MUSEO ROSENBACH has stood the test of time based on its amazing musical delivery on ZARATHUSTRA which is made all the better if you do not understand the Italian language and have absolutely zero clue about the controversy that ensued after its release. This is an Italian prog masterpiece for a reason and that reason is that it successfully balances the myriad elements that make a great prog album in a nearly flawless fashion. While similar to the other greats on the scene, MUSEO ROSENBACH stands out in its extremely focused concept laid out in a single vinyl side suite and a second side of separate tracks that continue the signatory prowess of one of the masters of Italian prog.Known as the \"Zarathustra Suite,\" side one on traditional vinyl releases is actually a series of five tracks, at least on modern CD releases. It is an exquisite delivery of the most traditional approaches of Italian prog all laid out into a series of ever-changing moods that coalesce into a greater musical universe. Dominated by the outstanding vocal abilities of Stefano \"Lupo\" Galifi, ZARATHUSTRA is enhanced by a perfect balance of pastoral acoustic segments alternating with heavier rock and completely fortified with the utmost progressive time signature chops, symphonic keyboard touches, Mellotron, Hammond organ, vibraphone and excellent guitar and bass rock workouts that allow a stellar instrumental interplay that without a beat knows exactly when to shift gears and exercise a completely new paradigm. The music overall is fairly dark and heavy on the heart even if you no speaka Italiano. Above all, it is melodic as to establish the proper hooks but it has no problem casting the proper deviating spells as to make this an angular prog workout.As far as Italian classics go, i have to admit that i do not find ZARATHUSTRA my top dog in the genre as i prefer the more experimental realms of Semiramis, Area and even Osanna but as far as sheer perfection goes and consistency of holy progginess follows, i have to admit that MUSEO ROSENBACH cranked out a flawless specimen of Italian prog and it's absolutely no wonder that this album has only become increasingly revered as the decades rolled along. The album is as majestic and magnanimous as music can be declared and like so many albums of its era resides in the top ranks of a musical hierarchy that has rarely been matched. The top album in all of progressive rock? Hmmmm?. i'm not sure, at least not for yours truly but a masterpiece of progressive rock? Oh yeah! There is absolutely no doubt that this is one of the pinnacle achievements of the era and that it deserves all the praise graciously heaped upon it.Despite being deemed as a one shot wonder, MUSEO ROSENBACH has been resurrected in the 21st century but not surprisingly has not even come close to this prog monstrosity in terms of qualitative delivery. This is simply one of those absolute essential prog albums to be heard before you die, whether the political stance suits your fancy or not. BTW, this album straddles an interesting dichotomy in its mutli-decade existence. The album was an utter failure upon released therefore only a limited supply of original vinyl was pressed, however it has also become one of the most popular albums to exist in the entire prog rock universe and has created a huge market for collectors of original material.I literally just saw this a week ago at Amoeba Records in San Francisco, CA, USA. An original vinyl edition goes for a whopping 2000$USD!!!! When a rarity like this emerges, counterfeits naturally ensue. There have been a few attempts but the original has a matted texture is absent and unlikely to fool the sleuths of the collector's world. Personally i own the Japanese remastered CD on the Ricordi label which faithfully represents the entire album in a mini format. The gatefold is identical as is the matted texture of the packaging. It sounds excellent and is the next best thing to owning an over-priced original which probably doesn't even sound as good."
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Wednesday, October 13, 2021",
      "rating": 5,
      "text": "Museo Rosenbach has only released one album, this one. Because of the Years of Lead that Italy lived through (red and black terrorism), the cover inspired by Nietzsche and depicting the face of Mussolini resulted in great repulsions for this group, considered as fascist. In those years (1973) in Italy any difference in political views could degenerate into violence and the left movement to which prog music belonged did not accept Museo Rosenbach's Zarathustra. It didn't help to specify that the cover was a provocation and that the concept album had existentialist lyrics, Museo Rosenbach was boycotted by the underground movement that had launched Pfm, Banco, and Area, and preferred to disband before producing their second. album. It was a real shame because this group of talents was really very gifted and could have churned out even more masterpieces.Side A1. Zarathustra: - a. The Last Man (3:57) Beginning in crescendo on an epic theme, the music stops and the singing of Stefano Galifi arrives in the distance who, shortly after, sings a second verse (existentialist symbolic text) at a higher volume, until the initial epic theme restarts with a grandeur effect due to the use of mellotron.- b. The King Of Yesterday (3:12) After the bombastic epic theme, Pit Corradi's piano outlines a horror film theme that then dissolves into a pastoral, melancholy motif (we're listening to excellent music) with a crescendo of Farfisa. Galifi's voice can be heard again in the distance but towards the end of the movement the music explodes and the lyrics prepare the advent of the superman (\"Love your land, in the womb of him God will form\"). Last jazzy notes that bridge with a tempo change for the next movement.- c. Beyond Good And Evil (4:09) Whose name refers to another work of Nietzsche (\"The man alone, far from God, cannot build his own morality ... From the morality that You have created nothing will rise\")- d. Superman (1:22) On a jazz tempo Galifi sings \"The superman is alive\". His voice, slightly hoarse, is sung with a lot of power and anguish, at times like an opera singer, and at times with an almost shouted voice, with an uncommon impetus in prog (present for example in Roger Chapman of the Family).- e. The Temple of the Hourglasses (8:02) After the slowdown following the previous piece, the new movement continues with a math rock march. Golzi's drums in evidence in this piece and the Rosenbachs are keen to show that they know how to juggle every element typical of prog. Towards 6 minutes the rhythm stops, the Hammond organ plays the intro emphatically which brings us back to the initial epic theme of the first movement.Masterpiece. Suite rating 8.5 / 9Side B2. Men (4:01) Slow start with the organ, then hard-rock electric guitar riffs (Enzo Merogno) which creates a grandiose and epic atmosphere. Changes of pace, accelerations in the style of British prog, it seems to listen to an assault on horseback. Slowdowns, and finally the voice of Stefano Galifi, the \"wolf\", who in fact seems to howl at the moon. Pause, the music stops, voice and Farfisa remain on a delightful background which, however, inexplicably fade out suddenly. Truncated song, it seems unfinished. It's a pity. Rating 7+.3. Of Nature (8:24) Start with a frenzied pace, very daring. Then, as often happens with Museo Rosenbach, the music stops, and Galifi's strangled, very bluesy singing arrives, which almost always expresses a sense of existential anguish. Great syncopated instrumental piece, with frenzied rhythm and tempo changes. There are perhaps too many tempo changes between percussion and vocals, too many stop and go. Around 4 minutes a jazzy rhythm arrives (great work by Golzi and Corradi) characterized by onomatopoeic sounds. \"Dawn comes from the virgin thirst of his mantle\", Galifi sings almost desperately in a blues ending marked by Merogno's guitar. Rating 8.5.4. Of the Eternal Return (6:15) More reflective piece than the previous one, which Galifi tells the sunset of Zarathustra. Corradi's Hammond conducts the piece together with Golzi's drums. \"I die without hoping that something will be born, something will change, the road that I will know leads where man stops and where eternal return reigns\". Galifi alternates moments of resignation with moments of desperate anger. Instrumental finale. Rating 8+.Total Time 39:22We are facing an ambitious concept album, with extraordinarily committed and serious lyrics, which outline the path of Nietzsche's superman. A compact disc also musically, guided in particular by Corradi's keyboards and mellotron, by Golzi's drums and by the very expressive and ductile voice of Galifi who, together, sign a composition of epic melodic rock, which alternates reflection with anger and desperation, in an almost expressionist way. The quality of the second side is slightly lower than the first but without falls, the only mistake is the brevity of the first song. Maybe some solos are missing, the group prefers the team game.Small masterpiece. Rating 9. Five Stars."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Monday, May 16, 2022",
      "rating": 5,
      "text": "Review N� 534Everything really began when a group, initially named Inaugurazione Museo Rosenbach, was created around 1971 from the fusion of two late 60's bands from Sanremo, La Quinta Strada and Il Sistema. Their first line up included the future Celeste's member Leonardo Lagorio on sax and flute, and the future guitarist of Museo Rosenbach, Enzo Merogno.La Quinta Strada and Il Sistema had played mostly songs by some other popular artists at the time like Jimi Hendrix and rock groups such as The Kinks, The Animals and Steppenwolf and by Rhythm & Blues stars like Otis Redding and Wilson Pickett. Somehow, towards the end of the 60's, the Sanremo's groups, La Quinta Strada and Il Sistema, were two of the first Italian rock bands to spread progressive rock in Italy, even though they had never recorded a single album.Everytime that the name of Museo Rosenbach is pronounced, you can see a sparkle in the eyes of every European truly progressive rock fan. Their album \"Zarathustra\" is usually considered as one of the best examples of the genre to come from outside England. However, the band wasn't successful at the time. They were accused of right-wing inclinations for the Mussolini image in the front cover collage on an all-black background and because Nietzsche inspired the lyrics. Both things contributed to limit the diffusion of their name and their album. So, it's not strange that Museo Rosenbach had a very short life, splitting soon after their album \"Zarathustra\" and some good live concerts in the summer of 1973.\"Zarathustra\" is, undoubtedly, one of the most impressive Italian prog rock albums ever, with an astonishing blend of hard and symphonic progressive rock. It's still a perfect example of the Italian powerful idiosyncratic musical creativity. It's not hard to understand why this is regarded as one of the main albums of the Italian prog rock. This is symphonic progressive rock with a rough edge, but without becoming too much heavy progressive. The arrangements are heavily loaded with Mellotron, organ, piano, aggressive guitar and furious drumming. Everything is amazingly played. The compositions are flawless. It's a complex album with many time changes which is something that happens all the time.Though the music is generally dark and heavy, it still manages to remain very melodic and fluid. The traditional rock ensemble of electric guitar, bass and drums has plenty to offer, with the Mellotron and Hammond organ capable of taking on both lead and supporting roles. The continually captivating interplay is a result of wicked distorted electric guitar, varied and beautifully arranged keyboards, a versatile rhythm section and strong expressive Italian vocals. Stefano Lupo Galifi's singing is bold and passionate, elevating the rest of the music to a higher level. It all comes together in a constant tension, topped by the majestic outbursts of Mellotron, which is the main hallmark of the album.In the original vinyl version, side A was entirely occupied by the long \"Zarathustra\" suite, consisting of five tracks with the duration of about twenty minutes. \"L'Ultimo Uomo\" is the segment that opens the album between solemn and emphatic sounds and King Crimson's solutions. Hammond, piano and Mellotron introduce \"Il Re Di Ieri\", the second chapter of \"Zarathustra\" in which Museum Rosenbach manages to blend the symphony of the early King Crimson with the darker sounds of the Italian prog. \"Al Di L� Del Bene E Del Male\", is a song that deepens and expands the prog demands of the band. \"Superuomo\" is the most changeable episode of the all \"Zarathustra\" suite. The fifth and final chapter, \"Il Tempio Delle Clessidre\", returns to the final theme of \"L'Ultimo Uomo\", a pompous and grand instrumental.The three other tracks on the album maintain the same high standard. \"Degli Uomini\" opens the B side of the vinyl. The initial Mellotron foreshadows the violent attack by Merogno's riffs, who contend for the scene at Corradi's Hammond and Golzi's battery pyrotechnics. \"Della Natura\" moves to a more jazz rock territory, with Hammond, Mellotron and guitar always in evidence with the rhythmic section, with Moreno's pulsating and nervous bass to underline the frenetic drumming of Golzi and where Galifi softens the atmosphere for a few moments before the usual jazz rock assaults. The equally beautiful \"Dell'Eterno Ritorno\" closes the album, an eclectic prog track with the typical Mediterranean sound.Conclusion: There are so many outstanding melodies and themes on this album that it's not without reason that \"Zarathustra\" is considered one of the milestones on the Italian prog rock scene in the 70's. The band dedicated itself to the powerful and rocking version of symphonic rock music, where they managed the balancing act from rough, hard rock to more intellectually shaped, complex rock with flying colours. In fact, it's almost a definitive example. Here you have the big keyboards, organ and Mellotron, a passionate and strong vocalist, a drummer who's clearly a jazzier and compositions that are both dramatic and rocking at once. Hardly any other work can develop such a harmony between hard guitar riffs and soft Mellotron carpets. Wrap it up in one of the finest covers of the era and you have a perfect package. \"Zarathustra\" is, undoubtedly, one of the universally recognized masterpieces of the Italian prog rock scene.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "DangHeck",
      "date": "Posted Monday, January 2, 2023",
      "rating": 5,
      "text": "Quite well known, beloved and acclaimed as an essential of Italian Prog,Zarathustraisthealbum (seriously theonlyrelease until 2000) by Museo Rosenbach. Coming at this in the digital age of music and of streaming, years ago now I had only ever heard its 2012 in-studio live re-recording, though I recall being thoroughly impressed then. Even now, peculiarly enough,Zarathustraon Spotify at least is available as an EP specific only to the title track, which in turn had been divided into its 5 parts. I can't find any information on this, even with the attribution given there to \"1973 Black Beard Records\".\"Zarathustra\", the aforementioned epic title track (purportedly inspired by Nietsche's Superman), begins with\"L'ultimo Uomo\"(\"The Last Man\"), out of the gate at first booming, yet melancholic. Vocalist Lupo Galifi has a softness to his voice that really warms us in this frigid mood; big fan of his later rough timbre, too. In an instance, the track crescendos with a whirlwind, like a contemporary passage from Hackett-era Genesis, mostly thanks to the Mellotron. Fade to the weary piano track\"Il Re Di Ieri\"(\"The King of Yesterday\"), the Mellotron matched with a warbling keyboard, eventually warming and brightening with fuzzy chimes. A huge return occurs with a truly symphonic orchestration from this [otherwise standard] Rock ensemble. Impressive and triumphant, it's evennowa fairly unique delivery (of the subgenre). Hammond organ angrily changes hands with fuzzy, beefy guitar on\"Al Di La Del Bene E\"(\"Beyond the Good E(?)\"), out in front of a wild gallop from the drums. At their heaviest, earlier King Crimson may be an appropriate comparison. This is a killer section, lasting a perfect sub-3 minutes. Just as heavy is the continuation at the start of\"Superuomo\"(\"Superman\"). It falls away and returns with a brutal rage. If I haven't made it clear, which I don't think I have, I amlovingthe synth sounds from Pit Corradi especially. Sort of that Keith Emerson level of sonic choice (at the start, the wildness reminded me also of Dave Stewart's work in Egg and Khan). The guitar is quite strong in this category as well, even when the fidelity causes it to break and distort. This is delicious Prog, changing at every turn to some other form, yet continuing wonderfully in its purpose and clear theme. I decided to listen through this section twice haha. After all the assault and heaviness of the last, finally \"Zarathustra\" comes to a close with the swooping and wonderfully full\"Il Tempio Delle Cles\"(\"The Temple of Cles\"). Slow fade to black for Side 1.[An overall track-specific rating of 4.75/5.00]We have adelightfulreturn to the festivities on\"Degli Uomini\"(\"Some Men\"), with soaring guitar andhugekeyboards, once again with the drums just blazing away. Another moment that feels like Genesis, here in the middle section, it feels like a glowing Tony Banks homage; however likely that is I don't know. Up next is\"Della Natura\"(\"Of Nature\"), featuring some of my favorite hallmarks of this era of Symphonic Prog. Another triumph which gives way to a soft, emotional passage. Then we return to wildness. This one isa lothaha. Definitely look forward to the section starting around minute 3; it has a cool sort of jazziness, I guess, which I just love. If anything, the wordless vocals in this section may be a little corny, but it sounded like they were having a damn good time. The bass at the end was certainly notable, when comparing to tracks preceding. The theme here is very classic and I would think would have pretty wide appeal. We get a now surprisingly eerie intro on\"Dell'eterno Ritorno\"(\"Of the Eternal Return\"), which funny enough turns into this really sweet beauty, with what I thought was flute (but now I'm genuinely unsure haha). This track is another which, seemingly throwing all caution to the wind, jumps wildly from thought and section to the next. The softer passages are really wonderful, especially approaching minute 3. Everything is just so well balanced and it gets you ready for the victory to come; even when it's brief, we get our reward. For me, this is up there with the title track in a way that the two that preceded did not (though they were far darker, as it was). What a fun and interesting song! Great closer to a well-rated album.True Rate: 4.75/5.00"
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Saturday, March 30, 2024",
      "rating": 4,
      "text": "Emerging in the midst of the effervescence reigning in Mediterranean lands due to the shockwaves that the progressive movement generated from the British Isles, the Italians Museo Rosenbach released their debut album and ultimately their only work for years: \"Zarathustra\". With a theme based on the concept of the Superman and the limitations to personal growth that submitting to a superior being implies, developed in the work \"Thus Spoke Zarathustra\" by the influential and controversial German philosopher Friedrich Nietzsche and, without breaking the mould completely with the tradition of their fellow countrymen more given to melodies and peaceful landscapes, the band presents a powerful proposal that combines influences of English symphonic rock with baroque and jazz touches and elements of primitive hard rock.With the five sections of the enormous suite \"Zarathustra\" as a fundamental anchor, the band surprises for the maturity of its musical ensemble, with Pit Corradi's keyboard playing standing out, with the protagonic mellotrons that generate a persistent dramatic and dark atmosphere in \"a. L'Ultimo Uomo\" and \"b. Il Re Di Ieri\", Corradi's own Purplelian Hammonds accompanied by Enzo Merogno's guitar riffing on the aggressive \"c. Al Di La Del Bene E Del Male\", as well as in the intense and jazzy \"d. Superuomo\", backed by Giancarlo Golzi's lively drumming and Alberto Moreno's correct bass playing. The instrumental \"e. Il Tempio Delle Clessidre\", the only section that doesn't feature Stefano Galifi's dosed and rough singing, completes not only the suite, but one of the best expressions of Italian progressive rock.And both the hard rock animosity of \"Degli Uomini\", the intricate and very progressive \"Della Natura\" with a superb instrumental display by the band, and the concluding \"Degli Uomini\" with Galifi's heartbreaking final vocal performance and the epic closing unleashed by Corradi's mellotron, maintain the high standard of the album.\"Zarathustra\", although at the time an elusive commercial success that probably frustrated the continuity of Museo Rosenbach (only resumed 27 years later with \"Exit\"), gained recognition over the years and today is a cult work for the progressive genre.4/4.5 stars"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album10f5.html",
  "last_parsed": "2025-05-18T00:21:42.123107"
}