{
  "album_title": "MOZART",
  "artist_name": "Sky",
  "artist_page_link_local": "artistf26b.html?id=1134",
  "year": 1987,
  "rating_value": 2.87,
  "rating_count": null,
  "review_count": null,
  "genre": "Eclectic Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/1134/cover_5250162972010.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "The Marriage of Figaro: Overture",
      "duration": "3:56",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Eine Kleine Nachtmusik: Rondo",
      "duration": "2:44",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "The Marriage of Figaro: Non So Piu, Cosa...",
      "duration": "2:33",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Symphony No. 34: Last Movement",
      "duration": "3:49",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Symphony No. 35 (\"Hafner\"): Andante",
      "duration": "5:27",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "The Magic Flute: Overture",
      "duration": "6:51",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Eine Kleine Nachtmusik: Romanza",
      "duration": "5:36",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Horn Concerto No. 4 in E Flat: Rondo",
      "duration": "3:36",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Don Giovanni: La Ci Darem la Mano",
      "duration": "3:00",
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "A Musical Joke: Presto",
      "duration": "3:59",
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "Come, Sweet May",
      "duration": "2:56",
      "is_sub_track": false
    },
    {
      "number": 12,
      "title": "Alla Turka: Rondo",
      "duration": "6:31",
      "is_sub_track": false
    }
  ],
  "lineup": [
    {
      "musician": "Herbie Flowers",
      "instruments": "basses, tuba"
    },
    {
      "musician": "Tristan Fry",
      "instruments": "drums, percussion"
    },
    {
      "musician": "Steve Gray",
      "instruments": "keyboards"
    },
    {
      "musician": "Kevin Peek",
      "instruments": "guitars"
    },
    {
      "musician": "+ The Academy of St.Martin-in-the-Fields",
      "instruments": "Not specified"
    }
  ],
  "reviews": [
    {
      "reviewer": "Zac M",
      "date": "Posted Sunday, June 25, 2006",
      "rating": 2,
      "text": "While the fourth album was made up of all covers, this album is a full fledged (you guessed it) album of Mozart's \"greatest hits,\" preformed by Sky and St. Martin's-in-the-Fields. It's hard to say that this is a Sky album because many times St. Martin's are much more present than any of the Sky members. To my knowledge, this is the best selling Sky album in America, maybe other places too. It's very accessible, and most people have heard at least half of these pieces, even if they know little to nothing about music.The covers are not the full length versions most of the time, but are still enjoyable. Sometimes, like in \"Rondo Alla Turca,\" Sky put their own twist on things, making it a bit more rokc or jazz or easy listening. I won't go through and describe all the pieces because most everyone has heard them, like I said before. My main gripe is the use of what sounds like a drum machine used very frequently in the background; it ruins some parts by just being there. \"A Musical Joke: Presto\" starts out nice enough, but by the end there is added techno beats that are just awful, Mozart would be rollng around in his grave haha.Most hardcore classical fans would probably scoff at this album, but as a Sky fan, I enjoy it. However, I can only recommend this to Sky fans; it's not for beginners whatsoever. 2 stars is enough."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Tuesday, May 13, 2025",
      "rating": 3,
      "text": "Sky's final studio album seems them taking a 1980s take on one of the earliest brands of progressive rock endeavour - adding rock instrumentation to classical music. This feels like a step down compared to The Great Balloon Race, which had been something of a return to form - here we're either dealing with a fairly standard take on Mozart with band contributions too subtle to be transformative, or the band jamming away with the orchestral guests pushed into the background.It's a fun whistle-stop tour of some of the highlights of Mozart's discography, and I guess doing the whole \"rocking the classics\" thing which was popular in the early days of prog with updated 1980s instrumentation is original, but it feels unambitious - not in terms of the musical presentation, because that at least is doing something new by setting the band against a full orchestra (though isn't the point of their rock-classical blend that they can achieve orchestral sounds without resorting to that?), but in compositional terms, since it feels like you don't take this path unless you're well and truly out of original songwriting ideas and want to resort to something perennially popular."
    },
    {
      "text": "Sky's final studio album seems them taking a 1980s take on one of the earliest brands of progressive rock endeavour - adding rock instrumentation to classical music. This feels like a step down compared to The Great Balloon Race, which had been something of a return to form - here we're either dealing with a fairly standard take on Mozart with band contributions too subtle to be transformative, or the band jamming away with the orchestral guests pushed into the background. It's a fun whistle-stop tour of some of the highlights of Mozart's discography, and I guess doing the whole \"rocking the classics\" thing which was popular in the early days of prog with updated 1980s instrumentation is original, but it feels unambitious - not in terms of the musical presentation, because that at least is doing something new by setting the band against a full orchestra (though isn't the point of their rock-classical blend that they can achieve orchestral sounds without resorting to that?), but in compositional terms, since it feels like you don't take this path unless you're well and truly out of original songwriting ideas and want to resort to something perennially popular. Warthur | 3 /5 | 2025-5-13 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Warthur Report this review (#3186090) Buy SKY music online with PA partners Show all SKY MP3/Stream Go to SKY page for videos, full discography with ratings, reviews and much more Go to Mozart page for more details, where to buy and ratings/reviews Search the Forum for SKY related discussions",
      "reviewer": "Warthur",
      "date": "2025-5-13",
      "rating": 3
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "albumef2d.html",
  "last_parsed": "2025-05-18T11:11:49.070349"
}