{
  "album_title": "THE INNER MOUNTING FLAME",
  "artist_name": "Mahavishnu Orchestra",
  "artist_page_link_local": "artist7fa9.html?id=649",
  "year": 1971,
  "rating_value": 4.29,
  "rating_count": null,
  "review_count": null,
  "genre": "Jazz Rock/Fusion",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/649/cover_43265852016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Meeting Of The Spirits",
      "duration": "6:52",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Dawn",
      "duration": "5:10",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Noonward Race",
      "duration": "6:28",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "A Lotus On Irish Streams",
      "duration": "5:39",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Vital Transformation",
      "duration": "6:16",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "The Dance Of Maya",
      "duration": "7:17",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "You Know, You Know",
      "duration": "5:07",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Awakening",
      "duration": "3:32",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Noonward Race (Live) \t(15:03) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "* Mar Y Sol Pop Festival, Puerto Rico, 3 April 1972 (previously unreleased in this 2' longer version)",
      "duration": null,
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Tuesday, February 3, 2004",
      "rating": 5,
      "text": "With Miles Davis, Tony Williams' Lifetime and Ian Carr's group Nucleus, jazz-rock took a definitive shape and started crystallizing to its actual form. Out of the Bitches Brew sessions came two bands that would really further define JR/F, the first being the brainchild of Wayne Shorter and Joe Zawinul called Weather Report, and the second being the pet project of John McLaughlin (and with Billy Cobham), called Mahavishnu Orchestra, based on the name his guru Chimnoy had given him. Both bands are simply the essence of jazz-rock and both were particularly progressive in their early days, before jazz-rock sort of veered to jazz-funk and later to fusion. With an almost impossible-to-improve line-up in terms of virtuosity, MO's first era was simply flawless, even if it sometimes went over the top and might seem today a bit indulgent.Contrary to Weather Report (who reigned as a duo but allowed anyone to come up with numbers), MO was clearly John's ship and clearly he was the captain with no back up, coming up with all of the music, leaving no credits to others. Between his roles with Tony Williams' Lifetime and Miles' group, two albums became very much essential in understanding John's evolution: first came the fantastic Devotion, where his guitar playing simply came of age and his brand of jazz-rock was born with the help of Larry Young (ex-Lifetime) and Buddy Miles (ex-Hendrix), than came the acoustic My Goal's Beyond (where he meets Cobham and Goodman), where John opens up to a very wide spectrum, including Indian music. But these albums cannot lead anyone to guess what was coming with Inner Mounting Flame. Even three decades after my discovery of this album, I still refer to it as Inner Mounting Erection, because it never fails to arouse my interest and reach orgasm, at least aural. (Sorry, I just had to do it ;o)) So when TIMF came out, its impact on music took on seismic importance and they became an instant success, as this album was the perfect mix between jazz and rock.Opening on the McLaughlin-defining Meeting Of The Spirits (a fantastic version of this emblematic piece) with John's eruptive solos flowing out like molten lava, fluid life a river and rapid like the thunder lightning, and the whole group accompanying him effortlessly, bringing the whole thing to an orgasmic big bang. The reflective Dawn, on the other hand, shows a very different and much quieter facet of this quintet, where Goodman's violin takes on the prime role as a soothing pill, even if McLaughlin's guitar manages to pull the track upbeat, before letting it drop to its original level. The aptly-titled Noonward Race is exactly that: a monstrous piece, a 300MPH track where Cobbham and McLaughlin let use see that they're not normal earthlings, then seeking to hide that fact, they are letting first Goodman and his violin, then Hammer's distinctive-sounding synth have their say, the track resembling a jam. Just like Dawn, the track Lotus On Irish Stream is gentle and soothing (after such a brutal Race), where McLaughlin's acoustic dexterity is featured, where Goodman's aerial violin borders the cheesy and Hammer's cool piano is the cement that binds the track.The flipside starts with a machine gun fire, courtesy of Cobham, and Vital Transformation becomes the alter-ego of Meeting Of The Spirits, and echoes that track's greatness. Dance Of Maya breaks the cycle of hard-smooth rotation of tracks with a slow-developing blues (that transition from the intro to the track proper is one of the best I've heard) where Mc and Co unleash all they got in terms of histrionics, while respecting the format. The following You Know track seems to be a variant of Meeting, but a calmer one, just content to play with the original riff, Cobham twisting our heads with his fantastic drum rolls. The closing Awakening is a bit the alter-ego of Noonward Race, at least in its intro, but even when reaching its apex, its delivers inhumane speed activity that no police radar has been able to measure, even three decades down the line.How not to give this album anything but maximum ratings, without appearing a fool or having a chip on his shoulder?? This is the album that set the blueprint for so many groups to come, that its historical importance is worth maximum rating, let alone the musical near-perfection that it embodies. Blindly!!!!"
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Wednesday, March 17, 2004",
      "rating": 5,
      "text": "Free form Jazz fusion at its finest. The MAHAV's debut album could be perhaps my all time favorite jazz fusion album. and for good reason. This is one of those albums which clearly grabs the listeners attention right from the beginning chords to the end with their wild mix of intense yet expressive musical innovation. If you are not familiar with the MAHAV's albums then this is a great place to start. Classic lineup way back when was the incomparable talking guitar of John McLaughlin, keyboard wizardry of Jan Hammer, Jerry Goodman on violin, Rick Laird on bass and finally Billy Cobham on drums. This music is highly intense and demands the listeners full attention which reaches heights and musical achievements I still marvel at today. It really is an amazing fusion of rock and jazz forms which will almost certainly appeal to all fans of complex ever changing prog. Mark this one up in the absolutely essential category my friends."
    },
    {
      "reviewer": "diddy",
      "date": "Posted Friday, June 4, 2004",
      "rating": 4,
      "text": "So now I will submit a review for this outstanding debut of the Orchestra. This was my first contact with this band and the first few seconds blew me away. I heard \"Noonward Race\" in form of a Mp3 and was shocked: how could anybody play so fast, was my first reaction. I immediately ordered the album and was amazed (so Mp3s are ALWAYS a very bad thing and only harm bands and music industry). You get the finest, technically most brilliant Jazzrock/Fusion album there is. And watch out for the awesome Violin played by Jery Goodman, it's the one thing that makes the Orchestra most identifiable I think. But all artists perform on a very high level and it's very unfair to point out one of them (did I? oops...) But there's one thing that obviates the 5 star rating: I miss the feeling, it's too cold, no rememberable melodies. Ok you don't have to have such thing all the time and it's actually prog so you can expect exertive music and you know that you have to concentrate a bit but there's no other prog album where I really need a break after listening to it. It's definitely no album to let oneself go while listening to it. So I subtract one Star, I would distract a half Star but it's not possible and I HAVE to draw off a bit, sorry..."
    },
    {
      "reviewer": "Certif1ed",
      "date": "Posted Friday, August 20, 2004",
      "rating": 3,
      "text": "Not as good as the diehards would have you think!!!After seeing and hearing the glowing praise heaped upon this album, I tracked it down in its original vinyl format - making sure I had a First Pressing, naturally!I gingerly lowered the needle onto the platter, and was duly blown away, as the other reviews here promised, by a full production and gorgeous musical textures. So far so good!So excited was I at \"my\" new discovery, that I went back several times for more - but each time, something was lost. Instead of discovering new delights with each listen, I found new disappointments as well; Whatever McLaughlin's pedigree, he uses a lot of bluff and simple repetitions played fast to cover the fact that on this album at least, he had a shortage of musical ideas. This leads to many passages that become boring noodle after just a few listens, the only saving grace being those other passages where the entire band gets it together and hits the musical high, so to speak.Meeting of the Spirits is one such high point. From the crunching opening to the end, we are treated to atmospheric textures of delights; Lights and shades - especially shades - of jazz rock fusion and sensual parts from all players, except, maybe Laird's slightly boring, repetitive bass. That said, the solidity is welcome, with the dizzying gyrations of the upper parts . However, McLaughlan seems to feel the need to noodle all over the top of much of this. Some of the noodling is incisive, where it attempts to accentuate and decorate the melodies. The unison duetting with the violin produces a wonderful timbre, and Hammer's electric piano rings through beautifully. Cobham's drums really are a treat, and are clearly an influence on the Ozric Tentacles' first drummer, Tig.Dawn begins in a kind of lounge bar Jazz mood. Mmm. Just how I like Dawn... Again, there is a beautiful melody unisonned on guitar and violin, and the band produce a glorious chilled texture. Then McLaughlan gets all noodly and spoils the mood. The noodling starts OK, but then he puts in bursts of fast bluff and fudged bent notes which the band gracefully relieve - and it is a relief when the band come back, as they bring in a gorgeous jazz groove, with Goodman giving it some gypsy Rose on the violin.Noonward Race begins with a kind of badly played Hendrix riff, and some awful bluff orchestrated with the drums - really, this is quite nasty. We get a bass riff that wouldn't be out of place in any psychedelic band, and some truly amazing keyboard work - but this is pure jamming, not really prog. Who cares? It's great fusion rock, until McLaughlan goes off on another one. Yes it's fast. But it's bluff - there is no attempt to get with the groove that Hammer was in or create something melodic, dynamic or even musical, it's pure self-indulgence of the worst kind. *Yawn*. It's easy to tell towards the end of the piece that the remaining band members aren't really into this either by the mechanical soulless playing - so it's not just me!A Lotus on Irish Streams would be a nice chill-out piece if it wasn't for that incessant noodling, Hammer providing superlative textures, and Goodman giving wonderful, aching melodies. It makes you wish there was a McLaughlan \"Off\" switch, such is the contrast between the sheer beauty that transpires when he is not playing, and the irritating fly buzzing when he is. If only he would play something that actually went with the music...Vital Transformation - starts a pure rocker, but springs surprises via starts and stops. McLaughlan finally proves that he really can play that baby by making it sing the way I've wanted to sing for four whole tracks - a real Vital Transformation! The band hang this one together in a really tight groove, but the urge to descend into fast bluff is seemingly irresistable, however, as you can feel McLaughlin teetering on the edges of musical creativity.The Dance of Maya opens with Wah drenched guitar and bass (just to prove to those who think I might not be listening properly that I am!), and Cobham provides a dynamo entry to one of the most upside-down drum beats I think I've ever heard. This is exactly the reason you should own this album; rhythms like this are lifeblood to any progger. The \"less is more\" concept fully proves its worth, until a bizarre chugging rock 'n' roll style section which, despite the mad time signature I could have done without, as for me, the initial spell is broken. I feel like I was set up for something way beyond rock 'n' roll, and am then presented with something that is merely fringe. As expected, there is more aimless noodling to come... tiny moments of genius do flicker through, but sadly the dance dies, and the directionless dirge lives.You Know, You Know, is nice enough, but directionless, and Awakening is an obvious attempt to end the album on a high - but again, there's no \"shape\" to it, only texture, so leaves (me, at least) somewhat unsatisfied......but willing to go through it all over again - so definitely not a bad album all in all. I originally gave 4 stars, but because of the horrible noodling I feel that the 4th has to be docked. Really, there's some 1st class material in here, so buy it to satisfy your curiosity and you will not be disappointed."
    },
    {
      "reviewer": "TRoTZ",
      "date": "Posted Saturday, January 22, 2005",
      "rating": 5,
      "text": "There are no words to describe this album. At first listening you won't be fooled around, you'll know you're in the presence of one of the greatest albums ever made. A grandiose symbiosis between rock music, neo classical music, psychedelic jazz music with further elements from blues to Celtic music. First of all, this album is an instrumental. If you think that, because of this, it would never reach a supreme level. you're judging wrong. The diverse instrumental arrangements, the superb playing, very virtuous and strong, offers an extremely enjoyable listen. Particularly I am referring to the magnificent drumming all over the album, very paced with many speed transitions, constituting a true independent instrument (but obviously well orchestrated with the rest), the high skilled guitar playing as well, with many speedy harmonious solos and also the beautiful violin playing.The album's production is also very good, not resembling at all a 1971 record, it could be perfectly an album edited a few years ago, as you'll not have any sound complaints. Every track is fantastic but my personal favourites are: the first, Shadow of the Moon, where the instrumental explosions, the guitar leading solo and the beautiful main riff impresses an astonishing ambience; Dawn with its skilled and beautiful violin; Noonward Race for more instrumental explosions; A Lotus On Irish Streams because of its emotional neoclassical arrangements, with violin, piano and acoustic guitar conferring a relaxing ambience very enjoyable; The Dance of Maya which has some blues influence; and the climax ending track Awakening.If you are a progressive rock collector and you DON'T have this album, God how can you live with such a great lack? This album is OBLIGATORY! It represents a perfect odd to symphonic progressive music in the genre of Canterbury/Jazz Fusion. It should not let anyone indifferent to it. If it lets, there's definitively something wrong with you.My rate: 9/10"
    },
    {
      "reviewer": "Trotsky",
      "date": "Posted Tuesday, May 31, 2005",
      "rating": 4,
      "text": "Surely the hardest rocking of all the great fusion bands of the 70s, The Mahavishnu Orchestra was a pretty much unbeatable combination of musicians that performed inciendiary breath-taking jazz-rock flawlessly. Oddly enough, its dominant member/main composer John McLaughlin is my least favourite member of the quintet, as I feel his solos have a tendancy to be all about volume and speed, but (aside from the fact that keyboardist Jan Hammer was underused) it's pretty hard to find another flaw in The Mahavishnu Orchestra's frequently stunning music.Inner Mounting Flame was where the quintet first laid it all down, and as such it's probably where most people should start off, although all three of the studio albums released by the original line-up are excellent (I'm including the second album Birds Of Fire and the lost third album which came out 26 years after it was recorded The Lost Trident Sessions here). Believe me, if you've never heard Mahavishnu before, you're in for a real treat ...Take the first piece Meeting Of The Spirits. I'm not exagerrating when I say that Billy Cobham's drumming and Jerry Goodman's violin-playing are outstanding in their precision and fire, but no one gets left behind. Dawn is mellower jazz-rock led by Jan Hammer's electric piano and features a heart-breaking solo from Goodman. I must say that I think McLaughlin's solo doesn't work upon its initial entry, but once the band picks up the pace and Goodman takes over, everything just rocks. Noonward Race likewise is a scintillating jam with first Goodman, then Hammer, then McLaughlin taking the honours.A Lotus On Irish Streams is a superb reflective piece with superb turns from the soloists Goodman, Hammer and McLaughlin. While Vital Transformation is one hell of a rocker on which Cobham's playing reaches some amazing heights. For me the album's weakest track is The Dance Of The Maya which has too much orthodox blues and dull wah-wah explorations from McLaughlin (even Goodman is guilty on this one). You Know. You Know on the other hand has it all, from the light intro, with the doubling up of Dave Laird's bass and Goodman's violin, then Hammer's awesome bluesy electric piano runs, and an ending in which both Goodman and McLaughlin turn in fiery leads while Cobham gives a veritable drum clinic in how to roll. In a way the bass of this piece doesn't move much, yet I love it to bits. Awakening is another one of those high-octane rapid-fire jams starring both Goodman and Hammer, that sets the seal on an excellent album.It's no coincidence that this album and its successor have the words \"flame\" and \"fire\" in their title, for that does indeed convey the mood of Mahavishnu's music. Decades after the group's ashes have blown away, there's something remarkably alive about this music. ... 84% on the MPV scale"
    },
    {
      "reviewer": "kunangkunangku",
      "date": "Posted Wednesday, August 3, 2005",
      "rating": 5,
      "text": "Whether it was initially intended or not, this album is widely considered as the gate opener to the realm of fusion (in its original meaning: the no-nonsense married between jazz and rock). It was released only a year after Miles Davis' \"Bitches Brew\" -- a groundbreaking effort. Here five virtuosos jointly create a work that is so dense with furious instruments playing, high energy, yet well planned with a Switzerland precision.Yes, Jazz is an important element here. However, upon a close attention, it is the rock element that deeply and smartly injected by the band. Listen to John McLaughlin electric guitar improvisation as well as Jerry Goodman's electric violin, both of which executed as if they were riding on a F1 circuit. Their melodies wandering, done within a constantly repeated basic pattern, are no strange at all within progressive rock territory.And there's the balance between its materials, which overall made this album an all-time classic. As one can recognize upon listening, the band put quieter materials between compositions showcasing breakneck speed unison passages. Try \"A Lotus on Irish Streams\" or \"You Know You Know\". These give space to the listeners to completely digest every single sound that had fiercely attacked their ears before.No progressive rock collection is complete without this album."
    },
    {
      "reviewer": "philippe",
      "date": "Posted Tuesday, December 13, 2005",
      "rating": 4,
      "text": "A grandiose introduction for a grandiose jazz fusion project by Mc Laughlin and his dream team (notably with the virtuoso Billy Cobham and Jerry Goodman). \"Meeting the spirit\" opens the ballet with a complex, rhythmical exercise and a bright duet between Mc Laughlin technical guitar style & Goodman's original violin touch. After an avalanche of technical solo sessions the atmosphere turns to something calmer with the beautiful & emotional �Dawn\". Mc Laughlin guitar solo delivers a touching, melodic texture. \"Noonward Race\" is a freak out, fast & technical song developed as a jam session, essentially improvised. \"A Lotus on Irish Streams\" is a nice, soft interlude with an acoustic expression. \"Vital Transformation\" is a catchy, energic, rhythmical tune with some funky accents and an excellent violin / guitar duet. \"You Know, You Know\" is my favourite track on this one; a mind-blowing, mysterious composition with a catchy repetitive bass pattern, time to time punctuated by solid guitar solos. An achieved and tasty debut album. Their monument remains \"Birds of Fire\""
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Friday, April 21, 2006",
      "rating": 5,
      "text": "When Jimi Hendrix died suddenly in 1970, connoisseurs of high decibel sounds unheard on the electric guitar were faced with a search for a new messiah. The The British guitarist-composer John McLaughlin, they found one. Mc Laughlin (b. 1942) arrived in America early in 1969 to join the pace-setting drummer Tony Williams and organist Larry Young in the Tony Williams Lifetime. This new venture fused jazz improvisational daring with rock'n'roll's sheer energy. After leaving Lifetime, McLaughlin became a disciple of the guru Sri Chinmoy, began calling him \"Mahavishnu\" .. [CD liner notes].I purchased the 20-bit digital remastered edition quite a long ago and I rarely spin this CD. It was actually an upgrade from a cassette version. But this remastered set is truly excellent because it's very informative and inspiring. Inspiring? Oh yeah . At the first page of liner notes you can read a poem or a philosophy - whatever you call it - by Sri Chinmoy (McLaughlin spiritual guru?) titled \"Aspiration\". Every single word penned by Sri is a powerful word. For me, having this CD is like owning two things: great music by Mahavishnu Orchestra and great book that inspires me.The soul aspires through the perfection of God's manifestationChinmoy writes the last sentence of that poem. It's inspiring, isn't it? It is!!!!Pssstt . intermezzo . by the time I'm writing this review I got a call from my prog guru who taught me prog when I was in Bandung in early eighties. Guess what? His son would get married next Sunday and he invited to attend the wedding ceremony. Yeah! Why bother I share this with you? It's because this gentleman (my guru) is special for me. He taught me the kinds like Mahavishnu, The Flock, Return To Forever, and the like. And most importantly, his son who is getting married soon is my prog mate as well! So he is the second generation of prog, inherited from his dad. Great! And now I'm writing this review of Mahavishnu debut album! What a coincidence! Sorry for this intermezzo - hope you skip it . [Jkt 21 April 2006 - Kartini Day, Our National Lady Hero, 10:45].Now let's talk about the music. It's awesome overall! It blends all elements of rock and jazz with great improvisations through solos of guitar, violin, drum as well as keyboard. It's ahead of its time. \"Meeting of The Spirits\" resembles the search of the divine power which John MacLaughlin lerned from his spiritual journey before he formed the band. It blasts off the music in a great way demonstrating Billy Cobham dazzling drum work, Goodman's powerful violin as well as Laughlin's stunning guitar. \"Dawn\" starts off with a softer style using combination of soft guitar and keyboard. Violin provides its shot excellently. The song moves into higher points with great guitar solo. \"Moonward Race\" contains heavier elements of rock performed in fast speed. So I can sense how great Billy Cobham is and how fast Laughlin plays his guitar. Electric violin takes is solo job wonderfully. \"A Lotus on Irish Streams\" starts with an excellent combination of violin, bass, piano and acoustic guitar. No drum is used here.\"Vital Transformation\" brings the music into a full speed again with great combination of guitar, drums, violin, bass that sound harmoniously. It's an energetic track. \"The Dance of Maya\" is another jazz rock fusion which moves from silent part into more complex arrangements. \"You Know, You Know\" is another relaxing track - this time with drums - featuring soft electric guitar fills intertwined with keyboard work by Jan Hammer which occasionally augmented with violin. \"Awakening\" concludes the album with another energetic arrangement and the music is sometimes complex. Violin solo is really great. Billy Cobham also plays drum solo, excellently! There is something similar between Mahavishnu music here in this track, especially, with the sounds of Return To Forever.Hmm . with such a long review plus long intermezzo, how could I rate this album? Five stars is a must!Keep on proggin' ..!Peace on earth and mercy mild - GW"
    },
    {
      "reviewer": "darkshade",
      "date": "Posted Friday, August 4, 2006",
      "rating": 5,
      "text": "One of the first of its kind. Fiery and fiercely fast guitar with some of the best fusion keyboard work in this genre. This is almost a supergroup, with John McLaughlin, Jan Hammer, Jerry Goodman, and Billy Cobham---all in the same band. Hammer is one of the best keyboardists ever, and he really shines on this one.So many people have reviewed this album before me, so I just want to mention some things I like. One, is the fuzzed out guitar that John was doing in Miles Davis' band. It's so... ROCK! Yet the music is so... jazz, that it fuses into this sound that is a little hard to describe. Jan Hammer always plays some great electric piano, comping chords like a champ, and Jerry Goodman lays down some nice violin parts, even if his sound is a little 'scratchy'. Unlike his funky solo albums, Billy Cobham is here, rockin' hard on the drums, and his definitive style is already showcased on this album.This album was important stepping stone in the development in jazz-rock/fusion. Where Miles Davis, Weather Report, and Herbie Hancock would go off into the stratosphere at this time in the early 70s, Mahavishnu Orchestra said, \"yea, we can rock out too\". This opened up the door for bands like Return to Forever, Fermata, and later on, Brand X. Essential for a any fusion collection, and if you don't have this one, you're missing an important album in the development of the genre."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Thursday, October 5, 2006",
      "rating": 2,
      "text": "Generally lacking in any interesting moments, perhaps I will be flamed for this review, but regardless. This is an output that is good to have for jazz fusion lovers, but what it really lacks is tact.If I was to point to one album which makes me wonder why everyone can not stand Dream Theater/LTE or other various offshoots, it would be this work, which actually makes DT look good(what a surprise); and makes me wonder why so many hate them, but love this. The majority of Inner Mounting Flame is a roller coaster of techinically advanced playing, with little interest in band dynamics, but rather instead, to merely play something that is advanced.The album lacks soul, it's cold and distant from the listener, and not cold and distant in an artistic, beautiful way, but in an offish manner. The listener may begin to wonder if this is really an album output or an advanced jam session.For all the things that people complain about in LTE, the incessant noodling, the lack of powerful passages that capture our attention, all of that can be found here, right in this album, to the tenth degree. Still, most definitely one of the go to albums of the fusion empire. However, the concept of \"art\" is lost on McLaughlin and his crew."
    },
    {
      "reviewer": "Chris S",
      "date": "Posted Tuesday, December 12, 2006",
      "rating": 4,
      "text": "Excellent album from Mahavishnu Orchestra, led primarily by John McLaughlin and becomes a natural extension of his time with Miles Davis. The music is richly and intricately layered forming a wall of sound more akin to Jazz fusion more than progressive genres. The opener ' The Meeting of Spirits' sets the tone for the rest of the album. Other highlights include ' The Dance Of Maya' and ' Dawn'. What a lineup, McLaughlin, Billy Cobham on drums,Rick Laird on bass, Jan Hammer on piano and Jerry Goodman on Violin. This music was the catalyst for so many more Indian influenced sounds like Shakti which JM went on to later join and collaborate with."
    },
    {
      "reviewer": "hdfisch",
      "date": "Posted Tuesday, February 6, 2007",
      "rating": 4,
      "text": "I can follow in some way what is meant by a small minority of reviewer criticising the dominance of narcistic show-off of technical skills, too much aimlessness and the lack of genuine feeling on this record. Listening to this stunning amazing tour de force and high-speed (actually only interrupted by the relaxing \"Lotus.\") one could well get the idea that the DT-guys tried to walk in the footsteps of McLaughlin & Co a few decades later. I'm usually not easily impressed and fascinated by virtuoso and self-indulgent solo escapades shown by Dream Theater and the likes but for some strange reason I like very much the work of this Orchestra. Maybe it's due to the presence of violin (which I appreciate a lot in rock and jazz music) or the total absence of any vocals (I much prefer instrumental Prog) that I feel highly appealed by this record. I find it as well very amazing how all the musicians manage to follow McLaughlin's insane pace but of course there are only brilliant guys involved here. But this fact might also be exactly the reason why this work cannot be considered a masterpiece (at least in my view) since too many and too big egos are preventing that. Anyway this one had been an excellent demonstration of artistic skills not only by one of the greatest guitarists in the world, but also by Goodman with his bewildered violin play, Hammer with awesome e-piano, Laird's brilliant bass and of course Cobham's wonderful drums which I'm especially a huge fan of. His Spectrum-album as well as his two Paradox-albums were just marvelous works and must-have for any rock-jazz fan. For this one here I would say a 4-star rating is adequate since for sure it's an essential one in Prog but not really perfect composition-wise."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Monday, February 19, 2007",
      "rating": 4,
      "text": "While groups like Pink Floyd occasionally took us on leisurely psychedelic trips to the moon, planets, stars and nearby galaxies these guys were intent on taking us to parts of the uncharted cosmos where even God wasn't too sure about what was out there. I would never dare mention The Mahavishnu Orchestra to the pop-loving layman but, since I'm supposedly among adventurous souls here where progressive music rules supreme, I feel safe in saying that a substantial number of you will find this music very stimulating and enjoyable. (But you might want to send the kiddies and Granny into the next room while you listen.)Obviously, in order to get to these outer realms of creation where 4/4 time signatures are the exception instead of the norm, one must travel at light speed and the first tune, \"Meeting of the Spirits,\" attains that velocity in a hurry. I must pause here to point out that even though this music is, at times, maniacal and unconventional it's also lyrical and melodic between the intense individual solos so it's by no means just a jumble of indecipherable notes. In other words, it's quite accessible and that's just one of its many charms. \"Dawn\" slows the pace for a moment as if we've reached our destination but soon we begin to explore our surroundings and the tempo picks up once again. \"The Noonward Race\" is noisy at first and faster than a speeding bullet but there are planned, structured musical phrases interspersed throughout the song. The rapid-fire interplay between guitarist John McLaughlin and drummer Billy Cobham is incredible. By now the listener could use a rest and \"A Lotus on Irish Streams\" is as welcome as an oasis in the arid desert. Jan Hammer's piano, Jerry Goodman's violin and McLaughlin's acoustic guitar create a beautiful and peaceful atmosphere. Insane, adrenalized drums from Cobham begin \"Vital Transformation\" where a recurring ascending melody is played between solos that whiz by your head like renegade comets. \"The Dance of Maya\" starts with a theme that would fit perfectly at the start of a mutant monster movie but then it morphs into (believe it or not) a Chuck Berry style rock and roll pattern where Goodman turns in a hot violin lead. Then, amazingly, the original theme comes back and is played simultaneously on top of the rock and roll. I would designate it as my favorite cut if it weren't for the next one, the slower \"You Know You Know,\" which also floors me. It's a simple repeating riff with a long 15/4 measure in between where all kinds of interesting things happen. Billy's drum fills are spectacularly tasteful. The last tune, \"Awakening,\" feels as if the whole band got sucked into a black hole because they reach speeds that were heretofore unattainable. However, it was necessary in order to get us back to earth.As I intimated earlier, this ain't for everybody and even the most courageous among you might find this far too busy and off the beaten path to tolerate for even five minutes. I understand. I, more often than not, am more comfortable listening to tunes that are relaxing and pleasant but from time to time I need to take a walk on the wild side and that's when albums like this one are called for. I am absolutely blown away every time I hear \"Inner Mounting Flame\" and consider it to be a magnificent achievement by this group that is only surpassed by their next offering, \"Birds of Fire.\""
    },
    {
      "reviewer": "thellama73",
      "date": "Posted Monday, July 30, 2007",
      "rating": 2,
      "text": "Let me begin by saying that I like nearly everything on this record. Why only two stars then? Because the one thing I don't like is so glaringly persistent that it ruins everything else. That thing is John McLaughlin. How this guitarist ever managed to get a gig with Miles Davis is beyond me. Don't get me wrong. The rhythm section is amazing. The keyboards, violin, bass and drums are all played with tight virtuosity and their improvisation is inspired. I am particularly impressed with Jerry Goodman's playing, and that's saying something for me because I don't even like Jazz. McLaughlin, however, is a hack. His solos make no sense at all in relation to what's going on behind him. He just crams as many notes in as he can without caring which notes they are, something any guitar player can do. It utterly spoils the beautiful textures and tight grooves supplied by the rest of the band. It's a shame, because without his guitar work, this would be a really great album."
    },
    {
      "reviewer": "apps79",
      "date": "Posted Tuesday, October 16, 2007",
      "rating": 5,
      "text": "Maybe the most ground-breaking jazz rock outfit of all times,MAHAVISHNU ORCHESTRA were an idea of skillful guitarist John McLaughlin.McLaughlin was a very spirited man,admiring the Indian culture, and had previous experience in song-writing having played next to jazz legend Miles Davis.The original line-up of the band included members from the four edges of the world and their debut ''The inner mounting flame'' came out in 1971.The album was trully a shock,as the band delivered unbelievable musicianship and interplays,deeply based on Eastern influences.McLaughlin's rocking' style of playing was in constant battle with Jerry Goodman's violin work and Jan Hammer's Minimoog keyboard,while the three members were supported by Irish Rick Laird's jazzy bass lines and Billy Combham's unusual crazy drumming.If it is hard for you to imagine Jimmy Hendrix-like guitars mixed with Indian music,funk & jazz then you should purchase this album...A masterpiece to remember!"
    },
    {
      "reviewer": "Moatilliatta",
      "date": "Posted Thursday, November 15, 2007",
      "rating": 5,
      "text": "McLaughlin's Mahavishnu Orchestra more or less took the mantle from Miles Davis as the vanguard of experimental jazz-fusion. The Inner Mounting Flame is the band's debut, and I can't think of a better debut jazz album. It's got a distinct sound, great jams, complex arrangements, and memorable melodies. John McLaughlin was an inhuman guitar player for his time. His unique, angluar chords and solos (at high speeds no less) were quite remarkable. The rest of the band holds their own right up with Johnny. The band does a lot of jamming, but they frequently check-in with the main riff or another composed line of some sort to keep from going off on long tangents. Considering the complexity and angularity of the sound, it's rather easy to get into for reasons like that. I don't want to waste your time with more reviewing. This album r00lz and you ought to own it."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Friday, February 15, 2008",
      "rating": 4,
      "text": "It's strange, but I've always viewed this album as a solid four-star--on par with some of the all-time fusion classics, but not quite there. Recently, upon preparing to finally review this gem, one thing always kept sticking out: 1971. Most of the other real fusion classics (at least in my book, mind you) were over four years later. This is simply an incredible sound for 1971, and these guys deserve the utmost respect for laying it down. Truly uncharted territory here, and that counts for something.As for the Dream Theater comparisons, I'm a little shocked. Sure, there are some unison runs, BUT, while DT painstakingly choreographs them, these guys just let it happen, and they break loose whenever they darn well feel like it. If things get a little out of key once in a while, all the better! This is not simply technical playing. This is the essence of fusion.Meeting of the Spirits kicks things off properly, with lots of dynamic shifts and a crazy tempo. McLaughlin could stand to be cranked down a bit (or at least throw in some vibrato), but his interplay with Goodman is outstanding, and Hammer makes sure to assert himself as well. Dawn is also a highlight--just listen to the part about two minutes in where they effortlessly switch from lazy shuffling to funky jazz and try to tell me that this is only technical playing...I dare you!Vital Transformation, The Noonward Race. Does Billy Cobham keep a fire extinguisher near his kit? That would seem necessary, because when he breaks out on these tunes, I can easily envision his skins igniting. On the other hand, it would seem unwise to keep any contents under high pressure near him, because he would eventually bash it open and cause an explosion. Either way, it makes for great music, especially with Hammer and McLaughlin keeping up throughout.We also have a contemplative tune (the absolutely gorgeous Lotus), a brooding number (You Know, You Know) and a dissonance exploration tune (Dance of the Maya). All in all, this is incredible diversity, and Mahavishnu Orchestra have really accomplished something impressive with this effort. If you are a fan of fusion and somehow do not have this cornerstone album, find it now, and you will rest much easier--that is, of course, if you can prevent yourself from continuously playing these tunes in your head."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Tuesday, March 18, 2008",
      "rating": 5,
      "text": "For my money i'll take \"Birds Of Fire\" over this their debut, but lets face it they are both essential Jazz / Fusion recording aren't they ? Heck you can add \"The Lost Trident Sessions\" and you have MAHAVISHNU ORCHESTRA's Holy Trinity.The first song \"Meeting Of The Spirits\" is really the only one that would have fit perfectly on \"Birds Of Fire\", and so it's not surprising that it's my favourite on this record. It opens with explosions of sounds again and again before it settles in, although there is such a powerful undercurrent throughout this track. Goodman's violin really gets things going before McLaughlin comes in firing. Check out the bass before 2 1/2 minutes. It calms down a minute later. The keys of Hammer are a nice touch 4 minutes in. They sound great. McLaughlin's back after 5 minutes as Cobham hammers away. Incredible track ! \"Dawn\" starts slowly with bass, drums and keys.Violin joins in as the guitar seems restrained yet raw as it solos.The song does pick up with some prominant violin before settling back down after 4 minutes to end the song. \"Noonward Race\" opens with Hendrix-like guitar, and drums that are all over the place for the first minute. Violin then takes the lead. Keys 2 1/2 minutes in. McLaughlin's turn before Cobham offers up some odd-metered drum fills 4 minutes in to the end of the song.\"A Lotus On Irish Streams\" is my least favourite and it opens with mournful violin as acoustic guitar comes and goes intricately. This is a slow paced track with some liquid keys that also come and go. I like the piano 4 minutes in when the violin stops briefly. \"Vital Transformation\" opens with a mind-boggling drum display as guitar and keys come in. Violin after a minute, but it's the guitar work of McLaughlin that is so impressive after 1 1/2 minutes as bass throbs. \"The Dance Of Maya\" is a dark song with a fair bit of bottom end. Guitar before 2 minutes reminds me of Fripp the way he makes it scream. A full band sound before 3 minutes. Cool guitar solo 4 1/2 minutes in, and Cobham ends the song in style. \"You Know,You Know\" feels like everyone is holding back. I like the atmosphere in this one. \"Awakening\" does not have anyone holding back on it. Haha. Everyone struts their stuff ending the album in impressive fashion. Essential !"
    },
    {
      "reviewer": "horsewithteeth11",
      "date": "Posted Thursday, November 27, 2008",
      "rating": 5,
      "text": "I've stated this before, although I'm pretty sure that it wasn't on this website, that when I first got into progressive rock, the only reason I kept with it was because of a certain few albums that I found interesting enough to want to stick with it. This is one of those albums. It was the first fusion record I ever heard and I was totally blown away by it. The sheer ferocity, technicality, and overall musicianship blew me away within moments of starting it for the first time and they still do every time I listen to it.1. Meeting of the Spirits - Starts with a few drum rolls by the genius of Billy Cobham and McLaughlin shredding a bit before an almost psychedelic intro draws us into the song. At 1:30 McLaughlin comes in with a lengthy solo, something that is quite common in Mahavishnu's work. Drums and guitar are excellent on this song. Around 3:40 the intense shred-fest quiets and slows down. Great piano playing in this section as well. However it builds up a bit again before the end. Absolutely amazing intro. 10/102. Dawn - Soft, slow piano intro with drums providing backing. Violin comes in around 0:45. This is an absolutely stunning and beautiful intro, and easily one. This song has great violin...shredding? Not really sure how to put it, other than the fact that it absolutely blows me away. 10/103. Noonward Race - Easily my favorite Mahavishnu track and even jazz fusion song. This is probably in a list of my top songs of all time; it's that good. At times it seems to go back and forth between being 70s hard rock, blues, and jazz. Words can't do this song justice. It must be heard to be believed. Again, absolutely mind-blowing song in every aspect, and no weaknesses whatsoever. 10+/104. A Lotus on Irish Streams - Some absolutely beautiful violin starts this song off. It almost brings me to tears when I hear it, as well as the point around 1:50. Songs generally don't make me feel overly emotional, but this one always strikes a chord with me for some reason (pun intended). Great interplay between acoustic guitar and violin throughout the song. Piano comes and goes throughout the song at appropriate times. Absolutely stunning, and one of my favorite tracks on the album. 10+/105. Vital Transformation - Kicks off again with a very hard rock feel to it like Noonward. Killer drums, guitar, and bass are a key of this song. And like Noonward, this is a song that I can't describe in words alone. Another must-hear song. 10+/106. The Dance of Maya - Starts with a creepy intro that would make Alfred Hitchcock proud before drums come in and...make it slightly less creepy. This song is also filled with very distorted sounds to help add to this creepy feeling. However, McLaughlin's guitar dispels that feeling at about 4 minutes in, and we are treated to more powerful and emotional shredding and soloing, however he does slow it down at times and gives a feeling of great balance and control without losing the raw power he displays so well. 10/107. You Know, You Know - This song begins with a very bluesy feel to it and starts off slow before building up. At least that's what one would think. But to me it feels like something is missing on this song. I'm not sure if the band was deliberately trying to hold back or what, but some of the emotion is lacking from previous tracks. There is however a good deal of nice noodling with the keys, which in the end might be what the song was intended for, I don't know (pun intended again). Some violin even comes in at one point and gives us the false hope again that the song will continue building, along with some weird noises, but again I feel that this song never gets that far from where it starts and could have expanded more. My least favorite and probably the only \"weak\" song on the album, but some of the drumming from Cobham saves it for me. 8.5/108. Awakening - The intro for the last song starts with everybody seemingly coming in at once and trying to solo at the same time. Very, very intense here, and a great return from the last song. This is much more in the vein of what else has been going on in this album. Great guitar soloing and great drums from Cobham as well. Heck, all the instruments feel on here, almost as if everyone is trying to get what thoughts and ideas are still in their head out on to the last track of the album. Fantastic, fantastic finisher. 10+/10Closing thoughts: An absolute must-have record not just for a fan of prog rock or jazz, but anyone who is a fan of music. This album is one of my 25 favorite albums of all time for a reason. The intensity and emotion really comes out very well here and in the follow up album, \"Birds of Fire\". Although both are absolutely essential albums, I rank this one slightly over Bird of Fire. An absolutely essential album and I really wish the rest of Mahavishnu Orchestra's discography had turned out as good as this. This isn't music; this is art in its purest form. If you don't have it, get it immediately. 6+/5 stars."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Sunday, January 25, 2009",
      "rating": 4,
      "text": "Review the new one, The Inner Mounting Flame, The Mahavishnu Orchestra, 1971StarStarStarStarStarThe original line of The Mahavishnu Orchestra is clearly one of the most instrumentally talented bands I've had the pleasure of hearing, with the excellent John McLaughlin (guitar), Jerry Goodman (violin) and Billy Cobham (drums, percussion) standing out particularly. This, their debut offering, is a fine example of simply how much they could achieve with a unique cross of instrumental fire, improvisational talent and clever arrangement. The big highlight is the awe-inspiring opener, but the rest of the album holds up very strongly. It is weakened just a little, in my eyes, by the more jazz/solo-dominated pieces, which could perhaps have been done with a little more depth, but overall a fantastic album, a pioneering mix of jazz, rock, blues, classical, funk, you name it, and an essential piece in any self-respecting music fan's collection.The opener, Meeting Of The Spirits, is comfortably my favourite ever Mahavishnu Orchestra piece, and one of my all-time favourite songs (probably top 20 or so... I don't keep track, but it's there). It showcases everything that made the band great: splintering, blistering solos from McLaughlin and Goodman, a swallowing hammond part, creative, lightning-speed, wonderfully thick and chaotic drumming from Billy Cobham, echoed themes and shared violin-bass lines, an insistent tug from the guitar, new touches of piano or violin you only hear after the fifteenth or twentieth listen. Rick Laird's bass also takes a particularly shining moment. The whole feel is incredible, gripping from every angle, creating a vibe of Indian-temple-fires-and-spirits-and-incense with intense bursts of rock guitar, a jazzy Jan Hammer e-piano solo over a thick background, and even one vision of near-classical beauty. More than music. A physical/psychological/spiritual emotion. Worth the price of the album alone.The following Dawn is one of the more jazzy pieces, opening with a sort of minimalistic Hammer/Laird background over which McLaughlin and Goodman drift with lightning-paced, short solos and brief bits of full-band-coordination. After two and and a half or so minutes, the piece suddenly picks up with a funky keyboard part and assertive guitar jabs backing a bit of phenomenal violin-work. The original theme returns again towards the end, developed by a bit of low-key Cobham drumming, and the overall impression is highly impressive, with a sort of high-density-low-density-high-density thing going on parallel to a low-intensity-high-intensity-low-intensity thing. Interesting stuff.Noonward Race is more in the jazz vein, definitely, with a relatively few repeated themes, obvious occasions where everyone is taking their solos (Hammer comes off particularly well), but an insidious high-quality funky groove from Laird/Cobham underpins the whole thing. Cobham, excellent as always, shows his ability to change a drum part's nature while keeping it very close. A bit more wandering and maybe the least tight piece on the album, but nonetheless excellent.The lush acoustic piece A Lotus On Irish Streams is a show of the rather more tender side of TMO, with personal violin and McLaughlin's unique acoustic stylings, sounding almost like a sitar at times. Laird latches onto and prompts McLaughlin's acoustic lines. Particularly satisfying are Jan Hammer's lovely piano runs and occasional classical-sounding motif within the more liberated, but very appreciative, jazz soloing of the whole piece. The mood, the development, the soloing talent and the wonderful moments of unity within the freedom and taste of the whole piece provide plenty to chew on and digest. Endearing, and excellent stuff. Absolutely great piano solo from Hammer.An intense Cobham drum intro takes us straight onto Vital Transformation, a blistering whole-band workout with charged thick solos from McLaughlin and Hammer, and an entirely unrelenting but very well-directed drum part. It places emphasis on keeping a strong riff or rhythm going throughout, with all five members at some point drifting down to the rhythm part, but never staying complacent, launching into a solo, a rhythm-altering jab or a gradual communal effort to change the rhythm ideas every now and then. A bit of versatility and complete changes are included for effect. Only really weakened at all by the rather light ending, but nonetheless a triumph of drumming and great stuff.The Dance Of Maya, a sort of tribal blues/jazz thing, opens with a tense, challenging and gradually expanding guitar part, which builds up slowly, as the rhythm gradually becomes a little less ferocious and a little more upbeat every time the fierce guitar thing subsides, and Goodman dazzles on violin, and suddenly, the rhythm becomes less ferocious and more upbeat and is a BLUES! I mean, ingenious introduction... hard listening, definitely, but so, so rewarding... A BLUES, man!! Hammer offers a bit of blues piano, Goodman a violin solo, McLaughlin something which is somehow too rapid and growling to be blues, but nonetheless works well with the background, which seems to be gradually rocking up again, slowly brutalising the general bluesness of it, until a repeat of the blues idea with McLaughlin now both helping and hindering, going gradually back to the tense guitar but also whirling around within the rhythm. The whole tribal tension is restored slowly, with a blare of hammond and a violin solo before the archetypal fiery blues conclusion coupled with a cheeky guitar thrum on the end. Extremely accomplished.You Know You Know is maybe a bit subtler and more downbeat, with a weird guitar, violin, bass thing under an initial drum solo and then a wonderfully subdued and unusual piano solo. The slow, careful rhythm has a gradual-revelation thing before McLaughlin's terse, unanticipated guitar stabs begin firing things up a bit. A dash more of basically drum soloing brings us to the end. I mean, really, the thing to remark, is that this doesn't sound like any other 'soft' piece I own. It's got aggressive bursts, but they never even really encroach on the softness of the song... yet are absolutely crucial to it. Very interesting.Awakening, the closer, is, expectedly, a bit of a solo showcase, with a Cobham near-solo intro, a rapid, high-energy riff thing, bursts of whole-band-just-playing-as-fast-as-possible-but-pulling-it-off-very-suavely, solos from Hammer, McLaughlin, Cobham and Goodman inside the main piece. The rhythm section does some quite interesting things changing around as the instrumentalists are cycled in and out of the soloing spotlight, but Laird's solid presence and unusual twists on the bass part have to be heard. The conclusion, with a spiralling McLaughlin guitar, screams to be heard.All in all, an excellent, interesting album entirely worthy of the term 'fusion'. Cobham is fantastic, the whole band are simply so damn good at soloing and finding a tasteful context in which to do it that the occasions where maybe the compositions aren't as solid are nonetheless very enjoyable. Preferable, in my opinion, to the following Birds Of Fire, and while it's not quite 'flawless' (Noonward Race and Vital Transformation are weaker than the rest of the album, in my view, though by no means bad), it is a masterpiece of high-quality, high-intensity jazz-rock. Essential.Rating: Five Stars, 13/15 Favourite Track: Meeting Of The SpiritsEdit: dropped to a four with a big general ratings harshenatificatorifying. Basically, there are albums I love noticeably more, and I'm not really the person who lives and breathes jazz rock - I love it, but it's not what makes my spine tingle all too much. This album does that at times, but not so much at others."
    },
    {
      "reviewer": "The Truth",
      "date": "Posted Friday, May 22, 2009",
      "rating": 4,
      "text": "This is truly some great music! The Mahavishnu Orchestra is probably my favorite Jazz Fusion band, a subgenre of prog I don't listen to much. John McLaughlin's guitar playing is phenomenal! It's like taking every guitar hero in the world and mixing them up into one guitar god! Most of the music sounds like it could be played by a symphony yet this band mixes things up and plays it on guitar. Meeting of the Spirits is one track that sticks out to me, (probably because I'm a symphonic prog fan and this is the most symphonic track on the album,) so if you like symphonic prog like me try it out! Noonward Race is a song that is played super-incredibly fast! Almost like someone having a controlled spasm with a guitar in their hands. Lotus on Irish Springs is an excellent track, very soothing violin playing, and Awakening is an excellent way to end an album. I almost feel sorry about not giving this a five star rating but the music sounds like it is almost repeating itself some of the time. However this is a must-listen to any prog fan!"
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Tuesday, June 9, 2009",
      "rating": 5,
      "text": "What we have here is a case of intense jazz fusion. All five members of the band are more than competent on their respective instruments and aren't afraid to annoy you with the ridiculous amount of notes they can play in a matter of just a few seconds. Over-soloing for the sake of it doesn't always make good music, but the musical lines underneath the soloing are what get my attention most and the primary cause of my positive remarks. The underpinning rhythms make the solos much better/less offensive (to me). The only time I feel it gets carried away is ''Awakening'' where everybody solos at once; it's a little too much for me to stomach, but at least a good chunk of the rest of the song is sound to my ears.INNER MOUNTING FLAME seems to alternate between louder songs and softer/smoother ones. It starts off with (probably) the most intense song (and my personal favourite) ''Meeting of the Spirits'', followed by a smoother jazzy song in ''Dawn'', brought back to intensity with ''Noonward Race'', then it goes completely soft with ''A Lotus on Irish Streams'', you get the idea. Yeah, it sounds very predictable and formulaic, but give it a try and see if you can make as much sense of the album as I did.No need to really go too much in depth (track-by-track); I've already tried to explain the dynamics of the thing, the pieces have plenty of odd metres in them, and the soloing goes without question. It's more intense than regular fusion, so that alone ought to make you try it. The best way to see if you'll like the album is to listen to the mp3 of ''Meeting of the Spirits''."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Thursday, June 25, 2009",
      "rating": 4,
      "text": "A landmark album from the revolutionaries of jazz fusion.This album is difficult to describe. All fully instrumental with some of the best virtuoso musicianship you are likely to hear. The music is a fusion of heavy guitar, using jazz metrical patterns, Indian influences and a dash of Celtic thrown into the mix. The music ranges from intense and off kilter with a range of time signatures, to a beautiful and melancholy pathos. There are crescendos and allegros on keyboards intermixed with the frenetic guitar of McLaughlin. There are influences of Miles Davis' \"Bitches Brew\", the milestone album from the jazz great.Goodman is a star on violin who plays off Mclaughlin's masterful guitar. The excellent \"Birds of Fire\" was to follow but this is the masterwork from Mahavishnu Orchestra. Highlights include Meeting of the Spirits, Noonward Race, Vital Transformation and, my favourite MO track, The Dance of Maya.There are other highlights interspersed in the other tracks but it needs to be listened to as a whole to fully appreciate the innovation and ferociously original style of the band. The album is of course legendary and highly revered in the jazz world and the band have become revolutionary progenitors of jazz fusion.My one concern is it is very short and the CD does not include bonus feature tracks. The booklet is pleasant to read and thumb through with some great pictures of them in full swing.Impossible to ignore and highly recommended for jazz fans too, not only those into classic prog albums. I give it 4 stars rather than 5 because it is legendary but not easy to listen to repeatedly due to the nature of the estranged music."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Thursday, August 27, 2009",
      "rating": 5,
      "text": "My first Mahavishnu Orchestra album - what a nice music! I heard McLaughlin before in different combinations, starting from his old duet with Santana and finishing his fresh live concert in my town with Five Pieces Band. I liked him as very technical guitarist and intelligent music maker. Here I found one more his ability -guitar hero!First MO album is melted energy, I never before or after heard McLaughlin playing so heavy electric solos. All album is one gem. Perfect musicians, but anyway-it is mainly McLaughlin star hour.This music is attractive to wide circle of music lovers-from heavy rock guitar heroes fans till jazz gourmans. Very different, with plenty of melodies, rhythm changes, perfect arrangements, but - mainly guitar fusion album.Never before I thought that guitar can be so important in 70-th fusion. I think EVERYONE interested in fusion,jaz-rock or just guitar virtuoso music should have this album. CLASSIC OF THE STYLE!"
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Monday, September 14, 2009",
      "rating": 3,
      "text": "\"Inner Mounting Flame\"is the debut full-length studio album by multi-national jazz rock/fusion actMahavishnu Orchestra. The album was released throughC.B.S./Columbia Recordsin August 1971.Mahavishnu Orchestrais the brainchild of prolific jazz rock/fusion guitaristJohn McLaughlinbut features an all-star lineup withJerry Goodmanon violin,Jan Hammeron piano,Rick Lairdon bass andBilly Cobhamon drums. All five musicians were experienced session musicians who had among others played with acts such asMiles Davis,Tony Williams LifetimeandThe Flock. After some years as a session musicianJohn McLaughlinwanted to make his own group which would follow his musical vision. The band nameMahavishnu Orchestraderives fromJohn McLaughlin�sspiritual name given to him by his guruChinmoy Kumar Ghose.The music on\"Inner Mounting Flame\"is instrumental jazz rock/fusion with especiallyJohn McLaughlin�sguitar as the lead instrument. Piano and violin leads are also present in the music. The eight songs on the album are all played with virtuosic skill and it�s definitely the musicianship that impress the most on\"Inner Mounting Flame\". The compositional quality of the tracks aren�t always that high as most tracks have an unfinished feel to them, focusing a lot on improvisational noodling and less on reoccuring themes and melodies. There are a few tracks which appear more like regular composed tracks and out of those\"Meeting of the Spirits\"is probably the strongest. Most other tracks are vehicles for soloing.\"Inner Mounting Flame\"features a powerful and organic sound production with a great raw edge which suits the material well. But for the strong sound production and excellent musicianship, there simply aren�t enough material on the album that�s particularly memorable. These guys are phenominal players but\"Inner Mounting Flame\"could have prospered greatly from more focus on songwriting instead of endless improvisational noodling. Still it�s a quality release and for those who enjoy improvisational jazz rock/fusion with a focus on playing rather than on compositions, this is most likely a great release. A 3.5 star (70%) rating is warranted."
    },
    {
      "reviewer": "friso",
      "date": "Posted Wednesday, October 21, 2009",
      "rating": 3,
      "text": "Mahavishnu Orchestra is the type of group that blows you away in a phase in which you are still hypnotized by fast solo's and very technical musicianship. Moreover, this album is quite an early example of heavy jazz rock with a Miles Davis heritage. For me personally the guitars of McLaughlin are a total hit and miss; I like the guts, but I dislike the meaningless use of his immense solo's. On their 1973 effort 'Birds of Fire' the band would improve a lot on the production and more importantly on the compositions. The band has an amazing line-up; Billy Cobham on drums, Jan Hammer on piano, Jerry Goodman on violin and Rick Laird on bass - all among the most technical players of their day. I listened to this record a few times, but it irritates me more than I enjoy it. I'm still happy it exists, because I do like bands like SBB, Finnforest and Leb I Sol - who took most of their inspiration from Mahavishnu."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Tuesday, November 17, 2009",
      "rating": 3,
      "text": "This album sits right behind Magma in my cd-cabinet and the first 40 seconds could easily fool me into thinking I picked up one of the Magma albums by mistake. It's a dark and heavy start, with virtuoso drums, screaming guitars and textured jazz chords, almost zeuhl. But after 40 seconds it clears up, a gentle vintage McLaughlin guitar picking hypnotizes us into a 7 minute journey of swirling guitar solos. This is pure oral pleasure for all guitar lovers.And the trip goes on, sometimes slightly more laidback as onDawn, sometimes slightly less inspired as onThe Noonward Race. OnA Lotus On Irish Streams, McLaughlin's influences from Indian music come to the fore a first time, it is another trademark piece that they would revisit multiple times.OnVital Transformationmy attention wavers a bit. It's sure an overwhelming piece again but the musical backbone isn't as solid and inspired as it would become on later albums.The Dance Of Mayais a lot better. Actually I think it must have been Robert Fripp doing the opening picking here. Easy to see what he was listening to in 1971. The complex time signature and chromatic chords would become a King Crimson staple in the ensuing years.You Know You Knowcontinues on the main chord progression ofThe Dance Of Maya. The piece brings a welcome rest point, leaving a bit of room for the other musicians. Not really a trademark McLaughnin approach I'd say...Based on the quality alone I have to rate this debut with 3 stars, but due to the pioneering influence an extra star might be considered."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Thursday, December 24, 2009",
      "rating": 3,
      "text": "Taking on the Mahavishnu Orchestra is a tough challenge-- because they're so damn good. However, their instrumental experimentation, intenstiy, and abstract style make them a challenge to connect with; they're very much a \"jazz man's\" band, and unless sitting through multiple listens to disect time signatures and key changes, or the virtuosity behind a noisy solo appeals to you, \"Inner Mounting Flame\" may be over your head.As a casual fan of fusion, I find \"Inner Mouting Flame\" almost too much. It's noisy, aggressive, and very free-form (not to mention very dated in its production). This clinical feel comes across as being very self-serving, and unless one is into chaotic-sounding music than I advise to listen with caution. It might make you feel smarter when listening, or make you feel frustrated waiting for something memorable to identify with.For those newly investigating the fusion genre, I heartily encourage sticking to the much more intelligible and classy Return to Forever; however, any fusion journey will inevitably lead the listener here to \"Inner Mounting Flame\"-- the complex and cerebral highlight of the genre.Songwriting: 3 Instrumental Performances: 4 Lyrics/Vocals: NA Style/Emotion/Replay: 2"
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Tuesday, July 6, 2010",
      "rating": 4,
      "text": "I might as well come out and say that I consider myself somewhat of a Mahavishnu Orchestra fan which also means that they tend to hijack the top position among the three Jazz Rock/Fusion giants of the 70's any day of the week for me.Inner Mounting Flamewas my second exploration of this now renowned quintet and at first it felt slightly disappointed which most definitely had more to do with the effect thatBirds Of Firehad on me than any fault of this material.Anyone claiming that John McLaughlin's writing and performing style is the key factor that determines whether you'll enjoy Mahavishnu Orchestra or not would be completely right. It might come as a complete surprise, to anyone who has read my previous reviews, that I happen to enjoy his style immensely which has been somewhat of a mystery even to me due to my dislike of other guitar virtuosos like Al Di Meola and Allan Holdsworth. I guess that the key difference to me is the way these artists go about in displaying their skill but I'll save you this in-depth analysis for my later reviews. As for now, let's get to what this debut album's material actually has to offer!The album starts with a grand scale intro that must have been quite daring at the time but as soon as the first sounds of the guitar/violin/drums kick in we immediately see that the band have the chops to back it up and the rest ofMeeting Of The Spiritskeeps up this tendency in quite a grand fashion.Dawnpicks up where its predecessor left off even if the first minutes of the buildup might give a different intuition as of how this composition will evolve.Noonward Raceis the first real groovy jam moment with all the members showing off their chops. This type of loose styled improvisation is probably the key to why I can't actually truly enjoy any of the Jazz Rock/Fusion recordings. Still it's far from the worst cases of jamming that I've experienced and, if in right mood, I can even appreciate the effort.A Lotus On Irish Streamsreturns the band to what makes them great with this beautiful low-key instrumental showing great attention to detail and mood of the overall sound. These moments of bliss are then rudely abrupted by another jam composition. UnlikeNoonward Racebefore it,Vital Transformationstarts off in an excellent fashion but soon becomes just a dull soloing number for John McLaughlin. LuckilyThe Dance Of Mayaadds an almost Crimsonesque touch to Mahavishnu Orchestra that later King Crimson compositions will become known for (only with the much heavier sounding guitars).You Know You Knowis another nice low key moment that doesn't really result in anything too noteworthy but instead paves the way for the weirdly out-of-placeAwakeningwhich to me sounds almost like a Samla Mammas Manna track from that same era. As always, it's nice seeing Mahavishnu Orchestra branching out and revealing more of their true potential with this performance.Even if my original response to this album was lukewarm at best it was only a matter of time before the material would settle in and reveal the subtile undertones that I failed to gasp upon my first visits.Inner Mounting Flameis well worth experiencing if you want to get a better understanding for the band that createdBirds Of Fireor the Jazz Rock/Fusion in general.***** star songs: Meeting Of The Spirits (6:52) Dawn (5:10)**** star songs: Noonward Race (6:28) A Lotus On Irish Streams (5:39) The Dance Of Maya (7:16) You Know You Know (5:07) Awakening (3:32)*** star songs: Vital Transformation (6:16)"
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Thursday, July 15, 2010",
      "rating": 5,
      "text": "After Miles Davis popularized jazz rock fusion in the jazz world withBitches Brew(no, he didn't invent fusion), it was anything goes for the rock inspired jazz musican. And anything went.Davis' band alumni John McLaughlin and Billy Cobham, along with keyboardist Jan Hammer, violinist Jerry Goodman and bassist Rick Laird formed the Mahavishnu Orchestra, creating a new form of tight, technical and powerful fusion, that rivaled the music of the best of the prog bands of 1971. It's hard to think that other great bands, like Return To Forever or Brand X, would exist without this group paving the way.Right from the start, this album blew away the listener with fast and furious compositions and performances. Even the slower songs, which give you a few moments to catch your breath, are wonderfully inventive.Almost three decades after it's release, I still play this album frequently."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Monday, November 29, 2010",
      "rating": 5,
      "text": "Breathtaking. Startling. Groundbreaking. Exhausting. I have resisted putting a review to pen (or computer) for this album because it is such an important album for the history and progress of progressive rock music. Despite the fact that John McLaughlin had introduced this new raw, full-volume shredding sound and style to the world with the previous year's release of his Devotion album (with drummer Buddy Miles, bassist Billy Rich, and organist Larry Young), it the lineup of crack virtuosi of this Mahavishnu Orchestra to express the team approach to explosive machine gun riff deliveries--both solo and collectively. And wow! Are these guys explosive! All five of them capable of rattling off rounds at clips that boggle the mind! And yet, amazingly, they also manage to incorporate and express melody and structure! Though the sound quality here is not yet where I like it to be (that will be better displayed on Birds of Fire), the gross effect of increased talent on display here is so far beyond what has come before. It's something totally new for jazz, jazz-fusion, rock and roll, and, most certainly, progressive rock music. I want to rate this with the highest amount of stars but it is, in my opinion, still an expression of a band just finding its way. It'll take the next album to express total superlatives. Still, this is a minor masterpiece and, so, still deserving of five stars. Thank god for Jimi Hendrix, Tony Williams, Miles Davis, and Indian music for giving Mahavishnu John McLaughlin the inspiration to create the Mahavishnu Orchestra!1. \"Meeting Of The Spirits\" (6:52) Has there ever been a more mind-blowing opening song in history? Billy Cobham and John McLaughlin are, of course, the most impressive over the first three and a half minutes, but then in the softer sections you get to figure out that there are many times in which multiple instruments are carrying those lightning-speed melody lines all at the same time! (A phenomenon that the band build upon on their next album.) (14/15)2. \"Dawn\" (5:10) this soft rather sedating start is in such a polar contrast to the whole vibe and energy of the previous song that it might leave some asking whether or not this is the same band! But then in the second minute some of the instrumentalists up front begin to express themselves through light-speed runs even getting Billy and Rick involved by the second half of the third minute. Jan, Jerry, and John are the main soloists up front but Billy Cobham's drum fills and cymbal play are often just as astonishing and competitive. Cool chord progression of whole-band arpeggi in the final minute. (8.875/10)3. \"Noonward Race\" (6:28) a song that is very much in line with those of the JIMI HENDRIX EXPERIENCE--both in pacing, bluesy flavor, and fireworks. Jerry's distorted violin sound used during his extended solo in the second minute is interesting--and then to be followed by a similarly processed Fender Rhodes from Jan Hammer in the third makes for quite an interesting consistency. John's electric guitar, then, is almost \"normal\" sounding during his following solo. The turn-taking solos are impressive but it's the three-, four-, and five-in-one displays of speed and dexterity that I find most astonishing and ground-breaking (though I guess in the context of an orchestra or big band there is nothing really new or innovative there; it's more of this use in rock 'n' roll, I guess). (8.75/10)4. \"A Lotus On Irish Streams\" (5:39) the acoustic side of the band: sweeping piano arpeggi and runs with flighty violin notes and astonishing flourishes from the steel-string guitar makes for an impressive expression of the trio format. Jan's play previews Rainer Br�ninghaus' play with Eberhard Weber, John's guitar previews that which he expands upon with Shakti, and Jerry's violin sounds like a cross between Ralph Vaughan Williams' \"Lark Ascending\" and Stephane Grappelli. Very beautiful. A perfect masterpiece. (10/10)5. \"Vital Transformation\" (6:16) a high-energy showpiece for the virtuosity of everyone in the band but Billy Cobham first and foremost. Here is where you get to hear more of those extraordinary passages in which the whole band is ripping through the space-time continuum at speeds that don't seem possible. It's no wonder that drummer Steve Smith chose this song title for the name of his jazz-fusion band in the 1980s. I find myself most drawn to the performances of Billy and John on this one. (9/10)6. \"The Dance Of Maya\" (7:17) a meditative start in which the band plays with an awesome chord sequence. A song that must have had a huge influence on Robert Fripp for the evolution/progression of his King Crimson project from the The Court of the Crimson King, Wake of Poseidon, Lizard, and Islands phase into Lark's Tongues, Starless, and Red. I've always hated the dramatic downshift at 2:33 into the two-chord blues motif--and the fact that they abandon the cool experimentation with chord progressions until the very end (where they do do the cool thing with interplaying/overlaying the chord progression motif over the blues chords. Also, I'm not much of a fan of the Clapton-style blues-wah-pedal guitar lead that John uses throughout the last five minutes of the song. (13.25/15)7. \"You Know, You Know\" (5:07) another �tude of chord progression possibilities, this time done slowly and with minimalist input and plenty of space. Billy Cobham is the only one to really try to break out of the restriction zone but not until the final minute though Jan Hammer's Fender Rhodes seems to send out probes in the third minute. Kind of a cool song! (8.875/10)8. \"Awakening\" (3:32) another high-powered display of machine-gun declarations of force and vitality--in fact, these are probably the most impressive displays of the virtuosity and dexterity of each and every one of the five individuals gathered together to make the Mahavishnu Orchestra. Not only impressive but jaw-dropping. Too bad it's lacking in any kind of engaging melody but I think they were banking on impressing their audiences more than expressing any kind of timeless beauty (though, of course, there is a kind of beauty in virtuosity). (9/10)Total Time: 46:34A-/five stars; a minor masterpiece of music but an major landmark in the course of music history: the album that made Jazz-Rock Fusion and instrumental virtuosity in rock 'n' roll household terms."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Tuesday, July 19, 2011",
      "rating": 5,
      "text": "One of the first of what I think of as the \"second wave\" of fusion bands - those designed from the ground up to be fusion acts, rather than evolving into a fusion style like Miles Davis's band or the Mothers of Invention did in the 1960s - the Mahavishnu Orchestra are probably best known for this classic album, on which for most of the time they play a fast, loud, and heavy brand of fusion.From the dark, foreboding eruption that commences the opening track to the end, this is a true triumph for every musician involved. John McLaughlin plays incredibly fast and complex lead guitar, showing both the craft he'd learned in fusion works by Miles Davis and Tony Williams and the influence of other artists working in the same vein - in parts, for example, I can hear a strong influence from Frank Zappa's celebrated guitar solos on Hot Rats. The rhythm section of Rick Laird and Billy Cobham do an admirable job of both keeping up and keeping their hand in the game, Cobham's drums in particular being a forceful and complex treat in their own right. Jan Hammer's keyboard textures and Jerry Goodman's violin complete the picture; a particularly good piece for them is A Lotus on Irish Streams, a rare moment of calm, reflection and beauty in the middle of the fury which is a showcase both for Hammer's piano lines (which at points recall more classic jazz styles) and Goodman's plaintive violin work.A true cornerstone of the fusion scene, and a key work not just in the discography of group leader John McLaughlin but of every member of the band, The Inner Mounting Flame deserves nothing less than five stars - in fact, I'd say it earns each of those stars twice over."
    },
    {
      "reviewer": "tszirmay",
      "date": "Posted Sunday, June 24, 2012",
      "rating": 4,
      "text": "Here is a fine example of what really defines the term progressive! By 1969, the musical world was still blues-rock based, short poppy tunes aimed at the dance floor or the airwaves and generally comprised guitar, bass, drums and organ with a strong focus on vocals. With the advent of new technology (synthesizers) and the introduction of old school instruments (violin, sax) played by serious and young music students who were attracted by the counterculture (yes, sex, drugs and rock 'n roll), the sonic universe leapt mightily forward, progressing towards new unattained horizons. This is where the term 'progressive rock' came from (sorry, had to state it!).With a gifted and original guitarist such as Englishman John MacLaughlin , a masterful genius of technique and tone, a muscular drummer in Billy Cobham from Panama , keyboard whiz and Czech refugee Jan Hammer , master American violinist Jerry Goodman and bassist Rick Laird from Dublin, Eire , this Mahavishnu Orchestra simply devastated that nascent scene with sheer bombastic virtuosity and uncommon flair. They remain arguably one of the pioneering bands of the new rock movement, blurring the line between Rock, Jazz, Pop and creating what is now universally known as 'fusion'. Not surprising that Carlos Santana would unite with MacLaughlin, as the Chicano fretmeister would soon espouse the teachings of guru Sri Chinmoy and search for the 'Emerald Beyond'!This monumental recording was the first installment of a series of colossal Mahavishnu Orchestra recordings (Birds of Fire and Visions of the Emerald Beyond are of course legendary) and sounds as devastating in 2012 as it did in 1971 when it took the world by storm. I remember the shock and awe of its appearance on turntables and the blizzard effect it had on young impressionable music fans. One word = disbelief!No time is wasted on pretty intros, 'Meeting of the Spirits' has that same wondrous feel that permeated Santana's Caravanserai, slithering carpets of synths and polyrhythmic drum jubilation that lay the foundation for John to flutter over his electric guitar, the violin in tow. Hammer's e-piano revels in the mid-section showing clearly that he is no electronics-only wizard, as he is shamelessly playing tag with Goodman's screeching instrument. The precious fragility of 'Dawn' is there to behold, a dreamy and elegant instrumental lament that conjures images of an awakening sun, soon to be bold. At the time, no one outside of Hendrix played such a dizzying style of e-guitar, blessed with demonic speed and insane diversity that pioneered more than a few future maestros. Precious loveliness.'Noonward Race' is just like the title implies a speed freak jam with frantic and exalted soloing from Goodman, Hammer and the Mac himself. All of course delivered at Indy 500 velocity and Swiss timing precision. Cobham is a whirling drum dervish, using his Gatling gun technique to devastating effect, as he did throughout his MO career.'A Lotus on Irish Streams' is a serene Chinmoy (pun) reprieve, gently bucolic, pastoral and aromatic. Mac prefers using his acoustic talents with the violin coasting its slithering beauty amid the pooling piano rivulets. Meditative and ponderous.Things get scorching and sweaty again with the forceful 'Vital Transformation', where loopy pyrotechnics are propelled monstrously by skillful drumming and careening guitars, all at quasi-supersonic speeds. The musical definition of delirium if I ever heard one! I could only imagine the shock when listeners first hooked up with this vortex of bewilderment!'The Dance of the Maya' releases an electrified slinky riff that suggests both historical doom and dense vegetation, furious guitar clanging entwined with agonizing violin that suddenly erupts into a bluesy e-piano led funk. Cobham bashes away in an unusual sweaty manner, cymbals ablaze whilst John's guitar races wildly within a lightning blitzed furrow that addresses both the past and the future brilliantly. Relentless, obsessive and utterly manic.My fave 'You Know, You Know' is obscurely remote and suave, groovy e-piano, shuffling drums and a repetitive bass figure set the tone for a slow-developing MacLaughlin scratch that veers on the sublime, a sensational and original moody jam that thrills in its lack of blistering notes.The teetering between tame and wild continues with a preposterously boisterous finale that will wake you up by its sheer maximum velocity and artistic dexterity. The musicians demonstrate true jazz tendencies, each creating their own sonic bubble and when called upon, stellar on-a-dime interplay. John unleashes a blazing solo that defies logic in time and space and Cobham turbocharges ahead like some percussive locomotive.Scary stuff that will develop into two future masterpieces.4 clandestine flares"
    },
    {
      "reviewer": "Modrigue",
      "date": "Posted Tuesday, August 23, 2016",
      "rating": 4,
      "text": "The primal flame to really fused jazz and rock?4.5 starsThis is perhaps what a volcanic eruption may sound like...First effort of one of the big 3 fusion bands of the 70's, with WEATHER REPORT and RETURN TO FOREVER, \"The Inner Mounting Flame\" can be considered as the first record to genuinely combine the raw fury of hard rock with free unconstrained jazz. Of course, funk, jazzy rock or jazz incorporating rock elements have already been heard since the end of the 60's, but I cannot think any other artist went so far in this fusion of genres before. Compared to pioneering records such as Miles Davis' \"In a Silent Way\" or Frank Zappa's \"Hot Rats\", \"The Inner Mounting Flame\" marks a clear evolution. This debut album is a pure magma, an acoustic and electric maelstrom sculpting heavy musical mantras inside mountains. Jazz, rock, blues and Indian ragas find themselves melted together to fuel an unique loud, rapid and mystical fire, with multiple uncommon time signatures and complex rhythms.Like most line-ups from this time period, MAHAVISHNU ORCHESTRA's members are all virtuosi in their respective instrument and form a true dream-team: incredible guitarist John McLaughlin, who just spent 2 years at Miles Davis' school to record no less than pioneering albums, organist Jan Hammer, who will later compose Miami Vice theme, whirlwinding violinist Jerry Goodman, bassist Rick Laird and extraordinary drummer Billy Cobham. The fast and spiritual aspects of the music is logical when you know John McLaughlin was the only composer as well as a disciple of the Indian guru Sri Chinmoy. That's certainly where these stylistic choices come from.The disc opens with the incandescent \"Meeting Of The Spirits\". Violin and drum explodes in a lava of burning guitars. Wow! After all this condensed fury, \"Dawn\" arrives as a welcomed spacey pause. A calm beautiful jazzy and bluesy kind of ballad. Then appears the raging \"Noonward Race\". This high-speed delirium jazzy hard-rock can stand for an overboosted jam. In contrast, \"A Lotus On Irish Streams\" is the perfect soundtrack to wander barefoot in peaceful hanging gardens. A bit mystical and dominated by Jan Hammer's relaxing keyboard textures, this track is a delicate and soothing passage.Back to life with \"Vital Transformation\", maybe the hottest and grooviest composition of the album. Not really sounding like an ancient Center American ritual, \"The Dance Of Maya\" starts with a dark oppressive pattern. This first half tends to become a little repetitive though. Then it surprisingly mutates into a heavy blues-rock! The slow desert jam \"You Know, You Know\" is enjoyable, nonetheless not varied enough. The record finishes in fireworks with its wildest track, \"Awakening\". A thundering and breathtaking piece, fast-paced, with multiple breaks and corrosive moments. Guitar, bass, violin, keyboards, drums, each musician displays his virtuosity here!As the debut opus of a legendary band, \"The Inner Mounting Flame\" was already, and still remains nowadays, a true sonic blast, stunning and innovative. Such an advanced mixture of hard rock with complex time signatures in the improvisational jazz mold was never heard at the dawn of the 70's.Simply an essential listen for anyone interested in fusion music. Not the most accessible MAHAVISHNU ORCHESTRA offering, but undoubtedly their rawest!"
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Friday, April 13, 2018",
      "rating": 5,
      "text": "As the free love 60s ceded into the 70s, the party was seemingly over as the blues based rock'n'roll turned psychedelic art rock scene was reeling from the deaths of some of the greats of the era. The year 1970 saw the untimely deaths of Janis Joplin and Jimi Hendrix as well as the beloved Beatles calling it quits after a decade long reign after they continuously upped the ante by reinventing rock music. Once again, the very next year of 1971 saw the similar fate of Jim Morrison of the Doors meeting his untimely demise and it seemed that the boldest and brightest stars in the biz had been snuffed out or were calling it quits. The time was ripe for a new era in the evolution of the rock paradigm and British born John McLaughlin was up to the lofty task of assembling one of the most ambitious collaborative efforts in the contemporary fertile cross-pollination of the disparate worlds of jazz and rock. While carefully taking notes under the tutelage of the greats such as Tony Williams in Lifetime and Miles Davis on such classics such as \"In A Silent Way\" and \"Bitches Brew,\" McLaughlin set out to find the perfect ensemble of extraordinary musicians to bring his musical visions into fruition.The search was on and in the end McLaughlin cemented his dream lineup of a truly international cast of characters. The whole vision came together as a quintet that included a violinist, bassist, guitarist, keyboardist and an extraordinarily strong drummer. McLaughlin, of course, had the guitar parts covered (making his famous double necked guitar his signature feature) but when it came to a dazzling virtuosic percussionist, his first gaze was fixed on the inimitable Panama born Billy Cobham who worked with McLaughlin in various Miles Davis sessions. The next slot to fill was the role of violinist-in-chief. Originally slated for the great Jean Luc-Ponty, the idea was scrapped due to immigration issues which prevented him from coming to the US where the band was founded (Queens, NYC to be exact.) This led to some investigation work and after listening to some contemporary violin based artists, the final decision was to ask Jerry Goodman of The Flock who turned out to be the only USAmerican of the team. He accepted. Next up, the Czechoslovakian extraordinaire Jan Hammer was a suggestion of Miroslav Vitous (from Weather Report) for keyboardist that panned out and and the final slot of bassist was awarded to Irish Rick Laird who had been an acquaintance of McLaughlin back in England who fit the bill perfectly.After a complete lineup of top notch talent, McLaughlin chose the name MAHAVISHNU ORCHESTRA after a name he attained with his studies with his spiritual guru Sri Chinmoy. Right from the getgo the band was a huge hit even at their very first appearance at the Greenwich nightclub \"Gaslight At The Go-Go\" and soon would release their debut album THE INNER MOUNTING FLAME which found instant popularity and even charted the Billboard charts. In no time at all, MAHAVISHNU ORCHESTRA became a hugely successful popular live act performing a grueling schedule and receiving critical acclaim for their unique fusion of disparate musical styles. Their sound encompassed a heavy rock infused energy ushered in by the likes of Jimi Hendrix and other late 60s heavy rock acts with intricate complex jazz compositions infused with Western classical and Indian classical elements. The band was notable for engaging in frenetic virtuosic performances in perfect unison and the ability to effortlessly transfer into calm bucolic passages, funk dominated rhythms and even basic blues only in unorthodox 7/4 time signatures. This was a band where everyone was the highest caliber of their respective instruments and one of the few examples of a band where five virtuosos shined equally. A true supergroup before most were household names.MAHAVISHNU ORCHESTRA was revolutionary in the maturity of their sound. While the 60s were ratcheting up the complexity in the rock paradigm with such monumental albums as \"Sgt. Pepper's Lonely Hearts Club Band\" by the Beatles and the birth of progressive rock and jazz-rock fusion, this group took all the maturing elements and crafted a fully ripened musical style that unlike many of their contemporaries married the youthful energetic flair of rock music without sacrificing the intricate compositional sophistication of jazz and Western classical music. The overtones of Eastern ethnic influences added yet one more layer of compositional genius to their overall approach and the gypsy folk aspects of Goodman's violin performances cemented this unique group as one of the most innovative of the ages. The band had achieved in retrospect the perfect marriage of the contemporary styles of music with each representation: jazz, rock, folk, classical and ethnic each receiving an equivalent heft in the mix with the musicians exuding lightning fast finger melting prowess accompanied by Cobham delivering some of the most intricately complex and comprehensive percussive attacks unmatched until the advent of the most extreme forms of metal music. In fact i would surmise that MAHAVISHNU ORCHESTRA was just as essential in the development of metal music. Whereas Black Sabbath created the primeval darkness and distorted tritone features and Deep Purple and Led Zeppelin the compositional flair, it was this band that unleashed the full primal energetic fury that most music was lacking during the era.As THE INNER MOUNTING FLAME begins with its very first moments, it is clear that this is a band unlike any others with members steeped in a multitude of influences and able to latch onto each other's irregularities and complex interchanges like a seasoned flock of birds in unison traversing the vastness of the atmosphere above. The appropriately titled opening track \"Meeting Of The Spirits\" displays the band in full unifying prowess as guitar, bass, keys, violin and drums all take turns in the spotlight and stepping out of the limelight at the appropriate moment for a satisfying melodic tradeoff steeped in complex time signature deviations like true jazz masters in a heavy rock infused context that without warning can cede to calm smooth jazz passages before erupting into pyroclastic volcanic eruptions of sound. The album is incredibly well paced as well as not to overwhelm and enervate the listener with its frenetic heaviness. The tracks \"Dawn,\" \"A Lotus On Irish Streams\" and \"Dance Of Maya\" contain significant sections of calm bucolic contemplative although heavier sections wrest control away ultimately. The general methodology of track placement finds the heavy tracks followed by the slow and dreamy ones until the final track \"Awakening\" ups the intensity and creates not only one of the most insanely intense tracks on the album but perhaps of the entire early 70s with an insanely electric violin leading the pack that tracks off with drum rolls, keyboard outbreaks, adrenalized bass lines along with McLaughlin's signature guitar fret melting technical wizardry.MAHAVISHNU ORCHESTRA was one of the rare musical entities of the era that not only conjured up highly innovating and uncompromising compositions performed in the most unhinged and eclectic fashion but they also achieved rock star status with sold out venues, a record deal with Columbia Records and were loved by both the music loving public and critics alike. The convening of kindred spirits was the lightning bolt of creative energy that the music industry needed at the time and helped bring the progressive rock fusion scene to the forefront allowing other musicians to exercise new musical freedom tamped down by commercial interests. While the pressures of instant success and fame would take their toll on the five members in just a few short years, on their debut THE INNER MOUNTING FLAME, the band had already struck gold by culminating the various strains of rock, jazz and folk from the 60s while retaining the elements of funk and blues. Another aspect of the latter half of the 60s was the spiritual quest to seek out a guru with India becoming the destination of choice and McLaughlin's involvement with Sri Chinmoy inspired the ethnic influences which added yet another layer of sophistication in the mix. Personally i probably prefer the followup \"Birds Of Fire\" just a tad over this debut but there is no doubt that the debut by MAHAVISHNU ORCHESTRA remains one of most amazing amalgamations of musical mastery in the entire rock / jazz fusion paradigm and is one of those rare albums i never tire of. A true masterpiece of all ages."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album1dbc.html",
  "last_parsed": "2025-05-18T00:11:13.399387"
}