{
  "album_title": "SECOND LIFE SYNDROME",
  "artist_name": "Riverside",
  "artist_page_link_local": "artist2753.html?id=1287",
  "year": 2005,
  "rating_value": 4.25,
  "rating_count": null,
  "review_count": null,
  "genre": "Progressive Metal",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/1287/cover_47181915102011_r.JPG",
  "tracks": [
    {
      "number": 1,
      "title": "After",
      "duration": "3:31",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Volte-Face",
      "duration": "8:40",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Conceiving You",
      "duration": "3:39",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Second Life Syndrome",
      "duration": "15:40",
      "is_sub_track": false
    },
    {
      "number": "a",
      "title": "Part One - From Hand to Mouth",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "b",
      "title": "Part Two - Secret Exhibition",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "c",
      "title": "Part Three - Vicious Ritual (instrumental)",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 5,
      "title": "Artificial Smile",
      "duration": "5:27",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "I Turned You Down",
      "duration": "4:34",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Reality Dream III",
      "duration": "5:01",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Dance with the Shadow",
      "duration": "11:38",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Before",
      "duration": "5:23",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "TRoTZ",
      "date": "Posted Wednesday, October 26, 2005",
      "rating": 4,
      "text": "In the second studio album RIVERSIDE don't disappoint and truly stablish themselves in the progressive metal genre. Though not transforming radicaly, their sound went through a different direction. If they, in the first album, created a sort of hybrid of PINK FLOYD, PORCUPINE TREE and some DEATH METAL, in \"Second Life Syndrome\" they pushed a bit more the metal vein and joined some TOOL inspiration, so that the sound became darker and a bit heavier and quicker in some parts. That does not mean floydian style is not present in the album, by the contrary. RIVERSIDE continues their \"PINK FLOYD metal sound\", somewhay different from (almost all) the other \"dream theater\" progressive metal bands. The techique is used for the sake of feelings, and not used for the sake of techique by itself.The album was well conceived, once more a concept album, very pleasant to listen, showing very inspired band members. The album starts beautifully in a melancolic mood with african chorus style \"after\". \"Volte-face\" then presents truly the main sound of the album, starting with some heavy catchy riffs, then progressing into an floydian atmospheric mood with catchy solo guitar before ending again in an heavier mood. \"Conceiving You\" and \"I Turn You Down\" are the mellower songs, combining the more tradicional rock-song format with metal-floydian guitar work. \"Second Life Syndrome\" may be the best of the album, adding some more inspired metal/ambiential transitions. \"Artificial Smile\" approaches to classic rock like \"Shallow\" does in PORCUPINE TREE's \"Deadwing\" but more complexed. The more metal of the badge may be \"Dance With The Shadow\", with heavy dark keyboards remembering PORCUPINE TREE's \"Deadwing\" in some parts, fused with some TOOL basslines. The album ends with the post-rock \"Before\".Very inspired album in a particular sound RIVERSIDE created. The complex and catchy death metal guitar riffs and the nice and beautifull guitar solos combine to create a superb sound. The only rowback of the album, for me, is not having acoustic guitar."
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Friday, November 4, 2005",
      "rating": 5,
      "text": "At about half a year ago I did an interview with this Polish progrock sensation and one of my burning questions was \"What are your main influences?\". Well, I expected some bands but their simple but striking answer was \"our emotions\"....an almost perfect description of this new album! I read the previous reviews and have to say that to me it sounds as an insult to call this new Riverside album a progmetal album because Riverside has so much more to offer. OK, the great vocals contain grunchy elements and the guitar riffs and runs have some metal overtones. But in general Riverside makes dynamic and alternating progressive rock with one key element: EMOTION, from the mellow and melancholical climates (wonderful vocals) to the compelling Gilmourian-drenched progrock atmospheres and exciting bombastic and harder-edged parts with those grunchy vocals and heavy guitarplay. The colouring of the compositions with the keyboards is amazing, so tasteful and varied, from tender piano and soaring strings to sumptuous organ floods and some spectacular synthesizer soundsTHIS BAND IS A SENSATION, WHAT A STUNNING ALBUM!!"
    },
    {
      "reviewer": "Tristan Mulders",
      "date": "Posted Wednesday, November 16, 2005",
      "rating": 4,
      "text": "Riverside - Second Life SyndromeFirst of all, this has got to be one of my favourite releases of 2005. Maybe even my favourite of the year so far! When I heard the news about the band recording new material I was really curious about whether it was equally good as the songs on their debut album. So when it was released a couple of weeks ago I could not wait any longer and bought it the instant it was available.Well, did it live up to the expectations created by the former \"Out of myself\" album? Let me put it this way: I don't know why I was even worried about them not being able to impress me another time in the first place; from the second I listened to this album I noticed I was listening to yet another talented album by a very talented band.Sure, you can compare the music on this disc to other bands in the genre (Porcupine Tree, Pain of Salvation and Anathema come to mind as the most typical influences), but what is most remarkable is that emotions are expressed through the mood of the music and the way the lyrics are sung. This album has it all: fear, sorrow, rage. Those three words might well sum up the ideal vibe on this album. This is not your typical progressive metal album, it is more \"symphonic.\" Symphonic in a way that it grows on you with each listening and that there are so many different sections that fluently collide. Furthermore, the music is not foremost technically. There are quite complex parts sometimes, but it is not made to show of the musicians' skills, but to create a certain atmosphere, which works very well; it helps to understand the music better.What amazed me most about this album is that the overall mood is darker than on the previous \"Out of myself\" album. It all starts of with some muted whispered vocals before haunting percussion takes over together with some dreamy vocals. But not only here, it is in almost every song that the overall vibe is dark and haunting! This does not mean that every song is depressing, not at all, I really like this ambience, as mentioned earlier on, it really helps the songs to reach a higher level!If compared to the \"Out of myself\" album, one might say that this album is more on the heavy side, but this metal approach fits perfectly for the songs. But if that might scare you of a little, don't worry, despite the more heavy approach the music still features what Riverside is so adored for: nice guitar solos, beautiful keyboard layers, well played bass guitar (Mixed in a way that you can hear it as a solo instrument, instead of a part of the rhythmic section. Quite remarkable!), drum patterns that might not get your attention at first, but when you keep an ear open for it you can notice what a talented drummer this band has and last but certainly not the least: highly emotional, sometimes a bit raw, vocals.To conclude this one can only tell that this album is an experience, an experience that you have to discover for yourself."
    },
    {
      "reviewer": "Marc Baum",
      "date": "Posted Monday, November 21, 2005",
      "rating": 5,
      "text": "Wow! What a beautiful piece of work by Riverside, I must say I am hooked. 2005 is in any sense the best year for progressive music since long. After so many good, some of them even great records there comes the next, maybe final great album of prog this year.These progressive rock hopefuls are in any sense a sensation. I really enjoy the warm, beautiful and harmful voice of Mariusz Duda very much. He sounds never too theatralic, his vocals are all about emotion, what he shows in the wonderful single \"Conceiving You\", the orientalic \"Volte Face\" or the crowning title piece, which marks the big highlight and appears as the central heart of the album. How can you describe the sound of Riverside on \"Second Life Syndrome\" at best? Well, the strong Pink Floyd influence of the debut album is still in place, but this album has more edges. Where \"Out Of Myself\" could be considered as a \"new art rock\" record, shows the new album the heavier side of the band. Progressive Metal parts appear in some passages, but that in a healthy reduced form. The lead guitars are absolutely shining and remind in some parts on David Gilmour from the \"Wish You Were Here\" period, which not few prog bands bring on today (see Dream Theater etc.). The production comes very well outbalanced, so that you can hear any single detail in a nice way. Where the singer holds back his aggressions on the debut, he now has some real moments on this album, where he shouts closely like a death metal monster in some few parts, which sounds nowhere as misplaced, it fits to the dark mood of the concept. Not the most happy listen for sure, but a experience of intensity and deepness, music for the mind. I want to repeat that there are some clear metal parts on this album, but the progressive rock element is still the dominant in the sound of Riverside, so don't call this band a prog metal band, because this would be a failure.\"Second Life Syndrome\" is the second part of a trilogy, so we can look forward to the third part, which probably will come next year. I mean, they really set one up to the debut with \"Second Life Syndrome\", the music is deeper and more complex. I have some problems to believe that this band can top this album with their third record, or even can keep it on the same level. If they can top this, they are the new kings of prog music of our time, enough said.I consider \"Second Life Syndrome\" a real sign of hope in today's progressive rock, which I never thought will come out of the East. This Polish band is the biggest surprise of prog since many years. They show that the East also has a lot of potential for the future time to come. All those, who believe in progressive rock to find the way into the future, which also can stand the test of time, are highly recommended to listen to this. Specially Pink Floyd and Porcupine Tree fans should also spend some time on this little gem. You won't be disappointed I am sure. Cheers!9/10 points = 92 % on MPV scale = 5/5 starspoint-system: 0 - 3 points = 1 star / 3.5 - 5.5 points = 2 stars / 6 - 7 points = 3 stars / 7.5 - 8.5 points = 4 stars / 9 - 10 points = 5 starsEssential: a masterpiece of progressive music"
    },
    {
      "reviewer": "semismart",
      "date": "Posted Saturday, November 26, 2005",
      "rating": 5,
      "text": "I ask you! Have you ever witnessed a band, who after releasing a monumental debut album, that had garnered widespread praise and universal acclimation, actually top that album with their second effort. I'm not saying it hasn't happened but I can't recall if is has, until now. I have listened toRiverside'sbrand new releaseSecond Life Syndromefor a week now, probably some two dozen spins and I have come up with one inescapable conclusion.Second Life Syndromenot only surpasses their remarkable debut,Out of Myself: but it ranks with the all time giants of progressive metal like,Dream Theater's, Images and Words and Awake, orGreen Carnation's, Light of Day, Day of Darkness.Forget theOpeth, Porcupine Tree,andAnathemacomparisons, I made in my review, about their first disc,Out of Myself. Second Life Syndromenot only eclipses it, but it also insinuates a raw newRiversidedirection that, shows the band evolving into a shadowy musical realm, while expanding the creative nucleus of their debut album.RiversideWhat are we talking about here? We're talking about a group of talented Poles, who seem to be creating a new and different style of music and yet it isn't. It's fresh as a spring rain and yet it's dark and morbid:\"I can't take anymore, I can't breath, I'm sick of this goddamn darkness, sick of the sadness and the tears. I threw it all up every single day together with last nights dinner\"Take the best fromPink Floyd, Anathema, Porcupine TreeandPain of Salvationand you almost have something close but not quite. Their music runs the gamut from mellow and subtle to intense and powerful. Most of the album is delivered in a slow to slow medium ethereal tempo but picks up for overpowering crescendos. Most of the music is carried by whining guitars with excellent keyboards interjected perfectly to compliment the music. The vocals by bassist Mariusz Duda, who still reminds me of Opeth's Mikael Akerfeldt, though not inspired, are perfect for this melancholy music.Second Life Syndromeopens with \"After\", a slow moody, sing song number, which for somehow reminds me of a forty year old song, \"Born to be with You\" by the Chordettes, followed by a frenetic piece, \"Volte-Face\", Which has fast and somewhat discordant Middle Eastern feeling and some great keyboards. Track three, \"Conceiving You\", is an ethereal ballad.The title track, starting with a slow guitarPink Floydambiance, leads to a very long complex and varied number. \"Artificial Smile\" features a heavy bass and drum workout, finishing with manic screams. \"I Turned you Down\" is a rock style ballad that gradually picks up steam and \"Reality Dream III\" is a super instrumental. \"Dance with the Shadows\", another long one and most other reviewer's, I've read, favorite. The final track is \"Before\" is an ambient moody guitar and piano laden number.CONCLUSIONThe biggest mistake you can make, is blowing this band off because of where they are from. Believe me when I say, there is currently no better, progressive rock/metal band in America, Britain or anywhere else. There's no one out there, with more imaginative progressive music. No better ear for music, no better compositions, no better arrangements. In summary, the worse thing a progressive rock/metal fan can do is ignoreRiverside.Evidence of the imminent, popular ascension of this band comes from the fact that this album will now be released world wide by prestigiousInside Out Music. What do they know that you don't? I can't tout this album and the previous one enough. It's your move! 4.9 stars!"
    },
    {
      "reviewer": "belz",
      "date": "Posted Friday, December 30, 2005",
      "rating": 4,
      "text": "3.7/5.0I am not to much into prog-metal, especially with all those crappy neo-prog fake groups playing all the time the same I.Q.-style weak keyboards rhythm, etc. However, this album is very good, much more emotional as some people pointed out, with great melodies and good climax.Reality Dream III is one of my favorite song on this album. I wouldn't listen to this band any time at day or night (it is much more heavy than my liking) however I can say that this album is of great quality and I recognize and appreciate that.Certainly not a masterpiece, but worth listening to."
    },
    {
      "reviewer": "Kotro",
      "date": "Posted Monday, January 2, 2006",
      "rating": 4,
      "text": "I didn't believe in the concept of Progressive Metal until I heard this album. I didn't beleive it deserved a such a high position in the Top100 after I first heard it. I also didn't believe I would play it much, like all previous progressive metal I had listened too. Then one day, while discussing the best 2005 albums with some friends, I started hearingVolte-FaceandConceving Youin my head, and the question naturally popped out of my mouth: \"Have you heard Riverside?\". Returning home, I had to play it again. Is doesn't sound like Metal, and yet it is. Sometimes it doesn't even sound that Progressive, however it is. It is one of the best Progressive Rock albums I heard since Mostly Autumn's first three albums. I can't fully describe what worked for me, if the powerfull riffs turning into great solos or the discrete keyboard work turning into massive waves of sound. I do believe it could do without some of the \"death-metal\" vocals, but that isn't enough for the album to lose it's charm. That's right, what we have here is a Progressive METAL album with CHARM and substance. And I believe that's why it's so good."
    },
    {
      "reviewer": "Rivertree",
      "date": "Posted Wednesday, January 11, 2006",
      "rating": 5,
      "text": "A second syndrome ...'Out of myself' was a great debut by RIVERSIDE and they surprised me with the long tracks 'The same river'' and 'The curtain falls'. But it was possible: 'Second Life Syndrome' is even better and the band has reached maturity! Beginning with track 2 RIVERSIDE takes you on a trip through the whole progressive rock world. Every song combines in another way proportions of the Art Rock, Neo and Prog Metal subgenres.Volte-Faceseems to be a perfect transition from their debut.Conceiving youis an absolutely beautiful ballad. The song participates much in the progress around the EP 'Voices in my head' - improved vocals by Mariusz Duda and the ability to write excellent ballads. The title track can be seperated in three parts - a neoprogger with metal patches and a psychedelic/ambient middle section.Artificial smileis a song with more metal ingredients.I turned you downis nearly in the same vein as 'Conceiving you'.Reality dream IIIis the official transition from their debut - to me it sounds like a tribute to DREAM THEATER.Dance with shadowis similar to the title track until they reach the 'point of no return' - the end is absolutely great!Beforebegins as a part of 'Voice in my head' but develops to a reminiscence of the music from TOOL.This is a masterpiece - I wonder if there is any chance for an improvement."
    },
    {
      "reviewer": "FishyMonkey",
      "date": "Posted Monday, March 20, 2006",
      "rating": 5,
      "text": "Where the hell did this band come from? Sounding like a hybrid of Tool, Porcupine Tree and Dream Theater, this Polish band (a nation usually known for its excellent death metal bands like Behemoth, Vader and Decapitated) has quickly launched themselves into one of my favorite bands. I haven't been able to track down their debut yet, but, oh my, I plan on it.The members are all highly talented. The basslines are fitting, nothing spectacular, but they get the job done. Same goes for the drummer, very solid work, but nothing extraordinary. The guitarist, however, is extraodinary, and extremely fun to listen to. His pure prog metal solos reek of emotion and absolute precision in choosing notes. Lovely lovely stuff. The vocalist is the same way, whether he is screaming or singing lightly. All excellent, he's one of the best vocalists I've heard in a long time. The keyboards are played very well, and help richen the compositions greatly.Songwriting is next to perfect. Neither of the two epics get boring, and the shorter songs are of perfect length and structure. The album opens with After, whic his an excellent tribal-sounding opener with great vocals. It launches into Volte-Face, the most straight-forward song on the whole alubm. It's generally a rocker with some great vocals and screams. Nothing epic, but fun. Next is Conceiving You, which has a pretty piano line and some great guitar work. The thing that really makes this piece lovely is the vocal line, however, which is sung beautifully.Next is the first epic, the title track. Words cannot describe. The track flows perfectly from one section to the next, and I wouldn't be doing it justice to describe it. All I can say is that this is some of the best work I've heard in years. After is Artificial Smile, which is probably the heaviest track. It features some excellent screams from the vocalist and is real fun to listen to while singing/screaming along. After is I Turned You Down, which you can hear on this site for free, so no need to describe it. Wonderful track, though. Next is Reality Dream III, an instrumental with more heroic guitar work and all substance, no wankery. It is also a very beautiful piece.The next piece is the other epic, and is just about as good as the first one on the album. So I won't describe it, I'll just say, beauty. The closer has some beautiful vocals and concludes the album in a very satisfying way.What a beautiful album. This is everything I like for in music. Highly reccomended."
    },
    {
      "reviewer": "Zitro",
      "date": "Posted Wednesday, April 5, 2006",
      "rating": 4,
      "text": "4.2 StarsStronger than the debut in all ways you could think of. Coherence, sound quality, textures, musicianship, songwriting, vocals, creativity, etc. It is heavier than the debut, so if you can tolerate that, Im sure you'll find this one the superior one. I think that this album is better than any albums from Porcupine Tree I own.Afternot only is a great opener, but my favourite song from the band!!! Beginning with depressing whispers, the song turns into a hypnotic and complex orchestra of lamented wordless vocals and one taking the lead. A bit influenced by African music, but missing a lot of elements as well. The song ends with a melodic guitar solo playing with the wordless multi-layered singing.Volte Faceis another highlight. A wonderful space prog-metal that goes through a lot of changes. The vocalist screams a bit here, which was an element absent in the previous album.Conceiving Youis an effective ballad with very memorable melodies.Second Life Syndromeis a tour de Force with no filler at all. All the 15 minutes of it shine. It should be a prog rock classic and is almost as strong as something like Lateralus' title track and Shine on You Crazy Diamond. The instrumental break with a loud bass riff is one of the best parts in the album.Artificial Smileis a short rocker with some neat growls.I Turned You Downis a very well executed track that unfortunately sounds very much like a Porcupine Tree recording. It is still an amazing song.Reality Dream pt3is a very good dark instrumental with lots of changes like the previous 2 parts of the Reality Dream. My favourite is still the 2nd one, but this one is very good.Dance With The Shadowis an excellent extended track with all the elements of the band that makes the music so captivating and enjoyable. A typical Riverside song. Like the debut, Second Life Syndrome ends the album with a mellow track.Highlights: After, Volte-Face, Second Life Syndrome, I Turned You DownLet-Downs: N/AMy Grade : B+"
    },
    {
      "reviewer": "Tony Fisher",
      "date": "Posted Saturday, May 20, 2006",
      "rating": 5,
      "text": "Let's get one thing clear; I don't like prog metal much as a whole.For example, DT, Tool, Pain of Salvation are all highly talented musicians but their music does not really engage my emotions. This does, big time. They are excellent musicians, the rhythm section solid and interesting, the keyboards spacey and atmospheric and the lead guitarist quite exceptional; he sounds like Petrucci (for his technique) crossed with Andy Latimer (for his emotion and uncanny ability to choose notes and timing). The vocalist sings with passion, emotion and in a nice variety of moods.There's a dark, haunting feeling which pervades the album, even though the songs come in a variety of styles. At times they can sound like Floyd, at others DT, at others there's a whiff of world music. Are they derivative? Yes, but when they play music as good as this, who cares? Favourite track is I Turned you Down (it's the MP3 on the band site that was the first thing I heard and it's stuck!) but there is little to criticise. After 3 weeks listening I was going to classify this as a solid 4* album but repeated plays have convinced me. I didn't think I'd ever give a 5* rating for a prog metal band, but this is worth it. I'm off to get their debut too.Best thing to come out of Poland since Lech Walesa!"
    },
    {
      "reviewer": "Prog-jester",
      "date": "Posted Saturday, June 17, 2006",
      "rating": 4,
      "text": "Probably my favourite from 2005's releases,but soild 4 star album.Emotional,dark,greatly played and composed,but not the all-time masterpiece.These Polish guys just combined TOOL,OPETH,PORCUPINE TREE and played them in COLLAGE vein,so personally I consider them to be Neo-prog with great metallic side.The opening track is pure brilliance,I never heard something like that;\"Second Life Syndrome\",\"Artificial Smile\",\"Dance with the Shadow\" and \"Before\" are also have to mentioned as the best tracks. Highly recommended to all prog-metal/neo-prog devotees and especially for prog beginners - this is new DREAM THEATER( in question of popularising prog) !!!Poland becomes a prog trend-maker!!!"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Sunday, June 18, 2006",
      "rating": 4,
      "text": "My knowledge about the band is not that comprehensive, but I remember vividly that I did review the previous album \"Out of Myself\" before. I cited the following:\"RIVERSIDE music is a blend of space, psychedelic and symphonic with some influence of progressive metal. Band-wise it's a sort of influences from PINK FLOYD, PORCUPINE TREE, OZRIC TENTACLES, MARILLION (early) and DREAM THEATER / PAIN OF SLAVATION. Quite a lot of influences, composed in an excellent harmony with catchy melody in many segments. Vast majority of the music style is symphonic in the vein of space psychedelic music (50%) with some neo prog (35%) and progressive metal (15%). This is an excellent debut album.As I had seen many excellent reviews about \"Second Life Syndrome\" at this site and my natural tendency to enjoy heavier part of prog like those presented by Dream Theater, Pain of Salvation, Symphony X, Kamelot, Rhapsody etc. I finally clicked the order to amazon.com. The CD arrived with me approx a month ago and since then I played the CD quite often. It's not something really different in music type as their previous album. But I don't know why I tend to like the album. The proof was that I played the CD almost regularly.With 211 entries, and now making it into 212 with my write-up, and average rating of 4.36 I think it's clear that there is \"something\" about this album. I f I can define correctly that \"something\" it will revolve around an excellent combination of neo prog and prog metal music which differentiates Riverside from other \"typical\" progressive metal music. As I said before, there are bits of Pink Floyd and Dream Theater as well - that's what make this album is unique. Take example track 4 which is also the title track is basically an exploration of Pink Floyd music. You can sense it right in the beginning through the ambient guitar work which might remind you to David Gilmour. This song is probably the most amazing track out of all tracks presented here. But other tracks are also excellent.Enjoying this album is a joy especially when I listen to the great combination of long sustain guitar solo / fills combined with keyboard work. The music resembles mostly neo prog music plus some heavy guitar riffs. The first time I enjoyed this album, it did not truly impress me only that the powerful narration by the vocalist at the opening track which is unique and enjoyable.No doubt, this album is an excellent addition to any prog music collection and you should not to worry buying the CD. A bit of disappointment is for me the sound production. It's not badly produced but it's not as excellent as Porcupine Tree's or even Dream Theater. However the music is still really excellent.Peace on earth and mercy mild - GW"
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Tuesday, June 27, 2006",
      "rating": 4,
      "text": "This latest release from this underrated band is great, fun rock. As one reviewer has said, a lot of the music has a very \"out of this world\" feeling to it. To compare them to a band like Pain of Salvation or Pink Floyd is unfair, even while they may sound similar to such bands. They are very much different and have their own distinguished sound which will make you go, that's Riverside.To lump this in with other prog metal acts would be an injustice. These guys sound nothing like Symphony X or Dream Theater, the \"standards\" for prog metal. Some of the moments in in this album are very aggressive sounding, however, a majority of the music is not that way. Most of the stuff here is pretty relaxing I have found, and allows the listener to be introspective. Ambient keys and a thick guitar tone really define this record.A great build upon their previous work, Second Life Syndrome is a nice album that deserves more recognition than it gets. 4.5 here, not enough for 5 stars but more worthy than some of my other 4 stars."
    },
    {
      "reviewer": "hdfisch",
      "date": "Posted Sunday, July 23, 2006",
      "rating": 4,
      "text": "Modern accessible Prog as good as it can get! 4,5 stars really!Having this record since quite a while in my collection and still loving it a lot after numerous spins already I've been really wondering whether it needs a rating #220. But since I reviewed as well their debut I think their excellent second full album deserves it even more. Well, what could I add what haven't been said before? There's definitely something about this album as Gatot mentioned already. I would say that is the capability to appeal to almost everybody whether young prog metal fan or old Floyd-follower. Though I'd claim I don't belong to neither of these two groups I've to admit they're able to fascinate even me (as an usually hard to be satisfied old sourpuss). They manage better than any other band, whether it's Porcupine Tree, Anathema or Green Carnation to combine features from both symphonic space rock and metal prog resulting in a highly appealing and captivating blend. Actually there isn't anything really that much innovative or PROGRESSIVE (in the literal sense) in their music. I would rather consider it as excellent \"popular\" rock music (no insult intended) meant in terms of accessilibity and to distinguish from \"real progressive\" (Avant) music like Kayo Dot is doing for example. Since both bands are listed in the same category I'm forced to compare them in a way though they don't have anything in common apart from the metal element. The lack of true innovation here on \"Second Life Syndrome\" is actually the only point keeping me off from giving the full score and call it a \"masterpiece of progressive music\". IMHO it is not, but truely an excellent example for \"eclectic modern rock music\" being catchy AND sophisticated at the same time."
    },
    {
      "reviewer": "King of Loss",
      "date": "Posted Friday, August 25, 2006",
      "rating": 4,
      "text": "Very Overrated album.That's really what I have to say about all the glowing positive reviews on the top. This album is NOT a Progressive Metal masterpiece, but this band has yet to settle itself in the Progressive Metal scene.Anyways, back to this album, this is obviously a well received and a well chronicled piece of Progressive Metal work and of course the second release by the Polish Progressive Metal band, Riverside. When I first heard this band, it was in 2003, browsing through the many sections of the Inside Out website. I first heard a strange uncommon band that sort of sounded like an insane combination of Pain of Salvation, Extreme Metal, Neo-Prog and other Psychedelic influences (most soundly of course being Floyd).So I decided to check out this band, Riverside. I've rarely if ever listen to Polish Prog, maybe a couple of bands interest me, but this one really hit the floor. Their first album was quite good from this Polish Progressive Metal outfit, with the sad, lacrimose psychedelic Metal sound along with Neo Progressive tendencies of course. I was very excited about this band, so I purchased the first album, Out of Myself and find it very interesting at first, but I quickly grew out of it just like how I grew out of a lot of Metal bands that I now call 'generic'. The album was good, but not really that good.Then comes Second Life Syndrome, their second Inside Out America release and I did not want to buy it, because I did not want to be as disappointed after 10 listens like the first album gave me. So I decided to download it and when I did, the music was completely different in a lot of aspects compared to the first album. The Neo Progressive traits that were so obviously shown in the first album were no longer present, but replaced by a sad, emotional almost- Pain Of Salvation like music, without the dramatic brilliance of Daniel Gildenlow of course. I must admit, I really did not like this album until I heard it several times and it constantly reminded me of Porcupine Tree, as compared to the first album mainly being a boring reminder of how some Progressive music/'generic' Metal was such a lull.The first album was not very exciting and this one has yet to capitalize with me. Even though I liked it at first, it never really fully grew on me, the parts stayed the same, much like the first album, except in a much more brighter way. Second Life Syndrome was a very interesting track, along with the ballad-like Artifical Smile. The almost \"pathetic\" lyrics also failed to reach me. Overall, this album is a very good, emotional album, but not an album to go overboard on, especially the reviews before hand.Overall, this album is about 88% or 4.33 stars.I mean, this is a good album, but its not quite as good as most people take it to be.Bottom Note: Riverside is a band that has grown on me and now love. They are definitely a band that takes time to grow. (A good hint of Prog music!)"
    },
    {
      "reviewer": "evenless",
      "date": "Posted Thursday, September 21, 2006",
      "rating": 5,
      "text": "First of all I'd like to say that RIVERSIDE'sOut Of Myselfwas the biggest surprise of 2003! What could you expect from a new prog-metal band from Poland (out of all countries!) anyhow?!After getting fairly known to bands like AYREON, PINK FLOYD and RADIOHEAD someone suggested I should start listening to PORCUPINE TREE, OPETH and RIVERSIDE. I \"discovered\" PORCUPINE TREE in 2002 and what a discovery it was! This is presently my favourite band together with PINK FLOYD and I'm lucky to have all their studio albums together with some collectables. After PT I purchased OPETH's \"Damnation\" and RIVERSIDE's \"Out Of Myself\" at the same time and I just found myself listening to those albums over and over again!Back to \"Second Life Syndrome\"! Now I think that I rated \"Out Of My Self\" too high with 5 stars, because I simply think \"Second Life Syndrome\" is more mature and therefore a better album. Let's say the 5 stars I gave for \"Out Of Myself\" was 4.5 stars rounded-up to 5 and the 5 stars that I will give to \"Second Life Syndrome\" is 4.8 stars rounded-up to 5 as well.1. After (3:31)Slow and mellow introduction to the album.2. Volte-Face (8:40)Great build up of the song with perfect instrumentation and singing with a superb ending into a pseudo-death metal voice in the phrases:\"HOW FAR IS THE LIGHT?\"and\"I'M NOT AFRAID\"3. Conceiving You (3:39)After the somewhat harder prog metal track \"Volte - Face\" here's a very emotional ballad showing the emotion of \"insecurity\" from a guy who loves a girl but does not dare to approach her and telling his feelings about her. (Haven't we all been there?!) Simply beautiful !4. Second Life Syndrome (15:40)This is my favourite track from the album! \"Second Life Syndrome\" is actually subdivided into 3 parts.PART I - From Hand to MouthSlow build up towards a more up-tempo song with great drum and bass accompanied by FLOYDIAN guitar and really good chorus sung beautifully by Mariusz Duda. This chorus will also return in PART II. PART II - Secret ExhibitionPART II really slows down the tempo back to where it started with a beautiful played strong bass line! WOW! I just love the way Mariusz plays his bass: you can actally hear it as an instrument, so not merely on the background. Together with the lyrics \"secret exhibition - cure for loneliness\" this song is simply perfect. In the lyrics you can see that the songwriter has come over the \"love of his life\" and is happy to continue by himself.\"I erase you now - I don't need you now - I erase you now with all of my past\"PART III - Vicious RitualSong seems to end after PART II, but continues slowly until the vocals go \"totakakatee totakatee totakatee totakatee\" Another part of this song that'll give you goose bumps whenever you listen to it. There is actually some fine singing of Marius Duda on the ending of this song, but unfortunately I can't seem to make up what he's actually singing. If I had to pick just one song from the album, this would be it!5. Artificial Smile (5:27)Often played at RIVERSIDE's concerts (I have seen them play live 3 times now ad they played it every single time). Not a bad song, but certainly no highlight either. I think therefore the song is somewhat too simplistic and poppy. However: I love Mariusz' pseudo death metal voice again at the end of this song. \"Tell me your lie!\" WOW! It seems it's coming out of his toes! This song seems to be about envy.6. I Turned You Down (4:34)Another highlight of this album! Lyrics are a bit short, butt hey perfectly match the song. This song is about regret. \"I turned you down so hastily - and it's tearing me apart\". It's nice to see all emotions are captured in this album. Love, loneliness, happiness, regrets. I especially like Piotr Grudzinski's howling guitar on this track! Just love his playing style!7. Reality Dream III (5:01)After the two instrumental tracks \"Reality Dream I\" and \"Reality Dream II\" on \"Out Of Myself\", here's the third part of this instrumental track. It's somewhat logical that you find this track on this album, because actually RIVERSIDE's first three albums will be part of a trilogy! The 3rd RIVERSIDE album we can probably expect somewhere in September 2007. Already looking forward to it :-)8. Dance With The Shadow (11:38)Another nice track about some relationship problems; basically about not taking a person who he/she is, but trying to make the person the way you want him or her to be. After listening to the lyrics of this song you can imagine how one would feel free and reliefed after the relationship has ended. (see track \"2nd life syndrome\")9. Before (5:23)\"Before\" is a track about a changed man who just came out of a depression and found himself eager to live once again. (Hence the title of the album?!) I especially like the build up of this track from a slow mellow track in a somewhat heavier track towards the ending. The ending is really superb with the guitar riffs by Piotr Gruzinski accompanied by Michael Lapaj on keyboards lifting the whole to a higher surface.I strongly suggest anyone who likes PINK FLOYD, PORCUPINE TREE, MARILLION or OPETH (so basically any progressive music lover) to check out RIVERSIDE (if not already done), because their compositions, instrumentation, lyrics and especially Mariusz Duda's voice is all worth it! He's got a velvet voice that can whisper, sing and even growl now and then. Normally I am not really into the \"growling\" but whenever he does it, it simply fits the emotion (anger) in the music that I've become to LOVE it!Once again: probably the best progressive album of 2005 and one of the best live performances I have ever seen! (I've been so lucky to have seen those guys during a live performance three time already and actually talked to Mariusz Duda twice :-)P.S. Also check out the great artwork from this album by TRAVIS SMITH!"
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Friday, October 6, 2006",
      "rating": 4,
      "text": "4.5 stars. Very difficult to pick a favourite between their first two albums.This is the second part of the trilogy and it's a little heavier than the debut. RIVERSIDE blends so well that heavy, raw aggression with that dark atmosphere. I like the way they often take their time and let the song develope. Of course Duda's vocals and Piotr's guitar work are not only outstanding but that's part of what sets them apart from many bands.Travis Smith once again did the cover art. The \"Thankyou's\" in the liner notes are all in Polish interestingly enough. Although I can see the keyboardist thanks Jon Lord from DEEP PURPLE.\"After\" sets the tone as we hear almost whispered vocals that imply we have a tortured soul here. Vocals before a minute with lots of atmosphere and drums.Guitar 3 minutes in. \"Volte-Face\" opens with more atmosphere before the song kicks into gear. Great sounding guitar after a minute. Vocals and synths 3 minutes in. Love the warm guitar leads here.Vocals get angry before 5 minutes. It settles 6 1/2 minutes in then we get emotional vocals a minute later. \"Conceiving You\" is simply gorgeous. My favourite track. The piano and fragile vocals are so moving, but then the whole song is. Even the guitar is emotional when it arrives 1 1/2 minutes in. \"Second Life Syndrome\" is atmospheric as guitar comes in.This reminds me of FLOYD. Gotta love the guitar 1 1/2 minutes in. Nice bass then vocals before 3 minutes. When it settles Duda's vocals are pure bliss. Check out the guitar after 4 1/2 minutes. Almost spoken vocals after 6 1/2 minutes.This is awesome ! Those amazing vocals are back 8 minutes in with guitar to follow. It's eerie 10 minutes in. More great guitar late. What a song !\"Artificial Smile\" initially has a PORCUPINE TREE feel to it, but that dissolves rather quickly as this song really rocks out. This would be a great song to hear live. Angry vocals in this barn-burner as well. \"I Turned You Down\" is a powerful yet restrained song. It settles with vocals. Fantastic sound 2 1/2 minutes in. \"Reality Dream III\" is an instrumental that builds after a minute. Gorgeous guitar after 2 1/2 minutes as it settles somewhat. Heavy riffs a minute later. Powerful organ before 4 1/2 minutes. Another favourite for me is \"Dance With The Shadow\". Lots of atmosphere as reserved vocals come in. Guitar before 1 1/2 minutes then it kicks in before 2 minutes. It smokes ! Great bass lines and guitar solos. Angry vocals 5 minutes in. Just an amazing tune. \"Before\" is so inspiring. It really builds in intensity.Simply a must for both fans of \"Metal\" and those who like atmospheric passages."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Saturday, October 28, 2006",
      "rating": 3,
      "text": "Looking for something along the lines of Dream Theater, I purchased this album because it was so highly regarded by the members of this site and categoried in the same Progressive Metal genre. What I expected and what I got were two different things. These guys don't sound anything like DT. Once I got over that surprise I hunkered down and started to open my ears to what they were doing. And now I'm glad I got it. First of all, the vocals are distinctive and somewhat reminiscent of John Wetton. \"After,\" the first cut, is mysterious and moody as it showcases Mr. Duda's experimental side with countermelodies and harmonies intertwining around a mantra-like sound. \"Volte-Face\" was my first encounter with the dreaded Death Scream that I wasn't really prepared for. I'm not a big fan of the technique but, thankfully, he doesn't overdo it and I learned to accept it as a dynamic accentuation rather than a constant annoyance. The guitarist is very, very melodic and tasteful in his playing and it works to make memorable melodies while still managing to create huge metal sounds.\"Conceiving You\" is a great change of pace song and it haunts you long after the cd is over. \"Second Life Syndrome\" and \"Artificial Smile\" are heavy and rockin', still maintaining the atypical mystical and occidental musical influence that permeates the album. \"I turned you down\" is another slower piece that is a highlight. And when Michal Lapaj interjects his incredible piano skills into the instrumental \"Reality Dream II\" it elevates the song into another stratosphere. Truly inspired. \"Dance with the shadow\" manages to spotlight every member of the group and then \"Before\" ends the journey much in the same way it began with a song that starts like a chant, then builds to an explosive end. The biggest problem I have with this endeavor is the fact that often the drums get drowned out in the mix and that's not good at all. Drums are so very essential to progressive rock that they need to be out front with the music surrounding them. From what I can tell Pietr is a fine percussionist but his work is sometimes hard to decifer. Hopefully their next release will rectify that problem. I did notice in the liner notes that the drums were recorded a month before everything else was so maybe that took away some of the spontaneity that I feel is missing at times. But this is only their second album so I'm going to give them a whole lot of slack and just enjoy what turns out to be a very good collection of songs from some musicians/composers who will undoubtedly continue to just get better with time."
    },
    {
      "reviewer": "The Prognaut",
      "date": "Posted Friday, November 10, 2006",
      "rating": 4,
      "text": "I'd dare to say that I'm as amazed as the rest of the reviewers here that had submitted over two hundred opinions just for this particular album. And there's a reason to this massive display of summoning. \"Second Life Syndrome\" blasted off so eclectic and revealing to me from the first listen that I couldn't believe my ears since I managed to encapsulate the sound of Progressive Metal in a very straightforward stream. RIVERSIDE has got this uniqueness in spite of the musical inspiration they've put together randomly on previous albums through the years. According to the musical references given away by members of this outstanding Polish band formed back in 2001, Prog Rock artists such as GENESIS, YES, MARILLION, OPETH, PORCUPINE TREE, PINK FLOYD, PAIN OF SALVATION, FAITH NO MORE and many others, have been some kind of point of departure for them in order to take the flight onwards. But how is it possible to RIVERSIDE to sound extremely different? Well, that's the wonder depicted on \"Second Life Syndrome\".The album kicks off with \"After\". Deep, dark, lyrics that relate the listener to some sort of inner self-talk that slowly describes the illness of a tormented soul. The musical arrangements are as enticing as the words in between giving this short introducing piece a devouring space that's superlative to the three and a half minutes it lasts.And now, one of my favorite tracks on the album. \"Volte-Face\". What caught my attention right away, was the clarity with what Mariusz DUDA speaks in English. Not many non-speaking English bands accomplish this first hurdle in order to sound audible. Anyways, the song turned out to be powerful and relentless to me out of the first chords. I've always appreciated the sound of a paused, delicate piano within a stormy and lightning Prog-Metal piece and this one, ain't no exception. What it seemed to be a simple kind of pure hard rock song from the beginning, turned surprisingly into a narrative composition filled of precise lyrics and awesome interpretation in the end.Then, \"Conceiving You\" came out of the blue when I suggested the album would take on a landscape full of crunchy guitars and thundering drums. Definitely, this piece blew me away. I do believe there's almost no room for schmaltzy songs within the depths of Prog-Metal, but this track is quite an opposite to my self-created pattern. The lyrics go far beyond from emotional, meaningless words since they've got a scent that speaks of reason, sentiment, and commitment.Upcoming track, named after the album's title, has got all what's necessary to be considered a respectable \"progressive rock epic\". Without overreacting to what I listened on this song, I truly believe this is not an exhausting, hard to listen for over fifteen minutes suite. I say an epic is not measured out from the time a song lasts, but out of argumentation, durability, arrangements, narrative and many other ingredients that mixed up all together blossom in some exceptional corner stone where we can relate Prog Rock from. And I humbly believe, this is a song to be considered as such. Out of first glance, the song seems to be everything but exceptional. Everything but different from what we all have listened to once in our Progressive experience. Just listen carefully, separate each of your senses individually and maybe like it happened to me, you'd end up as amazed.\"Artificial Smile\" is the suitable song for me to detail the metallic strength the album's got. The voice, the power set upon the instruments, the growing elements inside, the provoking lyrics. All of that, this song's got it. And I dare to say, even more than that. On the other hand, upcoming track \"I Turned You Down\", is a great metal-ballad executed wonderfully. Here, the lyrics go with the rhythm in time, accomplishing the purpose of captivating all of your attention.When you're listening to \"Reality Dream III\", this massive amount of adrenaline takes on you irremediably. The wonderstruck piano showed up in here is and opposite to the sound of the blasting guitar that joins in. This instrumental song has no need for words to explain a peculiar motive since it speaks for itself in a relentless way. Top class metal displayed by RIVERSIDE. No more to say here.Next on this progressive trip, the turn for \"Dance With The Shadow\" to set off from this review has come. Simply incredible. Two long play epics on one album? Believe it. The track takes a while to ignite, but the reward is fulfilling. As the song waltzes away, you'll get this feeling of drifting aimlessly for sure. Keyboards performance by Michał ŁAPAJ is overwhelming, distant from what's presented on this nine episode adventure. There's a complicity between a one-way chord remaining guitar and the beat held by Piotr KOZIERADZKI on drums. Suddenly, like a closing section, the song opens up to lead \"Before\" by the hand. Subtle and delicate. Great combination here.All of this just to widely recommend this masterpiece to you all out there. Must place hands on this one, undoubtedly. More than an \"excellent addition\", I'd say an \"excellent audition\". Believe me when I say you won't regret lending ears and mind to this fantastic album for one second. Prog on!"
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Wednesday, May 2, 2007",
      "rating": 2,
      "text": "\"SLS\" is an average piece of hard rock that comes off smooth despite some of the painful subject matter of the songs. It jams with muscular guitar and percussion with layered keys and bass. The highlight of the album is the instrumental \"Reality Dream III.\" I actually hear a little early 80s era Rush guitar and keyboard sound in a few places, most likely not intentional but interesting nonetheless. Not saying they sound like Rush, just that I heard a little of that sound mixture (of the guitar/keys) in a few spots. The lyrics are pretty good and I like the overall concepts which if I guess correctly concern fulfillment, alienation, loneliness, etc. They contrast the lyrics with music that is for the most part upbeat. I agree with the few reviewers who complained that there was some repetition to the songs over the course of the album. This becomes a problem the longer you spend with SLS. Initially you find the sound satisfying but over time there is little to keep the demanding prog enthusiast excited. And of course songs like \"Conceiving You\" are far more mainstream rock than they are prog so keep that in mind if you like to be challenged, this band could disappoint those fans. After playing the album for over a year I had to lower my initial rating as it doesn't hold my interest. Compared to some of the great stuff out there this is really pretty old hat, generic, and definitely not essential. Riverside are a lavishly hyped band who whose overall rating for this album completely mystifies me. Musically competent but nothing special, I can't recommend this album."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Sunday, September 23, 2007",
      "rating": 3,
      "text": "There is an amazing amount of review for this album (of which well over 200 without comments). I guess that \"Riverside\" is the most praised Polish band these days.I really liked their debut album \"Out of Myself\". This release will hold several really good songs like \"Volte-Face\". A great metal song. It combines some \"Dream Theater\" as well as \"Opeth\" influences (especially during the growling part of the vocals, of course). Ignoring this would not be fair.The soft and more \"Riverside\" oriented \"Conceiving You\" is just an apetizer for the epic song of this album. \"Second Life Syndrome\". It has some \"The Same River\" feeling. But harder. Lots of great guitar of course, and a fantastic beat throughout more than fifteen minutes. A true prog metal anthem.This feeling is fully confirmed during \"Artificial Smile\". Pure violence but with little feeling (at least ot my ears). I far much prefer the style of \"I Turned You Down\". Spacey and quiet vocals, beautiful guitar sounds, and a great beat. Melodic, inspired. One of the very good song of this album.Well, actually there will some other ones. The opening section for \"Reality Dream II\" is just fantastic. One is surrounded by these extremely aggressive riffs and at the same time one can only succomb to the charming guitar notes from Piotr. I have seen them live two years ago and even if it was a bit too metal-oriented I have to say that these young lads were quite a sensation. They are back again again in December (at the Spirit of 66 of course) and I will probably get there again. \"Reality\" is another highlight.The second epic almost start as a spacey song. But it is only during the initial phase of the song. After two minutes, we are confronted again with these wild and so powerful riffs. Hypnotic, heavy but with such a feeling...A great guitar break enters the scene during the finale. Again, it is brilliant... and about time because this long song is a bit too much of the same to my ears.\"Before\" reverts into a more symphonic territory. Great melody, ambient music, strong keyboards and as usal a wonderful guitar work. The tempo of the song will accelerate for the finale which will bring us again on the heavy side of \"Riverside\" music.This album is definitely to be categorized (without wanting to \"insult\") into the true metal genre. If their first album was more atmospherical, with some \"Porcupine Tree\" influence at times; this one is truely at the heavy side of the musical spectre.Three stars."
    },
    {
      "reviewer": "kenethlevine",
      "date": "Posted Saturday, December 8, 2007",
      "rating": 3,
      "text": "I am at a loss to understand why the most respected modern prog today mirrors not the classic Yes/Genesis symphonic axis but the depressive Pink Floyd mannerisms mixed with highly aggressive metal themes from King Crimson and the more overt stalwarts of that scene. While I have only heard snippets of groups like Porcupine Tree and Radiohead, I find they, like the relative newcomers Riverside, seem to fall squarely in the latter category. Echoes of Floyd's most irritating anti-social behaviour mix with occasionally violent vocal outbursts. In essence, both are sides of the same coin, a portrait of pathological solipsism, with every one of the few human interactions being interpreted in the pessimistic way imaginable. And those are just the lyrics and vocals. Unfortunately the music is also very much in the same paranoid mood which grows tiresome, and certain rhythms seem to be particular favourites of the group. The songs do change tempo within those parameters, that is, from sadness to rage, to the detriment of any sense of development within and between pieces.Yet multiple listens do reveal a certain depth and many moments of guilty pleasure. For instance, the sometimes oppressive \"Volte Face\" has brilliant Middle Eastern themes, \"Conceiving You\" is a ballad which could almost be called beautiful. The title track doesn't quite gel as a complete work and also has to get past the first few minutes of Dave Gilmour tribute; luckily \"I Turn you Down\" is like a shorter more impactful version of it. I am not a fan of prog metal so I cannot give very fair assessments of \"Artificial Smile\", \"Reality Dream III\" and \"Dance with the Shadow\", other than they won't make me a fan.Riverside does not seem to have invested a great deal in developing their own sound, but they can pull off pretty competent prog metal. The fact that I bothered to listen over and over and that it has in fact grown on me elevates it a half star, but I may not bother seeking out other releases. There's plenty more I'd want to check out before giving I'd consider reincarnating this band in my collection."
    },
    {
      "reviewer": "progrules",
      "date": "Posted Wednesday, December 12, 2007",
      "rating": 4,
      "text": "High time for the reviewing of a classic. And I think you can really call this a classic. It's also a class album by a class band. My first encounter with Riverside was a few years ago thanks to progarchives' download (now stream) at that time called Loose Heart from their debut album. I didn't think too much of it then, thought it sounded nice but no more.Then two years ago this album came out and I heard nothing but praise about it, so I thought maybe they have improved or I was mistaking by not giving them the recognition they deserve. I bought the album and I can only say: both is true. They improved since their debut and they deserve much recognition. What a fantastic album this is. Bringing me to the always killing choise between 4 or 5 stars.But first let's say some more about the band and the album. I always compared Riverside with Porcupine Tree, not quite the same style but there are resemblances and funny enough Mariusz Duda looks a lot like Steve Wilson. I think they are both real genii in what they do in music. To me Riverside has two 'faces' (sort of Jekyll-and-Hyde). The very quiet and ballad like side of which there are a few examples on this album and the much rougher side with a lot of power and even gruntlike sounds by Mariusz Duda. This side got them categorized in prog metal by progarchives and many others but I'm not totally convinced this is a real prog metal band but I admit there is no obvious alternative. Personally I like the heavy side best, in fact it's the only side I like about them because their ballads don't really appeal to me. I love the title track, it's a real masterpiece but also Artificial smile, Volte Face and Dance with the shadow are true highlights. The other tracks are far less to me and so that means only half the album rises up to the masterpiece status.That means that 5 stars is a little overdone here. I have to limit it at 4 but in fact it's 4.5."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Wednesday, December 12, 2007",
      "rating": 4,
      "text": "I�m one of the few on this page who likes \"Rapid Eye Movement\" better than this one. I don�t think it falls far behind though. I�ll complain as I did in my review of \"Rapid Eye Movement\" over the metal tendencies Riverside show in their music. I think their music is very beautiful, but the metal riffs and Duda�s momentarily gruff vocal parts are not my cup of tea. And it�s not because I don�t like metal, I listen to both Grind, Black and Death Metal. I just find their metal riffs kind of generic. Luckily it�s not that often they play like this, most of their music is nice progressive rock. When they play this genre they really shine.There are some really beautiful songs on \"Second Life Syndrome\". Songs like Conceiving You and Second Life Syndrome show that Riverside is second to none. There are moments in some of the other songs though that I could live without, but I have already mentioned them above.The inspiration from Dream Theater, Porcupine Tree, Marillion and Tool are very clear, but never disturbing. I think Riverside mixes their sources very well, and make a great personal style out of them. Isn�t that what it is all about ? Finding inspiration and then creating a personal style ? Well I have no problem with the occasional \"recognizable riff\".I think the production and musicians are great, and it is only small things that do, I like \"Rapid Eye Movement\" a little better. I�ll give this one 4 stars though, just as I gave \"Rapid Eye Movement\". I think it falls short of a masterpiece like it�s successor, but it comes close."
    },
    {
      "reviewer": "ProgBagel",
      "date": "Posted Wednesday, December 26, 2007",
      "rating": 5,
      "text": "Riverside - Second Life Syndrome 5 StarsWhat else can be said really? This album is amazing. Riverside took the original sound they created and simply mastered it, putting the riffs, lyrics, solos and vocals in an optimal sync. This album is much more dark and depressing then the first one, but the music is much more heavy in tone. Part of the responsibility for my analogy is a new keyboard player, which I mistakenly listed in the first album, I would change it if I was able. Michal Lapaj is featured on this album in the keyboard position and his presence is immediately felt. The keyboard remains atmospheric, but there is a lot more leads taking place, sharing the same feel as the guitar; good idea to me so things don't get too guitar oriented and redundant. This album also features Riversides first epic (going by the 15+ minute rule), which is the title track. It is their best in my opinion as there is such a nice flow to it and the musicianship just clicks with this track.Another notable track is the third song in the Reality Dream series.and it is their best. You would understand what I am saying about the new keyboard position being a great change by listening to this track. This is not only another one of my favorite Riverside tracks, but one of my favorite instrumentals.Now for the beginning of the album. It opens up with 'After' which also starts the concept of the album for those who did not know that this trilogy was already in the making. 'After' is a very unique track to start the album, there is an African style drumming and chorus, which is something I never really heard of before. Most of it is vocal work with yet another excellent guitar outro.'Volte-Face' is the second song that really just sets the stage in terms of sound for the album. It features the heavy riffs and angry vocal work, but things get separated and brought back with some clever breakdowns. A good track, it is.'Conceiving You' starts off as an excellent piano ballad. The whole band eventually comes together in the end and closes this track out, it's quite cool.'Dancing with the Shadow' and 'Before' close the album. 'Dancing with the Shadow' is a mini-epic on the album. It's an even harsher version of 'Volte-Face' with some great guitar and keyboard work. 'Before' is the perfect way to end this album, unlike the mistake made in the debut. 'Before' has a very big post-rock vibe and the drumming is reminiscent of the 'After' track (for obvious reasons). Nice slow ender to a perfect album.You should get it and see for yourself. This album is downright amazing. It is not the typical prog-metal album so for outsiders of the genre, there is no fear."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Thursday, December 27, 2007",
      "rating": 4,
      "text": "From the moment that Duda's deep, dark, layered voice sweeps its lush way across the listener's ears hey will know that they are in for an experience. With Second Life Syndrome, Riverside proves that their excellent debut was in no way a fluke, and that they have more than enough new ideas and energy for a second go-around.This album is decisively heavier, harsher, and angrier than Out of Myself, but retains the key elements of the band's now signature sound within the heavy guitar riffing-- namely Lapaj's lush keyboards and the feeling of class which come with Duda's vocals. The epic centerpiece steals the show for its fine arrangement and memorable melodies, but the rest of the songs more than contribute to the album as a whole, which will more than likely leave the listener feeling more than a little depressed by the end.As a whole, Second Life Syndrome is almost as good as its predecessor, with a few marks taken away for the comparatively tired sounding Artificial Smile and Dance with the Shadow; additionally, Piotr Kozieradzki's percussion is sounding more and more outclassed by the dynamic playing of his bandmates; these however are minor complaints when compared to the excellent music to be discovered.Songwriting: 4 Instrumental Performances: 4 Lyrics/Vocals: 4 Style/Emotion/Replay: 4"
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Monday, February 11, 2008",
      "rating": 4,
      "text": "After reading all the positive reviews ofSecond Life SyndromeI just had to give this album a chance. My verdict is that it's an amazing album by this promising polish band!The album has a unique sound by a mature band that knows what they want and how to achieve those goals. I actually liked the album even more after seeing the band play some of these compositions live on theirRapid Eye Movement-tour. Mariusz Duda is a really gifted craftsman and seeing him playing the bass sections ofVolte-Facewhile keeping the spark in his vocals impressed me beyond words.Being their, so far, most acclaimed release I don't feel the need of writing a tedious track-by-track walk-through since these have been done before and I don't have much to add to those remarks. Except maybe for the fact that, duringVolte-Face, Mariusz Duda plays many of the upcoming guitar-sections on his bass just before the guitar which makes for an interesting contrast.If you've never heardSecond Life Syndromethen I can guarantee that you're missing out on something spectacular!***** songs: Volte-Face (8:40) Dance With The Shadow (11:38)**** songs: Conceiving You (3:40) Second Life Syndrome (15:40) Artificial Smile (5:27) I Turned You Down (4:34) Reality Dream III (5:01) Before (5:23)*** songs: After (3:31)Total Rating: 4,27"
    },
    {
      "reviewer": "SoundsofSeasons",
      "date": "Posted Thursday, February 14, 2008",
      "rating": 5,
      "text": "What moves you?...Whatever it may be, you'll find that Second Life Syndrome will find that weak point in your heart, and caress your soul. I'm talking about the feeling of emotion. There are multiple examples of this central element, that permeates this romantic album. First case and point, the dynamic beauty of Mariusz's vocals. The gentle softness of his voice sounds beautiful and vulnerable, then comes the swell of change, and out bursts his strength and power. And while still sounding just as beautiful, the new emotion gives way to a new idea. Complimenting his vocals are lyrics just as touching, the centerpiece being the secret admiration of a girl who does not realize he exists. Then there is the sweet synergy of the guitar and keyboards, both singing together perfectly. Yes, I saidsinging. Just listen to how the guitar holds notes, and twists and bends them. Or how the keyboards flow like a kind of ethreal dream. The way these elements- the words, the vocals, the instruments- come together creates a kind of feeling, and wonderful kind of feeling.Emotion.Second Life Syndrome. Don't just listen to it. Feel it."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Monday, April 7, 2008",
      "rating": 4,
      "text": "Very, very good progressive music with a prog-metal edge, RIVERSIDE's second album misses out on greatness but is thoroughly competent in all aspects.To compare this Polish band to prog-metal greats such as TOOL, PORCUPINE TREE and DREAM THEATER is not to demean them: they do have their own sound, nascent still but more audible in this album than in their debut. Instead, the comparison is designed to help the new listener place this band in the ranks of progressive offerings.But it doesn't quite make a full five stars. There are not as many hooks as I would have expected: with such depressing subject matter, there needs to be a reason for the listener to return, and the music, while having all the ingredients, is somewhat predictable. Who, on listening to this album for the first time, would not expect 'Volte-face' to sound as it does, given the TOOL-like opening track that precedes it? And RIVERSIDE is unashamedly retro: I haven't heard guitars like those that open the title track, for example, since DIRE STRAITS in their pomp. After listening to this album I tend to go and listen to something from one of its influences, a sure sign the band haven't yet truly found their own voice.RIVERSIDE are somewhere near the best of the current crop of retro-prog rockers, but don't stand comparison with the likes of THE MARS VOLTA, KAYO DOT or SLEEPYTIME GORILLA MUSEUM as purveyors of cutting-edge prog rock. This album is about as good as - I'll say it carefully - any that wears its '70s influences so obviously on its sleeve. If you're a fan of the 70s sound you're in for a treat. Don't delay, purchase this immediately. Otherwise prepare yourself for a good, but perhaps not great, experience."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Sunday, November 9, 2008",
      "rating": 4,
      "text": "There's no Artificial Smiles when listening to this album.Polish band Riverside exploded out into the prog scene a few years prior to this album with their stellar debut,Out Of Myself, and in 2005 they followed it up with this beauty. During that short span of time the album has become a renounced masterpiece and the band has been elevated to Godly status within the progressive metal world, their peers now includingPain Of Salvation,Porcupine TreeandTool, not bad at all for a band that got its start in the early 2000s - and slightly ironic since the band don't often consider themselves to fall under the ''prog'' tag. This second offering from the band takes what they did well on the first album and builds on it. The feeling and general tone of the album is generally the same as the debut, a very dark and self-reflective voyage which plays out as a concept trilogy when combined with the other two albums in their discography at this point. What's different about this album is the aggression, the general feeling that the boys are more comfortable in their shoes, and the apparent desire to not just make something great, but to make something monumental. Fans of the first album will be delighted, as will anyone who loves slow and brooding progressive metal with multiple extended suites and instrumentals.Some of the best points of this album are the standout short rockers. Although not all of them will be considered 'short' by everyone, Riverside really excels at the heavier side of things on this album. On their previous album they tinkered in this department, but this time around they've decided to kick down the doors and run in headlong. This is proven right off the bat with the excellent and heavy-as-hellVolte-Face, which is like a kick to the face with it's heavy and surprisingly fast guitar playing from Piotr Grudzi�ski. Other songs on the album will have their heavy moments, but the next most memorable rocker is the killer, 5-minuteArtificial Smile, which really shows the band heading in a more metal direction. Marcus' vocals are less reserved than normal and he belts out with ever inch of his strength on this excellent track.Of course, where would Riverside be without their epic tracks? On this album there's two of them, the first being the title cut.Second Life Syndromeis a combination of the first two albums in terms of sounds, as it can go off on a heavy tangent full of metal riffings and then slow right down into a spaced out segment that brings back memories ofPink FloydasThe Same Riverwas able to do. This is a highly impressive track throughout its 16-minute duration with every member playing to their strengths.Dance With The Shadowstarts out much slower than its counterpart, but its slow build eventually turns into full out chaos supported by a very lead keyboard and a chugging guitar. Of course, tradition also carries on in the form ofReality Dream III, the end of the 3 part instrumental that started on the first album. Like it's brethren it's an impressive and heavy instrumental that brings up memories ofIndukti(for obvious reasons).As usual the album is well supported by beautiful artwork on the cover and throughout the booklet, which works with the other albums in the series to make the trilogy really feel like a trilogy. It also strengthens the mood from the album already presented strongly in the themes of the music.It's tough to argue if this album is better than the first or simply on par with it.Out Of Myselfhad its charms and so does this one.Second Life Syndromefeels a bit more mature and polished, and certainly more heavy, so it all comes down to a matter of personal preference. Of course, it goes without saying that this album makes an excellent addition to any collection, especially one in need of progressive metal. 4 reality dreams out of 5, definitely recommended."
    },
    {
      "reviewer": "horsewithteeth11",
      "date": "Posted Sunday, February 8, 2009",
      "rating": 5,
      "text": "How do you improve on an excellent debut? Add a lot more power.As I've mentioned, Riverside's debut was a breath of fresh air to modern progressive rock from a country which isn't exactly well-known for prog. Their sophomore effort definitely took it up another notch however. Unlike the debut, the metal influence is very clear and visible, and I can honestly say that this is a progressive metal album, rather than a progressive rock album like before.The guitar riffs have also significantly improved from last time; they are now very crushing and powerful in the way one would expect progressive metal riffs to be. However, if you're afraid that the psychedelic feel and sound to their music is gone, have no fear. It's still there and very noticeable, especially on the opening track, After. However, we also notice how there will be much more of a metal influence on the buildup and opening riffs of Volte-Face. Overall, this album is a very good mix of psychedelic-inspired progressive rock (with a modern feel) and progressive metal. The standout tracks for me are Volte-Face, the title track, Reality Dream III, and Dance with the Shadow. All of them are a great mix of metal and psychedelia and highlight the band's sound very well.If you want to hear one of the highlights of progressive metal from this decade, definitely check this album out. The very atmospheric keys mixed with metal should be a major delight to fans of slightly heavier progressive rock, and may even turn some prog rock fans on to progressive metal. This here is a keeper, and worthy in every way of 5 stars."
    },
    {
      "reviewer": "tszirmay",
      "date": "Posted Monday, August 3, 2009",
      "rating": 4,
      "text": "Second Life Syndrome continues on the same path as predecessor and splendid debut \"Out of Myself\", blending stark Floydian atmospherics with harsh metallic complexities, ushering in the plushest melodies from Michal Lapaj's keyboards and Mariusz Duda's anesthetized vocals. On \"Volte-Face\" the tension becomes palpable, with leaden riffs detonating the instrumental ammunition, guitarist Grudzinski daring to inject some Jimmy Page-like explosions in his rhythm work, bleeding off some sanguine solo rips while Duda rails in comatose wrath (the growls!), the piano interjecting some well placed romanticism and the overall feel immersed in troubling paranoia (\"Had a dream last night, sleepless night, do you mind?\"). The lovely \"Conceiving You\" is more attune with a ballad, a gentle melancholic frolic that proposes fragile introspection in direct contrast to their usual hard edge. Piotr Grudzinski displays a virtuosity that seeks out the most vivid emotion, not just a mere shredder. Now that proper appetizers have been served, the 15 minute 3-part title track becomes the piece de resistance, a pure Floydian soundscape that shuffles in deep and deliberate psychedelia, slowly blooming into a full-fledged explosion of sturm und drang, Duda's bass throbbing like some endless migraine and welcoming in the rhythm machine. The first slippery guitar solo parallels the forlorn vocal pleadings, inducing a few more raging growls as the organ swells with unabashed contempt. Simple yet oh so effective in creating a doomsday climate, the vocals emote powerfully within the schizoid context (\"There is no turning back\"), soaring plaintively with profound pain, launched by a huge guitar foray into the fluffy clouds as the electric piano motifs anchor the gloom. The disturbing whispered mid-section corrects the aim, increasing into a massive swirl of synthesized carpeting, both bass and electric guitars carving out hypnotic furrows. The romantically sustained and effect-laden guitar solo actually has some Mike Holmes tendencies, he of IQ fame. Bravo! \"Artificial Smile\" suggests a musical etude in hypocrisy, an angrily disappointed rant on human deceit with rumbling disgust and quasi-metalloid frustration emanating from the lead instruments, careening close to mellotron-drenched heavy prog, similar in style to their bosom buddies Porcupine Tree (\"I hate you because they love you\"). It nevertheless becomes evident that these Polish lads have their own style down pat, not content to merely emulate but actually going beyond the norm. The effusive anger expressed here is downright scary. \"I Turned You Down\" is more polished and hence less rambunctious, with huge swells of sound, the bass cockily shepherding the way. Duda wallows in frozen pain, tearing him apart, a despondent track full of imaginative creativity, with some supple drumming from the other Piotr, definitely a highlight composition. \"Reality Dream III\" propagates the previous two instrumental exhibitions from the debut with another masterful musical expos�, a pulsating steamroller of sound that explodes into harder realms, kept slightly soft by some dense keyboard colorations but really nothing more than a solid platform for Grudzinski to fly into the heavens with his six stringed instrument, while riffing like a man possessed. \"Dance with the Shadow\" is an 11 minute showcase that builds within placid atmospherics, a twisting electric guitar waving its wand and evolving into a roller coaster ride that buzzes, swoops and dives like some wayward missile gone astray. I am no fan of the growling vocals (I find it a bit silly, being a grown up!) but it's just a brief detail that doesn't linger on the radar screen. The P Tree resemblance can be uncanny but Wilson and Grudzinski have diverging styles, so it's hardly a clone just a similar context. The moodily reflective \"Before\" brings this sophomore release back to home plate, not a home run like the debut IMHO, but a worthy effort none the less. Barely 4 dill pickles"
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Wednesday, February 3, 2010",
      "rating": 4,
      "text": "Second Life Syndromeis the most representative of Riverside's first 3 albums. I could apply most of the criticism that I have with Riverside again but I will refer you to my review ofOut Of Myselffor that, assuming you would want to hear Riverside-criticism. However, onSLS, Riverside managed to add some nice surprises to their Anathema meets Marillion stew.The opener is the first one of those; it's almost an a-cappella intro with beautiful vocal harmonies, some soft percussion and background synths. A strong and very atmospheric start.Volte-FaceandDance With The Shadoware typical Riverside epics, featuring long instrumental intros that go through a number of metal-proggy themes and riffs, followed by a rocking main body with lyrical vocals and ending on a dramatic climax. Nothing revolutionary but enjoyable, especially the first one.One of Riverside's strong sides is actually balladry and the short rock song.Conceiving Youis a fine example of that sugar-sweet pop style andI Turned You Downis one of their best tracks ever. But they also manage the prog epic format quite well, the title trackSecond Life Syndromeis flawless. The instrumentalReality Dream IIIis another pleasant moment, it's one of the few places where I can actually hear them having some playing fun. There's a nice ELP vibe in the last minute. The album has only one weaker cut,Artificial Smileis rather artificial indeed, the gruff vocals are too overstated and sound out of place on this album. It all ends strongly in true Porcupine Tree fashion with a slow Floydian space epic.There are few moments on this album that I get really excited about, it's all pretty monotonous in the end. But I can't help loving it and it's perfectly fine album that might serve as a good introduction into prog rock, sub-genre: Prog-Lite."
    },
    {
      "reviewer": "EatThatPhonebook",
      "date": "Posted Wednesday, April 28, 2010",
      "rating": 4,
      "text": "7/10\"Second Life Syndrome\" is one of the most important prog metal albums.Polish band Riverside arrives at their second album in 2005, the second of a trilogy dedicated to the unconsciousness of man. The album, Second Life Syndrome, is considered by many their best album yet, and one of the most important albums of progressive metal. And let me say that I totally agree. The album is journey through the confusion, the preoccupations and the anxieties of man in the new millenium, an impressive record that many will not forget easily. The style isn't typically \"metal\", because many times it's more concentrated on the prog side. Always has a melancholic feeling, and a slight touch of grimness and mystery.\"After\" is a beautiful song, very calm but very melancholic, with the large use of vocalisms.\"Volte Face\" is great, aggressive, with many metal moments, as well as experimental ones. Fantastic, one of the best of the album.\"Conceiving You\" is another calm and beautiful song, with a really nice piano that accompanies Duda's great voice.\"Second Life Syndrome\" is the 15 minute epic piece, no doubt the best song in the album. Many moods , rhythms, and melodies, all beautiful and powerful, effective and very emotional. A masterpiece.\"Artificial Smile\" is another excellent piece, very catchy and I think it could have really been released as a single, and of course it could have drawn many peoples attention.\"i Turned You Down\" is a great song, a little calm but effective, like almost all the songs in this album. It has a great melody, initially I underrated this song a little too much.\"Reality Dream III\" is the last of the trilogy. Similar to the other too for the structure(all three are instrumental), it is still great and it never bores.\"Dancing With the Shadow\" is the second longest song in this album (11 minutes). Similar by structure to the title track, but I think its slightly inferior, even though this one has many great moments, sometimes amazing.I'm not so crazy about the last song, \"Before\", I find it kind of flat and repetitive.However, this is one fantastic album, essential for whoever loves prog and/or metal."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Thursday, November 11, 2010",
      "rating": 4,
      "text": "After much deliberation, I'm going to classify Second Life Syndrome as essential--check that, absolutely essential--but stopping short of calling this a masterpiece.Let's review what this album has going for it: 1) a foursome of very talented musicians who play with a sense of passion and urgency, as if they really have something to say, 2) an interesting and captivating overall theme that never turns cheesy, and 3) a large amount of extremely well-crafted music. All this screams essential prog in my book.So, what's preventing masterpiece designation? One is consistency, as the first half (beginning through the end of the title track) is masterpiece level to my ears, but the second half falls off a bit, with more of the brooding from their debut album and less of the passion from the first half.Labels and technicalities aside--let's get to the music! After is a fantastic intro, with the creative, intense, and smooth vocal side of Duda, nicely finished with some moody, passionate guitar from Piotr G (a running theme with this album). Then Riverside get down to business with Volte-Face, showing their full capabilities as performers and songwriters in moving from bouncy, catchy riffing to passionate ambiance to the skull-crushing metal finale.The title track and Reality Dream III also deserve special mention, because they encapsulate some of my favorite qualities of the band. Here Riverside move expertly from pensive, delicate passages to absolutely colossal symphonic eruptions. Remember, this is only four players, and Duda, Lapaj and Piotr G really are in sync to put these pieces over the top. I just can't get enough of this stuff.I have truly enjoyed watching this band evolve, as well as purchasing their largely high-quality releases. These guys really seem to be on the same page, they are a classic case of the whole being more than the sum of the parts. Now if only we could get some more Riverside tour dates in the States..."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Monday, November 29, 2010",
      "rating": 5,
      "text": "An album of nearly perfect production: There are not many albums out there whose sound clarity, engineering, and mixing can compete with the quality of this one. Simply breathtaking! While neither heavy prog nor prog metal are my favorite sub-genres, this was one of my first acquisitions during the 'prog listening renaissance' I've undergone since 2006. I immediately appreciated the sound, musicianship, and production; it has taken me quite a while longer to decide whether I appreciate and/or like the music. The answer is: Mostly. I immediately loved \"Conceiving you\" and \"Second Life Syndrome\" and now love \"I Turned You Down,\" \"Reality Dream III,\" and \"Before.\" \"After\" and \"Dance with the Shadow\" are both excellent songs, while \"Volte-Face\" and \"Artificial Smile\" are just not my style. I have no doubt that this album should rank among the best of this 21st Century as it is so powerful, so well constructed, performed, recorded, and produced. A 4.5 star album which is down-graded by me only because the album as a whole does not yearn for regular listening by me--though the song \"Second Life Syndrome\" is among my favorites of all-time.January 29, 2025 edit: I've long referred to this album as \"one of the 21st Century's shining beacons\" and, accordingly, used it as a reference in many reviews when upholding the highest standards of the Heavy Prog and Prog Metal genres, and I do find myself drawn to listen to parts of the album (especially the title song) more often than I ever thought I would, so I have decided that this album deserves the bump up to masterpiece status. Again, I feel intuitively that Second Life Syndrome stands in a small class atop the mountaintop that represent the absolute best progressive rock produced in the 21st Century (which now incorporates 25 years!!!)"
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Monday, December 20, 2010",
      "rating": 4,
      "text": "Excellent Prog Metal with a Little Too Much Black EyelinerI don't know why it took me so long to review Riverside's SECOND LIFE SYNDROME. It was one of the first albums recommended to me as a newbie at Prog Archives, and I've enjoyed it quite a bit. My overall impression is that this is progressive goth metal, allied not with Dream Theater, chops, and battle cries, but instead Anathema, gloom, and a little too much teenage bad goth poetry. The last item is what keeps this excellent music from reaching masterpiece level for me. Perhaps it is the translation from Polish to English that causes the over-the-top lyrics, but the images are really the same across cultures.The opener \"After\" is an ethereal, slow burner that starts with some ridiculous spoken word slash-my-wrists silliness from vocalist Mariusz Duda, but then the music comes. Glorious low male harmonies over tribal drums are basically likely giving a junkie his fix for me. Delicious. I realize that this sound is just as much a teen goth trapping as the lyrics that make me laugh, but I love it. And while we never quite reach this mesmerizing place again, there is a darkness that surrounds the music through out the album. And with the exception of a few over-reaching moments vocally by Duda, and a few of the lyrics, I believe it all works.The title song begins with very obvious Pink Floyd trappings but fairly quickly picks up momentum. The fact that the music is clearly more on-top-of the beat than Floyd adds a freshness, an urgency to the melancholy of what could have been a rip-off but instead is a very valid modernization of the mood. The added bonus of the metallic guitars and odd-time riffing also help Riverside make the sound their own. Interestingly, all the teen goth angst works quite well for the ode to infidelity, \"Artificial Smile,\" though there is one painfully bad lyric choice. The ballad-y songs aren't quite as powerful, though they accomplish their intent. The more instrumentally intense songs like \"Reality Dream III,\" \"Dance With the Shadows,\" and \"Volte-Face,\" are probably the most rewarding. The album ends with \"Before\" which is the best of the slow songs on the album.There is a distinctive 80's edge to this that is not necessarily from the realm of metal, though the choice of distortion on the guitars is a little dated. It's more in the reverb, and a bit of slap-back delay that points back to rainy-night songs of my youth. And yet the riffs are more modern, so we get a mixture of time frames that gives Riverside their own unique identity. Duda's dark harmonies are also fairly singular, and certainly his voice is the centerpiece for the entire band. His harsh vocals sometimes work and sometimes they don't, but his clean vocals are among the better in metal. His sense of the melodramatic also means that we get plenty of dynamics, with some great dramatic crashes where the band comes in like a brigade of tanks, and open passages that feel like standing on the edges of the light at a campfire in winter.More than anything, I get the sense that this band is making music, not playing just to play. They have something they're trying to say, pictures they're trying to paint, messages they're trying to communicate. And they succeed. It may have shades of adolescent drama rather than subtlety at times, but hey it's metal. 4/5 stars."
    },
    {
      "reviewer": "Andy Webb",
      "date": "Posted Tuesday, February 1, 2011",
      "rating": 5,
      "text": "Conceiving greatness.Riverside is one of the new progressive metal acts of this (well technically last) decade. However, one thing really separated Riverside from the rest: they're damn good. Unlike the countless number of new progressive metal acts that have flooded the scene, most of which are just copies (or slight variants) of Dream Theater, Riverside really exemplifies the spirit of creativity and inventiveness in the genre. The band is exquisitely unique and enjoyable, combining softer heavy prog with a deliberate and ambient avant metal. From all this, we get a tasty blend of a new brand of progressive metal, Riverside style.The album starts with After, a haunting vocal piece, before breaking into an ambient and mellow 'ethno-fusion' track with some cool percussive effects and some great textures to go along. Overall the track acts as a spectacular transition to a slowly crescendoing album full of tricks and tasty treats.Volte-Face fades in from After and slowly crescendos into a rocking and experimental groove fit for kings. The song is the first taste of Riverside's incredible ability to dish out intensely creative music. The song has no trouble modulating between feels and utilizing Hammond textures and supreme riffs and instrumental sections. The band obviously has intense compositional skill, and they are able to utilize it in fantastic ways. Overall, the track poses the first taste to Riverside's great ability on this fantastic album.Conceiving You is one of my favorite tracks on the album. Blasting open with a near tear- jerkingly beautiful piano melody, the song shows Riverside's interpretation of Progressive Metal's compassionate and melodic side. Overall, the track is easily one of the best on the album and shows how Riverside can effortlessly take music and meld into the beautiful form it deserves ' a skill not many possess.Second Life Syndrome is the monster 15 minute track of the album (every album needs one!). The song has a long buildup wait, which is highly paid back by the catchy bass line and atmospheric and highly infectious guitar playing. The song slowly builds into a rocking and highly amazing epic of, well, epic proportions. The song is very traditional to the great Riverside sound, with much slower tempos than much of Prog Metal and an overall very atmospheric and reliant more on sudden accents for excitement than crazy instrumental sections. Overall, the title track is another fantastic track, with high points at the atmospheric instrumental sections, some damn infectious bass lines, and just an overall sense of intense inventiveness. The melodic structure of Duda's voice is very unconventional and refreshing. This song is just great!Artificial Smile is the first real 'rocking' song on the album. Starting right off with a great riff and breaking into a still great rocking and atmospheric verse and easily modulating in and out of that feel. We hear a strong influence of harder metal influences like Opeth in this song especially. Overall, this song is yet another great track of the album, exemplifying all the great qualities of Riverside's music.I Turned You Down is one of the more atmospheric and ambient of the album's track. It has a much greater emphasis on vocal melody than instrumental value. It has a slower, more deliberate and moving feel to it than the others. Overall a great track also.Reality Dream III is the final in a trilogy of Reality Dream instrumentals, and it does not disappoint. It has a slow crescendo into a rushing and amazing dynamic that is very atypical of the album's music feel but also has strong ties with the 'ethno-rock/metal' feel of their music. Overall, the track provides one of the most musically refreshing rides that I've experienced in a while. The band really goes all out on this one. Each member has his say in where he plays, when he plays, how he plays, just to make the absolute perfect track.Dance with the Shadow is just a fantastic track. Opening with an ominous and atmospheric melodic vocal section, the song slowly builds into a rocking and greatly dynamic track, mixing great metal riffs and slower more deliberate and hard progish riffs and ethno rhythms. The song is really the first to show the band's true connection to the genre with a great and crazy instrumental section with a cool synth solo that just drops right back into the slower and melodic beauty of Doma's voice and bass playing. Overall, it is the next epic and a fantastic show of the band's skill in every aspect.Before, the ending, ends the album on a similar to note to what it began, a more atmospheric and ethno sounding track. It closes the concept of a man who can't stand his own self and refuses to accept reality (at least my perception, I haven't looked into the lyrics very much). The song is a fantastic 'summary' of what you have just experienced, mixing some of the heavier aspects of the song with more of the slower and deliberate and melodic feels of the album in a marvelous amalgam of music. Overall, the track ends the album fantastically, leaving you excellently satisfied with life.ALBUM OVERALL: It's easy to see why this album is considered one of the best of the progressive metal genres, even though the band and the album aren't even 10 years old (well the band is 10, but the album is merely 6). To see such a 'youngling' excel amongst 25 year vets like Dream Theater and 20 year runner ups like Pain of Salvation is extremely impressive. The album success is mainly due to its great new style ' nothing that the average prog metal head has ever heard of. The band fuses a delicious blend of ethnic metal and progressive rock to make an infectious brand of music ' Riverside style. Overall, the album is nearly perfect, except some of the atmospheric stuff could have been forsaken. But, other than that, the album has not a single flaw and provides one of the most exciting and refreshing musical rides the genre has heard in a long while. 5- stars."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Saturday, January 7, 2012",
      "rating": 5,
      "text": "Riverside create an emotionally charged masterpiece of colossal power.The second Riverside album features some of the most enduring material of the band and the heaviest work until the masterpiece \"Anno Domine High Definition\". Mariusz Duda is always excellent on lead vocals and also plays bass. The guitar work of Piotr Grudzinski is incredible on this album. Michal Lapaj is simply astonishing on keyboards and Piotr Kozieradzki is wonderful on drums. Every track on this album is superb, and some tracks are indispensable. 'After' begins with whispers that are rather chilling and then a very slow ambient Porcupine tree style sound takes over.'Volte Face' has a driving heavy rhythm and wonderful guitar notes ringing out over the loud percussion and shimmering Hammond. Then that awesome riff with odd time sig crunches and it is a prog metal sanctuary. The spacey vocals add to the atmospherics until we get to the first verse. The melody is pleasant in the quieter sections and it builds to the aggressive passage \"I'm not afraid\", and the Hammond quivers over the crashing guitar chords. Masterpiece song without a doubt.The piano solo that begins 'Conceiving You' is appropriate as Duda really delivers a powerhouse vocal, with emotion and vitality, \"been conceiving you for too long, if only I could change all things around.\" The lead break cries and soars as the soundscape builds to a crescendo. The wall of sound that Riverside are able to create is astounding, and really touches the emotions powerfully.The first epic is 'Second Life Syndrome' a 15 minute eargasm of intricate virtuoso musicianship and towering vocals. An instant classic, the song boasts one of the best structures of the band's repertoire. It begins with a drone and Pink Floyd style guitar riff and then it gets heavier building in intensity, with Hammond blazing and a divine bassline locks in. The vocals of Duda are crystalline and pleasant; \"From day to day, From hand to mouth, We're turning around, Vicious ritual, Getting used to it all, Falling down again, We're waiting for, The decrees of providence.\" The melody is ultra-infectious and the heavy guitars augment the dark overtones. Soon the lead break takes over and it is superbly executed by Grudzinski. There is no mistaking the massive sound on the keyboards, violently hammered by Lapaj. The song settles into bassline and echoing keyboards, changing feel and allowing the music to breathe. Duda is gentler on part two; \"I just want to feel your sigh on my neck, Want to feel your breath, Feel your need to stay, You don't know my name, Don't know my face, Only thoughts I share in my secret place, Secret exhibition, Cure for loneliness, I've ground to a halt, There's no turning back, You know there are things I just can't forget, You've helped me so much, To learn to be detached.\" The second lead break is spacious and soars with sustained held high pitched notes. Part three, Vicious Ritual, is an instrumental to finish this magnificent track. The music becomes spacey and whispers are heard with footsteps effects. The result is a creepy but compelling sound. As the bass joins in cadence with the whispers, guitars grind out a crushing distorted chord structure. A King Crimson polyphonic rhythm dominates, and some more vocal intonations \"you will never suffer.\" The last lead break is the final drawcard and caps off an absolutely brilliant track.'Artificial Smile' follows with a fast heavy tempo and some sensuous synths over a melodic hook. The vocals are still clear though much faster, and he occasionally uses a raspy tone to emphasise the anger in the words; \"I hate you cos they love you, I'm so happy when they left you, this is my life! Sell me your mind!\" This may be one of the heaviest Riverside songs but has still the strong organic symphonic nuances and equable lead guitar.'I Turned You Down' drips with an endearing bassline and peaceful guitar violining. The spacey textures are the sort of music that would permeate the next album. Very ambient verses follow; \"I turned you down so hastily, and it's tearing me apart, in my heart of hearts I'm screaming, in my heart of hearts I cry and it's cold, you're so cold.\" The lead guitar swells are beautiful over the synths. A heavier riff threatens to break through before a lead break overwhelms the serenity, and it is a darker atmosphere that supervenes.Following this is 'Reality Dream III' with nice reverberated harmonics in the intro until a bass rhythm fades up. The tempo locks in and becomes an unusual time sig. The instrumental makes a pleasant break and one can just become immersed in the music. There is a heavy metal riff that pounds and chugs along and then a heavy handed piano is heard. The guitars join this new time change and then the Hammond returns like an old friend.'Dance With the Shadow' is the second epic of the album starting with a low drone and gentle vocals. The Gilmour-esque guitar is prevalent and then an extremely heavy guitar changes it and it is more like Dream Theater with Petrucci riffs. The synthesis of psych space prog and metal is a key feature. The middle section settles into a calmer tunnel I'm standing on the edge about to fall, in the middle of the point o no return, trying to forget those days I failed to act, I can almost see the light, feel its warmth, and as the moment I was waiting or so long, I carry all before me now the die is cast, with open arms I'm standing out against my past.\" At 10 minutes in the sound builds up and a cataclysmic explosion of Hammond and metal dramatically clash and the riffs intensify till it ends. Incredible breathtaking music.The final track 'Before' is a slow calm after the storm. It builds to a forceful flurry of riffs and then it is all over, and you long to play the whole album again.The only conclusion that can be drawn after being treated to this extraordinary music is that this is a masterpiece from Riverside. Everything works perfectly to create some absolutely incredible music; the vocals, bass, guitars, keys and drums are an amalgamation that showcases all that is great about prog rock. Strong melodies, intricate complex time sigs, compelling lyrics and amazing musicianship. This, along with \"Anno Domine High Definition\", is one album that towers over all the rest."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Sunday, March 25, 2012",
      "rating": 3,
      "text": "I seem to be in the rare position of not actually liking Riverside's second album as much as their first. I don't know what it is - certainly, aside from a slightly heavier emphasis on the metal side of their sound, most of the ingredients of the first album are here - but on balance I think it's down to the album sounding a bit more cold and clinical in its execution than the previous album was. It's enough to make me worry that Riverside may go down the same path as so many other prog metal albums whose works are widely celebrated in the community but leave me cold - an over-emphasis on technicality without a corresponding increase in the band's command of emotion and atmosphere (or, as in so any cases, a positive decrease in that)."
    },
    {
      "reviewer": "The Crow",
      "date": "Posted Sunday, July 16, 2017",
      "rating": 5,
      "text": "After the splendid Out of Myself, Riverside achieved to do even better witch Second Life Syndrome!Not just the production is better, also the playing of all the members of the band improved since their debut, raising the level of complexity and deep to previous unknown limits for this band. The general style of the album is a bit less jazzy than in the band's first release. So, if you are a diehard fan of Out of Myself, maybe you'll miss the most trip-hop atmospheric sections.But the band gained tons of skills in songwriting, achieving a collection of songs which is far superior. I honestly think that the band's peak is here. In Anno Domini High Definition they almost achieved the great quality of Second Life Syndrome, but it's a step under nevertheless. Let's discover what made this record so good!The album starts with After, a very dramatic and appropriate intro with splendid vocals and the rest of the band sounding just perfect. This song is like an introduction of what Mariusz Duda would make in its parallel project Lunatic Soul, ethnic influences included. Then Volte-Face comes like a punch in your face with its strong riffs, passionate singing and oriental melodies. Stronger, very stronger than Out of Myself.But then Conceiving You brings back this most intimate side of the band, much in the style of In Two Minds of the previous release. The lyrics are also perfect, making a milestone in the band's career, just like the title track... An authentic progressive tour de force in three acts with perfect songwriting, marvelous lyrics and an epic guitar solo towards the end. Outstanding!And the guys of Riverside wanted not to bring the party down, so after Second Life Syndrome they included Artificial Smile, another great and rocky song, very prog and perfect to be played live. But if you think that the thigs could not be better, then listen to I Turned You Down... The best song of the album and one of the best of the band's whole career. I can't even describe what this song means to me... And my wife. I just LOVE it.Reality Dream III is a superb instrumental track with protagonism for Lapaj and the solos of the very missed Grudzinski. Better than the Reality Dreams of Out of Myself in my opinion. And what's to say about Dance with the Shadows? It starts in a very soft way, with a very catchy vocal melody from Duda, and it soon evolves to a very dynamic and complete progressive metal song, with the typical Riverside's more atmospheric and dramatic sections in the middle. The lyrics talk about loss and craziness, introducing the main theme of the next album Rapid Eye Movement. Great riff after the minute 9!And Before ends the album in the same way that OK did in Out of Myself... Another precious lyric from Duda for a track with trip hop influences.Summary: Second Life Syndrome is not perfect, but every song included is just great. If you like melancholic crossover prog with strong lyrics, great playing, a very personal approach to instrumental sections and a unique voice this is the best place to start. This is still in my opinion the Riverside's best album to date.An outstanding masterpiece and one of the best progressive rock albums from the last decade.Best Tracks: all of them.My Rating: *****This review is dedicated to the great and very missed guitarist Piotr Grudzinski. Rest in peace wherever you are, brother!"
    },
    {
      "reviewer": "Kempokid",
      "date": "Posted Friday, January 18, 2019",
      "rating": 3,
      "text": "'Riverside's' second album manages to rectify the issues that their debut, 'Out of Myself' had, balancing between the heavier and softer moments much more effectively, and also not wearing their influences from bands such as 'Anathema' and 'Pink Floyd' quite as much on their sleeves. Their sound in general is a much darker one, with more emphasis on the metal aspect of their sound, rather than their soft, beautiful ballads. Despite many changes that I find positive, especially the better establishment of their sound and identity, I do have some issues with this album, particularly in terms of certain songs not quite leaving any kind of impact.'After' already shows how this album will have a darker sound to it, beginning with whispering before leading into a really nice, and simultaneously eerie chant nicely utilising vocal layering. This segues into one of the better songs on the album, 'Volte Face', a great, heavy piece of music with some great riffs with a Middle-Eastern sound to them. I like the way the song slowly progresses as it goes on, starting off with the chorus ending in regular, clean vocals, and then having every time it appears be more intense, until harsh vocals are used, which sounds excellent in this, and really displays how 'Riverside' are trying to make a heavier album with less focus on their softer moments. Speaking of softer moments, the next song, 'Conceiving You' is the first weak point on the album. I find this to have nothing of much merit, with it being fairly unmemorable, and not even having the beauty or impact that's usually associated such ballads. I honestly find this slightly perplexing how a band who on their previous album made songs such as 'OK' and 'The Same River' could miss the mark with something beautiful quite as much as they did here. I think the main issue with it lies in the highly unsatisfying vocal melody, particularly the chorus. The title track, despite having some pacing issues and sounding far too much like 3 songs stitched together, manages to be quite good, as each section works very nicely. It's full of great instrumentals and solos, is quite dynamic, and has some absolutely incredible vocal melodies, most notably the chorus, which is nicely implemented in the second section, getting slower before transitioning into the third section. While I wouldn't put it among the various amazing epics, it's still a good song in general, despite some flaws in terms of pacing and the last section definitely dragging a bit. 'Artificial Smile' kicks things back up after the lull from the end of the title track, being another great metal track with heavy riffs and a lot of energy. Despite this being one of the more simple tracks, and Mariusz Duda's thick Polish accent making some inflections sound off, it's nonetheless an excellent song and one of the higher points on the album.The second half of the album feels somewhat weaker than the first, with some excellent songs, but nothing that particularly amazes me as much. 'I Turned You Down' is mostly unimpressive, but then has some absolutely exquisite guitar work thrown in that elevates it quite a bit, making it a good listen all around, with the keyboards also adding some good atmosphere. 'Reality Dream III' isn't on the same level as the first 2 in my opinion, but is still a good, heavy instrumental with plenty of great riffs and a really fun piano section, which plays nicely off the bass and guitar. 'Dance With The Shadows' is the biggest weak spot on this album, being very overlong without having any particular moments in which anything which particularly grabs me, outside of some really cool keyboards at around the halfway point. The big problem is that the almost 12 minute length makes it a much more difficult song to deal with than 'Conceiving You' which at least has the benefit of being very short. After that slog, the album ends well with 'Before', the one moment on the album which I find truly beautiful, and definitely ends the album on a high note.Despite the more intriguing sound that 'Riverside' possesses here, I do find this album to be vastly inferior to their first, largely due to many moments on this either feeling overblown, as is the case with parts of the title track and 'Dance With The Shadows' or not explored enough, especially 'Conceiving You'. This definitely is impressive in the sense of how great I find the tone and production of the album, being extremely distinctive and interesting, definitely paving the way for later albums which improved upon some issues. Despite the blatant issues with it, I do find that this album has both enough interesting moments as well as sounding great, that it warrants getting 3 stars despite the almost 20 minutes worth of music I find largely uninteresting.Best Songs: Volte Face, Artificial Smile, BeforeWeakest Songs: Conceiving You, Dance With The ShadowsVerdict: Really dark sounding music with quite a bit of heaviness to it. I'd recommend it to those who enjoy this sort of music, despite me finding this album very mixed. At the very least, I'd give Volte Face a listen, as it's definitely one of the highlights of the album, balancing their heavier, metal aspects, with some prog, providing a great balance."
    },
    {
      "reviewer": "octopus-4",
      "date": "Posted Friday, June 14, 2019",
      "rating": 4,
      "text": "I think one of the best characteristics of prog music is that usually very good albums can flow seamlessly from the beginning to the end, and even when there are huge differences between different tracks or sometimes inside the same track, they are just part of a whole.This second album of the Polish Riverside belongs to this category. It contains some scream, some very heavy distorted guitar, but there's also an Emersonian piano, moments Pink Floyd like and an obvous connection with Porcupine Tree. It's not a coincidence if the last albums of this band have been engineered by Steven WILSON.For my nature I prefer the Floydian moments, but I absolutely don't dislike the heavier parts. Mariusz Duda has a great voice in both clean and screaming, as well as the missed Piotr Grudzinski can do what he wants with his guitar. Possibly one of the most talented rock guitarists of the current century. Not that Lapaj And Kodzieradki are less skilled, of course.I have to say that \"Conceiving me\" is the first RIVERSIDE song I've ever listened to, and I was stunned by the title track immediately following it on the album, a 15 minutes epic which crosses the whole prog.metal subgenre.I have mentioned Grudzinski. His guitar playing is closer to John PETRUCCI or than to GILMOUR, but it has a FLoydian mood in choosing the right notes, without putting too much stuff in a solo and supporting the band when his guitar is not the leading instrument.The last track, \"Before\" can be taken as example. All the four create a soundscape in which there's not a prevalent instrument. All do their parts and the result is excellent. There also a bit of GENESIS influence on this track in my opinion.Anyway this is very close to be a prog masterpiece, and honestly even if I'm not much into prog-metal as subgenre I have to say that RiVERSIDE has become one of my favorite bands, and this is the album from which I have discovered them."
    },
    {
      "reviewer": "TCat",
      "date": "Posted Monday, March 23, 2020",
      "rating": 4,
      "text": "Riverside is a band that I have mostly considered to reside somewhere in the safe heavy progressive territory that exists somewhere between Opeth, Porcupine Tree and Tool, taking the best of those three bands and adding their own twists here and there to create astounding, emotional and melodic metal, almost inhabiting that space before Opeth did. Even though they are quite successful, especially within progressive circles, they haven't quite reached the pinnacle inhabited by those three bands, but were just as influential creating this niche as they were. They would also inspire and influence many more Polish progressive metal acts over the following years.The band found out how well they fit into this niche in 2005, when they surprised the progressive metal world with their 2nd album 'Second Life Syndrome'. Their music has matured quite nicely, even though they had only put out one album before this, and this album ended up sounding more like a mature band that had been around for a while. The album is full of mostly moderate tempo anthems, but that dark and expressive territory is explored to its most dynamic regions.At first listen, the music might seem a little too much alike, especially where the tempo doesn't really change much, however, there is so much to discover with repeated listening. All of the things that might not be apparent at first really start to shine through. The band's talents draw you in and the way they experiment with the dynamics sometimes even bring the music to new heights that have also been approached and explored by those bands that are more famous. Just listen to the tour-de- force of emotional range on the 2 epic tracks; the title track and 'Dance With the Shadows'. Suddenly, all of the hesitancy and unsurety of the first album (which actually seems more polished and insincere) are surpassed as if the band was told to just follow their instincts and let loose with their ingenuity.The only thing keeping this album from being perfect is that the tracks do have the same atmosphere, and Riverside does have a hard time breaking from that formula. More exploration or experimentation might help, but the band has also tried some experimentation and it doesn't always seem to work to their advantage. One place that it does is on this album with the instrumental 'Reality Dream III' which is probably the most explosive track on the album. Yes, it takes some time to build up its crescendo to an amazing climactic ending, but that is also what makes it more powerful.Progressive fans will still find plenty to keep them happy here. The songs are structured somewhat similar to that of Tool in that the song structures are not in any way traditional, that there are plenty of rhythm, meter and melodic changes throughout the album to keep most of those fans happy. The music on this album is not that challenging either, but it still captures you and keeps your mind engaged with its somber yet dynamic atmospheres. This is an excellent album and is one that progressive metal lovers should be familiar with."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Thursday, January 11, 2024",
      "rating": 5,
      "text": "After \"Out of Myself\", Riverside's surprising introduction where they showed a solvency and instrumental aplomb uncommon for a band that was just taking its first steps, the time had come to ratify that it had not been the fruit of a fleeting inspiration. \"Second Life Syndrome\", their second album and at the same time the second part of the three that make up their \"Reality Dream\" Trilogy (the story of a lonely man who fights with himself to overcome his inner demons and move forward), not only confirms the band's excellent form, but also consolidates them as one of the most auspicious appearances in the progressive scene of the 2000's. Led by Mariusz Duda, singer, bassist and main songwriter, Riverside brilliantly fuses elements and nuances of the hardest and darkest side of progressive rock (Dream Theater, Opeth, Tool, for example) with atmospheric digressions into the intergalactic oceans of the genre (Pink Floyd, Porcupine Tree).Nothing seems to be left to chance, from the whispering start of the hypnotic \"After\", the songs follow one after the other instrumentally intense and piercing, with Duda's deep voice very versatile and demanding, even reaching guttural notes without problems as in the energized \"Volte-Face\" or in the very heavy and fierce \"Artificial Smile\", Piotr Grudziński's protagonist guitars, clean and sustained and with clear floydian influences, as in the superb and extensive \"Second Life Syndrome\" and its initial airs to the Gilmourian \"Shine on... \"(one of the best pieces of the album), and also rough and forceful as in the super progressive \"Dance with the Shadow\", and the excellent accompaniment of both keyboardist Michal Lapaj (incorporated after the departure of Jacek Melnicki) who builds spacey synthesized carpets for all the themes and contributes some beautiful piano notes in the peaceful and harmonic \"Im Conceiving You\", and the sober percussionist Piotr Kozieradzki to complete the fantastic sound wall of an unmissable album.Beyond its progressive metal label, \"Second Lyfe Syndrome\" is a top album of the progressive genre of the last two decades, and positions the Polish band as one of the must-listen references for fans of the genre.Superlative.4,5 stars"
    },
    {
      "reviewer": "A Crimson Mellotron",
      "date": "Posted Saturday, November 23, 2024",
      "rating": 3,
      "text": "Representing the minority of people who favor Riverside's debut album over their sophomore release 'Second Life Syndrome', I must say that their second studio outing is an unnecessarily drab album that is way too derivative of its predecessor, quite one-dimensional compared to 'Out of Myself' which bolstered a fine balance between heavy and mellow, and with significantly less memorable moments and highlights, in opposition to the general opinion that this is the band's strongest offering. Not to mention the hideous album cover - perhaps reflective of the music and the overall feel of 'Second Life Syndrome'. The Polish proggers followed up their lovely debut album with a record that strongly draws upon the same influences, this time however with a much stronger inclination for a heavier sound, abandoning their more experimental and even psychedelic aspirations, glimpses of which could have occasionally been caught on 'Out of Myself'.And in an attempt to craft a more rough-sounding album, Riverside had apparently focused on a more guitar-driven riff-based writing, as opposed to the more organic sounds of their debut album, resulting in a less-thrilling experience. The 15-minute title track is arguably the highlight of the album, a fine presentation of the various aspects of Riverside's music, when they successfully integrate their melodic choruses into the dense nature of their often-drab songs. 'Volte-Face' is another good example of how their heavier inclinations may lead to pleasant results, together with the shorter track 'Conceiving You', reminiscent of the band's previous album. Nevertheless, there are many uninteresting moments here (examples would include the opening and closing tracks, 'Artificial Smile', 'I Turned You Down', and 'Dance with the Shadow'), as the band tends to drift away from their focused songwriting into a more technical style of play that does not complement the songs but instead makes up for a much colder delivery. As good as the album is, it has a more monotonous presentation, derivative of the sound of the band's debut album, as mentioned previously and definitely colder and more contrived in execution. Even if the main Riverside ingredients are present, the album is less atmospheric, less organic, or in a word, good but nothing more."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album0d91.html",
  "last_parsed": "2025-05-18T00:37:43.923719"
}