{
  "album_title": "THE ROAD OF BONES",
  "artist_name": "IQ",
  "artist_page_link_local": "artist1258.html?id=165",
  "year": 2014,
  "rating_value": 4.25,
  "rating_count": null,
  "review_count": null,
  "genre": "Neo-Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/165/cover_3550151852016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "From the Outside In",
      "duration": "7:24",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "The Road of Bones",
      "duration": "8:32",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Without Walls",
      "duration": "19:15",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Ocean",
      "duration": "5:55",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Until the End",
      "duration": "12:00",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Bonus disc on Box Set & Limited edition",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 1,
      "title": "Knucklehead",
      "duration": "8:10",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "1312 Overture",
      "duration": "4:17",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Constellations",
      "duration": "12:24",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Fall and Rise",
      "duration": "7:10",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Ten Million Demons",
      "duration": "6:10",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Hardcore",
      "duration": "10:52",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Bonus disc #2 on Box Set - \"The Road of Bonus\"",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 1,
      "title": "From the Outside In (first studio run-through)",
      "duration": "7:25",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "The Road of Bones (first studio run-through)",
      "duration": "8:35",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Ocean (piano/vocal version)",
      "duration": "5:52",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "The Slender Sky",
      "duration": "13:56",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "McDozenStrings",
      "duration": "4:08",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Without Walls (live medley)",
      "duration": "12:45",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "From the Outside In (live)",
      "duration": "7:51",
      "is_sub_track": false
    }
  ],
  "lineup": [
    {
      "musician": "Peter Nicholls",
      "instruments": "lead & backing vocals"
    },
    {
      "musician": "Michael Holmes",
      "instruments": "guitars"
    },
    {
      "musician": "Tim Esau",
      "instruments": "bass, bass pedals"
    },
    {
      "musician": "Paul Cook",
      "instruments": "drums, percussion"
    },
    {
      "musician": "Neil Durant",
      "instruments": "keyboards"
    }
  ],
  "reviews": [
    {
      "reviewer": "Warthur",
      "date": "Posted Wednesday, April 23, 2014",
      "rating": 5,
      "text": "Although its street date is May 5th, pre-orders of the sumptuous collector's edition of IQ's latest album have begun shipping already in order to get the sets to purchasers in time for the album launch show (tickets to which are included in the collector's edition), so I have been lucky enough to hear this latest release already.The Road of Bones is the second album in a row from IQ to feature a lineup reconfiguration, following the incredible streak from Ever to Dark Matter where the band lineup had remained extremely solid and stable. In fact, the lineup shake from Frequency to this is the largest between any two consecutive IQ albums, with three of the five band members not appearing on Frequency. Paul Cook and Tim Esau are, of course, old hands in IQ, being the group's original rhythm section (indeed, Frequency was the only IQ album not to feature Cookie on drums), whilst Sphere3 keyboardist Neil Durant makes his first appearance on an IQ album here.The obvious question, then, is how this shakeup affects the band's sound. Frequency was a refreshing update to the IQ sound; would the return of Paul Cook and Tim Esau reverse that musical progression, or would Neil Durant's inclusion allow the group to continue it? As it transpires, Durant is the surprise star player here, proving equally adept at a bang-up-to-date keyboard style and performances living up to the heritage of IQ's earlier material. (Constellations, one of several tracks on the bonus disc in the special edition of the album, showcases this distinction particularly nicely.)Tonally, the album finds IQ in a melancholic and reflective mood - one which often serves them well, as it did on albums such as The Wake or Ever - whilst the special edition of the album provides a bonus disc with a brace of songs which to my ears are just as strong as the compositions that made the cut, but which didn't fit the particular vibe they are going for here, and as a result the special edition presents a more diverse sound. Whether you plump for the 1CD or 2CD editions, right here you have IQ incredibly managing to continue their streak of top- quality albums which began with the classic Ever and still shows no signs of slowing down."
    },
    {
      "reviewer": "rdtprog",
      "date": "Posted Tuesday, May 6, 2014",
      "rating": 5,
      "text": "The band has developed their sound over the years with a modern symphonic sound that alternate some delicate often melancholic piano and keyboards lines with heavier and faster guitar parts. They know how to build their songs with a dark atmosphere set by the piano, vocals and keyboards that let slowly the spot to the dynamics guitars of Mike Holmes. A nice touch has been added here with the sound of xylophone and techno sounds that can be hear throughout this CD, probably the influence of Mike Holmes vision, who has produced and play in the excellent Regeneration CD with the Lens that contains a lot of techno sound.Sometimes we recognize some IQ previous passages from their older material, but not to the point to be a copy of it. I am glad to see that the band still got more ideas to create some nice music. Since the departure of Martin Orford, the keyboards sound has changed a bit, more diverse, so that is reflecting on the music. There is more ambient sounds that prepare us to the more energic part of the song were the tempo is getting faster in the typical IQ fashion. After many years, it's always nice to hear the great production in their music. The band has put all the ingredients together to make the perfect progressive rock CD; inspiring songwriting, diverse arrangements that harmonize the acoustic with the electric and a great sense of the melody like not many bands can do. We can say that IQ is the modern version of the old Genesis, because of the voice of Peter Nicholls, some Hackett guitar influence and also some Banks reference that we can find at some places on this release, but they have surpassed this influence long time ago. The bonus CD is also of high of quality with again more spacey and techno sounds, something that was emerging in the first CD, sometimes reminiscent of Vangelis and Depeche Mode. It's a little breather from the first CD, especially for Mike Holmes who takes a break here to comeback in the last song. The pace is slower and more relax on this one, but it complete perfectly this great release.I have always found difficult to pick a favorite one in IQ discography, but I think that this one could become my favorite. I can't give anything less than 5 stars. I am sure that many will share my enthusiasm with this new release."
    },
    {
      "reviewer": "lazland",
      "date": "Posted Thursday, May 8, 2014",
      "rating": 5,
      "text": "IQ, that venerable outfit of 1980's vintage, release this, their 11th studio offering, and, I will say straight away, are sounding as strong, if not stronger, than ever.This review is of the double cd I pre-ordered, and which is available now from all the usual quality outlets, and I would wholly recommend that potential purchasers get the whole thing. To be very fair to IQ, they have made the entire work available on release at a reasonable price, with no follow up rip-off's to us poor old punters, and support is deserved for that alone.The first cd, The Road Of Bones itself, is a concept piece that is not just dark, but actually very bleak and positively gothic in places, telling the story of a rather nasty serial killer in the first person. You would think, then, that the music itself would match such a story; you know, an album which would make Pink Floyd's The Wall a veritable ray of sunshine to come down to after listening.But, no, not a bit of it. This sumptuously produced (and Mike Holmes has really exceeded himself in this department), and gorgeously performed work just about takes us through the entire range of emotions, with passages which are achingly beautiful, and a rock experience which takes us from the hard and crashing opening, thundering, riffs of opener From The Outside In, to the quite gorgeous acoustic interplay on guitar, piano, and vocals at the denouement of closer, Until The End (which itself follows a really beautiful wall of sound in the finest symphonic tradition).More experienced IQ followers such as myself will, on the first couple of listens, have been surprised at the relative absence of genuine Holmes guitar bursts of days of yore. Indeed, it is, in my opinion, fair to say that this is the most keyboard dominated IQ album in many a year, perhaps ever, and massive credit must go to Neil Durant, who creates such a huge wall of sound and virtuoso performance that really do go up against the best Orford produced for the band, he is that good. However, saying this, this album is a genuine ensemble piece. The joy of hearing our favourite rhythm section of Cook and Esau, who shine especially on the beautiful title track, whilst Holmes, if not understated, is most certainly not at the forefront of all the action as he was during much of Frequency, although his bursts towards the close of epic Without Walls are pure trademark Holmes brilliance, and remind one of the similar beauty of Dark Matter. And, thence, to Peter Nicholls. I have always loved this man's voice, a set of chords capable of belting out a massive piece one minute, with a tear inducing piece of fragility the very next, and so it is on this album. His voice, if anything, is growing and becoming a damned sight better the older he gets, and his is without doubt the only one I can think of capable of telling this theatrical piece properly.There are five tracks on the first cd, and all of them, without exception, are essential IQ, that is, for those who know my opinion in such matters, right up there with the best progressive rock. Without Walls, just a shade short of twenty minutes long, never once fails to grip your attention and pull your heart strings. It contains all the vital elements that make this band so important, from those well versed symphonic soundscapes, to very dark introspective instrumental passages, massive riffs, some lovely acoustic work, some very clever sound effects, and quieter moments which, rather frighteningly, allow us in the subject's innermost feelings. The manner in which the vocals and music change mood and interpret a story are fantastic.And so to cd two. There are those who tell you that it is as good as cd one. They are extremely close to the knuckle, because, in Prog Archives parlance, cd one is a masterpiece, whilst the second helping is merely excellent. Which is to say, again, that it is at the top of the prog tree. Highlights for me are the exceptional Constellations, on which this lineup sound as if they have played together all of their career, with Durant, especially, sounding wonderful, helping to create a pomp prog spectacular; the clever instrumental 1312 Overture (so named because of its time signature); and the really rather exceptional opener, Knucklehead, which is perhaps one of the most experimental, and heavy, pieces they have released, although, in all honesty, there is nary a bum note or poor moment present throughout the cd. These are not \"throwaway\" bonus tracks, but a set of pieces which, whilst they did not fit into the main concept, deserved a release of their own. I for one, am very grateful they were. Six tracks, and 50 minutes of quality progressive rock.So, how to rate this? I think that IQ are a band who are still improving, which, given the fact that they have released some of the most important and vital neo-prog over the course of 31 years, is a testament to the quality present here. This is the sound of a band still striving to develop, mature, yet staying true to their glorious roots. It is simply a magnificent experience to listen to, and is genuinely the first utterly essential purchase of 2014 for me. Probably 4.5 stars, if we had such a rating, but rounded up to five because it is warranted.I tell you this. Pendragon, those other venerable survivors of yesteryear, will have to go some to match this when they release their own much anticipated new work later this year."
    },
    {
      "reviewer": "Flucktrot",
      "date": "Posted Thursday, May 8, 2014",
      "rating": 4,
      "text": "I was looking for some new prog to blow me away, and I did not expect it to come from IQ! I love the band, and they have been quite consistent over years and years, but there was no indication from the casual prog fan that they would be about to release an excellent new album that stays true to what the band does best--especially surprising because Frequency included some departures, indicating further experimentation--and has tightened up nearly every nitpick I might be able to come up with about the group. The fact that IQ has come up with this album, at this point in the band's career, has really elevated my respect for the group. I can't think of any bands off the top of my head who have accomplished this.Here's just a few of the reasons why I find this to be a fantastic album:1. Quantity and quality combo. To fill two discs worth of quality music, with really no low or skippable moments, is something that few bands have achieved, at least in my opinion.2. Interesting subject material. I don't know much about the album theme, but that's the whole point: it's gotten me to do homework outside of my listening experience and educate myself on an important historical topic. Few albums in my experience have done that!3. True team effort. Each member really shines, which is another compliment that I rarely give. Cook does some excellent fills and dynamics, and I appreciate that he's not just \"balls- out\" all the time. Holmes continues his Hackett-esque performance as well. He's not as continually present on this album, but he's there when you need it. For example, the Holmes rip at the end of Without Walls is classic: you're waiting the whole song for it, and when it comes, it's not technically amazing, but it's perfect for the moment, gets burned in your brain, and leaves you completely satisfied. Nicholls deserves special recognition as well. It's simply amazing how much better his voice gets over time, and it's a great model of successful aging. Esau brings wonderful variety on bass, which in my mind could come and go in previous IQ efforts. Finally, Durant is probably the standout among standouts. He provides the buzzy, bassy synths, tons of atmospherics, and, most impressively a perfect balance between wiggly synth lines and tasteful melodies.4. Presentation/lead up. Great cover, and, in hindsight, great choice for the title track. The title track is not an album highlight, in my opinion, but it offered the perfect tease of the alternating ambiance and intensity of the album. It got my attention in a big way, but it also left me wanting more. Imagine how satisfied I am now that I indeed got more, and in hindsight, much more than I had hoped for!5. Classic IQ song structure. These songs have a nice build of tension and pensive chugging (at least the extended pieces), but then things tend to pick up in fascinating ways, and then they deliver the big, warm reprise of which that IQ has made a clear niche.6. Production. This album just sounds incredible, and it's a tribute to the talent and attention to detail that went into its creation.Highlights: From the Outside In, Without Walls, Until the End, Constellations. We have the grinding IQ rocker (Arena, Immortal? era), the epic journey (complete with a wonderful nod the The Gates of Delirium toward the finale), and two extended pieces that remind me of the best of classic Collins-as-frontman Genesis. My only quibble is that I think the 1312 Overture (Rush YYZ influence!) would have made a perfect opener for the album, but that is a quibble in the smallest sense.Why not a five-star? For me, satisfying is not equivalent to mind-blowing, and this album is not mind-blowing. It's excellent, and that's why I like it so much. The highs are excellent, but they are not incredible, and thus, no masterpiece. Either way, it's my favorite IQ album, and I never saw it coming. These surprises are why it's worth it to keep coming back to prog, even when it seems like it has nothing left to give."
    },
    {
      "reviewer": "Second Life Syndrome",
      "date": "Posted Thursday, May 8, 2014",
      "rating": 3,
      "text": "Well, apparently I'm in the minority on this album from IQ. \"The Road of Bones\" is this neo- prog band's newest foray, and it comes across as darker and more mature lyrically than some of their previous albums. With a malevolent theme and what I expected to be stunning contrasts between dark riffs and bright synth, \"The Road of Bones\" was supposed to be a killer album, for me especially.There's something off about this album that I can't quite place. IQ has certainly given us an interesting album, as it's full of atmospheric and driving guitars, some great synth work, and some wonderful bass and drums. However, nothing particularly stands out for me. None of the instrumentation seems truly on point, crisp, or inspired. Take, for instance, the driving riffs in the opener \"From the Outside In\". It's as if I've heard that same particular passage a hundred times in other albums. It's good, don't get me wrong, but nothing special.There are other examples, though. The 20 minute epic \"Without Walls\" should be the cornerstone of this album. Instead, it contains only a handful of memorable moments as it plods along with little to no direction. Still another example can be found in the quieter moments of the album. IQ attempts to create some thick atmospheric sections that mainly consist of limited piano and singer Peter Nicholls' ponderous voice. This type of thing usually thrills me. I'd even call myself easy to please. However, the vocal lines are completely forgettable and the transitions to the rest of the song are just kinda there.I think that's my main issue with this album. It all just so \"blah\". It's not bad. It can even be enjoyable at times. However, it's so painfully average and pedestrian that I'd almost rather hear a band fail miserably at trying something new than listen to this flat, unremarkable album. In fact, even the cover art is so middle of the road. Sure, the performances (especially Nicholls' vocals) are okay, but, in the end, I think most amateur high school bands could play most of this, and probably compose something better, too.So, what saves this album? The title track is one of the best songs I've heard in 2014. It's so unfortunate and somewhat ironic, no? The title track is climactic, brooding, and ends in blazing glory. It finally provided that contrast I was seeking, and the lyrics are so personal. So, yes, this album was saved from an even worse rating through this one song, and also by the last 30 seconds of the album wherein IQ gives us the first atmospheric vocal/piano passage that actually connects.I usually am the one that is pleased with an album while others are lambasting it. However, I just can't see why others are praising this album, some calling it the possible album of the year already. If one great song and a handful of interesting minutes are enough to deserve that label, then I don't know why I even write anymore."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Saturday, May 31, 2014",
      "rating": 5,
      "text": "Prog does not necessary mean 'complex' ......and IQ has proved it nicely in this wonderfully crafted album that die hard fans like myself feel that it's worth waiting for an almost five years since its previous \"Frequency\" album released in 2009. It's been quite a while I have been thinking about writing the review of this long awaited album by the most consistent band on planet Earth in terms of music direction and sub-genre. They dare to stand tall with their direction in what so called neo progressive. I really admire IQ on this. One of major consideration for not taking part in writing my view on this album has been a juggle of complexity and simplicity. The matter is like this: almost at the same time of The Road of Bones by IQ , there is another excellent album by a supergroup Transatlantic who also released \"Kaleidoscope\" album. The fundamental question is only one: if I consider Kaleidoscope as an excellent album with a four star rating why should I give IQ with a five-star rating? Transatlantic music is more complex and challenging compared to IQ who plays simple prog music. I finally thought that the fundamental difference is on how each album maneuvers deeply into my emotion and it's totally a very personal taste and preference. Music to me is emotion and I have to admit that most of IQ music is very able to stir my emotion regardless its lyrics. the way the music is composed and then combined beautifully with melody line through vocal work as well as how solo works are intertwined sound really fantastic to my ears. That's why I put a full five star rating for this new album by IQ.As I put emotionally at my FB status:Np. IQ \"the Road of Bones\" ...a fabulous album. The opening track sounds like IQ plays metal as the music is in the vein of The Wake with high energy, powerful riffs resulted from tight basslines by the old timer Tim Esau (happy that he returned back to the band he supposed to be). It;s really a killer and it's strategically positioned as an album opener - what a brilliant idea! However, the second track is also another killer even though it starts in an ambient mode and moves slowly until ...again Tim Esau plays wonderfully with his bass guitar (is it a Rickenbaker? probably!). Not only that ... I love the way how the new keyboard player, Neil Durrant, inserts his mellotron-like sound at the background during the peak segments ....oh my God ...!What a fabulous musical journey I have experienced listening to only the first two damn killing tracks!!! I can not even afford to move to next tracks as my fingers keep pressing backward two times to get back to the opening track again .....!!! Oh no .....!!! This is truly a totally ngguweblak experience man!!! I bet you ....! Marillion Hogarth era must have learned a lot from being consistent ( or they are not capable anymore?) in neo prog music like IQ has demonstrated for years ... Yeah ...more than 30 years of prog nonsense!That long phrases resonate how this album really hooked me ('nggeblak' is my local expression on how the music has made me temporarily 'paralyzed' !) at first spin by only listening to the first two tracks only!IQ album has always been like that to me. At first spin I only could enjoy couple of tracks. It's not that I am too lazy to find the full journey and got the deep meaning of the music but ... I have already been \"satisfied\" by couple of tracks only - not the entire album. But as time went by I started to enjoy other tracks. Take example the Frequency album which at first I could only play regularly the title track, second track \"Life Support\" and a bit of some from other tracks. And guess what ....at later stage, maybe a year later... I Was totally in love with the \"Ryker Skies\" track that really make me 'ngguweblak!' to the bone. Yeah ... Ryker Skies is really a kiling track! I like the melody as well as the chorus line. It's really wonderful.My experience with The Road of Bones album is similar with Frequency as I fell in love at first listen to the first two tracks. Iplayed these two tracks over and over again until I was totally satisfied then I moved to next. The thing was, I mentioned in phrases of FB status, I could not afford to move further as the second track \"The Road of Bones\" finished I automatically wanted to go back to listen to the first track \"From The Outside In\". Then the journey continued with the album title track which is basically a simple composition but it's really heavy in nuances. I really love the first two tracks that made me play the two until I got it 'enough' to move to the next one.Only recently I pay attention to the third track \"Without Walls\" which indeed I like it very much too. It sounded to me at first reaction that this song somehow reminds me to 'Harvest of Souls' from the Dark Matter album. It starts ambient with a simple piano sounds followed with a drum loop that made me surprised as this is , I think, the first time IQ use the sound of drum loop. It was quite weird at first listen but as it grew on me , I then finally found that the loop has become a nice integral part of the whole song. The first three minutes plus duration this song moves in ambient mode accompanying a dark vocal line by Nicholls. But then the music moves in crescendo with a follow-up riff played in slow tempo. What a wonderful move! ......and the war starts at minute 6...as indicated by the very wonderful keyboard shot by Neil Durant that sounds really cool while accompanying Nicholls' vocal line. But that happens temporary as the music then is slowing down with long sustain keyboard sound at the back plus acoustic guitar rhythm section work by Mike Holmes. It's quite nice and reminds me to the nuance of Pink Floyd's Dogs from Animals album. The war continues again at min 10:22 as the music is heating up into faster tempo. And the peak of nice war happens at minute 12:20 when keyboard really take the lead in a wonderfully crafted solo backed with relatively fast tempo music. Oh man .... it's really coooooool!!!!The next track \"Ocean\" is probably the most pop song compared to other tracks but it's really good as a refreshment just before another excellent track Until the End that concludes the album excellently.Even though my CD package is the limited edition version with two CDs, I only make the review for the CD One as this is the main album. CD Two is nice also even though it's basically left overs. For IQ I always purchase the limited edition package as it has great bonus like the one in Frequency that contains live DVD of IQ - great performance, really! This time I did not preorder because my good friend who is a die hard fan of IQ purchased it for me PLUS the t-shirt (WHOOOAAAA!!!!!! Great one!!!) at IQ performance at Islington Assembly Hall, London, 3 May 2014.Overall, this is truly a fabulous album by IQ who has consistently produced excellent music from their more than 30 years of prog nonsense! I really love this album and it's still ini my regular playlist that I regularly play while I am working ora cycling or sipping a cup of coffee. The composition is really topnotch with fantastic melody line, great harmonies among instruments being played (even though this time Mr Holmes does not play that much long stunning guitar solo), beautiful transition pieces on changes of tempo, and most importantly ...this album is so cohesive so that the structural integrity has been successfully maintained from start to end. BINGO! It;s a perfect album that deserves a FULL five-star rating. Keep on proggin' ...!Peace on earth and mercy mild - GW"
    },
    {
      "reviewer": "kev rowland",
      "date": "Posted Sunday, June 1, 2014",
      "rating": 5,
      "text": "When this album arrived I didn't put it on the player straight away, but instead looked at the artwork and booklet, and kept thinking about Schr'dinger's cat. I so very much wanted this to be a great album, and until I put it on the player (and I still haven't read single review about this album as I needed to ensure that I wasn't being swayed one way or another) this was both a great album, and a poor one, both at the same time. I first saw IQ in concert some time in the Eighties when they supported Magnum at the Hammersmith Odeon and have seen them quite a few times since, the last being on the 'Dark Matter' tour. During that time I built up a strong relationship with Martin Orford, and saw him play solo a few times as well as with Gary Chandler and of course with Jadis as well, but after I moved to NZ he told me that he had left the band of which he was a co-founder. That shook me, and by the time IQ released 'Frequency' some five years after 'DM', Paul Cook had gone as well. I wasn't a fan of that album (and I totally understand that this could be due to emotions as opposed to quality of music), so what about this one? Great or poor?Five years on from 'Frequency' and yet again there have been changes in line-up. Paul Cook has returned, but perhaps the biggest surprise is that JJ is no longer on bass, but instead has been replaced by the man he himself replaced in the first place! Tim Esau is back, with his first album with IQ since 1989's 'Are You Sitting Comfortably?' I have always been a real fan of his playing and methods of attack, as he can easily move from fretless bass to many different styles: just check out 'Screaming' from 'Nomzamo' to see what I mean. Then on keyboards we have none other than Neil Durant. Neil may well be an unknown to many of you, but we have been friends for well over twenty years as he sent me the very first Sphere demo back in 1992 (and Neil knows I still have it, potential blackmail is a wonderful thing). A second demo followed in 1994, and they belatedly followed it up with a CD release on Cyclops in 2002, and it always amazed me that Sphere didn't become far more well known as they were/are all great musicians. I even managed to see them gig once in the Nineties, but here at long last Neil is able to put his talents to use on a larger stage.So, of the five members, four of them played on the first two totally classic IQ albums, so what would the band sound like in 2014, with one brand new member and two who had left (for very different timeframes) only to return? Absolutely brilliant is the way I would describe it.When opener 'From The Outside In' really gets going it reminded me of the very first time I heard 'Ever', when the band was again returning after a period of unrest: that time with a returning singer and a new bassist, four years after their previous release. Neil has always been a very fine keyboard player indeed, and here he has tempered the jazz influences he normally displays to fit in, and has also incorporated a lot of keyboard sounds that fans of the band will recognise from days gone past. He isn't Widge, and doesn't want to be, but he has made the seat his own by bringing in enough of the old to combine with the new that it doesn't alienate the fans of the old band yet starts to move in a slightly different direction. This is a dark album in many ways, and this comes through in the artwork as well as the album itself. In many ways this feels like a logical follow-on from 'Dark Matter' or 'Subterranea' as opposed to 'Frequency', and that has to be a good thing in my book.This is an album that I have fallen in love with as everything is right from the musicianship to the songs, from the production to the artwork. This is solid IQ, with everyone firmly gelling and producing more of the incredible music we have learned to expect from them, from rockers through to ballads, simplicity and complexity combining in a way that many have attempted to copy, but few have ever managed to achieve the heights. I have the double disc set, 11 songs at just over 100 minutes long, and it absolutely flies by as one classic leads into another. It would be wonderful to be able to see these guys play live, but I guess that isn't going to happen for me as I live so far away, so I'll just have to keep playing this. Again. And Again.And as for that cat I mentioned at the beginning. He is purring and stretching, ready to jump out of the box and take on the world. IQ are back where they belong, at the very top. www.iq- hq.com"
    },
    {
      "reviewer": "Hercules",
      "date": "Posted Sunday, June 1, 2014",
      "rating": 5,
      "text": "*This review is of the 2 CD edition.*I must have played this album 30 times or more, so I now feel able to review it.First spins of the main disc were not particularly encouraging. Apart from the title track, which is amazing on first listen, the rest seemed dark and a bit uninspired, I moved on to disc 2 (where the cast offs/second rate tracks usually reside) and actually liked that much more.However, IQ's material needs time to sink in. This is their first album entirely without Martin Orford (he wrote a lot of the material on Frequency before he retired) and, whilst the influences are similar, the execution is rather less bombastic.Of course, there have also been personnel changes. Paul Cook is less flashy than Andy Edwards but he fits the band perfectly. Neil Durant shows astonishing skill on keyboards, at times sounding very like the great Mr Orford but not imitating him. He is all over the album in the way Mr Orford was on Dark Matter, but less obtrusively; less \"in yer face\". But the real revelation is Tim Esau; the intervening years since he last played with the band have seen him develop into a superlative player who is equally at ease on fretted and fretless basses and conjures up some wonderful bass lines.Peter Nicholls has written some very deep dark lyrics and sings better than ever, but Mike Holmes is rather restrained, contributing far fewer of his trademark solos and much more heavy riffing.As for the main disc, the title track and Oceans, a beautiful gentle track which is the one light moment on the album, driven by Esau's bass and Durant's keys, stand out. The other tracks grow on you greatly with time and Until the End really excels, with some nice acoustic guitar and hints of some Scottish tune I just can't place. The epic, Without Walls, has some marvellous passages but just doesn't quite gel; it seems like lots of bits of songs joined together. For this reason, the main disc would get a high 4*.However, the 2CD edition has Constellation and Ten Million Demons, a stunning chunk of 80s style electropop (with a bit of Chicory Tip in the outro), both of which are worthy of inclusion on the main disc. Knucklehead, Hardcore and the 1312 Overture are also exceptional. This lifts the whole package well into 5* territory.My only real disappointment is the paucity of the great guitar solos for which Mike Holmes is famous, but this shows that IQ are still capable of delivering music that few bands past or present can match.An utterly essential album which contains easily enough great material to qualify as a masterpiece."
    },
    {
      "reviewer": "FragileKings",
      "date": "Posted Saturday, June 14, 2014",
      "rating": 4,
      "text": "Since first buying \"Frequency\" two years ago, I have kept IQ at the forefront of my listening choices. Whether mixing a playlist for my iPhone or burning a playlist to CD, or choosing albums to listen to during the week, IQ have more often than not made the selection cut. I have \"Ever\", \"Subterranea\", and \"Dark Matter\" as well, and \"Seventh House\" and \"The Wake\" are also on standby for a intended future purchases. I enjoy the mixture of heavy guitar, moody and dark or solemn music, the keyboards, and Peter Nichols' voice from the 90's onward. So when \"Road of Bones\" came out it was just a question of how soon I would order it. And I ordered the double disc version because I was sure it would be worth the extra money.As others have written, disc one is the new album that tells a serial killer's story and disc two is extra material that didn't follow the story of disc one but the band still felt worthy of releasing. I read a detailed review of both discs on a music blog and I had some ideas of what to expect. That reviewer said disc one was very good but some songs carried on a bit long and disc two was better but neither were as good as \"Frequency\". As \"Frequency\" remains my favourite IQ album, I approached \"Road of Bones\" with a little caution.First, I was impressed by how well the band sounded like IQ. They develop their sound over each album little by little but a few years pass between each release. Yes, some bands sound the same as they did 20 years ago these days but IQ have a slow evolution thing going on. Surely, much of the perceived change is due to the shuffling in the line up with only Nichols and guitarist Mike Holmes remaining from \"Frequency\", and yet the band is still IQ. In a way, this album is a very natural progression from \"Frequency\" without any drastic new change.One of the main changes I noticed is in the keyboard sound. That classic neo-prog synthesizer sound is still there but with some new sounds like vibraphone and a bit of electronica hinted at without taking the plunge like Galahad have done. These sounds have been added to the overall IQ sound without altering the sound of the band.The guitar in general strikes me as having been simplified. It serves more as a rhythm and mood instrument and less as a lead. I liked that Holmes actually didn't come in with his customary heavy chords in the title track until well into the song. It meant that by track two we were already hearing something different from the usual IQ dark sound. The album's epic track \"Without Walls\" is a little easier to digest than \"Harvest of Souls\" from \"Dark Matter\", in my opinion.The second disc begins with \"Knucklehead\" which sounds in every way like part of the \"Road of Bones\" story. It has the whispered voices from disc one and some of the lyrics sound very much like they belong to the story. \"1312 Overture\" is a little uneventful for me. I kept expecting some exciting keyboard adventure to begin but this sounds more like a backing track. The other songs on disc two are all enjoyable as is pretty much the whole double disc album. I feel as the other reviewer felt that \"Frequency\" is more exciting though that may be because the drumming had more flare and intensity at times. There were also songs like \"Closer\" which are very pretty, and \"Road of Bones\" doesn't get pretty for as long on either of the discs, though it still has its fair share of beautiful music in between the dark, heavy stuff.Honestly, though, I have no real criticisms about either disc. This is a very good IQ album and nothing to be disappointed with as far as I can see. It's not a total killer but it's definitely an album worth having. Both discs."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Saturday, June 21, 2014",
      "rating": 4,
      "text": "IQ can do no wrong, in fact when it comes to Neo-Prog they are at the top of the heap in my opinion with Fish-era MARILLION not far behind. That may be clear to me but there's a couple of things about this recording that aren't so obvious. First of all it isn't a concept album as many have thought, in fact the lyrics of the different songs on the first disc make that a no-brainer. The second issue is why put out a bonus disc of material when they could have just made it a double album? Well, the first proper disc does have the same sort of mood and vibe throughout which I do prefer to the mixture of styles like on the bonus disc, but most fans are saying they like the bonus material better than the proper album. This reminds me of when MARILLION released \"Marbles\" with a bonus disc of material which included \"Ocean Cloud\" which many feel is one of the best MARILLION songs ever. Since then I believe(perhaps wrongly) that \"Marbles\" is really considered a double album now by the band and fans alike. So will this eventually happen with \"The Road Of Bones\" ?\"From The Outside In\" opens with some incredible atmosphere and a sample of someone speaking from a movie before this urgent rhythm kicks in with vocals. Love the mellotron swells that come and go. How about the Banks- like organ 6 minutes in. The bass, drums and waves of mellotron are great, in fact these are the highlights of the whole album for me. \"The Road Of Bones\" is a song about a serial killer spoken in the first person. Again like the first track we start with atmosphere but this time sparse piano joins in followed by almost spoken vocals. It's all laid back here until things pick up 2 1/2 minutes in as the drums and bass kick in. The vocals become more urgent. Check out the vibes or xylophone that comes and goes on this one, they remind me of the eighties for some reason. I like them. It turns quite powerful 6 minutes in. Great section!\"Without Walls\" is the epic at over 19 minutes. A pleasant piano melody to start. Very chilled music right here as reserved vocals join in. A change 3 minutes in then it kicks into gear. Nice guitar work here and I like the organ that pulsates. Great section 6 minutes in as Peter sings with passion. A dark and haunting instrumental piece follows 7 1/2 minutes in. Very cool. It kicks back in before 10 1/2 minutes. Catchy stuff. It climaxes 13 1/2 minutes in, then settles back with synths before 15 minutes. Vocals are back. Mellotron and synths join in as it slowly winds down. \"Ocean\" is mellow with relaxed vocals but things get fuller on the chorus. Themes are repeated as it seems to build. I do love that chorus. \"Until The End\" takes about 3 minutes before we get a fuller sound. Nasty organ after 5 1/2 minutes. An epic section is followed by a relaxed piece of piano and acoustic guitar. Reserved vocals join in to end it.I'll touch briefly on the bonus disc. \"Knucklehead\" is the heaviest tune on here and the mellotron is fantastic! \"1312 Overture\" begins and ends with orchestral music but for me it's the music in between that satisfies the most. Lots of intensity and mellotron. \"Constellations\" might be the best track overall. Check out the drumming and mellotron early on. It makes me feel alive. It ends like it began. Just wow! \"Fall And Rise\" has some interesting sounds like banjo(I think) and other intricate sounds. A beautiful tune. \"Ten Million Demons\" is one I loved from the start. Heavy with mellotron and quite catchy. This has such a good mid-tempo groove to it. \"Hardcore\" is my least favourite tune on here but it's still a really good one.So I would rate this above their previous album \"Frequency\" but below \"Dark Matter\". This really is a grower for me and if it continues i'd give it 4.5 stars but for now a very solid 4 stars. Highlights are the bass, drums and mellotron."
    },
    {
      "reviewer": "tszirmay",
      "date": "Posted Sunday, July 6, 2014",
      "rating": 5,
      "text": "The Return of the Choir MellotronFor all its worth, any IQ album is subject to a vast array of opinions, going from \"masterpiece\" to \"I don't get it!\", an entirely understandable state of affairs when considering the pioneering legacy this band continues to enjoy. Yup, we all know the story, they were part of the heroic resistance to the impending disappearance of prog in 1977, when 'vanilla' punk ruled the hypocritical waves. Along with Marillion, Pallas, Twelfth Night and Pendragon, IQ forged ahead in the vast darkness. Each subsequent album has made an impact on the expectations from these wily veterans and releases such as Ever, The Seventh House, Dark Matter and Frequency have injected pride and passion into the flourishing scene, giving the lesser known bands a new source of inspiration and drive. Music for music's sake. The departure of the visually delightful master bassist John Jowitt, original keyboard virtuoso Martin Orford and drummer Andy Edwards did not really affect the sound all that much as new faces and old hats are now in the fold (Tim Esau and Paul Cook are back from their sabbatical). It seems that, like it or not, guitarist Mike Holmes remains the man responsible for the overall IQ sound and Peter Nicholls just stamps the lyrics with his theatrical voice. They also seem to take their time in getting new material done in a fashion that will keep old fans happy while seducing a new audience. Neo-pro, for all its opinionated shortcomings, has never produced more gems than in the last 10 years, a sub-genre that has been killing it with superlative new groups (Silhouette, Galahad, Anubis, Sylvan, Comedy of Errors, Magenta, Final Conflict, Shamall, Vienna Circle and a slew of others). Every day seems to announce a new arrival from France, Italy, Holland, Germany, Sweden, Chile, Argentina, Brazil, Norway and beyond. So, in all fairness to others, IQ are the shining light that keeps the prog road illuminated, intelligent music woven by supreme talents who have a peculiar vision of their sound, yet constantly look to reinvent themselves. That alone warrants the loftiest praise.Like most avid fans, I have opted for the 2 CD version (the more music, the merrier) and everything expected is reached in spades, with a package that will have fans and critics all caught up in their own personal interpretations, slicing, dicing and otherwise finding whatever they are looking for in a prog album. Yes, the mood reflects the somber cover artwork, a mist of swirling greys with an understood melancholic gloom that may appear out of nowhere, unexpected. Neil Durant is the main architect of creative keyboard work that sees little interest in technical prowess, completely subservient to the crew and their arrangement.CD 1 - \"From the Outside In\" intros with a Bela Lugosi accented \"Children of the Night\" and subsequent steamroller assault on the senses, crisp, heavy and actually closer to recent Galahad. From the opening chords, the mighty Mellotron has opted for the much vaunted choir option, (a personal longtime favorite) and it has not shirked its omnipotent desire to dominate the aural landscape. Paul Cook's marshaling beats show off quasi Led Zeppelin- like propulsion, nasty and lethal explosions of tectonic shock, Esau pulling menacingly on his basso profundo. There is little doubt that this piece has extraordinary 'live in concert' credentials, not just for its manifest bombast but also for its explicit winks at \"the Lamb Lies Down on Broadway\" cinematographic soundtrack. There is a gleaming metallic sheen here as well as elsewhere on the 2CD collection that should be obvious to any cursory listener.If there ever was a perfect IQ song (and there are many in the back catalog), the glorious title track would certainly fit the billing. It has a modern sheen, in that the keyboards have a most definite electro-glitter with a weighty beat and a grandiloquent presence, driving a metallic spike into the Neo-prog formula, a particular attention to forging stunning melodies adorned with twinkling orchestrations. The main theme is typical of the IQ veneration for colossal memorability, with a cute nod at Peter Murphy's classic \"Indigo Eyes\" there is a repetitive marimba/calypso keyboard tone that will corrupt any indifference and induce immediate 'kneeling at the shrine' hypnosis. The massed guitar onslaught, engined forward by that titanic Mellotron orchestration is a thing of beauty. This is progressive rock hit material. I could listen to these 8 and a half minutes on endless loop and repeat.IQ have crafted a loyal companion to their colossal epic \"Harvest of Souls\" off the Dark Matter album, though this 19 minute+ \"Without Walls\" may offer up more excitation than one could hope for, cool breeze drumming, sounding almost like a beat box combine with dense Led Zeppelin \"Kashmir\"-like atmospherics and majestic squalls of contrasts, a universe of salivating organ and a snarling Rottweiler guitar tirade. Nicholls howls with unabashed despondence, floating redolence and total confidence. Obviously, there needs to be many returns here to fully grasp the density and despair but that's what makes epics so gratifying, they keep revealing new details, such as the short \"The Knife\"-like take-off that winked at me and the sudden jangly guitar arpeggios a few seconds later, the rambling Hammond urging on explosion and the delirium inducing outro, thinking that the piece is over. Durant then flips on his switches and toys with his synths, giving another round to the microphone man. Beautiful, by any prog standard! Teacher, please don't leave us kids alone!\"Ocean\" took a long time for me to appreciate, as this and the following piece seemed to get caught in some invisible net. Fragile, puerile, bucolic, pastoral, it's actually a song in its purest form. In fact, I find myself comparing this to a Howard Jones/Naked Eyes/Thompson Twins electro-pop ballad. Truth is I am starting to really enjoy this track but it has been a slow-burner.We end the first installment with the underwhelming \"Until the End\", a cosmetic hodgepodge of altering nuances, a dozen minutes of intransigent drama laced with booming bass in overt Rutherfordian upper cut, tortured synthesizer punching and careening guitar jabs. The gritty song is initially a struggle in its performance and therefore in its acceptance but again, repeated returns have peeled off layers of tear-inducing onion, only to discover the underlying quality of the musicianship and the singing.CD 2 - As correctly stated by numerous previous observers, this second CD is as tasty, if not more so than the glittering first one, a real double whammy treat for the fan, the band was obviously inspired by all the \"remue-m�nage\" going on between members leaving and old vets returning to the fold. I guess the term 'musical chairs' has never been more appropriate. The brash \"Knucklehead\" blasts with serpent-like conviction, massive dollops of buttery choir and violin Mellotron cater to the sonic buffet, with enough twists and turns to keep us proggers on our tippy-toes.\"1312 Overture\" is studiously more orchestral than anything remotely neo-prog, a perfect example of how rock music can be 'classicalized' and satisfy the most irascible fan. It is a humorous and clever wink at Piotr Tchaikovsky's classic \"1812 Overture\", a piece depicting Russia's defiant defense from Napoleon's conquering Grande Armee. It has an obvious military tone to it, complete with cannonade fireworks, howling winter-like Choir Mellotron and gentle yet abject surrender.The cinematographic splendor of \"Constellations\" is perhaps the most terrifyingly accurate IQ song ever, as if the lads were all born brilliant and decide to harvest their souls for added inspiration. Peter Nichols has never sounded more accomplished, compelled towards excellence by the grandiose keyboard avalanche which in turn is propelled muscularly by both Tim Esau's burly bass and Paul Cook's driving rhythmic pulse. Guitarist Holmes does finally step out into the spotlight and he glitters with fluid streams of electricity, as well as arranging a sure fire IQ classic in the process, including the overt Genesis influences that we all know and love. Here, it's at its zenith in terms of successful seduction.The lovely \"Fall and Rise\" showcases Esau's exceptional fretless bass prowess (another valued prog idiosyncrasy), deft acoustic guitar from master Holmes who is a darn good player, as well as Nicholls vocalizing with his usual maitrise. A pleasurable ballad that will get many more repeats from my devices.When I first heard \"Ten Million Demons\" somewhat absent mindedly, I was taken slightly aback as I thought that Depeche Mode had suddenly gone progressive and bullied themselves onto this record! Just like their friends Galahad (who have been crafting quality neo-prog for 29 years now), IQ has been unafraid of infusing little hints of synth electronica, a trait that has kept their respective recent releases fresh and enticing. The track again showcases Neil Durant's keyboard command, capable to do his Tony Banks thingy as well as a mean Thomas Dolby!While we are at it, the lugubrious \"Hardcore\" does just that, incorporating tenser tendencies that swerve near neo-gothic horizons, something wholly Wagnerian but in a more prog context, injecting brooding rhythms and somber motifs , and need I to repeat myself , more of that unctuous Mellotron! This hazy piece seeks out some eerie spectral environments, daubing greyish halos on the grave and funereal accompaniment. Another brief Esau bass roulade introduces a shattering Holmes solo, very Hacketty and Ant Phillipsy, all emotion and restraint, finishing off with a long acoustic foray. Sublime!I have always hoped for an album smothered in unending waves of my favorite progressive sound, the Choir Mellotron and truth be said, \"Road to Bones\" has enough to keep my bumps goose-ing! Incredibly orgasmic, the music presented here will undoubtedly provide many hours of future relaxation and high fidelity leisure. The production, the sound, the artwork and booklet are all of first rate quality, making this a necessary icon in the prog pantheon, 2014 has been now officially blessed with even more golden status.Prog is in good hands as long as IQ provides the Guiding Light.5 shadowy constituents"
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Monday, July 21, 2014",
      "rating": 3,
      "text": "I own the special edition double CD release of this album, so my review is somewhat slighted by the \"overall\" impression that this collection of songs has left me. The Road of Bones contains a lot of very polished neoprog. None of it is very sophisticated. Most of it is fairly straightforward and repetitive with the occasional pleasing twist or turn. Peter Nichols' vocals are very clear and easy on the ears yet they lack whatever it takes to get the listener really engaged and excited. I find myself most drawn to the keyboard work--which is most often fairly simple though very lush and fully-filling of the aural landscapes. Mostly, I guess I just like the sounds and tones used by Neil Durant. The album does have a few gems--and, IMHO, they have improved their delivery from Frequency--though many of the \"hooks\" used effectively on that 2009 album are again used here. From Disc 1, \"The Road of Bones\" (8:32) (9/10) is great, beautiful, mature. The epic/show piece \"Without Walls\" (19:16) (8/10) and the Wind and Wuthering-like \"Ocean\" (5:55) (8/10) are both nice songs but neither leaves me with adrenaline pumping, neither lures me back for the \"replay\" button push. From Disc 2, \"Knucklehead\" (8:11) (9/10) is the best--offering the most complex and exciting music of the entire collection. Both \"Hardcore\" (the first half) (10:53) and \"Until the End\" (12:00) reminds me too much of Frequency's best song, \"Ryker Skies.\" The rest of Disc 2's songs are a step below the offerings on Disc 1. The instrumental, \"1312 Overture\" (4:18), is engaging but it makes me feel as if the band is going through a rhythmic warmup exercise. The acoustic guitar play on Disc 2 and use of programmed drums gives the music a cheesy lounge New Age music sound. \"Ten Million Demons\" (6:10) leads the best of the rest. \"Constellations\" (12:25) sounds like it came right out of Genesis' And Then There Were Three/Duke era--I mean, straight out, sometimes note and sound-for note and sound.Overall, The Road of Bones is a pleasant listen even if it doesn't excite me enough to extoll its masterpiece status. Still, I do recommend prog lovers give it a listen.January 29, 2025 edit: When I joined PA in 2008 there were only a handful of albums in PA's Top Prog Albums (all-time) list that had been created since 1981 (mostly from Marillion, Dream Theater, �nglag�rd, Opeth, Pain of Salvation, Riverside, and Porcupine Tree). Now there are 26. including this one. Over the ten years since this album was released--where it shook the PA world to its core--I've revisited this poorly recorded and produced album of grossly mediocre songs numerous times, thinking \"I must be missing something\" due to all of the high ratings and praise this album has received. But, in the end, I have determined that my original assessments stand. This album by no means deserves to be mentioned in the same breath with Kind of Blue, In a Silent Way, Bitches Brew, Jack Johnson, Abraxas, Lateralus, Clutching at Straws, Nonagon Infinity, Plat du Jour, Eros, Ocean, and/or Obscura."
    },
    {
      "reviewer": "Roland113",
      "date": "Posted Tuesday, August 12, 2014",
      "rating": 5,
      "text": "In My Not So Humble Opinion:\"Frequency\" by IQ was disappointing at best. I'm sorry IQ, I'm sorry friends of IQ, but this was not one of their best efforts.That was the beginning of my last IQ review, a three star effort wrought with disappointment from one of my favorite bands laying a dud. As such, I was less than enthusiastic about \"The Road of Bones\", it took me a while to finally give it a spin. I had pre-judged the album, it's another IQ album similar to the last three, how can it have such a high rating. I was prepared to come in and bash the album.I was wrong, I was horribly wrong!Ok, so there are similarities and differences between Frequency and The Road of Bones. For starters, both albums have the harder edge that's been going through the ranks of Neo as of late, this isn't necessarily a bad thing. The difference is that the engineering has taken a leap, the mix sounds so much better. Peter Nichols voice shines through as always, but Neil Durant's keyboard is some of the best that IQ has seen in years, including some of the later albums with Martin Orford. Another huge improvement is the rhythm section of Tim Esau and Paul Cook. It's both the new and old rhythm section, but they sound fantastic together and again, the mix makes them sound even better. Certainly not forgotten, Mike Holmes continues to rip out fantastic solo after solo. The occasional influence of a Spanish acoustic here and there is greatly appreciated.\"From the Outside In\" is a typical IQ song and honestly, when I first heard it, I was convinced that this was just a continuation of the latest trend. After multiple listening's it still leaves me underwhelmed,The title track is one of the first tunes that really hit me as something different. I love the distinctive sound of the vibraphone line standing out amongst the ambience of the rest of the synths. Neil Durant paints a beautiful soundscape here. Towards the middle of the song we get a glimpse of Tim Easu's tasty fretless bass (mmm, tasty bass. . . ). This is a great departure, something fresh and new.\"Without Walls\" is a full on nineteen minutes of hit and miss. Ok, that's an exaggeration, the first three minutes is a forgettable, Genesis-esque ballad that could have been tucked away on \"We Can't Dance\". Luckily, this is quickly discarded for a nod to Frequency with the heavy triple chunk of the guitar over the Kashmir style drums. This is the IQ that we're used to, and I'm not saying this as a bad thing, I like change, but there still needs to be a common point of reference.Neil Durant wears his Tony Banks influence on his sleeves, particularly for the keyboard lines in \"Ocean\". I kind of like Ocean as a ballad, though it is nonetheless, a ballad, a relatively underappreciated vessel in the prog sphere. Peter Nichols' voice stands out as more emotional and vulnerable than usual, a pleasant departure.\"Until the End\" has some bright spots as well, the part at the five minute mark is a wonderful study in tastiness and space. Paul Cook in particular sounds great here. The end of the song is typical of IQ in that it's a slow reflection back on the past few songs, but unlike the previous albums, this one is slightly less predictable in that it's slower and quieter. Rather than making the big statement ala \"Guiding Light\" or \"The Narrow Margin\" this one tapers off nicely.So, at this point we're at the end of the first CD and I'm waffling between a high three or a low four, it's good but I'm not convinced it's the next masterpiece. On to disc two.\"Knucklehead\" has an exotic, almost Indian feel to it, the rhythm section shines throughout the first few minutes with a flurry of accent hits. Some of Mike Holmes best guitar work can be heard throughout this song, first there's the acoustic part that ends the Indian section, followed by a case of the heavies and then a nice arpeggio. The rhythm section again shines throughout this entire song. This song is a nice improvement over the first disc and really got my attention.\"1312 Overture\" just plain kicks butt the whole way throughout the song, we start with a nice reference to the 1812 overture then there's four minutes of instrumental bliss featuring Neil Durant showcasing his talents over a sick rhythm. This is another great song.\"Constellations\" is a Genesis themed song with similar themes to the last two songs, Tony Banks sounding keyboard patches with Mike Holmes doubling at times, or soloing over them at other times. This is the third fantastic song in a row and I'm starting to feel this album.\"Fall and Rise\" is another beautiful song and Tim Esau shines here, the warbling of his fretless intertwining with Paul Cook's meandering drumming is sublime. Just when it's all well and good, Mike Holmes rips out a Spanish sounding acoustic guitar solo that meshes beautifully with Peter Nichols voice. This is another song about musical space and something that's been sorely missed on the last couple of IQ albums. In case that isn't enough, Neil Durant takes us out with his own beautiful solo. This band is firing on all cylinders in this song.I can't say enough about \"Ten Million Demons\". It starts out with a Dr. Who nod for the bass and just builds to an intense rocker. I can't say enough about Neil Durant, his patch choice throughout this song was the final kicker that pushed the cd to masterpiece status, at times he pulls a patch from 'Mama', other times just a wonderfully tasty chord progression with a soft pad behind the pounding groove. The important thing though, is that this song is fantastic thanks to Mr. Durant. I can't play this song loud enough. Yes, this is the moment that pushes this album to a full five star rating. Best line of the album, Peter Nichols growling 'Get yourself unwrecked, time to resurrect'.Hardcore is a great ending to the whole CD, we get five minutes of nod to the first CD, nice, more Neil Durant keys in the vein of ' . . . And Then There Were Three\" but then something amazing happens. We get into a soft, outro with just soft keys and ambience. This slowly grows into a full out outro similar to \"Fall and Rise\" in that the instrumentalists of the band are shining and locking in together. Mike Holmes adds first a Hacket sounding solo then another acoustic solo over the groove as the song slowly fades out. This was such a beautiful ending.I am so happy to give this cd a full on five star rating and so glad to see something this good from IQ. This is the best album that they've ever released. Good job to you all, this is a masterpiece and I'm so glad you guys kept working at this band. It would have been easy for Mike Holmes to have called it quits multiple times. This is fantastic and I'm so glad you kept at it."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Monday, February 9, 2015",
      "rating": 5,
      "text": "This is the album of the year 2014. I didn't think IQ were going to get anywhere near as masterful as \"Ever\", or for that matter, to reach the heights of the brilliant \"Frequency\", but \"The Road of Bones\" tops the lot, and that is no mean feat given the quality of IQ's back catalogue. This album continues to showcase the star quality of Peter Nicholls powerful melodic vocals and the incredible guitar playing of Mike Holmes. The rhythm is a powerhouse factory with Tim Esau's bass and Paul Cook's drums. However the real standout for me on this album is the extraordinary keyboard wizardry of Neil Durant. He is a revelation to this current lineup. It is a stunning collaborative effort from all involved.The tracks are only 5 in total but they are all killer and no filler. The album has an immediate impact on the listener that they are hearing something very passionate and special, but the greatest thing about the album is it grows on you and simply gets better and better with every listen. There is a bonus album and these tracks are excellent too. Perhaps it could have been a 2 CD set. Still as a bonus album there are some delights for those who can get it, such as 'Knucklehead', 'Constellations' and 'Hardcore '.It is an instant classic with Nicholls' vocals precisely executed on every note and the lead guitar breaks are dazzling and at times emotional such as 'Oceans'. Also the melodies are so infectious that it feels like it might be listening to IQs greatest hits. indeed some of their greatest hits are here such as the epic 'Without Walls', 'From the Outside In ' and the title track. All five songs have a quality and mesmerising hypnotic essence of their own. It's a concept album about a serial killer's mind and it's dark in content but the music is more upbeat and lively than the themes themselves.This is definitely an album that will take some beating but I believe IQ are able to, given their wonderful lineup at this point in their career. I can't wait to hear some of the songs live in concert on a DVD or perhaps a live CD release coming up soon hopefully. IQ remain one of the quintessential Neo Prog artists on the planet and this album certainly proves that they are far from losing their creative and innovative spark. It is simply a wonderful album on every level."
    },
    {
      "reviewer": "The Crow",
      "date": "Posted Monday, November 12, 2018",
      "rating": 5,
      "text": "Talking about a band with so much prestige, if I have to say that an album is their best to date that's a big deal...But this is just what Road of Bones is. In my opinion, it's best IQ album to date. A dark, mature and epic collection of marvelous songs with almost no flaws or weak points. And talking about a double CD release, that's an extra point!The rhythmic section is perfect, Holmes is so elegant and gifted as ever, the keyboards are awesome, modern and not so old-school like most of the Neo-Prog bands, and Peter Nichols... In my opinion, he has improved his singing throughout the years, being not so high pitched but much more mature and natural. And his lyrics are his most personal and obscure to date, making this album worthy to be heard again and again and again.Best songs: Road of Bones, Without Walls, Ocean, Until The End, Constellations... Should I continue?Conclusion: Road of Bones is not perfect. It contains an average song (Hardcore), some good ones (Ten Million Demos, Knucklehead, 1312 Overture) and a bunch of great ones (the rest). But it's really rewarding to hear a band with more than 30 years of history in such a great form, releasing their most complete, mature and well-made album to date.For this reason and for the outstanding musical quality of Road of Bones, I'm giving this effort five solid stars, being one of the best Neo-Prog albums of all times.My rating: *****"
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Thursday, November 7, 2019",
      "rating": 4,
      "text": "Very few bands have the ability to continue to improve after three decades on the scene, but the neo-prog legend IQ is no ordinary band for sure. Forged in the early prog revival scene of the early 80s, this band has consistently delivered one compelling album after another with only a few speed bumps on the way ('Are You Sitting Comfortably' = puke icon). Part of this surely has to do with IQ only releasing a new product roughly once every five years so the band takes the proper time to make sure that all the t's are crossed and all i's dotted as they forge a new fine-tuned slab of 21st century neo-prog.Following 2009's 'Frequency,' the band returned in 2014 with its 11th studio album THE ROAD OF BONES which resulted in a major lineup and change of the guard. Firstly, Neil Durant replaced Mark Westworth on keyboards as well as the return of original members Paul Cook on drums and Tim Esau on bass. Esau hadn't played on an IQ album since 1989's 'Are You Sitting Comfortably?,' an album so bad that i can understand why he wanted to jump ship as it was sinking. Remarkably though IQ returned to form with 1993's 'Ever' and has delivered a consistent neo-prog canon ever since. While the band may have absorbed former members on THE ROAD OF BONES, the stylistic approach is not retro at all and instead finds the band expanding its horizons.THE ROAD OF BONES was released in two formats. Firstly as a single album that contained five tracks with a running time of just over 53 minutes and also as a double album with the second disc adding an extra six tracks bringing the total running time to over 102 minutes and thus practically doubling the playing time. A wise decision however for those of us who didn't do our homework before our purchase didn't realize the double disc option and mistakenly ordered the single disc. While this may sound sufficient for the casual listener, for the hardcore IQ fan, this two disc version is definitely the way to go as there is no quality decline between the discs. In fact, the second disc explores even more possibilities that evolve the neo-prog paradigm into brave new worlds.While many components of IQ's sound are a given such as Peter Nicholls' melancholic vocal style lamenting narrations about dark and depressing subject matter, the musical components of IQ's sound took a leap forward with THE ROAD OF BONES. Not only is the music darker and noticeably softer than previous albums but the instrumentation is more varied with the interplay between instruments crafting new variations of possibilities. Firstly the drumming and percussive parts of Paul Cook have taken things to a new level. IQ's percussive drive on previous albums has been chiefly subordinate to the melodic flow and overall thematic nature of the subject matter but on this album his drumming skills actually provide the leading role in many cases upon which many of the intricate melodies and counterpoints follow.To sum up THE ROAD OF BONES is quite simple. It's a lengthy sprawl of epic tracks that displays a decorative display of various rhythms, melodies and dynamics but is held together by the gravitational pull of Peter Nicholls' distinct fragile vocal style which narrates an impending tale of emotional gloom designed to unleash all the tearjerking emotional tugs. Overall the album is more atmospheric and less on the heavy rock side of the equation but the album does start off with some heavy rock bombast on 'From The Outside In' as well as on the title track at key moments before drifting into a more ethereal ambient realm. The track 'Without Walls' covers all grounds with a sprawling run of over 19 minutes as it wends and winds through classic IQ developments and unexpected detours.With a darkness and consistency virtually unmatched since Marillioin's 80s reign as top neo-prog dogs, THE ROAD OF BONES provides an excellent display of melancholic thematic material wrapped in an excellent musical package. The tracks are more varied, the instrumental interplay is highly developed and the unique mastery of atmospheres seamlessly blending with the melodic flow and range of dynamics displays IQ at the top of its game. While the single disc version provides many new ideas forged, the second disc is even more liberal in allowing experimental touches to come out of the background and become the dominant features in some cases. Amazingly THE ROAD OF BONES retains a high level of professionalism and song quality throughout its run and that's including the second disc in that equation. Add to that an impeccable production job and you have a neo-prog classic. The only complaint i have about most IQ albums in general is that Nicholls' vocal style can become a bit monotonous at times. If his range was as dynamic as the instrumentation the album would be much richer but even as is, this is an excellent slice of prog."
    },
    {
      "reviewer": "friso",
      "date": "Posted Thursday, July 16, 2020",
      "rating": 4,
      "text": "IQ is arguably the most prolific neo-prog group of the 21th century so far. I started listening to 'The Road of Bones' after I got hooked on its follow-up 'Resistance' from 2019. Both these albums have a full second disc of strong B-material, which brings the playtime of this album over the 100 minutes.'The Road of Bones' album (the first disc) offers a gentle, adult and well-produced version of IQ that seems especially keen on honoring and up-dating its debut album 'Tales From the Lush Attic'. References to 'The Last Human Gateway' can be found in choice of sounds, chord progressions and how the compositions flow. There is lots of atmospheric spaciousness in these compositions and little of the rock/metal density that for instance 'Dark Matter' from 2004 offers. The compositions are given the space to evolve and there's relatively little instrumental keyboard melodies/progressions or guitar-leads for an IQ album. The album has some bleaker moments in which Peter Nicholls sings in a lamenting tone (the title track comes to mind), but overall the album doesn't offer much the sci-fi doom that would dominate 'Resistance'. By referencing to their early period and adding a layer of adult atmospheric growth (like Pink Floyd would do on The Division Bell) the band has found itself a renewed interest from the broad progressive community. I myself am not blown away by this first disc, because I think its beautiful content is a bit spread out. IQ sounds extremely well-versed in advanced symphonic progrock, but in the meanwhile looses some of its spontaneous edge.The second disc is quite the opposite. Notably less detailed in its production (though the quality of the sound is equally good), it shows the band experimenting with drum-loops, drones, sound samples, heavy prog, electronic soundscapes and a more diverse type of song-writing. The compositions are less finished and refined, but the chord progressions and melodies are more to my liking here; more nerve-wrecking, dark and abstract. This is IQ in its free-thinking mode and it really triggers my attention, for it makes the music that less predictable.I think the combining of the finesse of the first disc and the experimental side of the second disc of 'The Road of Bones' is what makes 'Resistance' one my favorite albums ever made. For this album I can highly recommend the 2cd version that should offer more than enough neo-prog delight for all fans of IQ."
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Sunday, August 9, 2020",
      "rating": 4,
      "text": "I must say it took me a long time really enjoy this album. At the time I got The Road Of Bones I had also had bought several others CDs and I guess others pleased me more at first listen, so I sest this one aside for a while. And everytime I took the trouble to listen to it again I was not captivated by the first two tracks,and I usually ended my session right there. It just sounded too much like Subterranea or The Seventh House, not my favorite IQ stuff. That kept happening until recently, when, by mistake, I put the second CD on and was amazed of how good it sounded. The bonus material was much better than the \"official\" one, or at least that�s what I thought then. Nowadays, after repeated spins,I discovered that the whole work is one of their very best.I guess this CD was a challenge for the band, being the first one to be completely written without founder member Martin Orford .And I did not know at the time that not even Orford�s replacement on the previous Frequency (2009), Mark Westworth, was gone and newcomer Neil Durant had taken over keyboards duties! On the other hand, original members Paul Cook (drums) and Tim Esau (bass) are back, thus meaning that 4/5 of the classic line up is playing here! And both are on top form, with Esau showing great bass lines here, specially when he plays some fretless bass.What really amazes me the most if the fact that this is surely a keyboards driven record, with novice Neil Durant taking a major role on this record. Although his style is not exactly the same as Orfords, his extensive use of vintage sounding keyboards, along with few more \"modern\" stuff, gives the tracks an unmistaken IQ feeling on all tracks, and yet he also brings some fresh and exciting new tones and colors to the music. He is the main figure here. The downside is the fact that Michael Holmes trademark, tasteful guitar solos for some reason are few and far between. The Road of Bones would be a five star record if he had add more of that on this album.As for the songs themselves, this is a killer album, with only winners and no fillers. Their sound is becoming more and more complex and symphonic, even if still melodic and accessible. The first CD is a concept album about a serial killer and that�s the one that takes more time to really sink in, but it�s a magnificent work, while the bonus disc is, at least, as good as the official one. It�s hard to pont out a highlight since the quality of the stuff is so high and varied. But I must say that the 19 minute epic Without Walls is defintely one, while Constellations and Until The End are also favorites. But, nowadays, I always hear them both from start to finish now without skipping a single track. The production is excellent, as are the arrangements and performances.Conclusion: One of the best IQ CDs,ever. If it was not for the lack of more Michael Holmes guitar solos this could be their very best. But a brilliant and inspired opus that will please anyone who likes great synmphonic prog music. 4,5 stars."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Monday, August 28, 2023",
      "rating": 5,
      "text": "Review N� 684Few things could be as exciting to a prog rock fan, including myself, than a new IQ album, especially considering they take some time to releasing them. They're one of the few remaining prog rock acts to have truly grown and improved with each release, or at least, their last releases hit a peak of quality very close but hard to outdo of their albums \"Ever\", \"The Seventh House\", \"Subterranea\" and \"Dark Matter\". They're all great examples of the best prog, expertly mingling heartfelt emotion with a complex but eminently melodic musical sensibility. IQ is my favourite British prog band today.Since their beginnings in the 80's they've been dubbed neo-prog for their borrowing of the prevalent symphonic and emotional tendencies of some 70's bands like Genesis. They play prog rock in a comfortable and atmospheric way. Their synth rich style generates an atmosphere that gravitates around spacey sounds as much as the symphonic, incorporating the two into long and extended backdrops before which the well defined rhythms proceed in due course. But, the most obvious is the vocal performance of Peter Nicholls. In terms of mood his unique style is difficult to describe, it's not quite downcast and not uplifting, but seems to find a stable and comforting temperament in-between.Thus, after five years of waiting, the UK progressive rock legend, IQ, a band who have worked hard at keeping the \"second wave of prog\" from the early 80's alive now for over thirty years, returned with their eleventh studio album \"The Road Of Bones\", which was released in 2014. It's the first album to feature Neil Durant on keyboards and it marks the return of original members Paul Cook on drums and Tim Esau on bass, the latter appearing on an IQ album for the first time since 1989. So, the line up on \"The Road Of Bones\" is Peter Nicholls (lead and backing vocals), Mike Holmes (guitars), Neil Durant (keyboards), Tim Esau (bass guitars and bass pedals) and Paul Cook (drums and percussion).There are two versions of the album, the single and the limited version. The single version has five tracks. \"From The Outside In\" is a great opener full of power. Opening with suitably spooky atmospheric synths, things soon get going with some solid pumping bass lines backed by synth flourishes and Peter's voice cutting through it all. There's more atmospherics to come, before a return to the pumping rhythms. This is a great sign of things to come. \"The Road Of Bones\" is the title track. It starts quiet and really builds to a climax. It has a new slow burner opening again with synths and piano. This is a particularly haunting track, and Peter's lyrics and vocals are astounding. The slow understated bass driven take us to an amazing tension all over the song. This is a wonderful track that showcases IQ's talent for building tension in their music. It's one of IQ's finest tracks, indeed. \"Without Walls\" is the first long track clocking it at nineteen minutes. It starts simple with piano and a drum machine, and again it builds and builds. There are some nice sections and some good soloing all over it. The first couple of minutes are very simple but during its nineteen minutes it morphs several times and ends up going all over the place quite brilliantly. This is actually quite common right across the album, which is what makes it so appealing. There's always something unexpected around the corner. \"Ocean\" is a pleasant song with a nice chorus. It's the shortest track on the album and one of the less energetic. But, there's power, warmth and intricacy that carries it along quite nicely to a satisfying conclusion. All in all, this is a pleasant track and a good breather between the two most epic tracks on the album. \"Until The End\" starts with a haunting theme that takes us to an intense musical journey. This is another stunner with plenty of atmospherics and an amazing performance by all band's members. It's another highlight, an unexpected way to close the album with a very refreshing ending, indeed.I must admit that I bought the limited version and I really enjoyed the second disc as well. Some of the material is very strong, but it's quite evident why the tracks were left out of the album, as they don't seem to keep the composure throughout the duration, most of the time. Still, the material is better than most bands' best tracks. And that's saying a lot, indeed. IQ must be one of the best choosers of tracks for albums and many prog rock bands could learn something with them about trimming down albums. We don't need 80 minute albums if half of the music seems unfinished or raw.Conclusion: It's hard to believe a band keeping getting better and more ambitious with each release after thirty years of career, but IQ does it. In every aspect, from the choice of sounds to the lyrics not forgetting the performances, this is a work of true masters. IQ has lost nothing with the personnel changes. In fact I think they're probably a tighter unit, both musically and as a band. As I said before, the sound quality is excellent and the playing is some of the best IQ has produced. \"The Road Of Bones\" first disk alone is a garden of melodic delights, unquestionably one of the best musical rides that we can get, but that wasn't enough for IQ. They had to throw a second disc. The second disk would have suited quite well on its own as the new album. Still, the first album is definitely the more cohesive listening experience.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "albumfcf0.html",
  "last_parsed": "2025-05-18T12:48:47.516063"
}