{
  "album_title": "PERMANENT WAVES",
  "artist_name": "Rush",
  "artist_page_link_local": "artistfb6c.html?id=609",
  "year": 1980,
  "rating_value": 4.28,
  "rating_count": null,
  "review_count": null,
  "genre": "Heavy Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/609/cover_523316452016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "The Spirit of Radio",
      "duration": "4:56",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Freewill",
      "duration": "5:21",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Jacob's Ladder",
      "duration": "7:26",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Entre Nous",
      "duration": "4:37",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Different Strings",
      "duration": "3:48",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Natural Science",
      "duration": "9:17",
      "is_sub_track": false
    },
    {
      "number": "i",
      "title": "Tide Pools",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "ii",
      "title": "Hyperspace",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": "iii",
      "title": "Permanent Waves",
      "duration": null,
      "is_sub_track": true
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Dan Bobrowski",
      "date": "Posted Thursday, December 11, 2003",
      "rating": 4,
      "text": "Permanent Waves reminds me of the snow storms I used to experience when I first heard it in the frozen cold of an Upper Michigan winter. Spirit of Radio and Freewill were radio staples at the time, but Jacob's Ladder was the soundtrak to the huge, dark, snow engorged storm clouds of the winter. The throbbing bass line chugged in a JAWS like menacing pulse. Natural Science, my favorite track, rivals any \"epic\" prog out there, from King Crimson to Yes. It's got some of the best lyrics written. By far their best musical display. Muscular and melodic.Permanent Waves will always be my favorite Rush album simply because it is connected to me in a special way."
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Tuesday, February 3, 2004",
      "rating": 3,
      "text": "This is when the early fans started to wonder why a band commits Hara-Kiri, as the sound had changed drastically. We all had to admit that Geddy Lee could not go on screaming like the madman he appeared to non-fans so he had to change his singing for his own throat's sake. But did they have to change their music so much? As history will point out , they were right because every album brought new fans even though the older ones were bemused.Only two tracks can be likened to the previous Hemispheres, and this would be the cool and rather calm Jacob's Ladder clearly a highlight and the three part mini-suite Natural Science (especially the last movement) being the other climax.the rest of the tracks were either meant at radio airplay (Spirit of Radio - In Toronto this meant 102.1 FM) or filler such as Entre Nous. A rather uneven and transitional album."
    },
    {
      "reviewer": "chessman",
      "date": "Posted Friday, March 26, 2004",
      "rating": 2,
      "text": "Oh dear! After the promise of the previous two excellent studio albums, this one marked, for me, the first major change in direction, and not one I enjoyed much. Don't get me wrong, this is not a bad album, and Jacob's Ladder and Freewill are Rush classics, and rightfully so. But the rest of the album seems thin,and to lack ideas. The Spirit Of Radio is far too jolly and insignificant, and the other tracks are forgettable. (Although the end of Different Strings has some nice fade out guitar work. Vies with 2112 as the second or third weakest album they have done. (Of course, both are superior to the tragic Fly By Night!) Only for die-hard fans."
    },
    {
      "reviewer": "greenback",
      "date": "Posted Wednesday, April 14, 2004",
      "rating": 5,
      "text": "Compared to \"Hemispheres\", this record is just a bit less progressive, being quite complex rythmic hard rock. The electric guitar has a bit less of the overdrive effect than on the \"Hemispheres\" album. The keyboards are very simple and are rather in the background, and they do not take very much room. On the catchy \"Spirit of the Radio\", there is a pleasant reggae part, and you can hear a rythmic PIANO on the song. \"Free Will\" has an OUTSTANDING complex bass part. \"Different Strings\" is a more mellow track full of melodic acoustic guitar, PIANO and relaxing lead vocals, ending with a slow & moaning guitar solo. The last track, \"Natural Science\", is one of the best RUSH track ever recorded: it is very progressive, structured and it has varied themes; the instruments, especially the bass and drums, are very complex. This record, coming right before \"Moving Pictures\", announces a bit how the lead guitar will sound like.HIGHLY RECOMMENDED!"
    },
    {
      "reviewer": "daveconn",
      "date": "Posted Monday, May 3, 2004",
      "rating": 5,
      "text": "Where earlier RUSH albums escaped into a fantasy world of their own devising, \"Permanent Waves\" unlocks the magic from within. It marked a turning point in RUSH's fortunes as they traded in fantasy for reality, diffusive energy for a concentrated beam of brilliance, bygone battles for imminent conflicts. I've never approached \"Permanent Waves\" as a concept album, though on reflection it usually occurs to me that \"Spirit of Radio\" presents a problem (where's the integrity in art?) that \"Natural Science\" offers a solution for (the honest shall inherit the earth and bring art and science under the command of good). And many of the songs are philosophical musings painted in epic detail: \"Entre Nous\" offers the epigrammatic insight that \"The spaces in between leave room for you and I to grow\", \"Free Will\" notes that \"If you choose not to decide you still have made a choice.\" Really, you'd have to look back to GRATEFUL DEAD's ROBERT HUNTER to find that much life wisdom delivered so succintly in a rock song. But the real wonder of \"Permanent Waves\" is the music, tighter than ever, not bloated with majesty but elevated by it, ascending toward some higher purpose. \"The Spirit of Radio\" is a bracing beginning that plays out like a life-or-death battle for integrity. \"Free Will\" puts the power back in the lap of the listener, lest RUSH sound too preachy. On the lyrical surface, \"Jacob's Ladder\" is no more than an extended haiku, but musically. good gracious! ALEX LIFESON's guitar pierces through like nothing since STEVE HOWE, sublime in its effect, and the whole song could be seen as an equal to the secret wonders of \"Fragile\": \"Heart of the Sunrise\" and \"South Side of the Sky.\" This first side of music, in my opinion, ranks as one of the greatest \"Sides\" of plastic in all progdom. \"Entre Nous\" marks the entrance to side two, another classic RUSH track infused with the same warm humanity as \"Closer To The Heart.\" A reference to the band's change in direction would seem to occur on \"Different Strings\", which resurrects some of the old sound (shrouded in mist) and imagery (one could interpret \"slaying the dragon\" as an end to the fantasy-fueled epics of old). The three-part \"Natural Science\" finds NEIL PEART seeking in science a fertile allegory for life (and succeeding), themes that would continue on Moving Pictures and (especially) \"Signals\". From this point on the Future would be RUSH's future, as their heroes put away their swords (their dragons now extinct), entered the battlefield of business, charged the gates of digital domains, and sought personal connections in an increasingly impersonal world. Just between us, it gave them a whole new world in which to grow. Collector's note: It appears only the original Anthem issue features the headline \"Dewey Defeats Truman\" on the newspaper blowing in the front cover foreground; subsequent issues have the newspaper title whited out (a la BILLY RIPKEN)."
    },
    {
      "reviewer": "Menswear",
      "date": "Posted Tuesday, June 1, 2004",
      "rating": 5,
      "text": "6... Yes, six great reasons to own this record. I know my Rush, and this one's a keeper. A different approach but the same comforting warmth. Rush knows what the're doing. For them, 1980 was a great year. They made a solid statement with duo Farewell/Hemispheres and now, they headed for new lands. But they brought luggage. That's what cool with Rush, the changes are made not drastically. They give you time to breathe and acclimate with their art. Great way to keep the ones you love close to you. That includes me. I still see myself listening that wonderful record in high school, in my crappy Sanyo walkman. I didn't even had it on cd. Except for Jacob's Ladder (a real treat), the whole album is positive and upright. Peart's lyrics are talking about understanding and emotional movement. Yay! And the album ends up with a song that aged so well, it's almost unbeleivable it was written 24 years ago: 'Natural Science'. For those who heard it live, it's a perfect 10 in 10 minutes. Rush really got forward in accesible songwriting and performance. A great place to start for the Rush middle-period. A perfect blend or light prog and rock. This album cannot deceive you. It would be illogical when everything falls into place in such a perfect precision. Welcome in the 80's...but in the right way. * 5 EXCEPTIONNAL STARS *"
    },
    {
      "reviewer": "James Lee",
      "date": "Posted Wednesday, June 30, 2004",
      "rating": 4,
      "text": "It's a new RUSH! Well, not really- the excellent \"Jacob's Ladder\" and \"Natural Science\" give us some continuity with the hard progressive rock, but the accessible immediacy of the songs on this album marks the band's dedication to making their epics more concise and refined. \"Spirit of Radio\" is the most direct song they've done, focusing on the music business the same critical eye they utilized on tracks like \"2112\" and \"A Farewell to Kings\"- and ironically becomes their most succesful hit (at that point). Likewise, \"Freewill\" sees Peart refining his songcraft and philosophical leanings, and \"Entre Nous\" brings more emotional depth to a band which had, at best, 'uncomplicated' romantic compositions. \"Different Strings\" is even more telling a glimpse- we see the maturity and sense of loss that will take over on \"Signals\" and \"Grace Under Pressure\". It almost goes without saying that the musicianship is remarkable; they rose to the challenge of fitting their instrumental discipline to the tighter tracks, and still managed to break new ground along the way. Second only to \"Moving Pictures\" as the band's most effective song-driven album, this one is a great introduction to RUSH and full of wonderful moments. 1980-81 is definitely the time when the RUSH star shone brightest."
    },
    {
      "reviewer": "lor68",
      "date": "Posted Friday, July 2, 2004",
      "rating": 4,
      "text": "Well an ever-green like this \"Permanent Waves\" by Rush (even though in a few circumstances for me it should deserve an inferior score in comparison to albums like \"Farewell to Kings\" or \"Hemisphere\") , by considering also the opportunity for them to come back on stage in Europe (first time in Italy) on next Autumn 2004,is giving me the opportunity to talk about this successful album in the future. \"Permanent Waves\" contains the direct song (almost mainstream) \"Spirit of the Radio\", which is very \"radio-friendly\", but with a fantastic intro by Neal Peart on drums, being exceptionally and easily supported too, by means of the powerful guitar of Alex Lifeson;nevertheless you can listen also to some other progressive \"jewels\" , such as \"Jacob's Ladder\" and \"Freewill\", which are well worth checking out once again... such an interesting use of mini-moog, fine guitar solos within, as well as a rhythmical and syncopated bass line, which is moreover enriched with an irregular time signature!!Instead Rush nowadays is not able to reproduce such grandeur, but you can recognize the attempt to make another music renewal, regarding of their several music ideas, especially during the long music \"excursus\" of their career. I don't know whether it's enough or not, but for sure, coming back to the present issue, I appreciate the melodic impact of \"Natural Science\" and the clever breaks-through inside \"Entre nous\".... not completely essential, but probably it's the most important work by Rush, who tried in the early eighties to let the crowd know their complex music, passing through the accessible music features within \"Spirit of the Radio\" and introducing the common listener to the progressive elements in a \"gentle\" manner...Clever guys!!!"
    },
    {
      "reviewer": "Chris S",
      "date": "Posted Tuesday, September 7, 2004",
      "rating": 4,
      "text": "Knock this album at your peril! OK Permanent Waves marked a move from long epic tracks like on Hemispheres and 2112 but it is filled with such wicked tracks I find that there is more a stubborness to change from some reviews rather than a genuine dislike to the music content.' Spirit of the Radio' encapsulates what short Rush songs are all about and Jacob's Ladder builds to be epic in it's own unique way. \" different Strings' has to be one of Rush's most beautiful slow moving songs and ' Natural science' began the epic last track series which was evident on much of the 80's albums."
    },
    {
      "reviewer": "Blacksword",
      "date": "Posted Tuesday, September 7, 2004",
      "rating": 5,
      "text": "Rush dont get much better than this. 'Permenant waves' saw Rush coming down to Earth, rolling up their sleeves and enjoying some commercial success without compromising anything. Musicianship as ever is superb, and the music inspirational. 'The spirit of Radio' still makes me smile, and glow with annoying optimism and positivity even these days. If anyone ever doubted this bands musical prowess they should listern carefully to 'Freewill' Here we see all three of them exploding in an exciting frenzy of musical wizadry, the likes of which I cant recall hearing on any other album by any other band. 'Jacobs Ladder' is one of two more lengthy conceptual tracks on PW. It brims over with moody time signature changes, and perfectly conjures up the intensity felt before, during and after the mother of all storms. 'Entre Nous' is a bit weak, I always skip it, and I rarely skip Rsh tracks. The only reason I refuse to give this album less than five stars, is the classic and flawless nature of everything else on it. This album is a classic rock album and should be recognised as such. 'Natural Science' is one of Rush's best lengthy tracks, and has to be heard live to be believed.This is an album for lovers of excellent, heartfelt, brilliantly performed music."
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Monday, October 25, 2004",
      "rating": 4,
      "text": "A couple of things are clear about the Rush that recorded \"Permanent Waves\". One, that the trio is less interested in epic themes, while keeping and even reaffirming a noticeable epic attitude instrumentally (more Oberheim stuff comes to the synthesizer fold). The other, that the threesome are beginning to partially flirt with the AOR format, while still maintaining a penchant for complex rhythm patterns and clever tempo shifts. Gone are the sci-fi splendorous tales, but in turn, the revealing dreams of a prophet ('Jacob's Ladder') and the critical views about the system as a vehicle if oppression against the individual ('Natural Science') become the conceptual vehicles for Peart's lucid concerns and cerebral poetry. This serious stuff is perfectly complemented by great musical ideas, which are enhanced by the musicians' tight performances - this results into both tracks being the most prominent in the album's repertoire. But the remaining tracks are nothing to be dismissed, despite the fact that they obviously are not as aesthetically rewarding for the average prog rock listener. The opener 'Spirit of Radio' is one of those classics that never leave the tracklists on every Rush tour: and no surprise about it, since it's a very catchy number, and at the same time, an effective sample of the prototypical combination of complexity and electric energy that has become a trademark of Rush. 'Free Will' and 'Entre Nous' deal with the individual's affirmation and romantic relationships on the rocks, respectively, with a more AOR-ish attitude, that's true, but never getting rampantly accessible: on the contrary, these numbers comprise that flame of inventiveness in its melodic lines and the instrumental interludes that keeps them from being mere radio friendly simple tunes. The ballad 'Different Strings' is one of the most intimately moving pieces that Rush has written during their 77-81 era, and it might as well be extended a bit longer in order to convey the melancholy proclaimed in its lyrics in a more effective manner - Lifeson's solo in the song's closing section is captivating, but it feels so short when the fade-out appears to call it quits. Fortunately, there's still the epic closure 'Natural Science', whose magnificent grandeur has been described before in this review. Overall conclusion: an excellent progressive album."
    },
    {
      "reviewer": "Guillermo",
      "date": "Posted Monday, December 6, 2004",
      "rating": 4,
      "text": "\"The Spirit of the Radio\" was the first song that I heard from RUSH in 1981, and at that time I didn`t like it because it didn`t have enough keyboards and it sounded to me as \"pure Heavy-Metal\", not as \"Traditional Progressive Rock WITH Keyboards\". At that time, GENESIS and YES were \"the True Prog Bands\" for me because they used more keyboards and \"less distorted Heavy Metal guitars\". By 1983, I listened to RUSH`s live albums \"Exit ...Stage Left\" and \"All the World`s a Stage\", and I changed my opinion about RUSH. So, in 1984, I finally listened to this \"Permanent Waves\" album. As I still prefer the live versions of \"The Spirit of the Radio\", \"Free Will\" and \"Jacob`s Ladder\" from the \"Exit...\" album, my favourite songs in this album are the songs of the Side Two of the L.P.: \"Entre Nous\", \"Different Strings\" (great song!) and the best of all, \"Natural Science\", the most progressive of all. In those years, Neal Peart really impressed me very much, as I still was learning how to play the drums (I began to play the drums in a band in 1981, but I played the drums for the first time in 1977) and I was trying to learn something from the albums that I liked and from drummers that I considered very good drummers. Peart is still a very good drummer, with a very original style which is Progressive and Heavy at the same time.This is a very good album, and I could really recommend it as a starting point for new listeners of this band."
    },
    {
      "reviewer": "Marc Baum",
      "date": "Posted Saturday, March 19, 2005",
      "rating": 5,
      "text": "The album begins with the sound of guitar pull-offs sweeping across the soundscape soon to be joined by bass and drums. The opening track “The Spirit of Radio” is an anthem to the powerful force of the radio and the music industry. In keeping with this theme, most of the album \"Permanent Waves\" is very radio friendly. With the exception of \"Jacob ’s Ladder\" and \"Natural Science\", the songs here are of radio length: around 4 minutes or so. Two of Rush’s most popular songs came from this album. The aforementioned “Spirit of Radio” and “Freewill” still receive radio air time.At this point in their career, Rush was slowly phasing away from the progressiveness of previous works like “2112” and “Hemispheres”. This is not to say the material here is not progressive, in fact, this is a great album for those that want to hear two different sides of Rush: The longer epic side, and the shorter, more accessible side. Even in the shorter songs, there is an element of experimentation. For instance, in “Spirit of Radio”, near the end the song goes into an unexpected reggae-like bridge section before hitting the guitar solo. A few albums later, they began to add more of the reggae riffs into their sound (Vital Signs and Digital Man being good examples).For those that like longer, more experimental songs, Permanent Waves has a lot to offer. I’ll be honest, I’m not a huge fan of “Jacob’s Ladder”, however the more I listen to it, the more it grows on me. It’s a seven minute, mostly instrumental song. After an ominous beginning with lyrics about “clouds preparing for battle”, the song goes into a lengthy mid section. Here is where the “short song” crowd will likely tune out. The riffs here have a military march feel to them, very fitting of the previous lyrics. Some synth later comes in, along with Geddy’s vocals shaped into a robotic voice. The guitar returns, slowly growing louder and building up to a loud climax. I can see why some could see this as a boring song, as I used to think that way before, but there’s a lot here that is heard only after a few extra listens.The big, epic track of the album is “Natural Science”. This is an excellent track and is definitely the highlight of the album. Not only is the concept here noteworthy, the music and atmosphere created as so fitting of its title. It begins gently with the sounds of waves hitting a beach. In comes an acoustic guitar with some reverb added on, making it sound as if he’s playing it on a deserted beach somewhere. Right as the first set of lyrics is finished; the sounds of seagulls can be heard in the background. Pretty cool. There’s some rich visual imagery here in the lyrics. For example: “Wheels within wheels, in a spiral array, a pattern so grand and complex, Time after time we lose sight of the way, Our causes can’t see their effect.” Add to that more strange vocals effects during the “Hyperspace” section and you’ve got a song that’s full of interesting twists. It’s a shame that this was one of Rush’s last “epic” songs.So putting this all together, there’s a good mix of shorter, accessible songs, and longer more complex ones. Rush may have gotten more radio friendly at this point, but they still had the artist integrity and the brains to come up with some great progressive rock songs. Permanent Waves is a fine album, another classic milestone in Rush's catalogue. They went even further with the monumental \"Moving Pictures\", their crowning achivement and pinnacle.album rating: 9.5/10 points = 96 % on MPV scale = 5/5 starspoint-system: 0 - 3 points = 1 star / 3.5 - 5.5 points = 2 stars / 6 - 7 points = 3 stars / 7.5 - 8.5 points = 4 stars / 9 - 10 points = 5 stars"
    },
    {
      "reviewer": "Eetu Pellonpaa",
      "date": "Posted Friday, April 1, 2005",
      "rating": 3,
      "text": "This album revealed a change in the bands style. The opening track \"Spirit of The Radio\" is well composed and produced, but somehow I found it a bit disappointing after their mid-seventies material. The next song \"Freewill\" is similar in style, but it has nicer parts in it, and Peart's lyrics are thoughtful. \"Jacob's Ladder\" is the other proggy tune on this one along with \"Natural Science\", the later one being my favorite. I think it's better to give this a listening before buying, especially if you're fond of their earlier material."
    },
    {
      "reviewer": "Cygnus X-2",
      "date": "Posted Wednesday, June 22, 2005",
      "rating": 5,
      "text": "After the masterpiece, Hemispheres, it was going to be tough for Rush to top themselves. While they did not topple over Hemispheres, they released one of their best records. This album was one of the first ever to be released in the 80's, coming out on January 1, 1980. The keyboards on this album are more for background purposes, and not to be used in the forefront like in the follow-up albums. Alex's guitar tone on this is immaculate, like all of the tones he uses. Geddy's bass is very complex and he's playing at his creative best, the same with Neil Peart, who pulls out all of the stops. The lyrics on this album are also second to none.The album opens with a fan-favorite The Spirit of Radio. Beginning with a very hard rock intro, it quickly evolves into classic Rush structure. Geddy plays a mean bass, and Neil creates nice sounds with his bells set. The Reggae section is also a very welcome addition to the Rush sound. Freewill also begins in a rocking fashion. This is a very complex song that has multiple time signature changes, and features one of the best Lifeson guitar solos around. The next song, my personal favorite Rush song right now, is one of the most complex songs they ever crafted. I like to call it the Can-Utility and the Coastliners of Rush songs. Jacob's Ladder is a lyrically short piece, but a musically long piece. Featuring shifting signatures every measure, incredible instrumental sections, and and incredible keyboard by Lee, this song just never gets old. The variety in riffs and structure on this song are incredible. The next two pieces, Entre Nous and Different Strings are both quieter, more gentle pieces. Nothing much to say except Hugh Syme plays a great piano of Different Strings. The finale of the album is another personal favorite, the epic Natural Science. With an incredible introduction, the riff-maestro Lifeson never ceases to lose his creative juices. Each section has it's high points, and they all connect to create a masterpiece of a song.Overall, I think this album is one of the best Rush albums ever. There are no flaws, and it never gets old. I recommend this to any progressive rock fan. 5/5."
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Thursday, August 18, 2005",
      "rating": 4,
      "text": "Rush have turned from a Led Zeppelin clone into a pivotal progrock band, what a skills and what a great ideas! This album features sophisticated rocksongs like \"Spirit of the radio\" and \"Freewill\" featuring lots of dynamics and great soli, a wonderful build-up piece entitled \"Jacob's ladder\" (fine use of synthesizers), a splendid guitar solo in \"Different strings\" and lots of shifting moods and dynamics in \"Natural science\". Only \"Entre nous\" sounds a bit mediocre but in general this is a good Rush album.WHAT AN AMAZING PROGROCK BAND"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Sunday, September 11, 2005",
      "rating": 4,
      "text": "Begin the day with a friendly voice ..!Yeah, what a memorable lyrical part the opening track of this album sounds! I think for those of you who were there when this album was released would definitely connect with the past when this album is spun or you hear the opening track. But last weekend, it was not a good thing happened to me and some classic rockers in my country as the only classic rock radio which has been around us for the last ten years has now completely died. That was the formal news I read in Koran Tempo newspaper where the journalist put the above heading (taken from Rush \"Spirit of The Radio\") to start his article. Yes, for years already the station quite often start the day with this song to energize the listeners with an energetic and dynamic song composed and performed by RUSH. Spirit of The Radio has been a \"national\" hit in my country in early eighties altogether with \"Tom Sawyer\" from Moving Picture album. That news have triggered me to spin the CD for the sake of great memory and a token for the dead of classic rock radio. Luckily, there is a new radio coming out: \"Jakarta Alternative Station\" that focuses on classic prog and rock . So.. the spirit carries on .This album of Rush is truly solid in composition and energetic in spirit even with the track that starts mellow like \"Jacob's Ladder\". My all-time favorite track from this album is \"Natural Science\". I especially like the hard-edge guitar work and riffs combined with dazzling drums. The changing styles also what makes this track an attractive one.Recommended album - an excellent addition to any prog music collection. It's a pity if there is someone who loves prog but doe not have this album. Keep on proggin'..!Peace on earth and mercy mild - GW"
    },
    {
      "reviewer": "slipperman",
      "date": "Posted Thursday, October 20, 2005",
      "rating": 5,
      "text": "Utterly perfect. Though I will have to insert some twisted logic here: they would get even \"more perfect\" on 'Moving Pictures'. But for now, as of 1980, Rush were attaining a peak that produced the marvelous 'Permanent Waves', a marvel in every way: production, songwriting, performance.The flow of the album is due to its compactness, both in terms of each song's ingredients (unlike the title song on 'Hemispheres', there is NOTHING unncessary here) and also its overall length (proving that shorter albums provide more impact). And with the bristling production job by Terry Brown and the band, the album's crystalline, earthy, crisp recording brings out the best in the band's gear and, of course, their always-increasing abilities.The album seems to offer 3 pairs or kinds of tracks:\"Jacob's Ladder\" and \"Natural Science\" are the prog epics. \"Jacob's Ladder\" is patient and slowly-building with a foggy, dark tone, while \"Natural Science\" flows from part to part in an exciting, ultra-dynamic ride. Some seriously demented metallic riffs appear, showing where Voivod might have taken some influence when they wrote 'Dimension Hatross'.\"The Spirit Of Radio\" and \"Freewill\" are more compact, FM-friendly rock songs, yet still with an abundance of chops, impressive playing and superb songwriting. Geddy's voice is starting to lower in range, slightly, and it's this era (along with 'Moving Pictures') that I feel represents his finest vocal performances. That these are two of the band's most popular radio songs displays the beauty of Rush: this music is substantial and profound, played by gifted artists, yet it STILL works on mainstream radio. Go figure.\"Entre Nous\" and \"Different Strings\" are not only an obvious pair, they're also next to each other in the running order, sandwiched between the epics, giving the album a good bit of depth. Both could be considered ballads, but as ballads go, they carry a lot more depth and believability than previous attempts (\"Madrigal\" and one I even like a lot, \"Tears\").So, did I mention this is a PERFECT album? Chalk it up: this is Rush's SEVENTH in a string of NINE absolutely awe-inspiring albums."
    },
    {
      "reviewer": "FloydWright",
      "date": "Posted Sunday, January 15, 2006",
      "rating": 4,
      "text": "Permanent Wavesgets off to a promising start with a good opening riff, in \"Spirit of Radio\". Drummer NEIL PEART is what DREAM THEATER's MIKE PORTNOY aspired to be.technical but still fitting into the groove like SYMPHONY X drummer JASON RULLO. In some ways I give RUSH credit for being an ancestor to the later prog and technical metal I enjoy, hence my interest in the band. Even in this obvious single, the band still managed to do some innovative things--the reggae section is a fun little change. The first two songs have suffered from some overplaying on the radio, unfortunately. PEART's lyrics are fantastic here--what's said about the music industry is just as timely in these times of RIAA fascism. Ironically, I noticed that GEDDY LEE's vocals are much higher-pitched and screechy on the pop tracks than on the rest of the album.could it be they did do it because it sells?\"Free Will\" is also enjoyable as a song.the lyrics are well-written but a little bit narrow in that they create a false dichotomy between having faith and taking personal responsibility. As for why I feel I can criticize, since PEART's lyrics are of such a high standard, I believe the criticism should be much more advanced as well. However, itwasthe lyrics that first got me into RUSH, most particularly the very true \"If you choose not to decide you still have made a choice.\" Later, the RUSH-influenced DREAM THEATER seems to quote this recognizable set of lyrics with their reference to God as the \"unearthly guide\" in \"The Great Debate\". Musically, we have excellent bass work in the interlude, and this is made an especially good album for its time bynotgoing the 80s drum-machine route.What convinced me to buy this album was that I had the fortune to hear this whole album on the radio when a classic rock station in our area was preparing to change to a different format.I remember that moment of shock when I realized the twofer was going to be an entire album! When \"Jacob's Ladder\" started, it had a totally different feel to the rest, slower-paced, and that really intrigued me. To me, the prog begins in earnest here. The lower-range vocals areveryeffective for him and it was good to see some versatility in his voice. The heavy feeling as the song builds up definitely shows why this group influenced later prog-metal offerings like DREAM THEATER and AYREON.and possibly even the power-metal genre. This is probably my favorite \"first-generation\" prog group after PINK FLOYD, and to be honest, I'm pretty picky about the first-generation stuff. There's some extremely nice synth work in the interlude of this song, not excessively fast, and has a definite mood to it.and as an added bonus, the overall production is pretty good for the time, and it really stood out here!\"Entre Nous\" is another that might've had a crack at being a single, but perhaps it didn't catch on because there was a little less of the screeching stuff from LEE. I also noticed that the lyrics were a bit lighter compared to PEART's usual fare, so while certainly not a bad song, it does seem a little strange in comparison to the rest of the album. On \"Different Strings\", Ilovethe chord transitions--unusual but not overly strange. The lyrics are simple and sweet-again, relationship based. PORTNOY has tried to do the same thing with the cymbals that you hear here, but failed for some odd reason.too little variance as one should expect from a human? PEART pulls it off quite well. While I understand the bass was a real signature instrument for RUSH, it does seem to be mixed slightly loud here.\"Natural Science\" is the other more strongly proggy piece in both music and subject matter. DREAM THEATER seems to have been inspired by the riff you hear around the \"Quantum leap forward\" bit and I'm pretty convinced I've heard them \"quote\" it somewhere. As to this song, I especially give RUSH credit for having good length control; they seem to know exactly how long the listener is willing to listen for and provide that--no more, no less. That's a balancing act that not all prog bands learn to master.Overall, this is an album well-done with only minor critiques--my main one being that it is way too short (though that could be a generational bias)."
    },
    {
      "reviewer": "Tony R",
      "date": "Posted Sunday, February 19, 2006",
      "rating": 5,
      "text": "This wonderful album is the bridge between the 70s and the 80s for Rush and would see the curtain draw on side-long sci epics of yore and set the stage for shorter more concise pieces.\"The Spirit Of Radio\" opens the album and it's the perfect fusion of prog rock integrity and radio-friendly stadium rock that would so elude Genesis and to some extent Yes.The bristling guitar opening,the hammering drums that lead into that incredible arpeggiated riff,the glorious chorus,the reggae finale and inspired outro combine to make this a most singular piece of modern prog. The pace rarely lets up,\"Freewill\" with the monster bass and guitar solo is another radio-friendly piece that again manages to retain the band's integrity leads into the portentous and beautiful \"Jacob's Ladder\". Almost an instrumental this track is the depiction of a rural landscape during a stormy day and the music is flawless in its delivery. Very much a timeless Rush classic. \"Entre Nous\" is a nice track interesting enough to be more than just filler and the slow-burning \"Different Strings\" features a killer fade-out guitar solo.The final track is the incredible \"Natural Science\" a song that features many shifts of pace and moods from the atmospheric tidal pool opening through sci fi wheels-within- wheels to the strident punk-like ending.This musical tour-de-force was actually created with bits from an unused piece which was to be called \"Sir Gawain and The Green Knight\" a potential epic Peart was working on but felt was out of place with the other tracks.I would have no hesitation in saying that this album is the perfect Rush primer and am absolutely confident in its five star status.Buy it and treasure it!"
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Sunday, October 15, 2006",
      "rating": 3,
      "text": "A bit of a question mark between two solid albums. Permanent Waves is the real start to more radio friendly Rush, straying from the long epic style songs they had established on the previous albums. This record is really lacking in a lot of areas, but there's enough there on certain tracks for it to be a keeper.Permanent Waves starts with arguably the best track, a fun and upbeat song in Spirit of the Radio. Freewill is a huge mistake. The chorus comes in and I just get bored to tears. My favorite track on this album is Jacob's Ladder, one of the most interesting songs Rush ever wrote, a real different style to it than most of their works. The rest of the album is very wishy-washy. Nothing really memorable, just some good efforts that don't exactly hit the mark.Overall, I really would not reccommend this record for getting into Rush (that is if you already haven't). The other albums of their \"prime\" are really much better."
    },
    {
      "reviewer": "The T",
      "date": "Posted Tuesday, October 31, 2006",
      "rating": 4,
      "text": "4.5 STARS.This album marks an important point in the canadian trio's career, and, for my particular point of view, in prog's history, for a reason I will explain later.this is the first album Rush released in the 80's. As such, it also draws a line between what was before and what was to come. Why? I think for two main reasons:- the \"short song\" era of rush has begun. After a period when (for me) Rush knew how to write excellent long, 10+minute songs (even some close to 20), but weaker regular- length ones, in Permanent Waves that chaneges completely: in this album, the solid tracks are the short, more radio-friendly (maybe less prog, too) ones, mostly the two openers, while the two longer songs, (neither of them really long, 7 and 9 minutes respectively) don't quite reach the same level as older pieces like Xanadu, CygnusX-1 or 2112 (which is more of a \"suite\" than a single work). Thus, this is the point when Rush begins to release albums made up of almost exclusively short tracks, which become the band's focus (only a few exceptions like The Camera Eye from Moving Pictures are yet to be created after this 80's release), and also the band's most effective songs (Tom Sawyer, Limelight, Subdivisions, Red Sector A). So, I think it's safe to say that Rush learned how to compose brilliant short songs but at the same time they forgot how good near-epics were created.- Geddy Lee's voice suddenly becomes more \"normal\", or, for lack of a better word, more human. Yes, the high-shrieking, at times scary halloween-like voice he used in such a talented way in 2112, Kings and Hemispheres starts to leave its place to a more ear-friendly, we can say more mainstream-radio-friendly quiet tone, with less (or almost no) yelling and more actual melody singing.- Even though they used Synths a couple of times in the past, the trio's music from now on would get an additional voice, that of synthezisers, which will become an integral, at times imposing, part of the band's sound.And what's the result?The Spirit of Radio (9/10), a brilliant short song. Don't let the prog-purists scare you away from this and other short Rush tracks, for they are amazing, too, and, for my particular taste, actually better than their longer ones. This apparently mundane track is a pure delight for a true rock-lover prog-lover. It starts with a twirling figure in guitar, then we get to a more pure-hard-rock riff, which suddenly fades in favor of the song's main verse, a melodic, wonderful section with clean guitars and great, not complicated yet effective drumming by Neil Peart with amazing use of the ride cymbal. The chorus has the return of the song's opening guitar figure. A short song with a lot of variation, syncopated cymbal-china-playing by Peart (Portnoy listened to this, I can tell). Then, when the main verse is coming to a point of exhaustion, the hard rock riff appears again, followed by, what I think is the song's only weak moment: a few measures in reggae-like rhythm adorned by the cheesy use of a sampler of a theater audience. After a brief solo by Lifeson, the track ends. Great.Freewill (9/10), another amazing short track, this one even less complicated that the preceding one (this one in common verse-prechorus-chorus form), the main riff in odd time (again, Dream Theater listened to this), and the first INFECTIOUS chorus by the canadians, an outstanding chorus. Catchy? You bet. Is that bad, anti-prog? Not at all, it's MUSICAL. When you have simple, standard-structure-songs, you want to have a great chorus that makes up for the lack of innovation in the structure department. This song has it. Weak point? The return, for just a few measures, of Lee's shrieking-witch- like voice before the final chorus.Jacob's Ladder (7/10), this one is longer and illustrates my point: while the short ones were getting better, the long ones were getting weaker. A boring track, starts slowly, in low tempo, with no life; the song up to this point is slowly drowning into oblivion; a calmer, quieter part saves this from complete insomnia-medicine level. Not awful by other group's standards but nothing to do with marvels like Xanadu or Villa Strangiato.Entre nous (6/10), this one is a weak short track ala older Rush. That the title is in french while not a single verse is sung in that language just adds to the lameness factor. Even pen-master Peart had troubles here writing good lyrics. This one is actually poor.Different strings, (8/10), this is another new for Rush: a pure, total ballad. There's no attempt to disguise this as hard-prog rock, this is a hard-rock ballad.... but a good one at that. Don't let the \"only long, serious tracks\" purists take you away from music like this: it may be simple, it may be a little bit cheesy, but when it's done with craft and mastery, it's an enjoyable and irrepleaceble part of this art form, for we all need a moment of rest and reflexion in one's more sentimental side. Also, this one is Geddy Lee's best performance in vocals. Good track.Natural Science, (8/10), an actually incoherent, boring at times track that is saved by a consideration more historical than musical (or better yet, musical-historical): It's my theory that this song actually contains the first progressive-metal section in all of rock. Yes, the middle section in this track has all the elements, the rhythym, the sound, the edge, the heavyness of prog-metal in the purest Dream Theater way. I can almost swear the New York greats (DT) listened more than 100 times this song before embarking into the Images And Words and the When Dream and Day Unite experiences. A fast, lightning speed solo by Lifeson only supports my position. Not the best track but a relevant one and, also, Geddy Lee's best bass- playing in the album.All in all, a good, very good album that clears the path for the Rush I prefer and the one I fell in love with. Surely, songs like Xanadu, La Villa Strangiato and CygnusX-1 I remain as some of this band's best (if not THE BEST) tracks ever. But outside of those marvelous near-epics, the rest of the earlier albums was mostly filler material. When Rush learned how to write great short songs, they found their sound. And don't forget: now (well, then, in 1980 onwards) we got a better singer, too.What do I say about those \"rush got worse 'cause they didn't write long songs ever again\" comments? Well, I like, I LOVE epics, log songs, but not for the sake of length, but for the sake of music. If the music is great, I would love not to have to quit listening to it 5 minutes after it starts....but Rush's epics were flawed, they were not perfect examples of this kind of composition....On the other hand, Rush's short tracks were nothing short of amazing (pun intended)....So, for longer, 20+ tracks, please, give me Yes, give me Genesis, or nowadays, give me The Flower Kings....For short, great songs, GIVE ME RUSH.4.5 STARS"
    },
    {
      "reviewer": "NJprogfan",
      "date": "Posted Tuesday, January 23, 2007",
      "rating": 4,
      "text": "Ironic that the band would open the album with a song titled, \"The Spirit Of Radio\" which would be the first major hit in the US. Sell out? Hardly, but you must admit, the album does have it's share of catchy tunes. I'm not the biggest fan of Geddy's voice or of Alex's guitar work, and on this album neither shine. Rather, it's Neil's drumming, (what else do you expect from the master) and Geddy's nimble basswork, plus the fantastic lyrics that get my attention. My favorites on this disc are \"Jacob's Ladder\" and \"Natural Science\". Yet, it's not until the following album do they get this style of art rock to sound proggy and catchy at the same time. Not that there's anything wrong with this album. All the ingredients are there. It just seems a bit thin here and there, especially the keys which to these ears don't fill in as well as they do on \"Moving Pictures\". Plus, \"Different Strings\" is a tad boring. This one would garner a 3 from me if it wasn't the actually first album I bought from them back in 1980. So I'll bump it to 4 for old times sake. Caio!"
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Thursday, March 22, 2007",
      "rating": 5,
      "text": "\"Permanent Waves\" has the ability to take me back in time to my youth when I drove around the beach in the summer listening to this amazing record. I can't really describe how good this music makes me feel.This is my favourite album and whenever I doubt this (I listen to so much great music) I play it again and the doubts are removed.There is an element of gloominess to this record which I really like, and the way Geddy uses the synths in the background are perfect. Oh, and the cover is unlike any I have ever seen. Nice.\"The Spirit Of Radio\" is dedicated to our local Toronto radio station CFNY 102.1, a station I listened to a lot in the nineties. Ironically enough they do not play RUSH on that station.\"The spirit of radio\" used to be their catch phrase before they became an alternative station.This song opens with Alex's churning guitar melody as the familiar drumming of Peart comes in. Check out the scathing guitar solo 4 1/2 minutes in. I remember back in 1998 driving down to Florida and hearing this song 3 times through the different states on the way down. That really surprised me as it had been 18 years since the release of this record. I love it when Geddy screams \"Of salesman\" this is my favourite Geddy vocal moment, along with him screaming \"Each of us...\" in the next song \"Freewill\". \"Freewill\" is my all time favourite song. It opens with riffs and Neil's steady drumming as Geddy starts to sing. The background synths are a nice touch.The line \"You can pray for a place in Heaven's unearthly estate\" is outstanding. Alex's guitar solo starts off mournful before he sets it on fire.\"Jacob's Ladder\" opens with marching-like drums giving the imagery of the lyrics that speak of dark, ominous clouds gathering overhead for battle.The soundscape is crushing after a minute, then Alex treats us again to a haunting, melancholic solo. Background synths are added to the pulsating rhythm until it all slows down to almost a stop, then it gradually rebuilds. Awesome tune ! \"Entre Nous\" is as close as RUSH is going to get to a love song.The lyrics are thoughtful and the melody is so uplifting. Great song ! \"Different Strings\" features Hugh Syme on piano and is a melancholic song with meaningful lyrics. Like \"different hearts beat on different strings\". More mournful guitar to end the song. \"Natural Science\" slowly builds until they are rocking 2 minutes in. Neil's drumming is perhaps at it's best on this song as Alex grinds it out, and the synths are again in the background.This song changes moods and tempos often and is a real ride.The band thanks Michael Shenker, FM and The Maxoids (MAX WEBSTER). They also thank Larry Robinson and Steve Shutt from the Montreal Canadiens for the hockey sticks. Steve Shutt and Geddy Lee were friends in school and they used to hang out in the summers after both became famous up here in Canada. They thank Space Invaders which really takes me back to the early eighties.They mention some of the past times they enjoyed at the time and TV shows. This album is more than just music to me, it's part of my history and a time machine all rolled into one."
    },
    {
      "reviewer": "Prog Leviathan",
      "date": "Posted Wednesday, March 28, 2007",
      "rating": 5,
      "text": "A smart, tight, concise, wonderfully played and dynamic album which really brings Rush to the next level as both players and songwriters. The just-over 30-minute album contains nothing but excellence, from start to finish, and contains some of the band's most beloved songs.\"Spirit of the Radio\" puts me in a good mood whenever I hear it, while \"Freewill\" always reminds me why I became a Rush fan during my jaded teen-age years. There is so much expression and brilliance contained within Peart's lyrics that I sometimes feel philosophically enlightened after listening. Alex's solos rouse the spirit while Geddy's genre-defining basslines emblazon themselves into one's mind; they are simply so much fun to listen to.Personal experiences aside, there is so much to like here that it belabors the point to list them. \"Permanent Waves\" is just awesome and belongs in any rock-lover's library.Songwriting: 5 Instrumental Performances: 5 Lyrics/Vocals: 4 Style/Emotion/Replay: 5"
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Saturday, June 9, 2007",
      "rating": 3,
      "text": "Begin the decade with a friendly voiceA new decade arrives and Rush have a hit single! The band obviously only had one thing on their mind when they recorded \"The spirit of radio\", the commercial nature of the track instantly securing the radio play it was so clearly designed for. We should not be too hard on Rush though, this is not asell outsong. Geddy Lee's vocals and Alex Lifeson's guitar work still stamp the badge of authenticity on the product.The change of style is however clear with the following \"Freewill\" also being instantly accessible, with a strong hook and melodic vocals. The chiming guitars are reminiscent of ELO's \"10538 overture\" the song itself being orthodox pop rock. \"Jacob's ladder\" is not thetraditionalsong of that name, but it is the slowest and heaviest song on the album. The track builds like a bolero with vocals and drifting synth sounds adding to the overall power of the song. This is undoubtedly one of Rush's most accomplished and finest pieces.The second side of the album has a similar layout to the first, with two short, commercially orientated songs, and a longer more structured track. \"Entre nous\" leans heavily on the synthesiser backing, but the song itself is rather dull, lacking any real spark. The ballad \"Different strings\" which follows is surprisingly downbeat and sparse, with sensitive lyrics. It is not particularly original, sounding a bit like theobligatory balladwhich many bands include on an album, but it is pleasant nonetheless.The closing \"Natural science\" is the longest track on the album at 9 minutes. The opening section continues the soft acoustic mood of the preceding track, but the volume quickly rises as the band present an altogether more traditional sounding Rush epic.With a total running time of 35 minutes, \"Permanent waves\" is somewhat miserly on content. The four shorter radio friendly songs signal that the band is moving away from its more progressive past, but the two feature tracks offer a fine olive branch to those who crave for more of the same."
    },
    {
      "reviewer": "1800iareyay",
      "date": "Posted Tuesday, June 19, 2007",
      "rating": 4,
      "text": "Rush's Permanent Waves is the fourth classic in a row for the band. It is a highly important record, as it marked the transition from heavy, border-line metal prog to the poppier synth sound that would define their 80s output. It also marks the lyrical transition from Peart's sci-fi obsession to mature and deep subject matter. Who'd have thought Peart would be such a great lyricist? This is a polarizing album: old fans point to this as the beginning of the end of the band, while others saw the lyrical brilliance and musicianship that make this album great. As always, the band gels like no other group on the planet, not even jazz bands. Geddy's voice has changed from the mad screams of previous albums into a more restrained but no less powerful tenor, which he maintains to this day. His bass playing is still some of the best you'll ever hear. Lifeson puts his stamps on the songs with beautiful melodies and terrific solos. Peart, well, we all know he's God.The album opens with the standard \"The Spirit of Radio,\" named after a radio station in Toronto. I don't know why people call this a sellout song. Yes, it's made for radio, but listen to the lyrics. The song attacks the music industry's corruption of radio from a device to hear music into just another tool to sell copies. The fact that it's tailor-made for radio play is genius. The band took John Lennon's \"Imagine\" approach to songwriting: sugarcoat your message so that many don't realize the attack. Plus, Rush introduce reggae into their music, which would surface from time to time in the future. \"Freewill\" is another classic with great lyrics. Peart pens an anthem of self-reliance. The chorus is wonderful and Alex's solo is one of his best. \"Jacob's Ladder\" is weak lyrically, as it details the dream of a prophet. However, the composition is staggering. Pounding bass and incredible guitar that slowly builds for the entire piece. This song bored me stiff the first time I heard it, but another listen and it all clicked.\"Entre Nous\" never really did it for me until I saw the band recently. It's a solid song, but it lacks the power of the rest of the tracks here. \"Different Strings\" is a beauty with melancholic vibes. Rush wouldn't make another song so moving until they released several moving songs on Vapor Trails two decades later. Entre Nous and Strings share a lyrical theme of rocky romance. The album closes with \"Natural Science,\" a look into society's oppression of the individual and how honest men are \"an endangered species.\" This features some jaw-dropping work from the band, particularly Peart, who does things no mortal could ever hope to accomplish.The album is rather short, but remember that back in the days of vinyl that meant better sound quality. Waves has the misfortune of falling between Rush's two masterpieces, yet it proudly holds its own. This is one of Rush's most enjoyable albums, and it's one of precious few devoid of filler. \"Entre Nous\" is the only track that comes close to being a throwaway. It falls just short of being a masterpiece, but Rush would ensure that their next album would make that final leap.Grade: B+"
    },
    {
      "reviewer": "obiter",
      "date": "Posted Friday, June 22, 2007",
      "rating": 4,
      "text": "prog=progressiveif hemispheres was the limit of the epic comfort zone (a what a great album that was) Permanent Waves signalled the start of a cycle of change, a progression from the epic 70s to the new wave of the 1980s.boy will that not suit everyone, in fact it riled me big time in 1980.with hindsight we have some really meaningful tracks .. redolent with the birth pangs of a new entityspirit of the radio wowed the masses, entre nous did it for me. Natural Science was the panacea for others ..but it was free will that epitomizes rush if not musically then ate least in their approach to music as it appears to me"
    },
    {
      "reviewer": "ghost_of_morphy",
      "date": "Posted Monday, July 16, 2007",
      "rating": 5,
      "text": "This is one of the two legitimate masterpieces that Rush has produced (the other being 2112.) Every song on it, even Entre Nous and Different Strings, is brilliant. Spirit of the Radio is perhaps the best song that they have ever released, although Subdivisions gives it a lot of competition. Freewill has been one of their concert staples since it's release. The dark and atmospheric Jacob's Ladder goes off in a direction that Rush has rarely explored in a magnificent manner. And finally we have Natural Science, which is a brilliant epic that ranks with the best of anything that has been released by other prog bands. It may not have quite the story that 2112 had, but the music here is unequaled elsewhere.Only a handful of albums this good have ever been released. If you haven't heard this one, find a copy and listen to it.5 stars all the way."
    },
    {
      "reviewer": "Atavachron",
      "date": "Posted Friday, September 14, 2007",
      "rating": 5,
      "text": "Rush made many great records. Everyone has a favorite and, especially if you were young during the band's heyday, each album brings you back to a certain time, often one of musical discovery and the realization that rock music could be more than just three-minute ditties about broken hearts and drinking. And that was the beauty of progressive rock, it took us away from the confines of the blues and allowed further growth. Rush accomplished this as well as anyone but added cool heavy metal flash and high-tech bravado.A Farewell To Kingswas good,Hemisphereswas a huge leap forward butPermanent Waveswas their most realized, eloquent and precise statement of what they did best.Alex Lifeson wastes no time ripping open 'Spirit of the Radio' with a Hackett-like riff, Neil Peart and Geddy Lee's accents beginning the day with a friendly voice, a track that shows the dynamic range of these maestros. Quirky guitar lines and a classic lyric from Peart on the importance of independent thinking in 'Freewill', and compelling drama for 'Jacob's Ladder' as the sky grows dark with Lifeson's stern muted chunks, building into a distant overture of synths and great space-filling by Peart. The second half is even better, if that's possible, and features the wise and wistful 'Entre Nous', a sophisticated rocker showing remarkable sensitivity and intelligence for a power trio, even more than they had shown in previous work. Love song 'Different Strings' is a tender tribute, further demonstrating a band with much to say and a drummer-turned-lyricist who knew how to say it. And to top-off an already classic piece of modern rock, the brilliant 'Natural Science', full of light, charged molecules, and a deft commentary on the rhythm of life.Though they produced albums that were more popular, Rush never did anything that was superior to this.Permanent Wavesremains a critical turning point for them and a coming-of-age record for all young people interested in what progressive rock has to offer."
    },
    {
      "reviewer": "b_olariu",
      "date": "Posted Saturday, September 22, 2007",
      "rating": 4,
      "text": "One of my fav Rush albums, no doubt, and among their best. From this one they write much shorter pieces, then on previous albums and the result is very good. I'm not agree with reviewers that said they try to go comercial with Permanent Waves, not even the opening track Spirit of the radio is not an every day tune, is prog but in other way put by the band. Again every musician shines on every piece just listen to Entre nous and the slow one Different strings, beautiful as always. Voice of Geddy Lee is outstanding both on slow and smooth pieces and in the pieces with more vein. Not to mention Neil Peart who is responsable with the lyrics did a great job, and the druming, o gosh what a drumer. Alex Lifeson is on of the best guitar heroes of prog music, and here is absolute outstanding on Jacob's ladder and Natural science. The rest are also great. 4 stars and among the best albums of the early '80."
    },
    {
      "reviewer": "FruMp",
      "date": "Posted Wednesday, October 24, 2007",
      "rating": 4,
      "text": "A great halfway point between pop RUSH and hard rocking prog RUSH.Following up 2 of the best progressive rock albums of all time in 'A Farewell to Kings' and 'Hemispheres' was never going to be an easy task but RUSH managed to do a fine job, cobbling together a great album which although quite doesn't reach the same level as it's predecessors is good in it's own right.Things start off strong with the hard rocking anthem 'Spirit of the Radio' with some fiery guitar work from Lifeson and we catch a glimpse of the synth-pop RUSH that was to come in the chorus but it isn't too bad at this point, the song on the whole is great and the little reggae breakdown towards the end is particularly good. 'Freewill' is very much in the same vein as 'Spirit of the Radio', and is incredibly catchy, there are some great riffs and progressions here.Jacob's ladder is the first real progressive song on the album and what a song!, it starts off innocuous enough with some nice chords and a bit of marching snare work from Peart before things become staccated before launching into some brooding middle eastern inspired guitar driven territory with a great solo then coming to rest peacefully - one of RUSH's best prog songs. 'Entre Nous' and 'Different strings' are where the album really dives, there is nothing really to these songs they aren't prog and they are quite poppy and weak. Natural science more than makes up for it, easily the best song on the album it starts off slowly before becoming frenetic and incorporating crazy timings with the best synth work in the album and the best solo in the album (Lifeson shreds!). Things end triumphantly with some lighter music and some great bass work from Geddy and some inspired lyrics \"Art as expression, not that much it can change, will still capture our imaginations\" and yet more shredding from Lifeson - a brilliantly written prog piece.Overall Permanent waves is a solid album and most of the songs are good or great, it isn't as proggy as previous efforts from the band and is moving towards the more accessible poppy sound on later albums further along in the decade but it's definitely worthwhile for any heavy prog fan and essential for any RUSH fan."
    },
    {
      "reviewer": "rogerthat",
      "date": "Posted Thursday, November 8, 2007",
      "rating": 5,
      "text": "While Hemispheres is my alltime favourite Rush album, it is this album and the following Moving Pictures that to me marked out Rush as an alltime great band. Why?? Because they showed they could change their sound without losing anything from previous albums that was great about them, indeed adding new dimensions to their art. Sure, older fans were alienated by the change (much like hardcore Ozzy fans must have decried the unspeakably brilliant Heaven and Hell album of Black Sabbath at the time of its release) but that is usually the case in rock n roll anyway (post-Uli Roth Scorpions is another such instance, again Lovedrive and Blackout ranking among the best albums of that band).However, I was not fortunate enough to watch these bands grow and that, fortunately, makes me more neutral about their albums through the years. This is a Rush still belting out proto-prog metal rivalled by none at that time (or even today). Hell, Natural Science possibly rocks harder than Trees and Jacob's Ladder has riffs that would make Tony Iommi proud. At the same time, they show they are able to write accessible, indeed radio-friendly, songs that still retain all the accomplished musicianship we look forward to from Rush. Sure, Spirit of Radio and Freewill are radio-friendly, but in a good way, like Pink Floyd's Money or Jethro Tull's Locomotive Breath. And, IMHO, Different Strings and Entre Nous rank among the finest creations of Rush. Sure, they are not in the least complex compositions but they show the sensitive, mature side of Rush.Here, I would like to digress a bit with an example based on Metallica. After deeply influencing thrash and making it a more epic and complex beast than its other frontrunners had conceived possible and in turn successfully pulling off mainstream metal/rock, Metallica tripped heavily in covering the seemingly simple Black Sabbath song Sabracadabra. Rush however proved on Permanent Waves that they could write accessible rock that was also intelligent and beautiful at the same time, a dimension they had not displayed till then in their songwriting. In essence, they could straddle the complex epics and the simple, soulful rockers/ballads effortlessly.Coming to the instrumental attack, this is probably more guitar-oriented than Hemispheres with some uninhibited but inventive shredding from Lifeson as opposed to his tight performance in the previous album. At the same time, Geddy Lee's keyboards too begin to play a bigger role in the mix than before. How is this achieved?? Well, as mentioned earlier, the band expanded and enriched their sound to accomplish that which they could not have in the previous outings.And that, more than anything else, is the reason to recommend any prog rock album highly. When a band change in a good way and even improve upon their previous work, it means the album is still interesting for a prog rock fan and Permanent Waves certainly passes that test.Dock points?? What for, this album is perfect in every way. Ok, I will be politically correct and give it 4.75 :P"
    },
    {
      "reviewer": "progrules",
      "date": "Posted Friday, December 14, 2007",
      "rating": 3,
      "text": "Back to one of my ancient favourite bands. I always thought this is an intrigueing album because it marked the transition form the old to the new Rush. In other words the real symphonic to the more crossover Rush. The predecessor Hemispheres was the apogee of the old period and for many their best album. The successor of PW, Moving Pictures is an already very accessable album, reflecting the new Rush. And Permanent Waves is somewhere in between although I believe it comes closer to Moving Pictures than to Hemispheres.Next thing that's striking to me is the popularity of this album. It has a real high average but I wonder what the great highlight is. I mean, it's not a bad album but it's far from outstanding I believe. Maybe the last track stands out a little, it still has the symphonic elements but the rest are average songs that have no extra dimension. Spirit of the radio was in the charts if I remember correctly but to call it a breakthrough for Rush in the commercial scene goes too far, don't you think ?So although this is an interesting one in the history of Rush I can't find the great charme musicwise. So it'll have to settle for 3."
    },
    {
      "reviewer": "crimson87",
      "date": "Posted Saturday, February 2, 2008",
      "rating": 4,
      "text": "This is my firsf review and I hope you , members and non-members of progarchives may find it useful.Rush is a band whose style has changed over the years , always keeping their progressive mood but adapting it to the new tecnologies , this album makes no exception .This album , altough somewhat short (35 minutes) has memorable songs that have become part of the band`s live set like Spirit of Radio or Freewill and it also shows that you can find prog elements in songs that are shorter than ten minutes (quite a quimera for some proggers) this album and the following shows a perfect mix between hard rock a la Zeppelin and progressive rock.4 stars for me"
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Tuesday, February 12, 2008",
      "rating": 5,
      "text": "Released in 1980,Permanent Waveswas the album that fused the progressive tendencies that Rush showed on their '70s material with a mint production and it even gave us a few signs of the transition that the band would undergo on their next few albums.This album was released only a year beforeMoving Picturesand has unfortunately been overshadowed by that release ever since. I consider it truly a pity becausePermanent Wavesis a far superior package in every single category. It has stronger hits (The Spirit Of Radio,Freewill,Entre Nous), a ballad that blowsWitch HuntandVital Signsout of the water (Different Strings) and, most importantly the best progressive rock moments (Jacob's LadderandNatural Science).Natural Scienceis by far my favorite composition that Rush have ever recorded. It has amazing lyrics which are perfectly matched by its music content. The two minute atmospheric intro transitions into one great Alex Lifeson-riff after the other and Geddy Lee adds a few underlying synthesizer melodies that elevate the band's performance to a whole new level. Still it's Neil Peart who once again steals the show for me here. Just listen to all the little polyrhythmic fills that he literally floods the music with! The only minor complaint here is the slightly trivial guitar-solo halfway through the track which sounds a bit out of place compared to all the other difficult patterns that the band has given us so far. Surprisingly enough I actually find this flaw quite charming especially since I don't believe in such a thing as a perfect recording althoughNatural Sciencedefinitely comes close to it!Seeing the band perform live during theirSnakes & Arrowstour was a great experience for me. The fact that they played four out of the six songs off this record during that performance really showed that the album has withstood the test of time! It's simply a great album that everyone should own.***** star songs: The Spirit Of Radio (4:56) Jacob's Ladder (7:26) Natural Science (9:17)**** star songs: Freewill (5:21) Entre Nous (4:36) Different Strings (3:48)Total Rating: 4,61"
    },
    {
      "reviewer": "The Pessimist",
      "date": "Posted Sunday, March 2, 2008",
      "rating": 5,
      "text": "Rush's best effort by far: it completely rinses Hemispheres and Farewell, while it marginally beats Moving Pictures, their supposed master work. Every single song on this wonderful album is a classic Rush song, especially Spirit of the Radio, Jacob's Ladder and the finale Natural Science. The musicianship is flawless also, and what's better is despite being pure progressive rock, it is also very rock and roll. Here is why I love this album so much, with a track by track:1. Spirit of the radio - Dare I say it, the best intro in the whole of rock history, therefore making it the best album intro in the whole of rock history. This is Rush's best known song, and for very good reason! (10/10)2. Freewill - Another Rush classic here, I especially like the peculiar time signatures and the chorus in this song. The keyboards are also quite pretty. (8/10)3. Jacob's ladder - Second masterpiece of the album, this is definitely the proggiest of the lot. One of my personal favourite Rush songs, this is direly underated as a song. (10/10)4. Entre nous - Another great short song from Rush. This one is especially catchy and delivers some nice guitar work from Mr Lifeson. (9/10)5. Different strings - The penultimate track is probably the weakest on the album, but it still is worthy of being on this masterpiece. The shortness of it also has a certain charm to it. (8/10)6. Natural science - AHA! The greatest Rush song of all time without a doubt. Everything about this song screams epic and prog in your face. The guitaring, drumming and bass work is astounding on this song and I love everything about it, from the addictive riff at around 2 minutes to the complete rhythm change about halfway through. This song is a necessity to any prog fan! (10/10)Overall, a masterpiece album. I need not say more, other than buy it if you haven't already got it. 5/5."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Wednesday, March 5, 2008",
      "rating": 5,
      "text": "...And the words of the prophets were written on the studio wall...As the 70s came to an end many of the prog rock giants were unable to produce work of the same caliber that they once had. Being a product of the late 70s anyways, Rush was somehow able to adapt and release this fantastic album. Very different in style from their previous works and yet somehow similar at the same time, Rush pushes into the shorter song format while still leaving some pure prog gems in their wake. For me this has always been a very friendly album, despite it's topics at times. Definitely one of Rush's most accessible works, this is one that will always find a place on my cd player.Likely fueled by their own dislike for their previous prog-masterpiece,Hemispheres, Rush cranks up the volume and manages to put some some excellent rock music. The album opens with to of the band's biggest hits. The oh-so familiar riff of the concert favoriteThe Spirit Of Radiowarms the listener with it's synths and riffs along with that interesting reggae breakdown near the end. Though better live (it was always a dream of mine to be one of the people screaming when Geddy shouts ''Concert Hall!''... which I got to do last summer) this song is still a great track.Freewillfollows this one, with it's objective viewpoint of human nature. Again a familiar, rock-anthem riff from Lifeson and a very catchy chorus that made this song such a hit to begin with.Coming onto the second side there's some more short rock songs, these ones a tad weaker than their side one counterparts. The spaced outEntre Nous(well performed on the Snakes and Arrows tour) kicks off the fray with some strong synths and melodies. The guitar in this one is a bit less pronounced and the tone is very much more low-key than some of the songs off the first side, but its a good song none the less. Unfortunately, the songs that it's had to compete with (Spirit, Freewill) make it seems weaker on the album.Different Stringsis kind of the obligatory slow song. Cool lyrics from Peart, making use of his poetic skills mixed with his normal lyrics about human nature. Good song, reminiscent of something likeTearsfrom2112, but likely the weakest track on the album.Then there's the longer tracks. On an album that houses such good short tracks are the longer ones going to be any good? Well, Rush has always been a band that's been great with the longer tracks, and these are no exception. The dark, moodyJacob's Ladderhas always been a personal favorite (although I prefer the...Exit Stage Leftperformance). It's short use of lyrics and subsequent instrumentalism (that almost seems like it could bring down rumbling clouds over your head) make this song one of the best tracks in the Rush catalog... if one of the least accessible (ironic that it's n the band's most accessible album). A fantastic journey from start to finish, no progger should be without this song. Topping off the album, however, is the even better -- multi-part-mini-suite --Natural Science(another live favorite). Starting with the sound of gulls and and Alex's subdued guitar under Geddy's echoed voice this song is of to a promising start. It's not long until the song explodes into full motion. A slick riff from Lifeson and some pounding bass from Geddy make his song an even better journey thanJacob's Ladder. Peart is back with his objective lyrics, this time comparing civilization to tide pools, where the creatures liveing in their little worlds forget about the larger picture -- the sea from whence the came. Interesting use of vocal effects on some of the parts and some truly excellent soloing throughout make this song THE definitive standout on the album. AKA -- if you buy the album for one song, it's this one. (There's also an amazing live version of this one on theRush in Riolive album).A bit of a biased review? Perhaps, but since this album is likely my favorite album of all time it must have done something right to get into that position. 5 stars. While the first couple songs of the second half may be weaker than the album as a whole they're easily redeemed by the behemoth that isNatural Science. Highly, HIGHLY recommended. The only people who won't enjoy this album are the people who condemn Rush for having Geddy as a vocalist. But even they will likely enjoyJacob's Ladder."
    },
    {
      "reviewer": "russellk",
      "date": "Posted Wednesday, April 9, 2008",
      "rating": 3,
      "text": "Putting aside the errors of prog overindulgence, RUSH settle back and do what they're best at: write good tunes.Within moments, RUSH's trademark crunchy guitars herald not another side-long prog epic like the ill-advised '2112' or 'Cygnus X-1 Book II', but a radio-friendly sound, marking the beginning of their move away from traditional progressive phrasing. I'm not overly fond of 'Spirit of the Radio', finding it frivolous, but I approve of what they're trying to do. With the benefit of hindsight, the direction they take on this album was a necessary prelude to 'Moving Pictures'. I simply don't think the band had the compositional chops to write the sort of prog epics they attempted in the late 70s: they realised this and moved towards music best described as prog-related with this and subsequent albums.After 'Spirit of the Radio' comes 'Freewill', a track dominated by a splendid LIFESON solo. There are prog elements here, particularly in PEART's drumming, but they're a necessary part of the song, not paraded self-consciously. 'Jacob's Ladder' manages to avoid overstaying its welcome, but what on earth were they thinking with those harsh, two-bees-in-a-dustbin synths?I'm afraid the second side of the album does not measure up to the first, continuing the RUSH tradition of unevenness. 'Entre Nous' is a fairly innocuous art rock song, easily culled on an iTunes playlist but unfortunate given that, at 35 minutes, this album has no fat to trim. 'Different Strings' ratchets the pace down a few notches, a welcome change, but ultimately the song is little more than a facile ballad with a defeated fadeout ending, as though inspiration has deserted them. 'Natural Science' harks back to previous albums, though the riffs here sustain the song for its nine minute length. RUSH have learned the virtue of brevity at last. Interestingly, in this song one can hear many of the elements that bands like DREAM THEATER took to heart.Another in a long line of frustrating RUSH albums, 'Permanent Waves' is actually a misnomer. The waves it makes are uneven and, at best, temporary, a prelude to the tsunami that was their next album."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Friday, April 25, 2008",
      "rating": 5,
      "text": "Sometimes albums can take several bashes about in order to understand what goes on. If you don't get what my jive is, let me explain it this way; I once thought that PERMANENT WAVES was fluttered with too many flaws to achieve the masterpiece status even though I loved quite a good portion of the album. I even reviewed the album during the growing phase (the original review date was 4/25/2008; the day of re-write is 5/22/2009) hoping there would be an epiphany to come. I already know the euphoria of the two most ''prog-like'' songs (''Jacob's Ladder'' and ''Natural Science'') but I'm going to go on and say that ''Natural Science'' is possibly nine minutes of exactly what Rush represented in their heyday; intricately structured epic-esque pieces of music littered with blistering guitar solos and drum fills, odd metred riffs that harken to hard rock all in a pace that will keep the listener interested throughout.Even if we don't observe the longer pieces, the shorter ones also deserve their fair share of praise. Songs like ''Freewill'' and ''The Spirit of Radio'' sacrifice the weird fantasy themes and banshee shrieks of earlier albums in favour of bright guitar riffs and pop-like sensibilities with an insane amount of tweaking to them. ''Entre Nous'' might be a little ho-hum compared to everything else, but I still have a soft spot for it. ''Different Strings'' will be filler for most people, but I've found it to be one of the better cases of Rush goes soft along with ''Madrigal''.I'd say that PERMANENT WAVES is much better than HEMISPHERES simply because on the latter effort, Rush tried way too hard to have prog kudos and ended up having a bloated epic. However, I think PERMANENT WAVES has more focused songwriting and tighter interplay all the while retaining that heavy-progressive edge that characterized Rush's previous two efforts. An absolute highlight for any Rush fan."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Tuesday, May 20, 2008",
      "rating": 3,
      "text": "Review 37, Permanent Waves, Rush, 1980StarStarStarStar Permanent Waves is naturally paired with its successor, Moving Pictures. In my opinion, Permanent Waves is a much, much better album, with more genuine and moving atmospheres, the boring moments focused on a couple of shorter tracks rather than creating a sort of inverse magnum opus in The Camera Eye. The high points of the album definitely merit the cost, but there are weaknesses. I enjoy this one.Noone can accuse Rush of not having a knack for openers, and The Spirit of Radio is proof of this, with great rocking guitar parts, a non-screechy, yet enjoyable and singalongable vocal from Lee (combined with a humming and very liberated bass part), Peart throws in great normal drumming, as well as shining with glockenspiel (or something similar) and tympani in the more progressive sections. Some solid enjoyable lyrics sail behind the music, including a nicely-used reference to Simon And Garfunkel's The Sound Of Silence. The combination of rather progressive sections and harder rock is handled sublimely, and we get a lively and energetic solo from Lifeson.Freewill's opening comparatively lumbers a bit, with overdone synths and a rather awkward ambling guitar part (coupled with boring, bombastic drums). It doesn't help that the lyrics are, while original in idea and form of expression, very forced at times ('they weren't born in lotus-land'). The choruses pick up a lot musically, but Geddy's voice just doesn't quite make the impact that it sometimes does. A rather mechanically inserted instrumental break features some rather odd bass playing from Geddy, a many-many notes per second solo from Lifeson, that was a bit acquired for me, but I now enjoy it. The conclusion is really no better than the original part, and the song overall a rather bland experience.Jacob's Ladder is a surprising gem, with a very dark, powerful atmosphere that Rush rarely attempt to build. The Lee-Peart rhythm section outdo themselves, through a rather vicious, military and driving feel. Lifeson shifts adeptly between a dark rhythm guitar and some stunning solos. Geddy Lee handles the vocals with tension and emotion, and his synths are a lighter counterpart to the powerful guitar, rather than ineffectual. In the build-up to a massive crashing section, we get a great decisiveness and a feeling of spontaneity that Rush often seems to lack. Everyone on top form, and the atmosphere is very moving.Entre Nous is rather a let-down after this, because the vocal is simply annoying and upbeat, failing to provide a real feel (the lyrical idea is good enough, though the wording doesn't satisfy me). The guitars are top notch, using acoustics and electrics well. Peart is responsible, with a rolling style more reminiscent of his earlier stuff on 2112 or Caress Of Steel, for most of the impact of the chorus, but his work on the verses simply holds no real interest for me, getting annoying if I listen too hard. A synth solo actually works better than I'd have expected, and it does give an opportunity to a brief, but no less likable, bass solo from Lee. Not absolutely terrible, but it leaves a lot to be desired.The gentle song of the album, Different Strings, is a very good piece, with a combination of acoustic guitar and a wonderful piano that weaves into it, an effectively uplifting bass (a rarity) part, and some decent Peart additions on drums from the second verse onwards. Alex Lifeson provides one of the slow emotional background solos we've earlier seen on Into The Darkness, as well as a rather more bulky one at the song's end. Certainly not a weakness.The long concluding piece, the tri-partite Natural Science, doesn't disappoint, beginning with a slow, gradually appearing-and-disappearing acoustic, some watery effects, some completely odd effects and a watery vocal with the right sort of distant feel for the song. The rocking chorus 'Time after time in a spiral away...' flows right into the next section, concluding Tidal Pools.The fast beat of Hyperspace, with its speed, mechanical, distorted vocal, a set of interesting drums from Peart and a use of a moog synthesiser as well as Lee's usual array of stuff. A mocking derision of the technological side of society gives way to a moving solo from Lifeson (rather reminiscent of Shine On You Crazy Diamond, only faster) and then a return to the chorus.Permanent Waves gives us the album's most grandiose moment, with a positive, determined vocal, some of the classic bombastic drumming-guitar ideas that pervade Rush's discography (only, they work!). A whirling guitar solo from Lifeson appears over a static bass drum line. The gradual drive-up to the chorus's alter-ego is perfectly handled, twisting with a concision and constant mobility. The instruments are relaxed in favour of a water effect fade, which works perfectly in context. An exceptional piece of work, with constantly good playing from everyone, an atmosphere of its own and it manages to hold interest throughout. Definitely a much-loved Rush piece, for me.In conclusion, there are two weak tracks that I don't like on this album. On the other hand, there are four gems that should be in the collection of any (progressive) music lover. Essential, but not a masterpiece. The feel of the album isn't quite rounded due to the aberrations that are Entre Nous and Free Will, but that shouldn't discourage anyone from getting it.Rating: Four StarsFavourite Track: Natural ScienceEdit: Last listen placed it as a firm three... I can't say that it has the same freshness it did when I wrote this review."
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Wednesday, June 25, 2008",
      "rating": 4,
      "text": "\"Permanent Waves\"is the 7th full-length studio album by Canadian progressive rock actRush. The album was released throughMercury Records(US/Europe)/Anthem Records(Canada) in January 1980. It�s the successor to\"Hemispheres\"from 1978. After completing the 8 months long tour supporting\"Hemispheres (1978)\", the band felt worn and took a six weeks break, before uniting again to begin writing material for what would become\"Permanent Waves\". A short tour followed whereRushwould introduce some of the new material, and in September 1979 they entered Le Studio in Quebec with producerTerry Brown, where the already written material were given a final brush and enough additional material were written for a full-length release.\"Permanent Waves\"marks a bit of a stylistic chance forRush. After the arguably most progressive period of their career (1976-1978), the band felt a need for change and most of the tracks on\"Permanent Waves\"are therefore shorter, more immediately catchy, and less complex in structure than the material on the preceding releases. This should not be understood as if this is not progressive or challenging music though, as there are plenty of adventurous songwriting and technincally skillful playing on the album. The progressive parts are just typically a little more subtle or hidden within the context of the songs, allowing more catchy and melodic moments to stand out.The album opens with\"The Spirit of Radio\", which on the surface is an almost mainstream pop/rock oriented song, featuring an energetic and uplifting mood, but when you listen a bit more closely it�s quite the complex and intriguing progressive rock composition, featuring many different parts and time signature changes.\"Freewill\"follows and it�s another album highlight. It�s a catchy and memorable track, but like the preceding track it�s a more complex composition than it may initially appear.\"Jacob's Ladder\"is a slow building, atmospheric, and ultimately heavy track. It�s quite an epic track and features a total playing time of 7:31 minutes.\"Entre Nous\"opens what was Side B of the original vinyl release, and it�s a melodic rock song. Not the most adventurous moment of the album, but still a decent quality composition.\"Different Strings\"is the mellow power ballad track of the album.Rushhad included tracks like that on previous releases too, so the mainstram oriented nature of the song isn�t a surprise. It�s a decent track but not exactly a highlight of the album. The 9:16 minutes long\"Natural Science\"closes\"Permanent Waves\". It�s an epic progressive rock track subdivided into three parts titled\"I: Tide Pools\",\"II: Hyperspace\",\"III: Permanent Waves\". It�s by far the most complex and progressive composition on the album and arguably an album highlight.Rushare as well playing/singing as ever (Geddy Lee�shigh pitched voice and singing style are probably as always a deal breaker for some and a great joy for others) and\"Permanent Waves\"also features a well sounding production job (co-produced byRushandTerry Brown), which suits the material perfectly. There�s power and bite here and it�s definitely a case of high quality production values. Upon conclusion\"Permanent Waves\"reeks high class in all departments, from the high level musical performances, to the above mentioned high quality production values, to the intriguing and varied songwriting. A 4 - 4.5 star (85%) rating is deserved.(Originally posted on Metal Music Archives)"
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Tuesday, July 22, 2008",
      "rating": 5,
      "text": "Permanent Waves is the latest album I have purchased of Rush, due to the fact that with my other Rush Cds I had somehow accumulated all but two tracks from this album, at least live versions and some on compilations. However, I am glad I bit the bullet and got hold of this as its an absolute masterpiece and quintessential Rush. It is become one of the top 5 Cds in my Rush collection. The main reason this album works so well as there are no filler tracks. It is a new style of Rush in comparison to previous efforts but it is surprisingly mainstream yet still keeping the aspects of prog.The first track, 'The Spirit of Radio' was a massive hit for the band and it is easy to see why. It has some of the most endearing and memorable guitar work from Alex Lifeson. Listen to that phased out lead work in the intro, and the way the time signature instantly changes only to kick into a standard 4/4 riff. Geddy Lee's high soprano vocals have never been better and you have to love the lyrics: \"Begin the day with a friendly voice, a companion, unobtrusive, plays that song that's so elusive, and the magic music makes your morning mood.\" This example of crazy alliteration that evokes a quirky sense of humour has defined the Rush sound. The track works effectively as a radio jingle promoting the medium, no wonder it was a top 20 UK hit in 1980, one of the greatest rock singles ever. It even features a startling reggae breakdown towards the end that shouldn't work but Rush makes it work because they are masters of song structure. After the words \"Concert hall\" we hear a crowd roaring, which really adds to the overall effect of the track. Lifeson's wah wah guitar solo is amazing. A short blast of the opening riff and then it ends abruptly.The next track 'Freewill' is also a terrific prog track with an excellent melody that stays in your head, notably the melodic chorus \"you can choose a ready guide in some celestial voice, if you choose not to decide you still have made a choice.\" Great stuff and a live favourite. Another notable track and the main reason for my interest in the album was the standout epic 'Natural Science'. It clocks in at a little over 9 minutes and is a type of multimovement suite with variations of light and shade in three sections. I had heard this on the live \"Different Stages\" but this, the studio version, way outclasses the live version for production value. Wind chimes, tubular bells, atmospherics, jagged guitar riffs and all manner of instruments merge together on this epic to produce one of the finest recordings of the band.In conclusion, Permanent Waves is an essential purchase and a good starting point for those interested in Rush."
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Sunday, August 3, 2008",
      "rating": 3,
      "text": "Different stringsIn my opinion, Rush reached their progressive and artistic peak with the previous Hemispheres. After the masterpiece that was Hemispheres, Permanent Waves is a little bit of a disappointment. The opening track, Spirit Of Radio was the first ever \"commercial\" Rush track and as such pointed towards things to come on future albums. This song simply seems to be designed for radio play. Freewill similarly is a more simple and straightforward composition than what Rush offered us on 2112, A Farewell To Kings and Hemispheres. These two tracks bring this album down a bit for me, but the rest of the album contains more classic Rush material. But even the best and most progressive numbers add little to what we already was given on the aforementioned trio of great albums and really only Natural Science is up to the standards set by these previous classic albums.Permanent Waves is for me the least good album of Rush's classic period (2112 to Moving Pictures) and, even if it is indeed another good Rush album, it was the first sign of Rush's imminent decline that started with Signals and culminated with the awful Power Windows.Not Rush's best, but still part of their best period and contains some great moments"
    },
    {
      "reviewer": "The Crow",
      "date": "Posted Monday, August 25, 2008",
      "rating": 4,
      "text": "This is an splendid album... But not a masterpiece in my opinion!The disc starts in a magnificient way with the hits The Spirit of Radio and Freewill... I specially like the first one, being a really catchy track with even a reggea middle part! Freewill is also another anthem with a great solo and Geddy's bass playing.Then, comes another great Rush's song... The proggy Jacob's Ladder, a song full of soundscapes in the vein of Vangelis and with a good keyboard's work. I also like the riffing of the song... A Rush's little classic. But then, the album enters in a kind of weak section... Entre Nous is a usual rock song in the vein of Caress of Steel or the short tracks of 2112. Just an OK rock song, but nothing special... And Different Strings is also not very interesting. A slow track with some interesting bass playing, but not really inspired.Luckily, the end of the album is brilliant... Natural Science returns the power of the beginning, even surpasing it. The first acoustic guitars are the introduction for an amount of catchy and variated riffs, offering the most progressive track of the album, and maybe the best one. Is the perfect good bye for an excellent (but far from perfect...) album.Best tracks: the level of the album is very high... Only Entre Nous and Different Strings are not great songs. The rest are excellent pieces of music.Conclusion: Permanent Waves is not so progressive as Hemispheres, and not so high in quality as A Farewell to Kings... Is also maybe a bit under the quality of Moving Picgtures. But it is an excellent album anyway, with a use of keyboards and some song structures wich give a glimpse of what Rush would make through the 80's. This is a brilliant closing to a decade, and a transition to a new Rush's era. And of course, a worthy addition to any collection of good music.My rating: ****"
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Friday, October 3, 2008",
      "rating": 2,
      "text": "Another famous album by Rush and another problems for me!This time even bigger problems. The sound is uncompleted with some sharply changes in the tempo, some jazz fusion and new wave elements from the 80s and mixture of repetitions and lack of synchronous. The album is like prelude to something that never comes. The lack of ideas is tangible. It's hard for me to listen to the whole album at once.The first song - Spirit of the Radio - is very interesting song with three elements that followed one to other constantly, but developed poorly. The second song - Freewill - is weak enough to comment it. The third song - Jacob's Ladder - again roaming between the genres without reasonable inception of the action. This is the typical for the album. The fourth song - Entre Nous - full of meaningless solos and folk rock elements. The fifth song - Different Strings - a low quality ballad. The sixth song - Natural Science - another long and decent progressive song.An album without unexpected and fresh ideas only for the fans of the band. 2 stars"
    },
    {
      "reviewer": "progaardvark",
      "date": "Posted Monday, January 19, 2009",
      "rating": 5,
      "text": "Rush's 1980 release of Permanent Waves showed a shift in musical priorities for the group and can be considered the first transitional album into a more radio-friendly environment, but still retaining strong progressive rock elements. It also showed the continuing transition of making keyboards a more dominant instrument in the group's sound. This had been evolving steadily on their previous two releases, A Farewell to Kings (1977) and Hemispheres (1978).While this shift kept the group from composing 10+ minute-long epic (something I surely miss from the later Rush years of the 1980s and 1990s), it attracted a whole legion of fans with their radio hits The Spirit of Radio (appropriately titled!) and Freewill. Entre Nous was also a beautiful example of the effective blend of keyboards into this new, more compact style of Rush's music; a precursor of what would appear on several albums throughout the 1980s and into the early 1990s.Still, Rush continued to display their talents on the slightly longer songs, like the killer Jacob's Ladder and the amazing Natural Science. Production improved and Lee's vocals continued to mature. The end result is another five-star masterpiece. It may not have the epic-like qualities of prior albums, but it surely makes up for it with the improved production, skilled musicianship, and better vocal deliveries. Highly recommended."
    },
    {
      "reviewer": "horsewithteeth11",
      "date": "Posted Sunday, January 25, 2009",
      "rating": 5,
      "text": "A quantum leap forward, in time and in space...Another extremely powerful release from the trio from Canada during their classic period, Permanent Waves is most well known in the music world for The Spirit of Radio, Freewill, and Jacob's Ladder, all of which have become well-established Rush classics and often performed live. But if you only focus on those three tracks, then you're forgetting the other half of the album. Here marks a clear change away from Hemispheres and towards what would become Moving Pictures, often considered the pinnacle Rush album. However, this one is no slouch either. Absolute musical perfection right here as far as I'm concerned.My two favorite tracks on here are Jacob's Ladder and Natural Science. The first is one of them because of that great thundering, pompous, and driving bass and drum work, as well as the heaven-esque synths. Everything about that song just speaks of majesty to me. Natural Science has that beautiful sound and feeling of rushing water with Geddy's singing and the acoustic guitar evokes such a tender feeling from me that it sends chills down my spine whenever I hear it. This is of course before the racey guitars and whirling synths come in. To me, this is easily one of the best songs that Rush ever wrote, and very few songs can top it.I wish I could have made this review a bit longer, but it seems fine the way it is. If I had to rank my favorite Rush albums, this one would round out my top 5. I see no reason to not give this 5 stars. Catchy, yet highly progressive and an absolute masterpiece."
    },
    {
      "reviewer": "Conor Fynes",
      "date": "Posted Sunday, March 8, 2009",
      "rating": 5,
      "text": "'Permanent Waves' - Rush (9/10)'Permanent Waves' represents a new stage in the band's development. Musically, the prog was starting to be melded with a new, more commercial approach. It is through this move that Rush experienced it's most commercially acclaimed period. 'Hemispheres' was obviously going to be a hard effort to top, but Rush was able to put together a record that while not beating it's predecessor, harbours a quality and flavour of it's own.The record starts with one of Rush's most well-known and radio played pieces, 'The Spirit Of Radio.' The guitar work for the signature riff of this song is intense, and is very hard to play. There is prog to be had here, but unlike 'Hemispheres,' which was content to go on along with it's long song lengths and comparatively uncommercial approach, there's also an optimistic radio-friendly sound on here... An AOR sound that helped Rush to become as popular and influential as they are. While commercialism generally is frowned upon (especially by prog audiences) there's no fault here, and it's done in such a way where it only makes the music more listenable.'Permanent Waves' is an easier album to simply sit down and enjoy, as opposed to '2112' or 'Hemispheres,' which needs a bit of audience participation and attention to really appreciate. It's music that can be played while driving, or while working out. There's good energy here (for the most part, songs like 'Different Strings' convey a more balladesque style.) The 'epic' 'Natural Science' unfortunately is probably the weakest epic Rush ever composed. Taken into consideration though is the fact that the song was written and arranged in a relatively short time (less than a week.) The production and sound effects on the song are very cool, such as the vocal effects towards the middle of the song. 'Natural Science' also has a strange evocation of progressive metal, despite the fact that the genre itself didn't come into major play until ten years later. The 'intense' part of the song sounds like a very fitting precursor to Dream Theater. If you listen to it, you'll know what I mean.'Permanent Waves' is worthy of five stars, but not an essential masterpiece of progressive music. Despite some very great songs, it has a comparatively less-strong middle section. A great prequel to the band's masterpiece however, 'Moving Pictures.' This album comes highly recommended, even if it's not as highly recommended as the masterworks."
    },
    {
      "reviewer": "The Sleepwalker",
      "date": "Posted Tuesday, May 26, 2009",
      "rating": 5,
      "text": "Permanent Waves is a huge leap forward from Rush's previous album, Hemispheres. In my opinion, this is Rush's masterpiece. It's really easy to hear the progress in the sound of different Rush albums. The synthesizer has a much bigger role than ever before, and its role will be even bigger on following albums. Musically this album is incredible. Alex throws some crunchy riffs and as a bassist myself it's undeniable that Geddy Lee's incredible bass playing is a very important factor for Rush's distinctive sound.The album kicks off with a striking intro of \"The Spirit Of radio\". This song is quite radio friendly, but a stunning piece nevertheless. The song features some groovy riffs, making it a very catchy piece. Another radio friendly track follows. \"Freewill\" is among Rush's very best. It features some catchy riffs and great lyrics. Don't let its radio friendliness fool you though, as the song is very complicated. In this stage of their career Rush relies less on epic tracks and more on shorter pieces, unlike on previous albums. Permanent Waves features two epic tracks though. The first of them is \"Jacob's Ladder\", an astounding piece of music. The song starts with a march-like rythm with some vocals on top. The vocals are scarce in this song, as it relies mainly on incredible instrumentation. After some ominous and heavy riffs, the songs takes a softer direction, only to slowly build up to a wonderful climax.The next song, \"Entre Nous\" was oddly issued as a single. In my opinion songs like \"Freewill\" would be much better candidates for this. Nevertheless, \"Entre Nous\" is a very good song, though probably the least interesting of the album. Next is a ballad called \"Different Strings\". The song is very mezmerizing and peaceful sounding. There is a melancholic undertone though. A fading guitar solo takes the listener to the sound of streaming water. An ambient guitar comes in and the absolute epic of this album starts. \"Natural Science\" is most definitely the most epic piece on the album. The song takes the listener through various parts and themes. From a soaring acoustic guitar introduction the song moves to what might very well be Rush's heaviest thing so far. This middle section of the song has been incredible important for inspiring the sound of several future prog metal bands. The third part of the song is much less agressive than the middle section, and takes us to the sounds of streaming water again, just to close the album in a brilliant way.Every time I listen to this album it's a wonderful experience. This truly is the absolute highlight in Rush's career. This masterpiece deserves five stars, and absolutely nothing less!"
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Tuesday, September 15, 2009",
      "rating": 5,
      "text": "I consider this to be one of Rush's finest moments. While the album is admittedly short, even for vinyl standards, there is zero filler, as every second is infused with creativity and intelligence. Geddy Lee fires off some excellent bass parts throughout while sounding at his best vocally. Alex Lifeson mainly holds down the rhythm with some highly inventive riffs, yet does not at all disappoint when he takes off with a blazing solo. Neil Peart contributes with more \"in the pocket\" drumming on this album, as well as his ever-inspired lyrics. These lyrics are expertly penned, generally scientific and yet without coming across as pedantic.\"The Spirit of Radio\" One of Rush's radio hits, appropriately enough, this is a fantastic yet simple song. The music stays upbeat and the lyrics are brilliant. There's some difficult bass licks stuck inside this one, as well as a \"bristling\" guitar riff. More than anything, this is a fun way to kick off the album.\"Freewill\" One of my favorite Rush songs of all time, this piece has it all in a concise five-and-a-half minutes: A stellar main riff, intellectual lyrics, odd time signatures, a catchy chorus, a gritty bass solo that's all over the place, guitar shredding, and killer drumming. The words are some of the best and most thoughtful ever penned.\"Jacob's Ladder\" Steady bass, static keyboard, bright guitar, and a light marching snare over an 11/4 time signature make for an intriguing beginning. A synthesizer line, which sounds a bit like the main riff from \"Subdivisions,\" occurs halfway through, with Lee's voice recorded through some warbling effects. This is an extremely great example of restrained progressive rock music.\"Entre Nous\" One of the greatest overlooked gems in Rush's vast history, this one has a great opening riff and an equally great vocal melody. I love how the crunchy electric guitar during the verses is contrasted with the acoustic on the brilliant chorus. In addition, there's a basic synthesizer solo over more dynamic bass.\"Different Strings\" Yet another often unnoticed work of brilliance, this has soft guitar and a likewise gentle vocal performance. This (like \"Jacob's Ladder\" is a great example of how a virtuosic band institutes restraint.\"Natural Science\" I first heard this song live, and was floored when I did. It begins with watery sounds, simple acoustic guitar chords, and a galactic-sounding lead vocal. The lyrics are quite remarkable- some of the most meditatively scientific Peart has written. They compare a microcosmic world to the one in which we live. There are various sections to this lengthiest track, with different riffs that keep it fresh and invigorating. Lee's bass work during the excellent guitar solo implies a simplistic chord progression, but is incredibly vibrant. What an impressive way to end such a stellar album!"
    },
    {
      "reviewer": "snobb",
      "date": "Posted Friday, September 25, 2009",
      "rating": 4,
      "text": "First Rush classic album ( ok, to be more correct - \"Rush middle period classic album\"if you want).I perfectly understand , that Rush fans are often divided into three groups. Some of them prefer Rush earlier sound ( in fact, hard rock with some prog elements, but heavy in screaming vocal,guitars and rhythm). I like some of their works of that period as well, but don't think that Rush will be known for a years because of that time music.Another listeners ( generally young generation) like Rush sound starting from \"Signals\", where they were more synth-driven group with some \"new wave\"elements. No guitar sound anymore. I don't like it at all, but believe, that some their albums of that period are even better than faceless boring neo-prog of the same period.As for me ( and I believe, there are plenty of proggers thinking like that) Rush golden period is short time starting from possibly \"Hemispheres\" and finishing with \"Signals\" . Excellent mix of heavy rock, complex art-prog, guitar driven multitextured sound and bright melodies. Albums are usually very focused, consists of songs,which are not too long ( often atribute of prog, but without nothing inside,just burning your time), not too short, just as its should be. Best compositions (incl. some perfect instrumentals), highest musician's form.So, \"Permanent Waves\"is album from that period, and album is good. Near their peak and one of the best album from american progresive rock of all times - \"Moving Pictures\".OK, there are still some unfocused moments, some longevities without serious reason, but generally very good album."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Friday, December 4, 2009",
      "rating": 3,
      "text": "Permanent Waves was the turning point that would launch Rush nicely into the new decade. They shed most of the progressive tendencies that had defined the preceding albums and frankly, that was a good thing. Not because I don't likeFarewell To KingsorHemispheres, but because I think Rush would prove to be best at easy when writing in a more concise song format.It is a difficult album to rate. On one side, it is defining for Rush's career, it has some amazing songs of whichJacob's Ladderis the standout.On the other hand the album is a bit on the short side. When discarding the trite balladEntre Nous), I count 30 minutes. But also the other balladDifferent Stringsis hardly essential and reminds me of the filler tracks they had on 2112 and Farewell to Kings. The remainder of the tracks are very good but are featured abundantly on all live albums.On top of that the album sounds rather dry and lacks a bit of punch. And to give it a final blow here, the following albumMoving Pictureswould continue and perfect this style of Rush music. All those reason would point towards 3 stars.I guess it is justified to put it in between those two and your appreciation may largely rely on the moment when you picked it up. I picked it up in 1986 after I had heard all other albums from Rush's back catalogue and it didn't add much really.If you have followed a more chronological route, then this album will obviously be more defining and important. But I can't give 4 stars to a 35 minute album featuringEntre Nous."
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Monday, January 11, 2010",
      "rating": 3,
      "text": "Transition album lacking the best of both stylesPermanent Waves was the transition album from \"epic\" period Rush of long, winding monsters like Hemispheres to the rock masterpiece of Moving Pictures. It is one of their highest rated albums on the site but I'm in the minority of reviewers who find it a bit on the uneven side. The first two tracks are pointing towards what was coming in earnest on the next release though neither match the quality in songwriting. \"The Spirit of Radio\" became a huge concert favorite for the band and \"Freewill\" contains some unbelievable chops by all three that still amaze me. Then comes the highlight which is the dark and brooding \"Jacob's Ladder.\" I just love the snare rolls Peart peels off during the intro. Then Geddy delivers the dramatic, stormy lyrics over the ominous rhythm with some nice keys in the background. It swells into a huge opus with some jaw dropping leads by Lifeson.Like my friend John I have memories of this era Rush which come flooding back when hearing songs like this. Side two is where things drop off pretty substantially with the mediocre \"Entre Nous\" and \"Different Strings\". \"Entre\" is particularly weak with its tiring chorus, \"Strings\" is a decent piece with interesting downbeat mood but nothing exceptional. The short album closes with its longest track \"Natural Science\" which despite some interesting change-ups and the usual great playing, doesn't get to where \"Xanadu\" or \"La Villa\" took us. Permanent Waves is certainly not a bad album and any Rush fan will appreciate it, but for me it's simply a good album. Each of the next three albums have held up better, and are more interesting and meaningful to me over the decades."
    },
    {
      "reviewer": "progpositivity",
      "date": "Posted Thursday, May 6, 2010",
      "rating": 4,
      "text": "In a 1980's interview, Rush said that they no longer felt like they had \"anything left to prove\" after Hemispheres. They were now free to \"move on\" to create the \"best songs\" they possibly could. Not the most complicated songs. Not the most impressive solos. The \"best songs\".While \"best songs\" is certainly a very subjective standard, I must concede that on \"Permanent Waves\" the songs are catchier, the writing more concise, the musicianship impeccable, the production professional, and the album a huge success.Rush doesn't abandon Prog territory as much as they refine, condense and distill it into a more compelling, concentrated form of album rock music. Each album side ends in a prog climax (Side One's \"Jacob's Ladder\" and Side Two's 3-part closer \"Natural Science\").Again we get under 36 minutes of music on the album. But there is no filler! It is no secret that Rush liked to compose a softer song in the studio \"off the cuff\" so to speak. But even \"Different Strings\" attains a delicate immediacy from Lifeson's passionate ending guitar solo.A supurb prog rock album, even if it does mark the begining of a new, streamlined era for the band."
    },
    {
      "reviewer": "tarkus1980",
      "date": "Posted Tuesday, August 10, 2010",
      "rating": 4,
      "text": "There weren't many bands from the 70's that clearly improved with the beginning of the 80's as much as Rush did. This album isn't as different from their previous work as I used to think, but itfeelsdifferent, and that means a lot for me. Yes, it's still largely tied to prog rock (I mean, it is a full length album with six tracks), and it's bombastic in places, but this album isnotjuvenile. It's very geeky in places, yes, and overly simplified philosophically in others, but Rush finally feels to me like it's grown up (or at least advanced further in puberty). The band has taken its core sound and made it more accessible, but without coming within a hundred miles of \"selling out\" or anything like that. It's my understanding that critics of the day largely knocked them for not coming up with a truly original sound, and that has a point, but the band came up with a plenty enjoyable stew of influences, so I'm not terribly bothered by this brand of new-wave progressive pop rock. The songwriting dips noticably in the middle, but aside from that, this is a very nice album, and definitely the band's best yet.The first two tracks are two of the best known, and best, tracks the band ever did. \"The Spirit of Radio\" does a lot of things well, and much of what it does mines familiar territory (the awesome \"rolling\" guitar riff, a lot of cool processed guitar noise in Lifeson's sound in the middle), but there are some nice new twists. There's a goofy (but great) reggae-ish section near the end (which was used in a Burger King Kids Club commercial in the late 90's), a repeated neat sequence where the riff launches itself off of some simple keyboard lines, a melody that actually has an effective pop feel, and even lyrics that I find very good (if a bit labored in the typical Peart way). Plus, the song has a feeling ofjoyI've never really felt in a Rush song before; it's so nice to feel such a friendly vibe when Geddy sings, \"Begin the day with a friendly voice,\" and I can feel that the band really has a love for good music and those radio stations that play it. Yup, this here is a great song.\"Free Will\" is a classic too, dagnabbit. The lyrics are dumb, yes, and the chorus just sounds a bit too much (both lyrically and musically) like what I'd expect to be the climactic song in a Broadway musical about the life of Ayn Rand, but it's still a great song. The basslines are ridiculously entertaining, the vocal melody is fun, the mid-song jam sounds interesting every time I hear it, and yes, I even like the chorus, despite myself. For better or worse, this song has become one of Rush's calling cards through the years, and I know that, were I ever to go to a Rush concert and not hear it, I'd be very disappointed.Unfortunately, the album gets noticably weaker after the second best opening 1-2 punch in the band's catalogue. I used to consider \"Jacob's Ladder\" close to the best song on the album, but I'm much less thrilled with it than I used to be, even though I consider it quite good and overly maligned by many. The song is basically Rush's interpretation of a lightning storm, not from within the storm itself (if so, it would be a lot louder and faster and more spastic), but rather from a distance, watching the clouds gather and lightning flash far away. From that perspective I find it to be quite atmospheric, menacing and even powerful; it has a lot of tension in its leaden, mid-tempo jamming, and the lyrics only enhance the experience and never detract from it. It's kinda boring in terms of not going anywhere and in terms of how few ideas it has, but those ideas are basically done well enough.The second side, honestly, starts as a bit of a disappointment for me, with two pop ballads that might represent new stylistic ground for the band but don't suggest it was a good direction for them. \"Entre Nous\" only has a decent introduction and that interesting melody with the \"Just between us, I think it's time for us to recognize\" part; otherwise, I find the song quite bland. I've listened to \"Different Strings\" plenty of times, and except for a single line in the middle, I've found it continues not to make any lasting impression on me. I don't hate the track, but I don't really like it much either.I like the album closer, \"Natural Science,\" way more than I probably should, though. One should always have a slight suspicion when Rush makes 9 minute songs, but I think this one is just magnificent. The lyrics are sometimes hilariously dumb (\"A quantum leap forward in time and space!\"), but the music is great. The acoustic intro is beautiful, the middle third is memorable, catchy and complex at once, and the final third is grandiose without being annoying. What else could you possibly want from a Rush epic? I could listen to this twenty times in a row and not get as sick of it as I do from one listen to \"Cygnus X-1.\"I find this album weaker than I used to, but it's still great by Rush's standards. It goes without saying that any Rush fan should have this, and even people who don't like Rush should have this in their collections."
    },
    {
      "reviewer": "lazland",
      "date": "Posted Wednesday, December 15, 2010",
      "rating": 4,
      "text": "At about the time this album was released, my other favourite heavy /classic rock band, Rainbow, released the LP Down To Earth following the departure of Ronnie James Dio. The title was a deliberate attempt by Blackmore to signify to the world that sci fi & fantasy was now no longer needed, or, indeed, wanted. Songs, in future, would be rooted in the real world most mortals inhabited.Well, Permanent Waves is Rush's Down To Earth. This is the album where they ceased to amaze us with fantastical tales and myths, and, instead, got on with the serious business of moaning about the crap playlists on mainstream radio and other such important daily considerations. Consider the epic Natural Science, which closes proceedings. Just short of ten minutes long, it is a wonderfully tight, chirpy track which deals with the microscopic world and its science. Real life and real themes, all set within a wonderfully epic backdrop which easily holds together far better than the epic on Hemispheres, and yet is only half the length.A lot of people hated them for it. There are no tracks on this more than ten minutes long, but what they did was to pack as much action and adventure into the shorter songs than they did on much of what went before. The album even garnered a (shock, horror) hit single in Spirit Of Radio, still played on FM stations the world over and a classic Rush track.They did still, of course, stay true to their roots, and nowhere is this better exemplified by the cracking Jacob's Ladder, a track which would not have felt out of place on A Farewell To Kings. There is, though, a heavier reliance on Geddy Lee's synths, but the heavy riffs are pounding, and the live version on Exit Stage Left is, if anything, even more effective. They did, however, literally lyrically strip away the mystique and fantasy dragons on Different Strings, a lovely acoustic track featuring some marvellous piano work by Hugh Syme.With this stripped down album, we can, in hindsight, see the bridge between old Rush, and the sound that was perfected on Moving Pictures, and taken in a more \"modern\" direction with Signals and later albums.This was down as much to commercial pressures as much as Peart's wish to move outside of the band's mythical comfort zone. At the time, punk had done its work, and bands such as Motorhead, Saxon, and Whitesnake (to name a few) were belting out classic rock tracks which sold truckloads and captured the imagination of the buying and listening public. They did it with songs which lasted less than five minutes long.What Rush started to do with this album was to lay down the foundations of modern heavy prog with commercial nous. That they did so without selling out or losing their fanatically loyal fanbase was a testament to this great band's determination to face a new era positively, without fear, and retaining their credibility as serious artists.Four stars, but damned close to being a true masterpiece. That, of course, would be achieved with the follow up, Moving Pictures."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Tuesday, February 22, 2011",
      "rating": 4,
      "text": "Despite not having a show stopper song likeYYZorLa Vill Strangiato, this Rush album manages to be just as good as the other albums from their most progressive period.The first side of the album, or first half of the CD has some of their most popular songs. But listen to them, and you will notice a complexity that was rare in the other hard rock bands of their time. Odd time signatures, difficult instrument parts and some deep lyrics set Rush apart from their peers.Jacob's Ladderafter three decades is still one of my favorite Rush tunes.The second half of the album tones the music down a bit, withEntre NousandDifferent Strings. But both of these songs have a depth that make them compelling to me, as a prog fan. AndNatural ScienceCloses the album on a high and heavy note.Another must have album."
    },
    {
      "reviewer": "Horizons",
      "date": "Posted Saturday, October 22, 2011",
      "rating": 5,
      "text": "A pattern so grand and complex, Rush's sound finds a new voice with Permanent Waves,mixing strong, accessible songwriting with admirable instrumentation. Clocking in at 35:40 minutes, Permanent Waves embodies the concept of \"short and sweet\", and oh how sweet this album is.Opening with \"The Spirit of Radio\" the album starts with a classic. Peart describes the majesty of music and the role the radio had, both good and bad. Lifeson's guitar sounds just like the radio waves themselves - giving off a sense of fluidity and a penetrable sound. The drums are complementary yet lavish, and tasteful bass licks are the sprinkles on top.\"Freewill\" is another acclaimed song from Rush. The lyrics can be looked at from an obvious point-of-view. Talking about freewill and how everyone should have their own voice in society, but beneath the surface their meaning can be about atheism. The drums are in the pocket, letting the killer bass and guitar solo shine.Like the clouds depicted in the song \"Jacob's Ladder\" ,the song starts off with an ominous and pulsing build-up, and then explodes into one of Lifeson's best guitar solos and continues with some great rhythm work. Geddy supports the song with strong thumping of his bass and keys that are as soothing as a staring off into the night sky. One of Rush's best and unique pieces.\"Entre Nous\" is a beautifully penned song by Peart. Talking about the need for two lovers to flourish on their own, but written in a whimsical way. It's quite the catchy song and all three members are great here.Writen by Geddy Lee, \"Different Strings\" is the shortest song on Permanent Waves. I believe this song is talking about the differences between people shouldn't tear them apart, and how they should remain together. The guitar remains the key point of the song, while the drums are subtle and are playing some accents with Geddy's bass.Tying things to a close is the monster \"Natural Science\". Opening with the section \"Tide Pools\", streams of water and gulls echo. The acoustic guitar and quite vocals enter and arrange for the next section \"Hyperspace\". Just like the title says, the section of the song has strong momentum and feels like you are being dragged throughout a cosmic anomaly. The drums are really great here, along with the ethereal keys. The bass is aerial and flies around for the entire arrangement, blowing your mind. Ending the piece is \"Permanent Waves\". The vocals are great, and are accompanied by a killer guitar solo, classic Geddy bass and air-drum worthy work by Neil.Overall Permanent Waves is an astonishingly consistent and accomplished piece of art. Highly recommended for any new Rush fan and anyone who wants to have an album that has both prog and radio quality songs.5/5 Stars."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Sunday, November 6, 2011",
      "rating": 5,
      "text": "Having mastered the accepted conventions of prog rock on Farewell to Kings and the title track of 2112, and having taken them to excess on Hemispheres, Rush then set about changing the rules to suit their ever-evolving sound. Not a single song on Permanent Waves has a running time of more than ten minutes, but whilst Rush's revised sound is delivered in radio-friendly portions, the content of the songs themselves is as innovative and technically complex as ever.Musically speaking, this album sees the band sitting on the cusp between metal and hard rock, with hard rock winning out on most tracks but metal still creeping in here and there, usually when Alex Lifeson decides to get a little wild with his guitar (as on Jacob's Ladder). Neil Peart's drumming is, of course, whilst Geddy Lee breaks out some really excellent bass solos. Thematically, the band steer away from fantasy and allegory in favour of a more direct lyrical message - Freewill, for instance, is a song which proves that you don't have to be angry, accusatory, or downbeat to endorse atheism, whilst opening number The Spirit of Radio is a simple song about the love of music.But the real genius of the album is how all these ingredients, plus Rush's love of complex time signatures and so forth, is broiught together in perfectly formed little songs that are as catchy as hell, without sacrificing any of the complexity. Many other prog rock bands were trying to make their style more accessible at this time, but this was usually at the price of damping down the whole \"prog\" aspect of their music and leaning more towards a poppy, mainstream style. Rush were one of the few who accomplished a broadening of their appeal without compromising their musical vision, and Permanent Waves is the album they accomplished this on."
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Saturday, January 19, 2013",
      "rating": 4,
      "text": "Rush have a lot of fans outside of Canada who sing their praises and are highly regarded in the 'prog' community, but to your average Canadian they are just another rock band who gets played on the radio all the time. \"The Spirit Of Radio\" and \"Freewill\" are two songs which get played to death on Canadian radio (the country and dance stations are probably required by law to play these songs). Not only on the radio but you hear these songs at hockey games as well. You can't shake a stick in Canada without hitting some electric device playing one of those two songs. \"Closer To The Heart\" and \"Limelight\" are the only other songs that get as overplayed. (For what it's worth, you hear \"Subdivisions\" and \"Time Stand Still\" a lot too).The trio were starting to move away from both the extended song format as well as the more science-fiction oriented lyrics of previous albums. Their music was now more accessible and contained more contemporary influences. The record buying public responded by making Permanent Waves a huge chart success. It went to #4 in the US and #3 in the UK (#1 in Canada). Rush were now officially Canadian's Favourite Canadian Band, a title previously held by The Guess Who and later to be taken by The Tragically Hip. They are still using analog synths instead of the digital ones they will use in a few years. The proggy moments are still there but now there is more room made for shorter, more 'song' oriented tracks.\"The Spirit Of Radio\" was named after the slogan of the Toronto radio station CFNY. The lyrics mention the Concert Hall in Toronto. That section of lyrics is a parady of some of the lyrics from Simon & Garfunkel's \"The Sound Of Silence.\" Here you hear the beginning of the trio's New Wave and reggae influences, while the main riff shows their hard rock roots. I love Lifeson's guitar tones during this period. Nice piano at the end (if you blink your ears you will miss it). \"Freewill\" contains one of my favourite of Peart's lyrics: \"if you choose not to decide you still have made a choice.\" The best part of the song of course is the dual bass and guitar solos.\"Jacob's Ladder\" is the proggiest track up to this point; you can tell this is the same group that made Hemispheres (along with Geddy's vocals obviously). Love the subdued but effective keyboards. Always loved the build-up after the drumless section which features some of Peart's best playing on the album. \"Entre Nous\" is a more accessible and upbeat song that forshadows what Rush will sound like in the 1980s. Features a very simple but effective synth solo. \"Different Strings\" in places reminds me of another Canadian trio, Triumph. Another accessible song and my least favourite on the album. Always liked the blues-rock vibe they go into at the end; it fades out too quickly as Lifeson is just about to 'take off'.\"Natural Science\" is the best track and another proggy mofo. Nice use of natural(get it?) sounds. Features Lifeson's best playing on the album. Love that abrupt change into a harder rocking section after 2 mins...you never see it coming. Love the vocal effects but at one point there is some synth sounds that are annoying, especially on earbuds/headphones. They would only get bigger after this but also less 'proggy'. The two albums that bookend this one are my two fav Rush albums, but this is one I rarely play (mainly because I can hear the first two songs any time I turn on a radio). Overall this is a very good album but they have better albums. I'll give this a 3.5 and round it up to 4 stars."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Friday, June 6, 2014",
      "rating": 4,
      "text": "RUSH begins the new phase of their career with an in-yer-face advertisement in the form of \"Spirit Of Radio\" to begin their 7th studio album PERMANENT WAVES. This leading track not only signifies that they are now more radio friendly and ready to acquire a more diverse following in the process but also it incorporates all of the sounds that represent past, present (of the time) and future RUSH. Throughout their career they have always carried the hard rock torch on every album they put out but on this album they are the closest to a progressive metal sound with a heavy addition of synthesizers to add a thick layer of atmosphere. While they have not totally jettisoned their progressive songwriting prowess that reached its apex on the previous album \"Hemispheres,\" they have toned it down and packaged it into smaller digestible morsels that fit within the context of radio friendly hard rock. They also added newer 80s elements including hints of new wave and the inclusion of the offbeat and staccato reggae chords of Alex Lifeson.RUSH found enormous success with this album which honed all their talents and synchronized them giving music lovers something easily digestible and yet complex at the same time. A sound that would take them even further on the following release. The huge airplay that this received is one of the reasons I have neglected this album as I have heard songs like \"Spirit Of Radio\" and \"Freewill\" enough for a life time despite them both being excellent tracks. Despite the overplayed tracks this album has a few flaws that have always bugged me. One is that \"Jacob's Ladder\" has recycled parts of \"La Villa Strangiato\" that are just too obvious for my tastes. There are other less obvious borrowings from previous works as well. For whatever reason I just can't get into \"Entre Nous.\" I can come up with no reasonable explanation. It just creates a cognitive dissonance that I cannot reconcile. The real gem in my opinion is the final longer track \"Natural Science\" which like the leading track perfectly exemplifies the triumvirate of sound that RUSH featured on in the different stages of their career. The difference is that while \"Spirit Of Radio\" focused more on the newer sounds, \"Natural Science\" is kind of a respectful farewell to the old as not too many more tracks of this length would be included in their albums. An excellent but not outstanding album in my book."
    },
    {
      "reviewer": "Necrotica",
      "date": "Posted Tuesday, July 28, 2015",
      "rating": 5,
      "text": "January 1st, 1980 was a very important day for Rush. After a large string of commercial successes in the 70s, Rush returned to the studio to work on their first album of the 80s, Permanent Waves. Not having released an album during 1979, many people were wondering what the band's new record would sound like; was it going to follow in the hard-hitting progressive rock and long-winded epics of previous albums, or would it signal a rebirth for the band's sound? Released on New Year's Day, you'd expect this to be a completely new phase for the band, right? Well, Permanent Waves certainly sounds a bit different from its predecessors, but it has that noticeable Rush familiarity in terms of overall sound as well.To be honest though, a mix of the old and the new is a great method for a band like Rush; it's interesting to hear them integrate the sounds of the specific era while retaining their progressive rock approach. Points of interest include: Geddy Lee toning down his voice (like the near-absence of high Robert Plant-esque wails), more synthesizer use, and more accessible arrangements. The latter point is the most notable one, considering that new wave was very popular at this time and Rush were heavily influenced by UK rock band The Police around this point. However, Rush were one of the biggest influences on The Police's earlier material, so the influence essentially became the influenced; it's pretty ironic to say the least. Anyway, no song goes over the ten-minute mark, so while you may consider album closer \"Natural Science\" an epic at 9:17, it isn't separated into individual segments like the previous epics by the band.Instrumentally, the music is a bit more conventional this time around. Despite heavy synthesizer use and the introduction of more eclectic rock elements (even reggae rock!), the overall sound is more reserved this time around. \"The Spirit of Radio,\" \"Different Strings,\" and \"Entre Nous\" are all mostly in 4/4 time with only a few variations rhythmically; the former in particular is a very tightly structured hard rock tune that switches frequently between a slow swinging rhythm and the driving guitar riffing that occurs around the verses. Nonetheless, the song is still fantastic as it seems to be a perfect mix of emotion, accessibility, subtle technicality, and anything else it may tie together. \"Freewill,\" despite its popularity, seems to be the real odd man out on this album when you get down to it. The sound of the verses is slightly sparse, mixing a mildly heavy guitar riff (syncing with the bass) with light guitar chord \"bursts\" as the drums are keeping everything in place. The 7/8 rhythm is also a bit off-putting initially as well, but it grows on you, as with the rest of the song.So with all of these details, what's the big reason the record's so good? The consistency. Even in the two \"epics,\" \"Jacob's Ladder\" and \"Natural Science,\" there's not much musical baggage to bring the record down. Nearly every note feels where it should be; the band also know when to space out their dynamics, such as how the acoustic ballad \"Different Strings\" follows the energetic rocker \"Entre Nous.\" The album's running time is only about 35 minutes, but the record feels completely satisfying at that length when you consider the replay value of each track. While the album is safer than some other Rush albums as I said, there are plenty of \"wow\" moments to offset the conventional ones. For example, the solo break in \"Freewill\" has Geddy Lee showing off his impressive bass playing with some exceptionally tricky runs as Alex Lifeson is adding his own soloing to the fray and Neil Peart is performing complex nuanced drum patterns underneath. It's cool to hear the interplay between every member of the trio as they play so technically and fluidly at once. \"Natural Science\" is a song full of surprises; the soft acoustic opening is pretty unexpected as it is, but a surprisingly heavy riff comes in after the main motif ends. Suddenly everything sounds frantic and tense as the song starts frequently switching between time signatures and tempos. It's stuff like this that combines well with the more accessible moments of the record, and it's a great balance all around.So yeah, this record is an awesome follow-up to Hemispheres. It's not as technical or intense, but rather a nice mix of accessibility, technicality, dynamic variation, and consistency. The amount of control on display is actually very beneficial to this album and that's why it works. However, the band had yet to really reach their commercial peak... as Moving Pictures would definitely prove."
    },
    {
      "reviewer": "Modrigue",
      "date": "Posted Thursday, June 23, 2016",
      "rating": 4,
      "text": "A permanent shift towards the radio waves?Stuck between the great \"Hemispheres\" and \"Moving Pictures\", \"Permanent Waves\" is RUSH's transition album from ambitious epic suites to more accessible songs. Released January 1st, 1980, this seventh studio opus makes the junction between their 70's neo-heavy-prog style and the more radio-friendly and electronic compositions the Canadians will develop in the 80's. Musically speaking, the synthesizers' presence is growing in the band's universe, and the trio slightly starts to incorporate elements from other genres, such as reggae. Furthermore, the lyrics become more oriented towards human nature, society and technology than fantasy and science-fiction. So, has RUSH abruptly left the progressive sphere? Don't worry seventies fans, this a transitional record, so there are still hard/heavy prog rock/metal pieces with complex rhythms structures, uncommon time signatures and changing atmospheres.The hit single \"The Spirit Of Radio\" is powerful and evolving. Simply rocks! In the ending section, RUSH even made their first (slight) incursion in the reggae territory, a style that they will further explore in their next three albums. The hard catchy \"Freewill\" is also quite nice and contains cool spacey guitar soli. However, the highlight of the disc is undoubtedly the somber progressive \"Jacob's Ladder\". Referring a meteorological phenomena, this track features multiple time signatures, epic riffs, oppressive metal passages and a spacey interlude. Great!On the contrary, \"Entre Nous\" (\"Between Us\" in English) is a much more conventional rock. Average and not very original, this is the weak song of the record. \"Different Strings\" is a kind of soft and melancholic ballad, with cover art designer Hugh Syme performing a piano solo. Enjoyable. The disc concludes with the 9 minutes \"Natural Science\", the longest track. Beginning with river and forest sound effects, this hard/heavy prog metal piece has a few futuristic moments. The ending, named \"Permanent Waves\", is quite heroic. A pleasant but somehow uneven mini-epic.\"Permanent Waves\" is definitively a transitional album, as well as a short one. Despite songs not as remarkable as its predecessor's and its successor's, the quality and inspiration are nonetheless overall constant and the trio's hard/heavy prog rock/metal is still efficient. Even if more accessible, the music should please all fans of the late 70's period of RUSH. Once again, the multiple breaks and complex time signatures may have influenced an important number of progressive metal bands.That's why there is finally no reason not to give it a listen!"
    },
    {
      "reviewer": "patrickq",
      "date": "Posted Saturday, March 2, 2019",
      "rating": 2,
      "text": "I could almost call this review \"A Tale of Two Sides.\" Side A is vey good, whereas it's hard for me to reconcile the unfocused Side B as part of the same album.Permanent Wavesopens with \"The Spirit of Radio,\" five minutes of focused rock which richly deserves its status as an AOR classic. Another radio staple, \"Freewill,\" follows. Whereas the band would revisit and improve upon \"Freewill\" onMoving Picturesin the form of \"Limelight,\" there was no need to improve upon \"Spirit,\" and to their credit, they never recorded a \"Spirit of Radio part 2.\"The first side of the LP ends with \"Jacob's Ladder,\" which, despite some repetitiveness, accomplishes as much in seven and a half minutes as most of their \"epics\" do in nine or more - - epics including \"Natural Science\" here and \"The Camera Eye\" onMoving Pictures. The second section of \"Jacob's Ladder,\" which begins at its geometric center, opens with a synthesizer part reminding me (favorably) of \"The Remembering\" from Yes'sTales from Topographic Oceans, and at around five minutes, a rhythmic guitar part fades in which sounds Genesis-like, not all that different, say, from \"Eleventh Earl of Mar.\" By 1980, Rush's Led-Zep-fanboy days had been over for at least five years, and they were winding down a period in which their influences were still occasionally apparent. At some point, of course, Rush would establish a sound that would be much more influential than influenced.Side B begins with \"Entre Nous,\" a cringeworthy song even for Rush. Lyricist/drummer Neil Peart is occasionally saccharine, he really outdoes himself here on this plea for English- and French-speaking Canadians to sit down and try to understand each other because we're all brothers and life's too short and can't we be friends. OK, actually that's always been my interpretation; I don't actually have proof that this is the song's meaning. But the words are embarrassingly corny, and the music doesn't make up for them.While I think I can see what the band was trying to accomplish with \"Entre Nous,\" the last two tracks on the album are truly baffling to me. \"Different Strings\" occupies a place on the album suitable for a mellower song, or a softer or slower tune, and it delivers on these counts, but strikes me as uninspired - - it seems like the band had four minutes to fill but no creative raw materials to work with. Perversely, I would've preferred that they recycle higher-quality from elsewhere on the album - - as they appear to have done onSignalsby cloning \"Subdivisions\" to create the album-closing \"Countdown.\"Permanent Wavescloses with \"Natural Science,\" which a considerable number of people consider a classic work by the band. The first two of the three sections, \"Natural Science,\" to my ears, are as unfocused and uninspired as \"Different Strings\" was. I'll admit that things pick up a bit for the last section of \"Natural Science\" (entitled \"Permanent Waves\"). It's hard for me to tell whether these last two songs - - \"Different Strings\" and \"Natural Science\" - - represent poor composition or album padding, but either way, along with \"Entre Nous,\" they make up one of the weakest album sides on any Rush album.Whatever the case, twelve months after finishingPermanent Waves, Rush would enter the same Qu�bec studio with the same producer, and would create the greatMoving Picturesalbum.As is the case with nearly every Rush album, the production and the performances onPermanent Wavesrange from very good to excellent. But while the half of the material is strong, the other half is tough to sit through. At three songs and 18 minutes, Side A would've been a four-star EP. Consider getting their 1981 live albumExit...Stage Left, which has all of the songs from the first side ofPermanent Waves, and, perhaps tellingly, none from the second.(P.S.: I wonder if now, forty years later, the guys in Rush cringe a little at the cover of this album. Duh, they have every right to have whatever image they want on the cover, and yeah, it's not pornographic at all - - I get it. But I wonder.)"
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Monday, December 16, 2019",
      "rating": 3,
      "text": "Never a band that attracted my attention, I've long resisted listening to any of their post-All The World's A Stage albums just cuz I felt that I had \"outgrown\" their music (as I had Sabbath, Led Zepp, Heep, B�C, and all the heavier proto-prog rock bands of the 1970s).1. \"The Spirit of Radio\" (4:56) tight, refreshing, radio friendly. The reggae section is weird--as is the solo section at the end. (8.75/10)2. \"Freewill\" (5:21) Nice instrumental passage in the fourth minute, otherwise, a forgettable song. (8.75/10)3. \"Jacob's Ladder\" (7:26) long, slowly developing introduction period before Geddy's singing joins in around 0:45. Thereafter, sounds like a song lifted by Spinal Tap for their 1985 mockumentary before switching to a little more disciplined version of a Led Zeppelin song for the instrumental passage in the second and third minutes. A sparse, slowed down passage in the fourth minute, which builds and eventually comes back to a protracted jam that ends with a return to Geddy's singing for the finish. Not bad. (13/15)4. \"Entre Nous\" (4:37) a solid construct with little emotional impact until the instrumental section in the third and fourth minutes. (8.75/10)5. \"Different Strings\" (3:48) one guitar being picked while Geddy sings. This sounds like a template and precursor to many of the hair band hit ballads in the 1980s. Greatly engaging chords, palette, and construct. My favorite song on the album despite the bluesy lead guitar solo at the end (that, interestingly, gets faded out). (8.75/10)6. \"Natural Science\" (9:17) (/20) - i. Tide Pools (3.5/5) - ii. Hyperspace (4.25/5) - iii. Permanent Waves (8.25/10)Total Time 35:25All in all, an album of solid compositions, very solid performances, that definitely show the band's development and maturity as both instrumentalists and songwriters since their earlier days. But, in the end, this is not the kind of music that draws me in or even interests or impresses me. (I have, after all, heard lots of Yes, McLaughlin, Zappa, Area, PFM, Banco, and RTF. These guys are tight but nowhere near as impressive as the former. As we say, \"Nothing to write home about.\")B/four stars; an excellent contribution to prog world and a solid indicator of this trio's evolution into the icons that they've become."
    },
    {
      "reviewer": "Hector Enrique",
      "date": "Posted Saturday, November 21, 2020",
      "rating": 4,
      "text": "Permanent Waves is one more demonstration of the excellent state of form of Canadian virtuosos, incorporating some less harsh sounds and new wave touches to their progressive proposal. It is thus that the keyboards that Geddy Lee alternated with the bass, acquire greater weight and begin to look at Alex Lifeson's guitar riffs more closely, challenging part of their prominence. On the other hand, Neil Peart's percussion does keep the same old line, a master class on how to play the drums.The album unfolds with a lot of vitality, from Alex Lifeson's meandering guitars in the festive and captivating The Spirit of Radio, a brushstroke of reggae in between and crowned by the interaction of an audience that responds to the challenge, through the epic and hypnotic Jacob's Ladder that reminds us of a biblical passage from Genesis, up to the final and indisputable jewel of Permanent Waves, the magnificent and super progressive Natural Science, ideal for the instrumental display of the trio in the 3 sections that compose it in their most of 9 minutes, being this one of the last extensive pieces of Rush (the last one ended up being The Camera Eye of the mega-successful Moving Pictures).In between, the dynamic and more digestible Freewill and Entre Nous, and the delicate and at times inconsequential ballad Different Strings, perhaps the most debatable song on this great album. The duration of these three pieces would be the example of the new standard from now on, themes not so extensive and more direct, leaving little by little the intricate conceptual developments.Permanent Waves implied one more evolution in Rush's musical career, they extended their horizons into new territories, but without neglecting or betraying their essence. Excellent work starting in the eighties."
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Friday, October 1, 2021",
      "rating": 2,
      "text": "With this album Ruhs renew their sound, making it more concise and synthetic, and adding some synths and some more rhythms. In fact we are faced with conventional rock songs of which only two are long.1. The Spirit of Radio (4:56). First song that made the fortune of Rush for the rhythm, the stadium choirs and the reggae verses. It would seem an exercise in fusion but Rush have never managed to gradually, coherently and inventively blend acoustic pieces with electric ones, as well as different genres of music: also in this case the reggae verses are simply alternated with the rock ones, without a real fusion. The piece is still very pleasant and interesting. Rating 7,5/82. Freewill (5:21). Catchy rock song verse chorus. Rating 7,5.3. Jacob's Ladder (7:26). It is the long song of the first side, which has the rhythm of a march, but soon an acid electric guitar solo arrives (one of the best parts of the LP), then the song becomes very repetitive, until the interlude with the synths (to the delight of the prog audience without great pretensions), even this very repetitive, then arrive at a sung ending. Song not entirely successful. 6.5 / 7.Side B 4. Entre Nous (4:37). Conventional hard-rock song verse-chorus, quite catchy, solo left to synths (the only prog part of the piece). In fact, Rush are a hard-rock group who write quite commercial songs but with a very high technical and songwriting rate. Rating 7+.5. Different Strings (3:48). Acoustic beginning: and it's always nice to hear Lee's voice when he's not screaming. The song continues slowly, and then becomes an electric ballad that fades without a real chorus or a solo. Song not finished compositionally, a wasted opportunity. Rating 6+. The weakest piece of the Lp.6. Natural Science (9:17) - i. Tide Pools - ii. Hyperspace - iii. Permanent Waves It begins with noises of flowing water, very prolonged, then slowly it goes in electrical progression (the best part of the piece), then comes a syncopated, almost cybernetic piece. At about 3 minutes and 45 seconds the rhythm changes and the welcome guitar solo arrives. At about 5 minutes the third movement arrives, very rhythmic, but rather boring and with continuous exhausting stop and go. The piece does not take off, it remains very forced. Last 45 seconds of fade. Part not completely successful. Rating 7.Medium quality of the songs: around 7. Honest but even modest album. Two and a half stars."
    },
    {
      "reviewer": "Dapper~Blueberries",
      "date": "Posted Sunday, November 7, 2021",
      "rating": 4,
      "text": "Rush has got to be the smartest band in the 80s. While yes in the 70s to the 80s, their sound of course became a tad more synthy in a way, they still stayed true to their hard rock music, due to the fact that hard rock was big in the 80s, so why change it? I feel like this album perfectly encapsulates what hard rock was in the 80s and how Rush evolved with that decade.Permanent Waves starts off with the amazing first track, The Spirit of Radio. I'd say, other than Tom Sawyer and 2112, this is the perfect opening track for any Rush album. It's powerful, it's epic, and it's cool. It has all the right beats, riffs, and flow, plus it has a very cool music video. Afterwards, Freewill comes in, a great song to enjoy with your friends in a car while on a road trip. Speaking of which, this album is basically the perfect road trip jam. It's fun, it's groovy, and it is extremely enjoyable. The last song on the album, Natural Science, is a amazing ballad. It starts off slow and acoustic, and then it builds up speed instantly when the electrics and drums comes in. The more the song goes on the more powerful it is. It's an incredible song by the band.All in all, this album, like many others, is downright incredible, and proves this band can stand on it's own in the decade of the 80s without straying away from their roots too much. I love it."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Monday, August 5, 2024",
      "rating": 5,
      "text": "Review N� 804\"Permanent Waves\" is the seventh studio album of Rush and that was released in 1980. This album marks a distinct transition from the lengthy conceptual pieces of music, into a more accessible, radio friendly style and consequently, a significant expansion in the group's sales with hits like \"The Spirit Of Radio\" seeing considerable radio airplay. While there was short, complex and cerebral songs hadn't come close yet to fruition until the release of \"Permanent Waves\".\"Permanent Waves\" represents the third studio album of the band that belongs to their second musical phase. The other studio albums of that musical phase are their fifth studio album \"A Farewell To Kings\" released in 1977, their sixth studio album \"Hemispheres\" released in 1978 and their eighth studio album \"Moving Pictures\" released in 1981.The line up on \"Permanent Waves\" is Geddy Lee (lead vocals, bass guitar, Oberheim polyphonic, Mini Moog, Taurus pedal synthesizer and OB-1), Alex Lifeson (electric and acoustic six and twelve string guitars and Taurus pedals) and Neil Pearl (drums, timpani, timbales, orchestral bells, tubular bells, wind chimes, bell tree, triangle and crotales).\"Permanent Waves\" has six tracks. All lyrics were written by Neil Pearl, except \"Different Strings\" that was written by Lee and the all music was written by Geddy Lee and Alex Lifeson. The first track \"The Spirit Of Radio\" is lyrically a very curious song. It laments the commercialization of the music industry and the devaluation of the true artists. But very ironically, this critique of commercial radio was itself a commercial hit. However, though it's a song written for the radio it has so many time signatures and genre changes that makes of it a great song and in one of the band's most famous songs. The second track \"Freewill\" is another one of their most popular songs, but like its predecessor, is technically also great. Both songs have a very conventional structure. However, filled with great guitar playing, and an awesome bass line you can see that although these two songs, which were singles, Rush chose not to be lazy with them, and which is certainly the main reason why so many Rush progressive fans love these two songs. The third track \"Jacob's Ladder\" has something enigmatic on it. While the sound belongs to the Rush songs in the 80's, something here has the taste of the hidden and unique flavours of \"Xanadu\" or the finest musical moments of \"2112\". This is Rush making their best, and it became for me in one of their finest songs, mostly because of its hybrid sound. This is, without any doubt, a great song and is perfectly in the same line of their best tracks. The fourth track \"Entre Nous\" has also something special. It's a kind of a love song but in an original progressive shape. Even if the sound doesn't reach a musical level of excellence, it's good enough for mainstream dudes, especially because of the more familiar musical structure that it contains. It goes extremely well from times to times and it's very catchy, somehow. The fifth track \"Different Strings\" is also a song with something special like the previous song, despite being the weaker track on the album. Although, this means not that the track is a bad one. Simply, this is a very simple song that stays in a more old fashioned way of doing music, despite masterful drumming, which is always usual on any Rush's album. The sixth and last track \"Natural Science\" is divided into three parts \"Tide Pools\", \"Hyperspace\" and \"Permanent Waves\". This is the lengthiest and epic track on the album and is definitely the great highlight of \"Permanent Waves\". Not only the concept here noteworthy, but the music and the atmosphere created as so fitting of its title. Again, with this track the progressivity in Rush's music gets to the highest point, with an atmospheric future that starts like flowing and that grows bigger and bigger all over the track. This song represents one of their finest musical moments. It's truly a pity that this was one of Rush's last epic tracks. This particular track is one of the reasons why Rush is considered a progressive rock band, really.Conclusion: \"Permanent Waves\" worthy perfectly well to have five stars. However, it isn't at the same level of the best masterpieces of the progressive rock music like \"A Farewell To Kings\" and especially \"Hemispheres\" are. Despite some very great songs, it has a comparatively less strong middle section. So, it isn't the most cohesive or consistent of all Rush's musical works. There's an undeniable dissymmetry between the giant progressive rock tracks and the clean straight forward pop rock songs. Still, any lack of overall cohesion is overshadowed by the sheer quality of the songs in and of themselves. As \"A Farewell To Kings\" offered an onslaught of some new musical ideas that were then unified on \"Hemispheres\", \"Permanent Waves\" is a transitional album and the breeding ground for countless new musical ideas that will be perfected on their next studio album \"Moving Pictures\". Anyway \"Permanent Waves\" is a great album and one of the best musical efforts of Rush. My sincere wishes were that Rush returned to creating more epic tracks on their new studio albums like they made on this album and on those previous albums. It's a pleasure to hear and review albums like this. \"Permanent Waves\" should be in your progressive musical collection because it's an excellent album.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "A Crimson Mellotron",
      "date": "Posted Friday, January 24, 2025",
      "rating": 5,
      "text": "Rush entered the new decade with a more than brilliant release in the face of their expansive, epic work 'Permanent Waves', an album that marks a strong creative achievement along the greatest run of albums for the band. With just six tracks in rotation, Rush deliver a more concise but quite straightforward piece of work that tries to experiment with more radio-friendly arrangements and sounds, while necessarily preserving the progressive spirit, felt enormously on every single track on here. 'Permanent Waves' marks a shift in the way Rush albums sound, which might be attributed to the better production and the overall step up for the band in terms of writing and performing the material. A certain sense of maturity engulfs this album, which amazed with the taste for balance and control over the compositions.Already expanding the scope of their music on preceding albums and trying out various instruments and mainly synths and synth pedals, Rush do not shy away from trying our a variety of styles on 'Permanent Waves', exuding a sense of musical eloquence that perhaps was not so obvious on previous albums. The listener will see them trying out some radio-friendly arrangements on 'The Spirit of Radio' and 'Freewill', a format the band is familiar with as well as some very complex, unpredictable and epic compositions, occasionally much darker than the usual Rush tune, in the face of the two main highlights on here 'Jacob's Ladder' and 'Natural Science', both of which are just too good. The tasteful solos of Alex Lifeson, the upfront menacing bass picks of Lee and the all-over-the-place drumming of Neal Peart all make this album quite special, everything fits perfectly and works as an excellent LP with several moments of true progressive greatness. 'Different Strings' is another excellent entry, while 'Entre Nous' provides a nice counterbalance to the heavier, more menacing tones."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "albumffdb.html",
  "last_parsed": "2025-05-18T00:12:56.241485"
}