{
  "album_title": "SPACE SHANTY",
  "artist_name": "Khan",
  "artist_page_link_local": "artistd719.html?id=1172",
  "year": 1972,
  "rating_value": 4.29,
  "rating_count": null,
  "review_count": null,
  "genre": "Canterbury Scene",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/1172/cover_495862252016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "Space Shanty (including The Cobalt Sequence and March of the Sine Squadrons)",
      "duration": "8:59",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Stranded (including Effervescent Psycho Novelty No. 5)",
      "duration": "6:35",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Mixed Up Man of the Mountains",
      "duration": "7:14",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Driving to Amsterdam",
      "duration": "9:22",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Stargazers",
      "duration": "5:32",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Hollow Stone (including Escape of the Space Pirates)",
      "duration": "8:16",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Break the Chains (3:31) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Mixed Up Man of the Mountains (first version) (4:28) *",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "* Previously unreleased",
      "duration": null,
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "Sean Trane",
      "date": "Posted Wednesday, June 23, 2004",
      "rating": 4,
      "text": "Another one of those albums that is a prime example of one of the facets of Canterbury- style prog . Khan started much sooner than this release and came after Egg , Arzachel/Uriel (early Egg plus Hillage ) and was the first album after Hillage came back from university. They made one album and then he went on to GonG and the solo carreer we are all familiar with.As for the music , this is solid prog rock with slight jazz influences ( Canterbury , right?) with a very solid line-up . The vocals are parsimonious but present , leaving the music do the talking . Strictly from memory , one number is relatively weaker than the rest ( on an otherwise very even album ) , I think it is Mountains , but cannot be sure because my album is on loan."
    },
    {
      "reviewer": "loserboy",
      "date": "Posted Thursday, June 24, 2004",
      "rating": 5,
      "text": "Now here is an album you have to track down for sure ! KHAN's \"Space Shanty\" is a scrumptious album full of Steve HILLAGE's vintage psychy-blues guitar playing with perhaps Dave Stewart's best Hammond work ever ! Overall the music really covers the Canterbury prog psych genre with some wicked tones and instrumental interplay. \"Space Shanty\" is really 6 interrelated songs giving the listener a very conceptual feel throughout the album. Musically this guys hit dimensions of YES, DRUID, CARAVAN and even CAMEL. For those familiar with HILLAGE's ARZACHEL will simple drool over \"Space Shanty\" and in many ways takes ARZACHEL and pulls it out of the psych into the centerbury.. of course ARZACHEL is another classic as well.This is simply a must-have mind-blowing recording with some great expressionism."
    },
    {
      "reviewer": "greenback",
      "date": "Posted Tuesday, July 13, 2004",
      "rating": 4,
      "text": "Steve Hillage and Dave Stewart made this English/Dutch-styled remarkable album. The music corresponds to the progressive Canterbury style; you listen to it from the beginning to the end with a great satisfaction. Hillage is very structured on this record: he plays a coherent electric guitar that participates to the music, although he sometimes add some psychedelic & spacey guitar sounds, a bit like on his solo albums. Hillage sometimes uses acoustic guitars, which soothes the already mellow music. The tracks sound a bit like Hatfield & the North and Caravan, since the keyboards are quite similar: one can recognize the typical lagged wah-wah organ of the Canterbury style and some electric piano notes. Dave Stewart gives some effects to his basic keyboards, and I must admit the result is quite impressive. The lead & backing vocals are a STRONG point here: the male vocals are rather highly pitched, perfectly suited for the Canterbury style. I'm sure the album is not very well known, but it should!Rating: 4.5 stars"
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Monday, January 24, 2005",
      "rating": 5,
      "text": "Canterbury Progressive Rock album that you should not miss!What prog music would look like if Khan is still alive? That's really a very tough question to answer because as we know it later that the band is actually a \"one album\" band and short lived. The history of the band is centered around Steve Hillage (guitar player, vocals, and songwriter / composer), Canterbury alumnae who invited Nick Greenwood (bass, vocals co-writer of one song \"Mixed Up man of The Mountain\"), Pip Pyle (drums) and Dick Henningham (organ). Pip Pyle then decided to join GONG and was later replaced by Eric Peachey. Just before the band entered studio to record the first album (that it turned out to be the only one), organist Henningham left the band. Hillage summoned his old mate Dave Stewart and asked him to play on the album, which Stewart of course did on the spot. That's why there is a special note on the back cover of the LP that says: \"Our special thanks to DAVE STEWART who fitted in our sessions in between commitments with his bandEgg\". As a matter of fact we knew it later that Dave Stewart plays wonderful organ work in this album that has become his sound trademark. No one would argue with it if s/he listens to this record!The term \"Canterbury\" has made an automatic reference to a heavy jazz-influence music, while the music of KHAN was composed in the structure of rock music actually (my view). That's why I categorized KHAN music as Canterbury Progressive Rock. Sounds weird, doesn't it? But, look at its structure and compositions, you might agree with me. Historically, I knew the band in its early year of release, 1972, through two songs only \"Space Shanty\" and \"Mixed Up Man of The Mountain\". The songs were recorded at the leftover space of C60 cassette of Uriah Heep \"Demons and Wizards\". But at the time I knew nothing about jazz or Canterbury, therefore I associate KHAN music as typical hard rock music (in the vein of Heep, Purple, etc) with some flavors of improvisation. It's in the direction of bands likeHatfield and The North,National Health,Egg. Only couple years later, I knew the full album of the band from friend's LP. I was amazed by the wonderful composition and performance of the band through this debut album.Let's have a look at track level .Space Shanty(Hillage)The song starts with a music that sounds like an ending part of a song but it continues with a quieter passage when the vocal sings \"I need you and you need me .\" in a punctuated, low register notes style. It's a very classic rock style and memorable. The intertwining work of organ and guitar at approx min 1:27 (not exact, as I'm refering it through an LP) is really fantastic here - after the opening vocal line. The bassline is also wonderful. The music then enters a smooth transition that later brings the music into a faster tempo style demonstrating great organ solo augmented with stunning guitar solo and dynamic bass line. The drum helps accentuate the song especially in filling in the in between spots. It turns then to a beautiful guitar solo that serves as a transition to next style of organ work that later brings the music back to the original tagline melody. I observe the bass guitar has gone really crazy in this part as it sounds very dynamic in forming the solid composition. The vocal returns back to the music at the ending part - in quieter mood, augmented with soft organ, guitar fills and great bassline and drumming. I'm fully satisfied with this superb track!Stranded(Hillage)It opens with a simple acoustic guitar rhythm with a soft background of organ. The vocal line enters in a slow tempo style. Again, I observe an excellent bass guitar and powerful voice quality. At approx min 2:55 the music turns louder and quieter again to let the organ enters for a short solo. The bassline plays important role during transition and set the atmosphere for double guitar solo work followed with acoustic guitar solo. The vocal returns back to the music with the same opening melody. It's a nice mellow track, packed with an excellent music. It ends up with a transition piece in atmospheric mood to set the tone for next beautiful track.Mixed Up Man of The Mountain(Hillage, Greenwood)The opening nuances of this song is really fantastic: a repeated guitar fills with wonderful organ played softly and great singing. The music then enters in its full swing in medium tempo with an obvious dynamic bass guitar. At approx min 2:00 the music turns quieter that features voice line and soft organ and guitar work. At the end of singing, the music turns into faster tempo with improvisation works of bass, guitar, and organ. It's a wonderful interlude, I would say! This is the part where the influence of jazz is so obvious. The vocal choir is also excellent. The guitar solo during the ending passage is stunning!Driving to Amsterdam(Hillage)The opening part of this track is truly a Canterbury outfit with great organ work augmented with guitar fills. Sometimes the two instruments play together with the same notes. Fantastic opening! The vocal line then enters to the music and makes an excellent composition harmony. \"We look ahead for miles down our avenues of lights .\" is a very nice lyrical passage that brings me to a full enjoyment listening to this track. Again, guitar and organ harmony augmented with dynamic bass guitar has made an excellent music passage. Another lyrical passage that I used to emulate is \"Staring at the ground for I knew not what to do ..\" Uuughhh .. Mannnn ..!!! That's really wonderful passage that is very hard to forget. It's damn memorable! (especially if you also observe the soft organ work that plays at background).Stargazers(Hillage)It starts Canterbury style with a complex composition combining organ work, drumming, bass and guitar that turns quieter when the vocal sings \"Open your eyes if you dare ..\". Yes, I can sell a heavy influence of jazz music in this song, but its' not any typical kind of jazz you may encounter in the market. It's probably the kind like Egg, Hatfield and the North, National Health, etc. I like the music has a very strong punctuation in many segments of the album.Hollow Stone(Hillage)It a mellow track with a nice vocal line. Instead of jazz and rock influence, I can smell the influence of blues as well. This time the guitar and organ are played in a soft way but still maintain wonderful solos. It's a great track to conclude this masterpiece album.OVERALL: Highly Recommended!This is a true masterpiece of prog rock album that you should not miss. Oh by the way, I forget to mention that all songs in this album have a very nice and strong melody on top of tight musical composition and immaculate performance by the four members of the band. As I'm aware the standard CD version is currently out of print. If you are lucky, there is a replica version printed in Japan. The enhanced CD version is currently being released internationally. You may check your local store or internet shop. But seriously, this is a great album. After release of this album, the band tried to make an effort for the follow-up record but it failed to do so and ended up with a Steve Hillage solo album \"Fish Rising\".Keep on Progging!Progressively yours,GW - Indonesia."
    },
    {
      "reviewer": "Proghead",
      "date": "Posted Wednesday, May 4, 2005",
      "rating": 4,
      "text": "This is perhaps the one Canterbury album that's is most strictly progressive rock, without the fusion elements or the whimsical nature many of their brethren (HATFIELD & THE NORTH, CARAVAN). Certainly there are some jazz elements in some of the passages, but not fusion. Dave Stewart (not of the Eurythmics fame) had already been a member of EGG, and Steve HILLAGE was in an early version of that band when they were known as URIEL and ARZACHEL. This early lineup did record as ARZACHEL (with the famous contractual difficulties that forced the band to record under pseudonymns). HIKKAGE left and then came EGG as we know them with two albums under their belt. HILLAGE went to study at Kent University. EGG broke up by 1971 following the release of \"The Polite Force\", and came KHAN. HILLAGE intended to form the band with bassist Nick Greenwood (ex-CRAZY WORLD OF ARTHUR BROWN), drummer Eric Peachy and keyboardist Dick Henningham, but then Dave Stewart came around and Henningham was out of the picture, which established KHAN as we know them.\"Space Shanty\" was released in 1972 on Deram, which was the same label Egg was recording for. It was their only album. And even if you're not fond of bands like GONG or HATFIELD & THE NORTH, no problem here as the music is straight-up progressive rock, dominated by the organ of Dave Stewart and guitar of Steve HILLAGE. HILLAGE at this point had yet to develop his trademark lead guitar like you hear on the GONG albums (or his solo albums, of course), although there is a guitar solo on the title track that points to the style he would perfect with GONG. The album starts off with the title track, which goes through several changes. I especially like the guitar solo that I already mentioned. There are some jazzy passages as well, not of the HATFILD & THE NORTH or NATIONAL HEATH variety of fusion. \"Stranded\" features some use of electric piano, it's more or less a ballad, but then there's a heavy guitar and organ solo in the middle. It segues in to \"Effervescent Psychonovelty No. 5\" which is some bizarre messing about with Stewart's Wurlitzer electric piano, which then segues in the the next actual piece, \"Mixed Up Man of the Mountains\". This piece is quite '70s sounding, especially the vocals and organ. The band gets in to a jazzy passage in the middle. The rest of the album more or less is the same, you're not exactly sure what to expect. While the whole album is pretty much early '70s progressive rock, there is still that Canterbury element of fuzz organ (of the David Sinclair and Mike Ratledge variety), that Dave Stewart uses throughout the album, although there's some occasional use of the heavy fuzz organ that's more typical of a DEEP PURPLE or ATOMIC ROOSTER album. Plus he also uses the normal Hammond organ sound as well. Unlike HATFIELD & THE NORTH, he pretty much kept the electric piano to only one cut, letting his organ dominate the rest of the album.We all know what happened to KHAN after this: they broke up, HILLAGE teamed up briefly with Kevin Ayers, before joining GONG (then leaving by 1975 to pursue a solo career), and Dave Stewart forming HATFIELD & THE NORTH with two albums under their belt, a brief Egg reunion in 1974 (with the album \"The Polite Force\"), then playing on HILLAGE's own \"Fish Rising\", playing with Bill BRUFORD's band (no one could have ever imagined Bill BRUFORD being associated with the Canterbury scene when he was still a member of YES and then KING CRIMSON, but he did when he formed his own band that had Dave Stewart in it) and with NATIONAL HEATH (which BRUFORD was in briefly, before PIP PYLE stepped in).By the way, while the original version of \"Space Shanty\" was released on Deram in 1972, in 1978 it received an American release on the PVC label (which was related to Passport Records, some Passport titles ended up on PVC, like the later version of Anthony PHILLIPS' \"The Geese & the Ghost\"). This American version describes the history of the band on the back cover, and the front cover now said \"Featuring Steve HILLAGE and Dave Stewart\" (but still with the original artwork intact), which the original did not have. They did that to advertise who was in this band probably to sell a few copies to the American audience (since HILLAGE had by this point been an established solo artist, his album \"Green\" being his then-latest effort).Regardless how you feel of the Canterbury scene, this is the one Canterbury album I most highly recommend for the more traditionally prog-minded out there. And of course, those who are fans of GONG, EGG, and HATFIELD & THE NORTH, because of the musicians involved."
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Friday, July 8, 2005",
      "rating": 4,
      "text": "This re-release (2 bonustracks, running time 55 minutes) CD is originally an album from 1972 with 6 songs. It featured two 'Canterbury legends' named Steve Hillage (Gong) and Dave Stewart (Hatfield And The North and National Health) and both played together in the great bands Arzachel and Egg. The dynamic rhythm-section on this CD consists of Nick Greenwood (bass and vocals) and Eric Peachey (drums) but the focus is on mr. Hillage and Stweart, they are colouring the compositions with their distinctive play, loaded with breaks, soli and shifting moods. Steve Hillage his guitarplay alternates from lues and rock to spacey, from dreamy twanging guitar to moving soli and fiery and biting licks. Dave Stewart is a master on the Hammond organ along other keyboards, skyceleste and marimba. The vocals are good and the compositions are elaborated. EXCITING PROGROCK!!"
    },
    {
      "reviewer": "Trotsky",
      "date": "Posted Sunday, July 31, 2005",
      "rating": 4,
      "text": "Space Shanty was a one-off shot by a little-known group led by soon-to be Gong star Steve Hillage. This inspired work is almost certainly the rockiest and least jazzy album to emerge from the vibrant Canterbury scene, thus rendering it among the most accessible. Khan's lyrics and vocals may be passable at best, but there are some incredible exchanges from two Canterbury icons Hillage and keyboardist Dave Stewart (who also starred in Egg, Hatfield And The North and National Health) and that alone makes this record indispensible.Khan is not as typically quirky as the likes of Hatfield, no does it have quite the trippy vibes of Gong or indeed the Hillage masterpiece Fish Rising, but my goodness when our heroes get going, this is truly compelling stuff (I must say that the rhythm section of bassist Nick Greenwood, who also handles most lead vocals, and Eric Peachy aren't outstanding, but they are far from weak either).My favourite pieces are the free-flowing (and occassionally hard-rocking!) title track, Mixed Up Man Of The Mountains (which starts off with a great blues-rock riff before launching into a kick-ass exchange of solos between our two heroes, with some great basswork from Greenwood thrown in as well) and Driving To Amsterdam (which alternately rages and reflects) but they are all good. Stranded is a dreamier, laid-back electric piano dominated piece that curiously evokes an image of a ragged-sounding America, also features a rare acoustic guitar solo from Hillage. Hollow Stone Escape Of The Space Pirates is a charming Caravanesque psych epic that includes a mesmerizing multi-tracked solo from Hillage and Stargazer also has some dizzying moments.Even though it's a hard album to track down, I'm going to have to insist that you do. I seriously doubt you'll regret it. ... 84% on the MPV scale"
    },
    {
      "reviewer": "lor68",
      "date": "Posted Saturday, August 20, 2005",
      "rating": 4,
      "text": "The label Deram (remember the works of Caravan but also the early Camel in the period of \"The Snow Goose\"...) could deserve a major attention as for this Canterburian work, only by means of the modern compact discs, which make us re-discover another very interesting work like this, along with others...well the contribution of Dave Stewart (already mastermind of the ensemble called \"Egg\" and afterwards such a great composer with Bill Bruford and National Health), with the collaboration of Steve Hilage, at that time a rising star of such light experimental progressive, are important examples of the old 70's Canterburian style. Their remarkable approach can be appreciated in a few but remarkable epic numbers such as \"Stargazers\", \"Space shanty\" or \"Escape of the space pirets\".All the typical features, regarding the famous school that was developed afterwards by Hatfield and the North and Gong (without forgetting the ensemble of Soft Machine), are present here, especially the well structured and simple harmonic solutions at the guitar, except on the psychedelic elements...check it out anyway!!Update: March, 15 2010: re-mastered versionSuch a remarkable cult band, coming from the Canterburian scene, above all much \"remarkable\" and more clearly notable in the present re-issue: often in the vein of Hatfield and the North- as well as of the most experimental side concerning the versatile guitarist Steve Hillage (without regarding the interesting bassist Nick Greenwood-former Crazy World of A. Brown- and Dave stewart at his first turning point of his career as a keyboard player), this British line-up was important for the whole experimental scene in the UK...well not only for the long instrumental passages, but also regarding of the intelligent improvisation (do you remember the album \"Rotter's club\", by H.& the North?), Khan reached his peek of imagination and creativity as well, with \"Space Shanty\"...ok perhaps there are better albums within the Canterburian scene (witouth thinking of bands like Gong), but unlike these latter, here the features regarding the progressive rock style or the fusion rock music genre are much more present in comparison to their jazzy and psychedelic side...at the end the re-mastered version is well worth checking out at least for every prog listener and a must-have for all the Hillage's fans!"
    },
    {
      "reviewer": "BaldFriede",
      "date": "Posted Sunday, September 25, 2005",
      "rating": 4,
      "text": "This is one of the collaborations of Steve Hillage and Dave Stewart. There is something strange about this album: It really is not anything special, good melodious prog with lots of soloing from both Hillage and Stewart, supported by a very solid rhythm section, and yet...For some reason this album haunts me, and I return to it again and again. Is it the excellent interplay of Hillage and Stewart? Is it the huge variety of meters on the album (about every meter up to 13/8 is present on it)? It is an eerie quality I can't quite grasp. The rational half of my mind tells me I should give this album 3 stars, but it is too close to my heart for that. On the other hand the 5 stars my heart wants to give it would not be justified, as my brain tells me, so I will give it 4."
    },
    {
      "reviewer": "Certif1ed",
      "date": "Posted Wednesday, October 5, 2005",
      "rating": 4,
      "text": "Make the time investment and this one pays dividendsThe opening few minutes would have you believe that \"Space Shanty\" is, in fact, a Deep Purple tribute album: The opening crashing chord echoing, in a small way, the beginning of \"In Rock\" (U.K. Release), and the slightly cheesey riff that follows, topped off with cheesey lyrics makes you wonder if you're about to suffer a somewhat sub- par Purple outing.But there's something happening in the percussion dept; the drum licks twist and turn around the riff. Then, at 1:20 or so, we are told that we can \"Stop feeling confused\", as the vocal melody takes an unexpected turn, and the music steps down in what we can now recognise as a Hillage trademark - this motif appears later on Fish Rising, L and Green.Now the music enters into a more unique proggy atmosphere, and more Hillage trademarks ease themselves out of the background, the bass and keyboards winding around creating an organically developing sonic soundscape. Around 3:00, the bass presents a riff with some urgency, building up nicely into a development from some other world! A minute later, there is an unexpected twist and we enter some kind of bizarre fairground before soaring off into a sublime HIllage solo. The music snakes and twists through more moods than it should really be possible to twist through, showcasing Hillage's inventiveness to the max. When the vocals are reprised, however, it feels a bit of a let-down.I'm put in mind of Gentle Giant in the sheer inventiveness of it all, the \"soft\" harmonies and the consistently strong and tight musicianship. There are almost too many ideas in this track - anyone looking for simple, repetitive riffs will not find anything to latch on to and may feel somewhat lost.\"Stranded\" begins gently, and again, Hillage's style is stamped all over the music, and his vocals shine well, without being ambitious. Dave Stewarts keyboards are sublime, although I'd really like to hear more. Nick Greenwood's bass ambles around, keeping everything moving. Around 3:00, my prayers are kind of answered, with a complete change and all-too-brief keyboard solo, but it's the jazzy double guitar solo around 4:00 that really captivates... then Hillage picks up the acoustic... I wonder how this was carried off live.At 6:00, I am assuming that we are hearing \"Effervescent Psycho Novelty No. 5\" - a most sublime and spacey little afterthought to the piece.\"Mixed Up Man of the Mountains\" picks up from the sublime spacey feel, kicking into a rather basic riff - it is apparent that vocal sections are not really a strength of this band, although there's nothing desparately wrong with them, they're not particularly progressive as a rule. It's the instrumental textures and sonic soundscapes that really stand out here.Around 2:40 we get a great instrumental section - I am reminded of Camel quite strongly (a year or so before the release of the debut by the latter). However, Dave Stewart's style is very different to Bardens, and we soon move into more \"way out\" and experimental territory.The vocal harmony section at 4:30 is quite brilliant, and the guitar solo section that follows is amazing, not just for the solo, but also for the instrumental backing, and the impressive way that it is woven into a single complex texture. Around 6:20 we are treated to a really hard-rockin' driving section that I would have liked to have heard MUCH more of.The truly amazing thing about all of this is that, like Gentle Giant, it all feels improvised, but is quite clearly not just a jam. Real prog, ladies and gentlemen!There is so much happening in the music that I really don't want to spoil any more surprises. \"Driving to Amsterdam\" is more of the same, \"Stargazers\" has a phenomenal intro, and a wonderful jazz-flavoured instrumental section, and \"Hollow Stone\" has the fantastic \"Escape of the Space Pilots\" burn-out.The main thing that drags this album down from masterpiece status is that despite the myriad ideas, the perfection in execution the masterful developments and wonderful sudden changes, somehow it ends up sounding rather samey, overall, as the exploration is within a fairly narrow musical field, and a single style is stamped all over the music.That is not necessarily a bad thing, as more of the same of this kind of stuff is exactly what I want from this album, and it is a masterpiece in itself. However, in the broader field of Prog Rock, it is not, as it does end up a little predictable (for prog!) - and the vocal sections, on the whole, let the whole thing down. Blemishes too big to go unnoticed, sadly.The instrumental sections are so good that it's worth sitting through the vocal sections for them, and lead me to recommend this album to ANYONE exploring progressive music - despite the fact that I can't bring myself to call it a masterpiece of the genre. A purchase that you will not regret.Prog Rating (Is it progressive): 9.5/10Rock Rating (Does it rock?): 9/10Creativity Rating (Are the artists pushing their style to the limits?): 7/10 (10/10 for Steve Hillage).Musicianship Rating (Do the artists execute the music well?): 8/10 (10/10 for Steve!)Enjoyment Rating (Do I like it?): 9/10Total : 42.5/50 = 85%. Technically 5 stars, but dragged down by the vocal sections."
    },
    {
      "reviewer": "Tom Ozric",
      "date": "Posted Friday, September 8, 2006",
      "rating": 5,
      "text": "The time has come for me to submit my thoughts on this album. Personally I have a strong obsession with this album so I couldn't rate it less than 6 stars - heck, it is one of my top 10 prog albums I've ever heard, period !!! The mix is perfect ; awesome Bass playing from Nick Greenwood (whose rare solo album 'Cold Cuts' should be included on the Archives - superb, bluesy proto-prog with symphonic and psych touches - 5 star for sure), Eric Peachy's precise Drumming, Hillage's out-of-this-world spacey guitaring and my favourite, or let that be OUR favourite, keyboard player Dave Stewart, with his trademark Fuzz- Organ taking equal lead with Hillage's guitar. I can't add more to what has been already said about this album - Hillage is GOD, and anything with Stewart's buzz-saw organ rates highly for me. For those music lovers who go for super spacey guitar work and outrageous organ playing with a tight, busy rhythm section - this is THE ONE. Half Space- Rock and half Canterbury - I guess I could go on.....and on....."
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Saturday, October 28, 2006",
      "rating": 5,
      "text": "How great is this to hear Steve Hillage and Dave Stewart so early in their careers, before Steve's solo stuff and GONG, and Dave before he was with HATFIELD AND THE NORTH and NATIONAL HEALTH.This was Steve's project and he needed a keyboard player so he asked Dave who was in the band EGG at the time. Great to hear Nick Greenwood as well on bass and vocals. Nick's solo album \"Cold Cuts\" which would be recorded after this album is fantastic. \"Space Shanty\" is one of those albums that I keep coming back to. I love how it sounds. It's one of those very special records that I have in my collection. The vocals, guitar and organ are all just right.The first song \"Space Shanty\" is surprisingly heavy early, almost like a blend of HAWKWIND and BLACK SABBATH. That changes after a minute then keys and guitar follow as drums continue with bass. It picks up before 3 1/2 minutes in with some fuzz organ then again a minute later with aggressive guitar. Nice. It's psychedelic after 5 minutes then back to the earlier theme with keys and guitar after 6 1/2 minutes. Vocals are back after 8 minutes with acoustic guitar, then we get a big finish. What a song ! \"Stranded\" opens with keys and strummed guitar. It picks up before a minute with bass, distorted organ and drums.The vocals and piano melodies are a joy here. A feel good song if there ever was one. It picks up 3 minutes in with fuzz organ in tow. Tasteful guitar 4 minutes in as themes are repeated. A pastoral ending.\"Mixed Up Man Of The Mountains\" opens beautifully with gentle guitar melodies as reserved vocals come in.This reminds me of BLIND FAITH. It then kicks in with organ and guitar. A calm 2 minutes in before it kicks back in before 3 minutes in a jazzy way. Some great guitar after 5 minutes. \"Driving To Amsterdam\" is a jazzy tune with a good tempo until it settles 2 minutes in with vocals. Some ripping guitar after 3 minutes. Contrasts continue. I like the drumming and fuzz organ around 5 minutes. It turns jazzy again then the fuzz returns.Themes are repeated. \"Stargazers\" has this guitar / organ / drum melody early that sounds great. Vocals follow. Pulsating organ comes in.The tempo keeps shifting, some lazy guitar 2 minutes in then the organ returns. Fuzz before 4 1/2 minutes then it kicks in with some killer guitar. \"Hollow Stone\" is laid back to open as fragile vocals come in. It gets fuller as drums and organ join in. Fuzz organ after 3 1/2 minutes. It's heavier 6 minutes in as Steve comes in to light it up to then end.The singing on this record is terrific and fits the music very well, as a matter of fact I can't find anything that I don't like about this album. A classic !"
    },
    {
      "reviewer": "clarke2001",
      "date": "Posted Sunday, November 12, 2006",
      "rating": 5,
      "text": "There are several albums that I consider as a truly masterpieces of progressive rock and music in general. All of them are flawless, challenging, and you will discover something new every time you put it in your CD player. However, there are as many tastes as individuals themselves and every masterpiece is not for everyone. There is no point to convince someone that some symphonic progressive album is a masterpiece, if that person prefers, let's say, fusion, or progressive metal or something else. You have to be careful every time and to check even the albums of highest rank.However, KHAN's \"Space Shanty\" is maybe the only album that I could easily recommend to literally anyone. It's got the artistic value, the history value, the methodology value. It is undoubtedly a masterpiece and I can't imagine anyone disliking this one, with all the respect for the differences.The most difficult thing is to explain why it is so good. Well, I'm not sure how to explain, but there is no absolutely one single second of filler time on the record, all the songs are perfectly floating into into another (although this is not a concept album), and all the tracks are well-balanced instrument-wise, representing the perfect, homogenic blend of styles at the same time. Musicians are the top class, providing us enjoyable moments all the time without any unnecessary virtuoso extravaganza. Hillage's solos are unique and gorgeous, and again so unmistakeably his very own. Stewart gave us here the fines Hammond sound in rock history, with palette with chosen timbres which are fitting perfectly into the story. Incredible."
    },
    {
      "reviewer": "OpethGuitarist",
      "date": "Posted Sunday, December 10, 2006",
      "rating": 2,
      "text": "Psych-Canterbury with hard rock punch.This is a hard rocking bit from one album band Khan. I find it much closer to other hard rocking acts of the time than the rest from the Canterbury scene (Caravan in particular). The album goes through a variety of themes inter-weaved with one another throughout the entirety of the album.The vocals are well, terrible. The lyrics are poor (I could tell what the next line would be before it was \"sung\") and their's little variation in the voices which basically have maybe an octave range. Another key problem is how, despite that some of this can be very interesting, it appears that Hillage and Stewart are in competition at who can solo better than the other throughout almost all the songs, with no real concern for the basic premise of the song until a definite rhythm section can be found again. The rhythm sections are really quite good, but only last a short while before some less than inspiring vocals come in.Mixed Up Man of the Mountains is my favorite track here, but parts of it I can't stand, especially the \"doodle doodle doo doo\" section in the middle. The otherwise uplifting and powerful beginning is completely erased by the dismal vocal performance and a muddy background. It ends well though, and the \"racing\" keyboard finally fits well somewhere with by far the best vocal performance \"Don't you know I can fly\"; the only powerful and moving piece I found in the album.I think this could very well be a much better \"project\". The rhythm sections and melodies are quite intriguing, but the musical masturbation (soloing leading to nowhere) just screams why? Find an intriguing voice, and key in on the powerful rhythm sections, and I could find myself listening to this quite often."
    },
    {
      "reviewer": "hdfisch",
      "date": "Posted Wednesday, December 13, 2006",
      "rating": 5,
      "text": "I've to admit I wasn't aware of this wonderful album before one or two years ago but I just can confirm what other reviewers wrote already about it. This one and only release by short-living formation Khan featuring Steve Hillage and Dave Stewart had been one of the most pleasant but as well very sophisticated records in the Canterbury style. The six tracks on here are offering a highly versatile and interesting style mix between jazz and hard progressive rock with some classical leanings and a very slight space touch mainly due to Hillage's echoed guitar solos. There are plenty sudden rhythm breaks and frequent shifts from mellow to hard rocking sections. Dave Stewart presented here one of his most energetic and powerful organ work, especially in his solos. What else can I say that hadn't been told yet elsewhere? Actually it's hard to name any highlights since all tracks are equally excellent and I don't see any reason for not giving a full-score rating for this work. I think this unique gem fully deserves to be called a masterpiece of progressive music!!"
    },
    {
      "reviewer": "Atavachron",
      "date": "Posted Monday, September 3, 2007",
      "rating": 4,
      "text": "Khan was a remarkable coming together of talent that topped-off a period in English rock never to be recaptured again, a pinnacle of Canterbury sounds, tough Sabbatic hard rock, and fugue organ flash-- no surprise with Dave Stewart and Steve Hillage working together, supported by the more than capable rhythm section of Nick Greenwood and Eric Peachey.The band was an offspring of the Stewart-Hillage relationship going back to Uriel in 1968 (an outfit that mainly played Cream, Nice, and Hendrix covers) which re-emerged as Egg in '69 and the short-lived Arzachel that same year. In Khan we hear one of a handfull of keystone groups that filled-in the gaps in Prog's evolutionary history, taking from psychedelic blues but adding a more musically educated sensibility. Though a winning combination, these elements would soon disappear from popular music and 'Space Shanty' remains an axial link in the bubbling but doomed progressive/psych milieu. Hillage had formed the original band in 1971 with bassist Greenwood, keyboardist Dick Henningham (both with Arthur Brown), and Pip Pyle drumming. But it was the second line up - a product of the small and incestuous art scene - of Greenwood and Peachey with Dave Stewart's helping hands (while still with Egg) that birthed this album. The set is a complete spectrum of British rock, Canterbury, psych, post-modern classical and hippie-dippy hints of patchouli, risen to the surface and affixed in time, a bit too late for its own good but compelling just the same. There may have been superior bands; Caravan, and Stewart's own Egg and National Health, but this session has a singular, unified quality and is less pretentious than others of its ilk. A graveyard vocal opens the 9-minute title but quickly becomes prog as we know it with winding organ-guitar harmonies, jazzy motifs and Stewart's circus tent play. 'Stranded' starts pastoral and drags a bit with whiney sentiment but picks up by the middle, building nicely, and 'Mixed Up Man of the Mountains' is a pretty reflection with Hillage's searing axe and an organ/guitar/voice scat. And nine minutes of 'Driving to Amsterdam' peaks this album out in classic English jazz-rock form. 'Stargazers' is angled and adventurous with a bit of theater and many tempo shifts, a great piece, and the soft and sundrenched 'Hollowstone' concludes. The Eclectic Discs reissue has two bonus tracks; the Caravan-esque 'Break the Chains' and a preliminary version of 'Mixed Up Man of the Mountains'. A vital if tiny amuse-bouche in the progressive first course, not to be missed."
    },
    {
      "reviewer": "Prog-jester",
      "date": "Posted Friday, September 7, 2007",
      "rating": 4,
      "text": "Amazingly great one-shot band, featuring talents of Steve Hillage and Dave Stewart. Imagine DEEP PURPLE or any other Heavy Prog 70s band going Canterbury! Intense musicianship, wonderful melodies, long and varied tracks showing band members’ outstanding level of maturity but without falling into pointless show-up. If you’re into Classic Prog and don’t care much for labels (Art, Symphonic, Canterbury etc), this is definitely a Must. This is simply one of those albums that make you believe all best Prog things had been played in 70s, and any contemporary Retro Prog band fails short to achieve the Classics’ knees. Almost flawless, and the only complaint is that it gets a bit samey to the end – it would sound better as a plate, when you can have a break turning it from one side to another ;) Highly recommended and not to be missed!!!"
    },
    {
      "reviewer": "UMUR",
      "date": "Posted Monday, December 3, 2007",
      "rating": 4,
      "text": "\"Space Shanty\" is the debut full-length studio album by UK progressive rock act Khan. The album was released through Deram Records in June 1972. Khan was a relatively short-lived band, and their only output was this debut album. Featuring some pretty prolific Canterbury scene musicians (among others Steve Hillage and Dave Stewart), \"Space Shanty\" is a sort of supergroup.Stylistically Khan play an interesting mix of hard rock, progressive rock, spiced-up with Canterbury jazz-rock/fusion influenced moments. It�s both an intriguing, clever, and pleasant sound that Khan produce, although the occasional hard rocking riffs and heavy drumming can at times point in another harder edged direction. When the album is most heavy I hear traces of early Judas Priest and Uriah Heep in there, but that�s just an element of Khan�s sound and as described above there are many other elements which make up the full sound of the album.Stewart�s pleasant and often jazzy organ playing and the tight and organic drumming and bass playing add a lot to the sound too, and of course the vocals by Hillage, which are quite powerful and well performed (at times sounding a lot like Rob \"The Metal God\" Halford, sans the high pitched screaming). So the musicianship is definitely one of the greatest assets of \"Space Shanty\".Another great asset is the warm, organic, and detailed sound production, and the intriguing songwriting should also be mentioned. It�s obvious these guys are both skilled musicians and clever songwriters, and although the music features elements from various known genres and music styles Khan manage to produce a pretty unique sounding progressive rock album. A 4 star (80%) rating is deserved."
    },
    {
      "reviewer": "SouthSideoftheSky",
      "date": "Posted Saturday, January 3, 2009",
      "rating": 4,
      "text": "Khan is listed under Canterbury Scene, but this seems to have been more due to geography and the members involved than with the actual music. The sound of Khan is often close to the Psychedelic/Space rock of Nektar, and sometimes it is close to some bands in Symphonic Prog and Heavy Prog. So this is not at all your typical Canterbury album and it is all the better for it (Canterbury is not my favoured sub-genre of Prog). However, there are many jazzy passages that often creep up in Canterbury music, but happily the Jazz influences are never allowed to dominate the music. The result is a very interesting and quite unique piece of music.The guitars and keyboards are very well played and the vocals are surprisingly strong. Indeed, the vocals are very different from what we would expect from a Canterbury band. And the music rocks harder than any other Canterbury band I have heard. The lyrics are quite \"spacy\" and bit \"trippy\" at times but there is thankfully no silly attempt at being humorous.As far as I am concerned this is the best album Steve Hillage has ever made and also the best of the whole Canterbury sub-genre.Recommended!"
    },
    {
      "reviewer": "CCVP",
      "date": "Posted Wednesday, March 25, 2009",
      "rating": 5,
      "text": "One of the best albums from Canterbury, if not the bestKhan is yet another case of aone album bandin progressive rock that made an incredible album and then disappeared, what is always disappointment, since good music is never enough.The main thing that made this album click in me was the strange dialectic with King crimson that this album has: its music is considerably alike the In the Court of the Crimson King album from King Crimson / it has the same mood, but yet it does not sound like King Crimson. I know, i know, but it is pretty hard for me to explain also, so let's just move along. . .Their music can be described, very shortly, as a blend between hard rock, space rock, psychedelia and jazz. The guitars are the most prominent instrument here, being responsible for most of the solos through the album. The organ is, however, pretty important because it is used as the second voice or secondary soloist instrument. The bass and the drums, although doing an excellent job, only have a background spot here in Space Shanty. One very interesting thing about this albums is that, by having two competent vocalists, the band have a great versatile vocal department.The songs, despite being quite complex, have the traditional rock structure oftheme - chorus - themeused in may different ways, since they have a significant number of different musical themes throughout each song.Another thing that deserves to be mentioned are the lyrics. Although english is not my first language, it is not hard for me to appreciate the lyrics of Space Shanty, which fit quite well with the band's music in general. The vocals also help the lyrics considerably, since each vocal sings the lyrics that, in my opinion, fit better for it.Grade and Final ThoughtsSpace Shanty is definitely a memorable album for me. It was my first Canterbury album and it one of the best albums I have ever listened in my life. All songs are great, just like the instrumentation and the vocalization. Besides that, Khan managed to avoid a big part of theCanterbury clich�s, making this album quite different from the others from this genre.A great album such as this one deserves a great grade, so 5 stars."
    },
    {
      "reviewer": "tszirmay",
      "date": "Posted Sunday, September 6, 2009",
      "rating": 5,
      "text": "Have I been waiting to review this incredible testament to very early 70s prog and admitedly one of its crown jewels! It remains one of the highest rated prog albums ever, peculiar only in that this band had only one album and what a recording it was! Khan captures two immense talents at the burgeoning of their erudite careers in Steve Hillage (part of the great \"Steve from the UK\" bloc along with Hackett and Howe) and the irascible organist Dave Stewart, back in 1972 when the grass was very green and some girls embarked on their path towards becoming future porn-queens. The title track \"Space Shanty\" has both gents ripping through their instruments in their so very original style, Steve letting his axe fly into the darkest depths of space, echoing manically with Stewart's whimsically fuzzy organ runs. Bassist Mick Greenwood keeps the pot boiling (no pun intended!) and the drums shuffle intensely along for the cosmic ride. This is the nascent birth of space-prog along with Gong and Hawkwind, a testimonial to the future yearning of creative musical geniuses that sprouted everywhere. There is an obvious Canterbury connection in the spirited jazzy excursions (especially when vocals are called to perform) and the breezy organ fills that litter the recording. The gentler, more ambient \"Stranded\" intervenes with Stewart's rolling organ sweeping masterfully and aided by some sparkling piano, giving Hillage a platform to sing in his usual �ber-hippy style. The piece includes the humorously sub-titled inclusion \"Effervescent Psycho Novelty No.5\" (something I wish I wrote!) , a guitar flexout where Stevie lets fly on both stereo channels, always at odds with the crystalline piano sprinklings. Psychedelic music at it's definitely most pristine. The bluesy guitar rant on \"Mixed Up Man?\" is as intense and fiery as Hillage can be, a cosmic blizzard that starts off nice and soft, suddenly exploding like a supernova when the main lead riff enters the space, in complete agreement with Mick Greenwood taking over the mike. The mid-part scat voice/guitar duet is grand, the organ raging comfortably intricate and sparked by some cool bass runs. The sheer depth and power of the outro/finale is spellbinding! A great track! \"Driving to Amsterdam\" seems to be a fan favorite (if one judges by a recent PA poll), purely typical Canterbury escapade, a ripping opportunity to create incredible soundscapes where both slippery electric guitar and whomping keys duel intensely. Not even the slightest discredit to Alan Holdsworth or Phil Miller, but Soft Machine and/or National Health with Hillage's scintillating guitar would have been sooooo kick-ass! Here his series of two-channel solos is a true classic, hard , brief and deadly each time. Once again Stewart keeps hard on the fretboard magician's heels, splashing intrinsically glorious passages with shimmering ivory runs. \"Stargazers\" is a highly hippy affair where love, peace and space vie for attention, all liberally flavored with tongue in cheek humor, the super-cool guitar illuminating the prog fire (Steve was blisteringly fast, incredible fluid and a complete sonic star trekker) with a plethora of dizzying notes. Yes, it's quite dated in terms of sound but the creativity, the bold ambition and the sublime musicianship combine to make this a thoroughly exhilarating audio exercise. The closer \"Hollow Stone\" includes the \"Escape of the Space Pilots\" (perhaps inspiring Robert Calvert of Hawkwind fame), bids farewell forever with an outrageous intergalactic voyage that hypnotizes in silken mists, a long organ tirade that is a true classic and explains the universal high esteem Stewart is held on this site and many others, as a consummate (Hall of Fame) keyboardist. The somber guitar riffing weaves through cordons of electro effects, searching, grasping, enraged and outr�, a collapsing sea of sounds kills this one off brilliantly. Shape of things to come. Very good things! 5 Mongols"
    },
    {
      "reviewer": "Negoba",
      "date": "Posted Tuesday, September 15, 2009",
      "rating": 5,
      "text": "Simply My Favorite Canterbury AlbumThe Canterbury scene was famous for the various mixing and matching that happened between top artists. Keyboard / organist Dave Stewart and Guitarist / Vocalist Steve Hillage were among those rolling stones with major roles in several of the main bands of the genre. In fact, they played together in several different groups, and their comfort with each other was instrumental in several great records. But the peak of their interaction, to my ear, is Khan's Space Shanty. Both musicians had achieved master-level skills but were still developing their artistry. Clearly still excited and hungry, they were far from the rawness of their early work in Arzachel / Uriel. Space Shanty really is a nearly equal balance between the two, where several of their other works are dominated by one or the other.While the album first comes off as a very good bluesy space jam, closer listening reveals just how intricately composed many of the pieces are. Intertwining lines, call and response, multiple time signatures, all appear in a deceptively complex music. Many of the instrumental passages remind me of the Allman Brothers in tonality, with the organ / lead guitar combo often in unison or complimentary lines. Yet there is so much more going on here. Some sections are classic symphonic prog, some space jam (some of the best ever, I might add), a little blues rock. Despite spanning across the entire prog genre, the sound is remarkably focused and consistent.Steve Hillage's vocals aren't beautiful, but they are as good as many hard rock singers, and the vocal interactions with bassist Nick Greenwood are sometimes heavenly. His guitar work is simultaneously free and precise, exploratory and skilled. From bluesy psychedelia to crazy space noises, Hillage's sound changed quite a bit over the course of his career. But on Space Shanty all of these elements are present in tasty helpings. Virtually nothing is over the top here. For an artist whose later signature was wild exploration, this is the album where his superb musicianship (which brought Daevid Allen a little nearer to earth in Gong) really gets to shine.Dave Stewart's effected organ was a staple on many Canterbury records, and his work here is beautiful. Fans of Hatfield and National Health will certainly recognize the tones he uses. But never has he had such a perfect foil. The organ sounds blend so well with the guitar. Stewart's moves from background layering to lead solos are so seamless. His skills are quite strong, but his musicianship is so far ahead of some of the other prog showoffs both historical and current. His ability to compliment a song brings this music from good to phenomenal.If you like Deep Purple, Allman Brothers, this album is going to appeal to you even if you've never listened to a prog album in your life. If you love Gentle Giant, RPI, or Jazz Fusion, you're going to find plenty to admire here too. I liked this album the first time I heard it, but it just keeps getting better on multiple listens. It combines so many things so well?.If you can get this album, buy it, you won't regret having this in your collection. While not all will rate it masterpiece as I do, I think any rock fan, prog or not, can enjoy many many listens with this great album."
    },
    {
      "reviewer": "friso",
      "date": "Posted Wednesday, September 16, 2009",
      "rating": 5,
      "text": "I was in love with Khan's 'Space Shanty' before I even listened to it; I find the artwork to be utterly amazing. The music fully deserves it, because this album represents the best of Canterbury type jazzy space (hard)rock. A type of music that would also appeal to listeners of symphonic and eclectic prog. Stylistically the band is most close to the albums Camel would release in the following years, but played by totally different personalities. Furthermore the music was composed to be fully formed with bass, guitar and drums, whereas organ-player Dave Stewart (Arzachel, Egg, National Health) would perform as a guest musician. Stewart doesn't sound anything like s a second fiddle though, playing some of the best rhythmical chords patters and Canterbury solo's ever recorded. Due to the original trio line-up, there's plenty of space for the diverse bass-lines of Nick Greenwood, who would also do most of the lead vocals. Steve Hillage on electric guitar and harmony vocals had already been in an obscure acid/space rock band with Dave Stewart called 'Arzachel' in which his guitar talents are clearly there. Yet, on 'Space Shanty' he has evolved quite a bit with some fine jazz rock touches and a great pallet of clean and distorted sounds. He also added the rock that is so often missing in progressive rock. The drums of Eric Peachey are actually quite much like Camel's 'Andy Ward'; extremely tight, in a jazz'up rock style, well directed and in full sync with the band. Its beyond me how this amazing musician has never appeared on a record again. 'Space Shanty' might be my favorite example of what progressive rock is about; excitement, exploration, musicianship, spaciousness, melancholy, instrumental story-telling and wonder. The album just hasn't a single moment that is anything less than brilliant."
    },
    {
      "reviewer": "Seyo",
      "date": "Posted Friday, December 18, 2009",
      "rating": 5,
      "text": "Space Shanty must be one of the most unknown masterpieces of progressive rock music in general! Appeared in 1972 as a low profile effort of the one-shot group KHAN of the burgeoning Canterbury scene, it showcased enormous talents of the two main composers and instrumentalists - Steve Hillage and Dave Stewart. It marks a transition in Hillage's career between his early ARZACHEL/URIEL days and his most successful and popular works with GONG and solo albums to come. And what a transition it was...The music is a breathtaking fusion of different elements common to the prog era: lenghty instrumental passages, beautiful solo parts of organ and guitar, multi-structured compositions, emotional singing by Hillage, changes of tempo and jazz-rock experimental ambitions. Symphonic prog dramatics meets jazz fusion improvisation meets space rock atmosphere as suggested in the title and the cover image. Tracks flow nicely into one another, without any sense of pretentiousness, mere technicality or empty experimentalism that were quite often then among many prog-inclined bands.Simply put, Space Shanty does not contain a second of excessive material or dubious fillers - it is a wonderfully composed music piece in its entirety, which you can listen to many many times and always hear something new. In short: a true masterpiece!PERSONAL RATING: 5/5P.A. RATING: 5/5"
    },
    {
      "reviewer": "The Quiet One",
      "date": "Posted Saturday, January 16, 2010",
      "rating": 5,
      "text": "It's Heavy, it's Symphonic, it's Quirky, it's Beautiful, it's KHAN!This relatively unknown supergroup with it's one and only album released in 1972(!!) is probably one of the finest albums ever made by a supergroup in terms of clear genius on the song-writing department with a complete eclecticism in terms of playing a wide array of various styles all in a Prog-fashioned way.To begin with oddities for the Canterbury fan, Khan opens up the album in a Atomic Rooster kind of way with a blasting organ/guitar riff and daring vocals. However don't let this fool you, the title track also goes through some wonderful symphonic-esque interludes with Dave's classical organ plus a completely spacey passage with Steve's guitar. As a whole, a very engaging introduction with the exception of the vocal duties that can put someone off, fortunately in the rest of the songs the vocal duties are by no means a flaw if not a special feature.Next song is Stranded which is quite the opposite to the title track, meaning that the heaviness barely shows and as a replacement to that(the heaviness) there's a completely peaceful mood played with lots of delicacy. While of course the instruments are responsbile of this beautiful tranquility, the main feature of this mood actually is Steve Hillage's lovely voice singing with a lot of care and gentleness, totally adore his voice in this tune.Mixed Up Man of the Mountains, on the other hand, brings back the rock-mood of the opener. But like Khan showed us on the opener, they're not used to staying in one style for too long, so expect a lot of variation in this song too. This time with greater effect, since the vocals are not a flaw and the instrumental passages are extremely memorable wtih Steve being the highlight with his rockin' guitar .Driving to Amsterdam, while it opens in a rather fast paced manner with intricating organ and guitar, later it completely cools down giving space to Steve to liberate his splendid vocals. However, Steve is not the main feature like he was in Stranded, if not Dave Stewart with his mind-blowing hammond organ that reminds me of Dave Sinclair. This song is the perfect mix of Stranded's beauty and Mixed Up Man of the Mountain's excellent variety and musicianship.Stargazers is next and it introduces itself in a very quirky way very alike Gentle Giant. However, the rest of the song barely has anything to do with that quirkiness of Gentle Giant. Steve Hillage delivers a magnificent guitar solo in the middle before the quirky intro reprises. The song finalises with a marvellous solo by Dave.The album concludes, unfortunately, with one forgettable tune, Hollow Stone. Indeed, it's a ''hollow'' song; it's 8 minutes long and yet there's barely anything that the musicians do other than playing the same thing over and over again, the only exception being when the solos arise. If it were only 4 minutes, I wouldn't consider it repetetive and boring.As a conclusion to my review, I'll just add that this is something that all fans of the classic 70's Prog should check this out since the music, while placed in the Canterbury sub-genre here, it has a lot to do with the classic 70's Prog music, yet it's totally unique played by one-of-a-kind musicians thus making an essential masterpiece."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Monday, March 8, 2010",
      "rating": 4,
      "text": "Pre-Gong Steve Hillage project 's ( with Dave Stewart and other great musicians) only album. And the great one!Being one of the greatest examples of early Canterbury sound, the music there is a bit different from what we all are expecting from classic Canterbury sound. Still based on heavy blues psychedelic sound, quite strongly structurized, but with some instrumental breaks and slightly jazzy. In fact, much more Uriah Heep, than Gong. But - melodic, excellently arranged, with great musicianship and vocals. For me, this album is classical sound of progressive rock of early 70-s!Later re-release contains two bonus tracks and good sound, so better go for it. Excellent entrance point for every newcomer to Canterbury sound: accessible, but complex, this album could be a bridge from hard rock or heavy prog to more jazzy/psychedelic sound.Overall, this album is must have one for each serious progressive rock fan."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Wednesday, May 12, 2010",
      "rating": 4,
      "text": "This album to my ears marks one of the high points in the Canterbury scene. Not only does it feature two of my favorite musicians of the genre, Steve Hillage and Dave Stewart (no, not that forgotten poseur from The Eurythmics, therealDave Stewart), but it also contains some of the most exciting music to come from said scene. Complex and powerful from start to finish,Space Shantycontains little of the lightness and airiness that often limits my enjoyment of other Canterbury artists and groups.Hillage is, as usual, an exemplary guitar wizard throughout the album, but Stewart, from song to song, steals the show. He plays each song with a fiery intensity that I've only heard in this consistancy on the Bruford albums.My copy, is the early nineties Deram release, which was in dire need of remastering. The sound is a bit muddy throughout, with the bass and drums often getting pushed too far into the background. But still, it's better sounding than the completely worn out LP I also own."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Sunday, August 1, 2010",
      "rating": 4,
      "text": "I've been interested in hearing this album for quite some time now but the opportunity just never seemed to arrive until I one day took a spontaneous trip to Kulturhuset's Library, here in central Stockholm, and started scrolling through their CD-collection. To my surprise their collection has expanded quite a bit since my last visit a few month ago and I manage to leave the library withSpace Shantyand a few other titles that I never expected to find there!The first time I glanced at the cover I recognized that this was one of those top rated prog albums but I really didn't know much about the lineup behind it even though this particular cover read specifically \"featuring Dave Stewart\" on its front. For some strange reason I initially confused Stewart for, a fellow Canterbury artist, Dave Sinclair but at least I almost nailed the origin of this album! This was of course not of much help considering the huge differences in the Canterbury Scene which features everything from the soft vocals of Richard Sinclair to psychedelic experiments by Daevid Allan!Listening to this album for the first time was somewhat of a surprise even though I really didn't know what to expect in the first place. The opening title track starts off almost like a Heavy Prog tune from that era, reminiscent of Captain Beyond, Quatermass and Atomic Rooster jamming with their gear tuned all the way to 11... all at once! This setting proved to be very temporary and soon the music shifted to groovy space jam lead by Hillage's guitar. Talking about turning 180 on the audience!Strandedis where things finally settle into a mellow atmosphere with spacy landscapes finally taking over the music thanks to Steve Hillage loose guitar play and underlying keyboard support from Dave Stewart. Things continue this way all the way until the first sounds ofDriving To Amsterdamwhere we finally get something resembling the more familiar soft Canterbury atmosphere coined by bands like Caravan and Soft Machine, but the explosive intro is once again misleading since the song that follows it is another pretty groovy and loose atmospheric jam. The section right after each chorus section reminds me a lot of Pink Floyd's songPigs, especially the part where Roger Waters uses tape effects on his vocals. My guess is that there has to be some similarity in the chord pattern that makes me think of this connection between the tunes.Stargazersis a surprising rhythmic shift to an upbeat performance, although even this one slows down on a few occasions just to remind us of how great Hillage can be with his guitar fills.Hollow Stoneis a nice conclusion to an otherwise already impressive album. This is probably the mellowest moment on the whole release with prominent sounds of acoustic guitar and keyboards that make this already moody tune even more special.There's really no use denying that supergroups can be quite exceptional if all the members actually make an effort instead of just playing prog-by-numbers that mosts of the later supergroup formations tend to achieve with their gatherings. Granted that Steve Hillage is responsible for writing most of this material on his own, the rest of the band really do their best to accompany him on this spacy journey and not once do I get the feeling that someone was underplaying their part. A great treasure of the early prog scene that should definitely be heard by all fans of progressive rock music!***** star songs: Stranded (6:36) Stargazers (5:34)**** star songs: Space Shanty (9:02) Driving To Amsterdam (9:23) Mixed Up Man Of The Mountains (7:14) Hollow Stone (8:20)"
    },
    {
      "reviewer": "Dobermensch",
      "date": "Posted Friday, September 10, 2010",
      "rating": 2,
      "text": "So called 'Supergroup' Khan's one and only release. Thank God, that's all I can say.From the opening lines \"I need you and you need me, also I need to be free!\" I knew I was heading into choppy waters on a ramshackle boat which was about to spring leaks all over the place.The phrase 'too many cooks spoil the broth' springs to mind. We've got Hillage, Hatfield, Egg and National Health all vying for supremacy and kicking lumps out of each other on this weak recording.I've liked all these individual bands, but as Khan they don't appear to know where or what they're doing or what they want - falling back on horrible Sabbath/Deep purple riffs every five minutes or so. As individual musicians they're competent - but this album is as rough as a badgers ass. The vocals are rotten too, sounding like the clich�d early 70's from which they emerged.Far too 'Rock' with little sense of adventure. A very disappointing album.Only the mighty 'Egg's' Dave Sinclair prevents this plumbing the depths."
    },
    {
      "reviewer": "Bonnek",
      "date": "Posted Tuesday, November 30, 2010",
      "rating": 3,
      "text": "Khan is a Canterbury supergroup of sorts, uniting past and future members of prominent bands like Egg, Gong, Hatfield & the North and National Health. The sound is exemplary for its style and age, with a warm woolly sound, melodious vocals, jazzy improvisations, spacey guitars and plenty of deliciously dusty Hammond organs.The opening title is a real winner, a surging 9 minutes of musical creativity and vigor, with catchy vocal lines and plenty of gorgeous improvisations. Heavier and less poppy then Caravan and a true masterpiece in the style. This opener puts me in a benevolent mood. Normally the poppy ballad style ofStrandedwould stir my usual skepticism, but the instrumental jam in the middle saves the party. As usual with Canterbury style Prog, the vocals can get a bit too poppy and mellow for my taste. Luckily Greenwood is a powerhouse, reminding me a bit of Hammill on the earliest VDGG releases.Mixed up Manis very different again, quite heavy and even anthemic in its opening and closing sections, but before you know, the capricious creativity of these guys make them veer off in another gorgeous smooth jazzy-psychedelic improvisation. More 70ties ballad influences onDriving To Amsterdam, the chorus with the \"Now the morning opens slowly\" line is tacky at least, and hard to bare for a Beatles/hippy skeptic like myself.Stargazerscontinues with delicious jazzy psych rock.Hollow Stonestarts hesitatingly but explodes in pure heavy space-rock orgasm.A more then excellent album with great heavy space-rock done in a delicate Canterbury jazzy style. If you also like the Beatles-inspired ballads on this album, this may be a perfect masterpiece for you. Recommended."
    },
    {
      "reviewer": "zravkapt",
      "date": "Posted Saturday, April 30, 2011",
      "rating": 3,
      "text": "Khan only released this album and is most notable for having a pre-Gong Steve Hillage and a post-Egg/Pre-Hatfield Dave Stewart on board. Generally, Space Sahnty is only slightly Canterbury sounding and more early 1970s hard rock sounding most of the time. Hillage and Stewart had of course already worked together in the band Arzachel previously. It's a good album but nothing special and is not representative of what the Canterbury Scene was.I don't like some of the cliche bone-headed hard rock vocals in the title track. Generally a good rocker but nothing here truly original or memorable. I like when Hillage and Stewart do their call-and-response thing on guitar and organ, respectively. Around 3 minutes switches to a jazzier and harder rocking part. Gets even more jazzy but not so rocking until the guitar solo. Later on some guitar noodling with a bit of wordless vocals. Jazzy and classical at once before it goes back to the the call-and-response part again. Ends with a nice mix of guitar, organ and bass. Vocals join in and it goes back to the beginning vocal section.\"Stranded\" is mostly a nice early '70s laid-back mellow rock song. Some nice piano playing from Stewart. Almost halfway gets more typically Canterbury sounding. I like Hillage's playing after 4 minutes, followed by some good acoustic guitar playing. Goes back to the main song. Some guitar and organ segues into... \"Mixed Up Man Of The Mountains\" which starts off as more early '70s rock. It mellows out later with some altered vocals. Hillage and bassist Nick Greenwood share vocal duties but I generally don't know who is who here. Later gets more jazzy with some guitar/organ interplay. I like the harmonized scat vocals after 4 minutes. Afterwards gets almost symphonic prog sounding before a riff takes the song back to hard rock territory. Goes back to the main song, getting more intense as it ends.\"Driving To Amsterdam\" starts off very Canterbury sounding. After 1 1/2 minutes changes to a ballad with great wah-organ. Turns into more of a blues-rocker at times. Love the drumming and organ playing in the middle. The band jams out for awhile, eventually going back to ballad mode. Gets slightly funky near the end. \"Stargazers\" starts off sounding very much like later Hatfield & The North for the first 30 seconds. Then it changes to more typical early '70s rock. Goes almost Floyd style before 2 minutes. Then back to Hatfield style. Then the main song again. More Floyd style with an organ solo. Almost classical rock towards the end.\"Hollow Stone\" is another ballad type song. Organ and guitar generally dominate. Some harmony vocals. Nice fuzz-organ solo. This song sounds like an influence on Judas Priest's ballads. Gets more rockin' yet still slow paced near the end. Finishes off in a cacaphonous way with tape speed altering. No single song stands out for me: I only enjoy parts of each song but not the whole thing. The most interesting and enjoyable aspects of the album are obviously Hillage and Stewart. I'm glad Khan never made another album, or else the world may have been robbed of albums like You and Rotter's Club. Good but not essential Canterbury. 3 stars."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Sunday, June 12, 2011",
      "rating": 5,
      "text": "My slow and gradual testing of the waters of Canterbury Scene of 1970s progressive rock music is now up to nine records: Caravan's \"Grey and Pink\" and \"Girls Who Plump,\" Soft Machine's \"Third,\" Steve Hillage's \"Fish Rising,\" Hatfield and the North's \"Rotter's Club,\" Robert Wyatt's \"Rock Bottom,\" Gong's \"You,\" and Zyma's \"Thoughts\" (though I might also ask to include Camel's \"Mirage\"). Overall, I am very much enjoying the sub-genre's light, upbeat, happy-go-lucky feel?it makes me wish I'd been in the thick of the 60s' psychedlic hippie generation. Of the above albums I must say that \"Space Shanty\" is my favorite. Why? It's the vocals! There is something very special in the vocals of both Steve Hillage and Nick Greenwood. \"Stranded\" (10/10), \"Mixed Up Man of the Mountains\" (10/10), and \"Driving to Amsterdam\" (10/10), and \"Hollow Stone\" (10/10) are all/each absolutely gorgeous masterpieces. The vocals in \"Stranded\" and \"Stargazers\" remind me so much of why I love MOTH VELLUM, while \"Mixed Up Man\" reminds me of my friend MARK FARNER's \"I'm Your Captain/Closer to Home/\" from his GRAND FUNK RAILROAD days. Absolutely beautiful works!My only reservation in giving this album five stars is that I never like it when an album is so reliant on a guitarist's use of multiple tracks (� la \"Thick as a Brick\"). At times I found myself thinking (wishing) it was two guitarists that I was listening to. And the compositions are not perfectly polished but, again, these amazing vocals and melodies make it such a transendent listening experience I cannot really rate it anything less than a masterpiece. I am in awe. And in love."
    },
    {
      "reviewer": "progrules",
      "date": "Posted Tuesday, June 28, 2011",
      "rating": 5,
      "text": "Heavy Canterbury !Actually this album caused the same experience for me as Atlas' Bla Vardag. A lesser known prog gem that I got hooked on immediately and never disliked for one second. Some albums simply have that impact on you (fortunately) and in the end there will be no other outcome than the full five.Through the years I get stronger and stronger appealed to the Canterbury music thanks to their delicious organ and (when Steve plays it) guitar sound. I simply can't get enough of it and the longer the solos the better for me. Khan decided to produce these features with a heavy (and also spacey at times) sound to create this unique album. Like several other reviewers already stated: what a shame they did this only once !Because I would have liked a couple of more experiences like this. But as so often a masterpiece is created only once in a while and even brilliant composers like these guys are no machines and maybe had this one time inspiration when they produced this. Too bad but at least I will always cherish this one and consider it a highlight in my collection. Many thanks to PA for helping me discover it and I can only recommend it strongly to all other proggers at least those who already have a soft spot for Canterbury."
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Friday, July 22, 2011",
      "rating": 4,
      "text": "The Khan project heralded Steve Hillage's return to the music industry (after leaving Uriel to go to university, coming back only to cut the Arzachel album with his former bandmates for a lark). Lyrically speaking, the album is hilariously dated - right from the opening couplet (\"I need you and you need me/Also I need to be free!\") we can tell that, for all his other qualities, Steve Hillage was never much of a lyricist - he wouldn't get much better over the course of his post- Gong solo career. But then again, whilst the words are rubbish, the sheer earnestness with which Steve delivers them elevates them from mere dross into a sort of platonic form of New Age nonsense - and I'll take unintentionally hilarious over boring any day of the week.Of course, prog fans by and large aren't here for the lyrics - they're all about the instrumental performance, and in that regard the album is pretty damn good. It's essentially a fairly middle- of-the-road Canterbury album made special by Steve's spacey guitar style, though the inclusion of Dave Stewart's always entertaining keyboard talents certainly doesn't hurt. Nonetheless, I wouldn't go so far as to call it an outright masterpiece - I feel that I have to look past the album's obscurity and the fact it's the band's sole recorded output to look at the quality of the music, and whilst it is good, the fact is that you can tell more than one album or so of this material would get tired-out quickly. Still, it gave him the extra exposure he needed to get the post in Gong, so the album is both important to the development of the psychedelic, spacey end of the Canterbury scene and Steve's career as a whole. If you're already a Hillage fan or a Canterbury fan, this comes heartily recommended, but otherwise both Hillage and Dave Stewart would appear in superior (and much more significant) albums across their careers, and you'd be well advise to explore those first."
    },
    {
      "reviewer": "Wicket",
      "date": "Posted Sunday, August 28, 2011",
      "rating": 5,
      "text": "A wonderful masterpiece of Canterbury prog that all respective fans will appreciate, but will not be an unknown venture to fans of classic rock.Just the names of Steve Hillage and Dave Stewart should be the immediate bright spots here. Any good fan of prog will recognize those names and interest should immediately be gained, and why not? Even though this is the only album this group produced, it's worth every penny. I was stuck on the title track for about a month or two before I even listened to the rest of the album. That's how good it is.Now the songwriting on that particular track wasn't exactly the best in the world (especially not before \"Stranded\", which contains some wonderful songwriting), but once the main chorus is over and done, the instrumental sections come in and it's all uphill from there. It's a great example of typical Canterbury jazz/rock mixing with striking guitar solos and that typical heavy rock sound made popular in the early 70's thanks to bands like Led Zeppelin and Queen. The magic continues when Hillage gets the spotlight all to himself, and the solo just echoes like magic and really pulls the song together.As aformentioned, \"Stranded\" is the complete opposite of \"Space Shanty\". Vocals are more abundant (and it took a lot longer to write this song's lyrics than \"Space Shanty's\"). It's more atmospheric and light as the lyrics are the only thing that can pull you into the song. But by \"Mixed Man Of The Mountains\" both the instrumentation and songwriting from the previous songs come together in another fantastic demonstration of Canterbury prog.\"Driving In Amsterdam\" starts off as another typical instrumental prog song, but then Hillage and Greenwood sing in harmony, and it sounds like another song. This proves the point that any band can play a Canterbury style of prog while maintaining the melody and harmony that many rock bands at that time normally played. Without a doubt, if you selected a number of Canterbury prog albums like Soft Machine's \"Third\", National Health's \"Of Queues And Cures\", Hatfield And The North's 1973 self-titled debut and even Caravan's \"In The Land Of Grey And Pink\", and played samples of them to someone stone-cold, without any prior knowledge or listening history of Canterbury prog, chances are, Khan's \"Space Shanty\" would be the nicest to their ears, simply because of the presence of hard rock elements common in early 70's rock bands on songs like \"Driving In Amsterdam\".\"Stargazers\" clearly comes off from the beginning as a Canterbury prog fan's dream. It seems like that for the entire ride, until the chords lighten up and the vocals come in. Midway through, it even develops into a bluesy segment there. An absolutely wonderful track and a technical masterpiece. The album concludes with the phenomenal \"Hollow Stone (Escape Of The Space Pirates)\", which could easily have been \"Driving To Amsterdam, Pt. 2\".Overall, it's a phenomenal disc and a shame that this is the only release by this collection of musicians, but at least they made one, and this will be a perfect addition for any Canterbury prog fan. Excellent mix of prog and hard rock."
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Saturday, October 15, 2011",
      "rating": 5,
      "text": "Khan's sole album is a mesmirising journey into spacey escapism.My ears have been gloriously blessed with some of the finest musicianship from some of the finest musicians. Nick Greenwood on bass, vocals, the incomparable spacey Steve Hillage on guitars, vocals, Eric Peachy on drums, and the keyboard wizardry of Dave Stewart on Hammond organ, piano, skyceleste, and marimbas. From the opening title track the album delivers a feast of powerful vocals, lengthy Hammond finesse and scorching lead guitar work. The spacey content is reflected in the lyrics, \"flow in its river of light and you'll see, that you have found what you've been searching.\"The Canterbury influences are prevalent, especially on the next track, 'Stranded', with escapist lyrics; \"we escaped to the city, lying on a deserted beach, out of reach, I could see you much clearer as we strode by the shore, all the peace all around us, seemed impossibly pure\". The magical organ solo that follows is a shimmering virtuoso performance accompanied by riffing guitar work and a psychedelic fuzzed lead solo.'Mixed Up Man Of The Mountains' begins with quiet guitar tones and builds to the Canterbury feel, with loud guitar and organ. Greenwood's bass is relentless and this one is filled with lyrics of the secrets of the mountain man. There is a pronounced time sig shift leading to a fast lead break with golden Hammond arpeggios played Adante over jazz percussion metrics. The lead guitar of Hillage is excellent broken only by some whimsical multilayered vocal intonations. Side one of this album is all killer, no filler.Side two begins with a riffing guitar lick on 'Driving To Amsterdam'. It sounds a bit like Caravan or Hatfield and the North for a while. The guitars and organ keep a tight rhythm. The balladic quality is prominent with gentler vocals; \"can it be that there's so many, that have been through this whole scene before, staring at the ground, I found myself in you, our weary faces smiling with the energy that's left.\" The harmonies are quite effective. Eventually the song launches into a jamming bluesy rock feel with twin lead guitar embellishments. The Hammond gains pace and some speed key fingering adds to the atmosphere of tension until the jazz improve ending.'Stargazers' has a quirky time sig a bit like 'Tarkus' at first and then locks into a Canterbury sounding verse; \"don't you think you can surely make it now, you don't need anyone to tell you how, king and queen, an extra gene\". The lead break following is a solid psych sound and there is a very odd time sig that comes next with organ and improvised style lead. There is an identical verse and then a lengthy break with high pitched organ and fret melting lead guitar work played to perfection.'Hollow Stone' begins with dreamy organ and soft vocals; \"hollow stone, all alone, back a thousand years, and you know there is no answer, they can give you, for the words are there for them to choose, as you fall into space from your lonely shelf, you raise your hand and gaze in wonder.\" After these types of lyrics a sparkling electric piano leads. More spacey lyrical verses follow until we enter into a grinding distorted fuzzy guitar riff. The sound reverberates from left to right speaker. There is a freak out of chaotic Hammond and guitar, bass and drums that fades into the final section alternating from left to right ear and finally slowing and speeding back to a echoed note.Overall this album is a sensational musical triumph and sadly a one off. But how many bands can produce music like this, to perfection capturing such incredible atmospheres? This may well be the lighting in a bottle so many bands are searching for. Khan found it and never were able to return to this. For the listeners they have left behind this indelible mark on prog history and it is a pleasurable experience."
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Monday, July 9, 2012",
      "rating": 4,
      "text": "Space Shanty, the sole album of Khan, featuring Gong's Steve Hillage and Egg's Dave Stewart, is a refreshingly consistent record loaded with dreamlike psychedelic vibes, spasmodic jazz leanings, and symphonic splendor. Musically, it is quite similar to Kansas. This album is excellent all around and shows the more symphonic side of the Canterbury scene.'Space Shanty' Opening with a cacophony, the song quickly takes a Led Zeppelin approach to rock and roll, with vocals over drums followed by a heavy riff. However, the lead guitar and organ tradeoffs over the wandering bass and engaged drumming is the highlight of this piece. Steve Hillage and Dave Stewart are monsters, but so are their companions, who are offering creative rhythms throughout underneath psychedelic mayhem. Eventually Hillage bursts through with a fiery guitar solo over a jazzy upbeat backdrop, soon leaving the rest behind in a delayed dual guitar bit over disembodied vocals. Later, Stewart picks up with a bit of sprightly organ before those tradeoffs return. This is an exciting beginning to a great album.'Stranded' Lightening up, this has a beautiful acoustic guitar paired with distant synthesizer and the best vocal melody on the album. As it picks up, it has an organ-led Camel feel. It grabs a heavy rock riff abruptly to introduce an organ lead. The fuzzy and acoustic guitars coming through left and right channels work well over the rhythm that reminds me of 'The Pinnacle' by Kansas or King Crimson's Lizard. The ending is rather mystical, leading into the next piece.'Mixed Up Man of the Mountains' The light guitar and organ lie underneath the vibrato-laden lead singer, but soon give way to rocking lead guitar. The singing soon becomes awash in underwater cloudiness. It leads into something similar to Camel, with vocalizations, semi-clean guitar, keyboards, excellent bass, faithful drums, and plenty of rhythmic creativity. In some ways, it favors passages from Gentle Giant's Acquiring the Taste. Over a relatively simplistic rock rhythm, Hillage provides a very fetching guitar solo.'Driving to Amsterdam' Jazzy yet accessible, this track opens with nearly clean guitar runs and supporting organ. The song possesses an excellent vocal melody that weaves between dreaminess and uplifting determination. There are several complex musical passages woven together.'Stargazers' The fifth song is very Styx-like, quite dramatic and somewhat pop. Hillage's lead guitar is all over the place on top of the velvety backdrop. Stewart's organ solo is so thin sounding it could almost be an electric guitar.'Hollow Stone' This final number has a wash of mysterious guitar and organ. The vocal performance is moving and serves the music extremely well- quite similar in style to Steve Walsh of Kansas. The bass underneath the organ solo is remarkable itself, floating all over the fretboard. The end of the album spirals out of control in spirited psychedelic passion."
    },
    {
      "reviewer": "stefro",
      "date": "Posted Monday, December 17, 2012",
      "rating": 4,
      "text": "Owner of a pretty impressive ouevre, British guitarist Steve Hillage has really worked his way up over the last forty-or-so years. From obscure psych-group member to mid-level guitar star and modern dance 'n' trance innovator, it seems there is very little Hillage hasn't done, his colourful career taking in stints with his own formative outfits Arzachel and Khan, a lengthier spell with Anglo-French prog-psych purveyors Gong, a highly- successful solo spell and a surprise sonic reboot as 1990's trance pioneers System 7. Most will remember him for his time either with Gong or for his series of excellent solo records from the mid-seventies, albums such as 'You', 'Fish Rising' and 'L', though thanks to the ever-growing reissue market, many are now discovering his early work with Khan. A blink-and-you'll-miss-em' Canterbury-styled outfit who recorded just the one record during 1972, Khan featured Hillage, Nick Greenwood(bass), Eric Peachy(drums) and Canterbury- scene stalwart Dave Stewart(keyboards). Their sole album, 'Space Shanty', was recently remastered for the first time by the excellent Esoteric Recordings imprint, and it has since become a firm favourite amongst the progressive rock crowd, sailing into the esteemed ProgArchives.com top 100 albums list. And rightly so. A scintillating mixture of Gong-style psychedelia and Caravan-edged Canterbury prog, 'Space Shanty' is a wonderful album filled a plethora of swirling instrumental moments and topped off with a collection of top-notch technical displays. Very different from the raw and rough-edged psychedelic sound of Hillage's previous outfit Arzachel, this is a much cleaner-sounding album that also features a highly-symphonic edge. The mixture of differing progressive elements allows the musicians to really stretch out on pieces such as the electric nine- minute psychedelic marathon 'Driving To Amsterdam' and the lysergic flavoured 'Mixed Up Man Of The Mountains'. As a result, you have a genuine Hillage career highlight that should more than please his legion of fans, whilst also appealing to lovers of all things Canterbury-styled. However, although the album's excellence is of course down to the group, the real heroes here are the guys at Esoteric who cleaned-up this superb album for it's 21st century retooling. Why it failed during it's own time is a genuine mystery; second time round its proving a real hit. Great stuff."
    },
    {
      "reviewer": "GruvanDahlman",
      "date": "Posted Tuesday, May 7, 2013",
      "rating": 5,
      "text": "There is something quite untouchable about vintage british prog. Something that the genre from every other part of the world can't touch, no matter how good it is. I believe that all countries and continents possess a certain tone, some notes unique for just that particular origin. I love prog, whatever their origin but for me it is british prog that strikes the best chord and I believe it to be so by way of three reasons. Firstly I came to love prog through King Crimson and that set the blueprint for everything else. Secondly, I adore all things british and third there is that tone, that chord or sound that just makes me shiver with delight.Khan's only album epitomizes everything I love about prog in general, not just british (though I am delighted that it is). The album is a perfect mix of accessibility, complexity, melody, strange chord progressions, beauty, anger, mellowness, joy and every other emotion known to man. All this is coupled with divine inspiration and hard rock, amidst all the jazzy, classical elements held within. The gentleness, by the way, is of a certain kind only found in prog, I believe. How to explain that to someone not initiated? I guess you have to take my word for it or listen to some of the music. Simple as that.The title track kicks in with a blast and is a tremendous piece of multilayered prog. The next track, Stranded, is so beautiful and has to be one of the best follow-up songs on an album ever. I love it! The following tracks, I won't review every track in any detail, are simply outstanding and brilliant. The blasts of distorted guitar, alongside stabs of organ and powerful rhythm section, intermediated by flowing, gentle episodes and discords are simply out of this world. The genius behind this album is flawless and it is a shame they did not record another record, though (as I have been told) Hillage's first solo album Fish rising (another slab of brilliance) contains songs intended for Khan's second offering.The song Hollow stone holds a special magic. I believe ther is an old magical hollow stone in Cornwall (?) and I see it before me, though only visited in books. The lyrics paint images making me tremble with delight. Actually, all the songs hold a special magic. The album is magical. The cover, Hillage's guitar, Stewart's trademark organ and the great rhythm section, the songs, the ambiance, the vocals, the everything spells magical brilliance.Though at first reluctant giving the album five stars I am now compelled to do just that. It is an amazing record worthy every praise and hallelujah there is."
    },
    {
      "reviewer": "Matti",
      "date": "Posted Friday, January 17, 2014",
      "rating": 4,
      "text": "Steve Hillage is unarguably THE guitarist in the Canterbury scene, and among the most gifted ones in the whole prog history. After making the Arzachel album with his fellows from EGG, Hillage returned to his studies at Kent University, Canterbury. In April 1971 he formed KHAN, which at first featured drummer Pip Pyle, bassist Nick Greenwood and keyboardist Dick Henningham. Caravan's manager Terry King got them a record deal, but before the sessions began, Pyle was replaced by Eric Peachey and Henningham's departure was replaced at the last minute by none other than Dave Stewart (of Egg and numerous, at the time future Canterbury bands), one of Hillage's old playing mates.Space Shanty gives some foretaste of Hillage's later work as the GONG guitarist and a solo artist. Especially the echoey guitar sound - for example in the title track which is loaded with heavy psychedelia - was to become his trademark. The album is tight prog rock. Several tempo changes, soli and variations in the dynamics work brilliantly on long tracks such as 'Mixed Up Man of the Mountain' and 'Driving to Amsterdam'. Hendrix-influenced guitar is the central element in this melodic and lively prog. On one moment it may sound a bit like Genesis, on the next moment like Camel, and on the next one... Well, it's better to say that Khan had a full-blown style of their own. On the Canterbury scene it represents its rockier side, and also slightly more vocal-oriented than Canterbury on the average.Stewart's organ and electric piano are best heard on the calmer track 'Stranded'. The album fully deserves the classic status. During the summer and autumn after the release, Khan toured with an unstable line-up and practiced for new material (some of which was to appear on Hillage's solo debut Fish Rising, 1975), but the band came to its end in October when Hillage joined briefly Kevin Ayers' band. From then on he continued his colourful career as the Gong member."
    },
    {
      "reviewer": "ALotOfBottle",
      "date": "Posted Thursday, February 18, 2016",
      "rating": 5,
      "text": "Khan was a short-lived project formed by Steve Hillage, who had just completed his studies and was now ready to participate in musical projects. After a few line-up changes, he teamed up with a bassist Nick Greenwood, previously of Crazy World Of Arthur Brown, a drummer Eric Preachy, and his old friend, the keyboardist Dave Stewart, whose band Egg had just disbanded the same year. The quartet's only album,Space Shanty, was released in June 1972.What really setsSpace Shantyapart from most Canterbury scene works is the emphasis put on songwriting. In result, what we get are organized jazzy ballads with phenomenal improvisational parts. The musicians draw some of the most beautiful and moving soundscapes in the sub-genre. There is something really soporiphic aboutSpace Shanty. Usually, it would not be a compliment, but in this case, the factor gives it a really unique flavor. It's not heavy on one's thoughts, without sacrificing the sophisticated factor. The band often finds itself in scenarios including odd time signatures. Improvisation does not play a crucial role and solo instrumental parts are only one of the elements contributing to Khan's distinctive musical extract.Steve Hillage's soft, pastel guitar passages combined with Dave Stewart's lush, smooth keyboards are what mainly contributes to the effect of the album. Hillage is also capable of some phenomenal rock solos, which remind me a bit of Andy Powell of Wishbone Ash. His singing is gentle, light, and almost angel-like in places. Dave Stewart's playing is as always close to perfection. Not only does he proficiently draw affecting ambient-like textures, but he is also capable of great rhythm play and rapid solo parts. The rhythm section of Nick Greenwood and Eric Preachy lays down some great grooves and keeps up with Khan's dynamic and lively style.All in all, Khan's only release is one of the most emotion-filled progressive rock albums. What would Khan have been able to do if they continued as a band? We can only imagine.Space Shantyis a truly unique masterpiece and is a must-listen for every progressive rock fan.Five stars!"
    },
    {
      "reviewer": "Magnum Vaeltaja",
      "date": "Posted Wednesday, March 16, 2016",
      "rating": 5,
      "text": "This is the very best Canterbury album there is. A little bold? Perhaps, but what Khan manages to accomplish on their sole disc is something really special, that sets it apart from a flood of other incredible albums.First off, I'd just like to give major kudos to all the musicians involved. Dave Stewart and Steve Hillage need no introduction, and their interplay throughout all of the album's many instrumental passages is top notch. The chemistry within the band is unparalleled, with all of the album's complex arrangements sounding very natural and organically flowing. Lately I've also been paying particular attention to the bass playing of Nick Greenwood; what an underrated musician! Even though the organ and guitar steal the show, Nick manages to keep up really well, and plays all sorts of interesting and unconventional licks throughout. From a technical standpoint, it's pretty hard to beat how well all four members of Khan play.Of course, well-played albums are a dime a dozen in the prog world, so that alone can't define a masterpiece. So what else does \"Space Shanty\" have going for it? What really resonates with this album for me is the atmosphere it creates. There are a whole lot of influences on display here, from smooth jazz fusion, to hallucinatory space rock, to heavy psychedelic blowouts, to soulful blues passages. And, miraculously, all of these different genres are so well balanced in every track that a unified sort of nocturnal atmosphere comes into fruition. Often melancholy, meandering, inviting, there's a definite coherence of mood throughout the whole affair. I think it can be best described as a very nostalgic, \"coming-of-age\" type of feeling. I highly recommend putting this on as a night driving album, it seems almost like it was made for it!Now just because \"Space Shanty\" is well-played and engulfed in a beautiful atmosphere, does that really quantify it as the \"best Canterbury album there is\"? I think that those criteria alone are enough to push me to a 5 star rating, but what really makes Khan's album the shining star of the Canterbury Scene is in its approach. Canterbury, lighthearted as it is, is one of those genres that seems to be very conducive to abstract silliness, and, quite frankly, a whole lot of noodling. Khan's greatest strength is their ability to take all of the typical Canterbury aesthetic and to channel all those absurd ideas and influences into something so structured, tangible, and ultimately very emotive. Call it \"Canterbury-for-those-who-don't-really-like-Canterbury\" if you like, but what I believe really sets Khan ahead of Soft Machine or Hatfield and The North is that, as splendid as the musicianship on those records is, there's a bit too much of a niche appeal to their style. But with Khan, even if you take the \"Canterbury\" descriptor away, \"Space Shanty\" is still a masterpiece. 5 solid stars for this beauty."
    },
    {
      "reviewer": "siLLy puPPy",
      "date": "Posted Monday, August 27, 2018",
      "rating": 5,
      "text": "THE GRAND VISION OF THE WILDE FLOWERS FINALLY COME TO FRUITION.Any fans of progressive rock's Canterbury Scene are keenly aware that the whole thing began back in the mid-60s when the pioneers Kevin Ayers, Brian Hopper, Richard Sinclair and Hugh Hopper created the blueprint for the whole scene with the proto-offerings of the Wilde Flowers, however due to creative differences the band never realized their visions and splintered into Soft Machine and Caravan which would create a snowball effect for an entirely newly established branch of jazz-rock fusion. With a fork in the road, each set of musicians splintered into different directions. While both started out in a more playful psychedelic pop with progressive leanings mold, by the turn of the decade, Soft Machine was a full-fledged jazz-fusion instrumental band and Caravan had polished their progressive pop chops.Fast forward a few years down the road and a fledgling Steve Hillage was just getting his feet wet in the music world after working in the psychedelic blues rock band Uriel aka Arzachel in 1969. As a result of the remaining three members forming Egg after the band split, Hillage found himself exposed to the world of England's Canterbury sound and learned a few tricks from his continued involvement with his former team. After a few years of academic studies, Hillage had the itch to start a new band which resulted in his next project KHAN which consisted of the lineup of Nick Greenwood on bass after his stints with The Crazy World of Arthur Brown, Dick Heninghem on organ and Pip Pyle on percussion but quickly Pyle joined Gong and was replaced by Eric Peachey. Soon after Heninghem baled as well leaving the entire project in question.Despite having recently joined Egg, Dave Stewart came to the rescue and contributed his keyboard playing skills between gigs all throughout 1971 to KHAN's one and only album SPACE SHANTY. The sessions began with only Hillage and Greenwood which would set the stage for the final outcome. If you are lucky enough to have heard the remastered edition that contains the two bonus tracks \"Break The Chains\" (which never made it onto the album) and the first version of \"Mixed Up Man Of The Mountains,\" it would all make sense as how SPACE SHANTY evolved from being super catchy pop rock songs with flowery hippie inspired lyrics to a more sophisticated slice of prog rock that craftily mixed Canterbury inspired progressive rock with jazz fusion and space rock. The formula was set and teased out until it created one of the Canterbury quintessential listening experiences that stands out from all the rest.SPACE SHANTY is a brilliant mix of 60s almost Cream inspired harder edged rock in fine compositional form with the melody as the primary feature. Someone forgot to tell these guys that the 70s weren't about peace and love any longer and that cynicism and darker tones were in! Well, never mind. KHAN somehow didn't get the memo and remained staunchly in flower power mode with heart-warming lyrics that make you scream \"power to the people!\" Despite this extended flirtation with idealistic optimism, the music is off the charts outstanding. Of the six tracks, each begins with a beautifully arranged pop rock song that after a verse / chorus / verse normalcy begins to drift off into the progressive rock universe with each passage organically shapeshifting from various styles of space rock to jazzy fueled fusion to organ driven Canterbury heaven. The result is in my mind exactly what the Wilde Flowers were hoping to achieve had they stayed together.The opening title track perfectly states the entire mission with the opening \"I need you and you need me\" belted out in poetic prose and vocals that remind me somewhat of Kansas. After the initial lyric driven rock in melodious splendor, the track deviates into \"The Cobalt Sequence and March of the Sine Squadrons\" which displays the veritable talent of the musicians involved in the KHAN project and although Dave Stewart and Hillage rule the show with blistering solos and time signature rich outbursts, hats off to both Nick Greenwood and Eric Peachey for finding ways of inserting their genius within the nooks and crannies. KHAN came off as a super group even at this early stage of the members' respective careers.The entire album follows suit with melodic \"normal\" rock intros drifting away into a rotisserie of musical genre mashups with each musician finding abnormal ways of musical expression, ranging between loose jazzy jams and space rock extravaganzas with the track finding resolution by ending with the same vocal led melodic rock from which started the whole thing. Some tracks like \"Driving To Amsterdam\" display more phenomenal than usual keyboard outbursts from Dave Stewart and \"Stargazers\" finds the perfect way of juggling hyperactive progressive angularity with gentle placidity as the two styles alternate. This album is pretty cool as it displays not only much of Hillage's bluesy guitar rock of his Arzachel project but finds him perfecting his space rock echo approach that he would fully unleash once joining Gong.I really can't think of another album that so brilliantly melds the 60s ideals so well into a 70s progressive rock context. The brilliant musicianship and virtuosic outburst meld perfectly with placid mellow melodies that would come crashing down if not for the strong vocal performances of both Hillage and Greenwood. Everything serves the greater good of the atmosphere and melody on this one and the result is brilliant and compelling. Forget the hideous cover art. Ugh. The music is some of the most brilliant that the Canterbury Scene has to offer. Yeah, this was a grower for me as i had the initial ick factor with the flowery verbiage and rather dated organ sounds but the more i listened to this one, the more it weaseled its way under my skin.Yes, this does have a dated sound but not every classic has to be timeless in nature. This is a masterpiece of the era and instantly takes me back to the classic musical year of 1972. This was a great start for Hillage. Unfortunately the band collapsed fairly quickly and despite some material being prepared for a second album, much of that would find itself onto Hillage's first solo album \"Fish Rising.\" While only existing for a brief moment in time, KHAN somehow managed to create one of the ultimate classics of 70s progressive rock that has held up over the years. It was certainly an acquired taste for me but one i finally captured as i let the melodies sink into my skin first and then let the more fancy shmancy complexities follow. Great lyrics, great melodies, great technical wankery. What more could you possibly want? One warning is that this is mood dependent. I haven't found this brilliant on every listen but in the end, it is."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Wednesday, May 26, 2021",
      "rating": 5,
      "text": "Review N� 434Khan was a UK progressive rock band associated with the Canterbury scene. They were only active in 1971 and 1972 and released only one album, \"Space Shanty\". \"Space Shanty\" was released in June 1972, followed by a UK live tour supporting Caravan. It's a truly classic progressive rock album of the Canterbury scene. It's a question of love or hate to proggies. Some love its loose, jazzy jams, and others hate its hippie lyrics and flowery arrangements. Some others say that its sound has more to do with a hard rock album than to a Canterbury classic album. But what's more notable is that \"Space Shanty\" is a distillation of the many styles of the Canterbury scene, with its cosmic hippy humor, the fascinating and busy arrangements but, above all, it remains completely new, fresh and exciting. This is a progressive rock album of the first class, and it's, definitely, one of the best albums where Hillage and Stewart have played together.Khan was a supergroup, one of the first ones. As is typical with the Canterbury scene, each member was also a member of a number of other bands. Keyboardist Dave Stewart played with Arzachel, Egg, Gong, Hatfield And The North, and National Health, to name a few. Guitarist Steve Hillage went on to play and record a number of notable albums with Kevin Ayers, Gong, and as a solo artist. Bassist Nick Greenwood had done time with the Crazy World Of Arthur Brown.So, the line up on the album is Steve Hillage (vocals and guitars), Dave Stewart (organ, piano, celesta and marimbas), Nick Greenwood (vocals and bass) and Eric Peachey (drums).\"Space Shanty\" has six tracks. All tracks were written by Hillage except \"Mixed Up Man Of The Mountains\" which was written by Hillage and Greenwood. The first track is the title track \"Space Shanty\". This opening title track is very representative of the album, both in quality and style. It has lengthy and complex tones with strong melodies, riffs and much extended instrumental parts that will impress and satisfy any true progressive rock fan. Stewart's organ sound is immediately recognisable, and the addition of Hillage's guitar work gives the band a sonic range that the otherwise excellent Egg didn't have. There is a slight space edge to some of the instrumental parts, quite natural with an album's title like this, but I still wouldn't consider the overall sound on the album to be spacey or space rock. The second track \"Stranded (Including Effeverscent Psycho Novelty No. 5)\" features a beautiful, deep organ tone by Stewart along with a sprinkling piano and a very strong vocal melody. The instrumental part burst out in a heavy riff, and an acoustic flamenco influenced guitar solo makes a surprising and nice appearance. This song flows right into the next one, \"Mixed Up Man Of The Mountains\". The third track \"Mixed Up Man Of The Mountains\" starts with a fairly straightforward rock beat played at a stride. The instrumental parts on this track has a slightly jazzier feel, with wordless vocals and lots of soloing between Hillage and Stewart with some of the best Canterbury prog jamming that you'll ever heard. The fourth track \"Driving To Amsterdam\" also starts a bit jazzy and turns quickly into some delicious melodies played simultaneously by Hillage and Stewart. It features some particularly fiery keyboard work by Stewart with his prepared keyboards. The melody on the vocal parts is probably the most beautiful in the whole album. The fifth track \"Stargazers\" reminds a lot of Gentle Giant and the song itself is a progressive rock at its catchiest and most immediate. It features some excellent guitar solos from Hillage along with patented guitar and organ interplay, between both, and some tasteful and prominent rhythm section of bass and drums. The sixth track \"Hollow Stone (Escape Of The Space Pirates)\" has some soft and pleasant vocal passages with Stewart's dreamy organ in the background, while the more distorted side of his sound dominates the solo parts. The track ends with an incredibly grand sounding heavy riff that creates a hell of a climax to the song. This is another excellent track that concludes brilliantly this great masterpiece.The 2005 reissued release includes two bonus tracks, \"Break The Chains\" and a fantastic first version of \"Mixed Up Man Of The Mountains\". With these two additional tracks the running time of this new release increases to 55 minutes.Conclusion: \"Space Shanty\" is a must have and it's too bad that they didn't last long enough to make more albums. The music has a real sense of scale and joy, and the guys are clearly enjoying themselves with their instruments. The recording is warm and straightforward with panning and flanging done to a real good effect. The music here is quite innovative, particularly with combining effects pedals with keyboards. In this time weren't relying too much on studio trickery and tape manipulation. This is one of the jewels in the crown of the Canterbury prog and one of my favourite albums of that sub-genre. It's highly recommended for all fans and collectors of the early 70's British progressive rock scene. Canterbury rock didn't start with Khan. But, if you're not intimate with that genre, then \"Space Shanty\" would be a perfect place for you to start, despite its heaviness. This is a pure gold plated classic progressive rock album, really.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "DangHeck",
      "date": "Posted Friday, July 9, 2021",
      "rating": 5,
      "text": "Canterbury-Adjacent Heavy Prog Steeped in Jazz and Space RockI suppose it's worth saying right off:Space Shanty,the sole release by would-be Heavy-Canterbury Prog supergroup Khan, isone of my favorite albums of all time. Simply put, it's one of the greatest albums that have ever touched these ears. Khan's membership includes most prominently keyboard wizard (literally my favorite keyboardist) Dave Stewart and guitarist Steve Hillage (time and again I find to be one of my favorite guitarists, certainly). They were both members of Acid-Blues Rock group Uriel with Mont Campbell and Clive Brooks, releasing just one self-titled album as Arzachel in '69. With Steve's departure from the group, they changed the name once again, effectivelyformingthe classic Canterbury Prog trio Egg. When Egg disbanded--for the first time before releasing their final album in 1974--Stewart and Hillage joined forces with former Crazy World bassist Nicholas Greenwood (providing his gruff Arthur Brown-esque baritone) and drummer Eric Peachey. Likewise-not-actually-Kentish drummer Pip Pyle was briefly in the band beforeSpace Shanty's recording.It all begins with the super-epic,mini-epic title track,\"Space Shanty\". The full-ensemble cacophony dies away and Greenwood enters in vocally. And what follows ispure beeves. One of the things I appreciate in this, enjoyable throughout the album, are the close harmonies between him and co-lead vocalist Steve Hillage. And this is a great showcase of Hillage's and Stewart's ability to play around and off each other. The soloing sections throughout the album range from beautiful and feeling (heard here around minute 2) to raucous and frightening (though less so the latter). This opener is also just a fantastic composition. So much interest. So much to keep pulling you in. And Dave Stewart just always blows my mind. I must say, the person I mention the least is Eric Peachey on drums, but seriously he is just incredible. The band is so well-balanced. Continuing along into the middle section, we get hints at circus fair, Heavy Metal, a little bit of neo-classical (see minute 6), and a heavy dosage of the Avant-garde. The solos nearing minute 7 is one of my favorite moments in music. Total mind-blower, and afairrepresentation for what's to come. Now, how can I say way less for the rest?...We get ahugetonal shift for what's next, the beautiful, awe-inspiring\"Stranded\". What I would consider Dave Stewart's (one) signature Hammond sound is well on display here. This track also has Steve Hillage on lead vocals, soft and emotive. Love him. Just get yourself ready for the section change around the midpoint. I'll keep it down over here in the back, but... I'm in heaven haha. Queue one of my favorite 'solos' ever. Literally Steve duetting himself, eventually switching to this bright acoustic guitar. Once again, a totalmind-blower,what the f*ck. Moving right along, seamlessly we get\"Mixed Up Man of the Mountains\",another Greenwood-fronted number. This song justgrooves,Peachey laying down a solid foundation and Nicholas melodically bassing. This band rules haha. And then he scats along with the keys, before another epic guitar-keyboard back-and-forth. Moments like this are why doctors recommend putting this whole album on a few times a year, at least. Some of the swirling synth effects Dave puts on make this pure Canterbury, resembling in part Soft Machine's Mike Ratledge, for instance. And then queue up this absolutely sexy, soaring guitar solo right about the 5 minute mark. Wrap it up, call it a day; another perfect number.This is then followed by\"Driving to Amsterdam\",what I always considered to be a sort of sister song to Egg's nearly-as-long \"A Visit to Newport Hospital\". And they start off with a boom, shifting into another section of jazzy beauty and grace. I always considered this also to be just a little bit more perfect than the rest of the album haha. It gets a track-specific rating of 5.5/5.0. Gorgeous, and inspiring. I expect to cry if it comes on haha. Hope you experience a comparable joy. Another where Peachey is distinctly on fire. Another fantastic keyboard solo, atop Eric's rolling, bubbling tom-play. Hard Bop shifts into view as Steve then takes up the soloing. F*ckin' delicious stuff here. Dave's buzzing Hammond takes over once more for a brief movement back into Heavy Prog territory before the equally astounding ending.Quickly coming to its close, next is the freakishly upbeat\"Stargazers\",at times most Avant-garde, dissonant and chromatic. I love the way Steve and Nicholas trade off lead vocals on this one. Steve then has a great solo, fuzzy and emotive. He is just a master of the instrument. And speaking of masters, the next solo, after the second chorus, averyat-times guitar-like keyboard solo, comes from the inimitable Dave Stewart. Such a fun track. This is then followed, again starkly juxtaposed, by the final number,\"Hollow Stone\". So much to take in and enjoy, just on a sonic and emotional level. Many of the tracks have fun section names, like \"March of the Sine Squadrons\" off the title track and \"Effervescent Psycho Novelty No. 5\" off \"Stranded\", but most memorable, I believe beginning here in the sixth minute, is on this one: \"Escape of the Space Pirates\". What a killer closer to an absolutelyessentialalbum.[By the way, I believe what is effectively the final chord of the album is the first chord on the album, so hypothetically, I could listen through this over and over and over...]For those who somehow care, myTrue Ratefor this amazing album is4.958333/5. Certainly notably better to me than some of the best regarded albums in all of Prog, classic, newer or otherwise. I'm always astounded by the album and I get excited just talking about it, but especially showing it to someone new. Anyhow, enjoy. Ramble over. [Much shorter review than I could have imagined haha.]"
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album4967.html",
  "last_parsed": "2025-05-18T00:21:45.934935"
}