{
  "album_title": "CRIME OF THE CENTURY",
  "artist_name": "Supertramp",
  "artist_page_link_local": "artistf843.html?id=324",
  "year": 1974,
  "rating_value": 4.32,
  "rating_count": null,
  "review_count": null,
  "genre": "Crossover Prog",
  "album_type": "Studio Album",
  "cover_image_url": "http://www.progarchives.com/progressive_rock_discography_covers/324/cover_364111852016_r.jpg",
  "tracks": [
    {
      "number": 1,
      "title": "School",
      "duration": "5:35",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Bloody Well Right",
      "duration": "4:26",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Hide in Your Shell",
      "duration": "6:52",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Asylum",
      "duration": "6:30",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Dreamer",
      "duration": "3:19",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Rudy",
      "duration": "7:07",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "If Everyone Was Listening",
      "duration": "4:05",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Crime of the Century",
      "duration": "5:20",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "Bonus disc from 2014 A&M remaster",
      "duration": null,
      "is_sub_track": false
    },
    {
      "number": "Live",
      "title": "at Hammersmith Odeon March 9th 1975",
      "duration": null,
      "is_sub_track": true
    },
    {
      "number": 1,
      "title": "School",
      "duration": "5:54",
      "is_sub_track": false
    },
    {
      "number": 2,
      "title": "Bloody Well Right",
      "duration": "6:46",
      "is_sub_track": false
    },
    {
      "number": 3,
      "title": "Hide in Your Shell",
      "duration": "6:47",
      "is_sub_track": false
    },
    {
      "number": 4,
      "title": "Asylum",
      "duration": "7:01",
      "is_sub_track": false
    },
    {
      "number": 5,
      "title": "Sister Moonshine",
      "duration": "5:30",
      "is_sub_track": false
    },
    {
      "number": 6,
      "title": "Just a Normal Day",
      "duration": "3:59",
      "is_sub_track": false
    },
    {
      "number": 7,
      "title": "Another Man's Woman",
      "duration": "7:42",
      "is_sub_track": false
    },
    {
      "number": 8,
      "title": "Lady",
      "duration": "5:55",
      "is_sub_track": false
    },
    {
      "number": 9,
      "title": "A - You're Adorable",
      "duration": "2:57",
      "is_sub_track": false
    },
    {
      "number": 10,
      "title": "Dreamer",
      "duration": "3:28",
      "is_sub_track": false
    },
    {
      "number": 11,
      "title": "Rudy",
      "duration": "7:24",
      "is_sub_track": false
    },
    {
      "number": 12,
      "title": "If Everyone Was Listening",
      "duration": "4:33",
      "is_sub_track": false
    },
    {
      "number": 13,
      "title": "Crime of the Century",
      "duration": "6:01",
      "is_sub_track": false
    }
  ],
  "lineup": [],
  "reviews": [
    {
      "reviewer": "maani",
      "date": "Posted Tuesday, January 6, 2004",
      "rating": 4,
      "text": "One of the most underappreciated albums in rock. The overall atmosphere of this excellent concept album is as beautiful as can be. Every song is a mini-musical. Hide in Your Shell is one of the best unknown gems in quasi-prog-rock, and the ending of the title song is one of the most haunting fade-outs I've ever heard. It's also nice to hear Dreamer in its proper context, instead of as a Top 40 hit. Along with Klaatu's \"Hope\" and 10CC's \"Sheet Music,\" one of those album that everyone SHOULD have, but probably doesn't."
    },
    {
      "reviewer": "Sean Trane",
      "date": "Posted Wednesday, February 4, 2004",
      "rating": 5,
      "text": "The sweetest of all the crimes of any century....After their mentor and 's abandon, Hodgson and Davies had to re-start Supertramp all over from scratch, with the only assurance of a recording contract with their label A&M. The duo hired two ex-The Alan Bown! members: saxman and free-electron John Anthony Helliwell who had a high-pitched voice very similar to Hodgson's and the excellent bassist Dougie Thompson, whose bass would quickly become a very important element of Supertramp's new sound. They also hired Bob Siebenberg (later Bob C. Benberg) on drums and this would become the classic line-up of the group for years to come. This is the album that saw Rick Davies' rise as full-blown singer and his baritone vocals contrasts heavily with Hodgson and Helliwell's soprano voices, thus making this unique and instantly recognizable Supertramp sound.Probably knowing that this would be their last shot, they returned to the more progressive fold of their debut album, but created a full-blown concept album that stood the test of time. Apparently, and despite their delusions about their first two albums, the A&M management liked what they heard and gave Ken Scott a \"carte blanche\" and un-limited studio time to get the album the chance it deserved. Scott had been around for David Bowie and Elton John, and produced a sublime sounding album, with outstanding arrangements. Just listen to Elton's Madman Across The Water album on the Levon, title track and Indian summer tracks' string arrangements to understand how important Ken's involvement is important to the album's sound. The album was also graced with an iconic artwork with the absolutely spellbinding jail in the cosmos illustration, thus enhancing the album's youth alienation concept.But all of these details would amount to nothing, if the music on the album was anything less than flabbergastingly stupendous and the alternance of Hodgson & Davies song is one of the most inspiring ideas of the album. With that lone harmonica opening the wild School track (a rare Davies/Hodgson collaboration in songwriting), there are precious few albums starting so breathtakingly well. Indeed that song is the group's flagship with its constantly-changing patterns and many breaks and those schoolyard kids screams are spine-chillingly beautifully placed in the middle section. The blues-derived Bloody Well Right is a typical Davies tune that will boosts his confidence for the future endeavors. While a bit too-wordy, Hodgson counters with the spell-binding Hide In Your Shell, a flamboyant tune about shyness' implications. But if that wasn't awesome enough, Davies counters with the blood-curdling and spine-chilling Asylum, a pure bombastic tune about losing grasp of reality. Before one knew it, it was time to flip the album over.The second chapter opens with the only song I like that features Hodgson's taste for wanker melodies choruses (see Lady, Give A Little Bit, the BIA tt, Raining Again), but the song itself is awesome, especially with the outstanding Thompson bass line and the establishment accusation lyrics. The Hodgson unconditional fans will have to recognize that Davies also managed some incredibly beautiful songs, like the album centerpiece Rudy, a fantastic trip through the estranged boy escape-route from society (listen to these amazing string counterpoints that gives so much depth to the track). This epic is equally impressive as Fool's Overture, and not just in my humble opinion. The self-explanatory If Everyone Was Listening is a emotional last-chance cry before-alienation-warning, before the no-return point of the closing track. Indeed the title track is a splendid album finale where Rudy commits his no-coming-back gesture, no doubt his idea of a Crime Of The Century. The track's long double piano finale is out-of this world.This album will always have a huge spot in my heart as it was my first album ever acquired my hard-earned cash (newspaper delivery) and still one of my favorites; and it is responsible for thousands albums I have bought since. From the harmonica intro of School to the fade-out of the title-track this is a major work of art. This album was capital to me in my teens, as most of us related to the story of Rudy's alienation to his surrounding world. It is easier to point out the one slightly weaker number than list the outstanding ones: If Everyone is the only slight imperfection in here but it is still essential to the rest. It also took me some time to accept the wanker chorus of Dreamer, but the incredible bass line (courtesy of the awesome Thompson) behind made it pass. Absolutely essential listening and definitely in my top 10 albums."
    },
    {
      "reviewer": "greenback",
      "date": "Posted Sunday, April 18, 2004",
      "rating": 4,
      "text": "Supertramp never were very progressive, but they have the capability to make very catchy songs. The Wurlitzer piano is quite present, as usual. On \"School\", the famous harmonica in the intro, the kids screaming while Roger Hodgson makes spacy electric guitar effects, the saxes, the vibraphone and the catchy rhythmic piano make this song an elaborated international number one hit! The almost hard rock \"Bloody well right\" has a funny wah wah guitar solo, some relax rhythmic piano & saloon piano and a couples of excellent sax solos. \"Hide in your shell\" has one of the most catchy refrains Supertramp made: GRAND! \"Asylum\" has a quite mellow and relaxing piano & lead vocals on the intro; it is a less catchy track than the other ones: it seems to have some subtle orchestral arrangements in the background: the Supertramp's style is harder to recognize on this track. The typical hammering Wurlitzer piano takes all its grandeur on the catchy \"Dreamer\". \"Rudy\" starts again with mellow & relax piano; it has some very subtle & discrete clarinet and orchestral arrangements: it almost ends with a catchy disco style: it sounds a bit like some Alan Parsons' stuff of the 70's. \"If everyone was listening\" has OUTSTANDING classical arrangements; a catchy echoed piano and beautiful clarinet precede a very good rhythmic refrain. \"Crime of the century\" has maybe a too repetitive hammering piano.Rating: 4.5 stars"
    },
    {
      "reviewer": "Easy Livin",
      "date": "Posted Thursday, May 6, 2004",
      "rating": 5,
      "text": "\"Read all about their schemes and adventuring, it's well worth the fee\"\"Crime of the century\" saw Supertramp become a major league band overnight.I first heard the album when it was played by Supertramp live on tour. The performance consisted of the entire album presented in track order. I suspect most of the audience joined me the following day in buying the album. Incidentally, Supertramp were supported by a youthful, and at the time superb (I kid you not!) Chris De Burgh, who was also signed to A&M. His complete set consisted only of him and his acoustic guitar, but the prog inclined audience were captivated, and indeed highly appreciative.The album starts innocuously enough with \"School\", something of a grower of a track which only really gets going when Hodgson assaults his piano. \"Bloody well right\" is a pretty poor Rick Davies led track, it's a bit funky, but band and uninspired. I must admit at this point in the concert I was starting to despair.\"Hide in your shell\" however dispels all concerns, a masterpiece of melodic prog featuring the pained voice of Hodgson. It's structured along the lines of the Moody Blues \"Isn't life strange\", but a bit more upbeat. There's some wonderful sax, and symphonic keyboards, plus a supreme melody. This really is Supertramp at their peak.The album includes the single \"Dreamer\" which at the time was radically different to anything which had previously featured in the charts, yet it has an irresistible hook. It has to be one of the mostprogressivesingles ever.The title track which closes the album opens with a brief vocal section thepunchlineleading to the wonderful instrumental which plays the album out. The music builds majestically from unaccompanied piano through a soothing wash of saxophone (think \"Year of the cat\" by Al Stewart), before the distant harmonica which opened side one brings things full circle.This was probably Supertramp's most progressive effort, and undoubtedly their finest hour. Many of the songs have complex structures while retaining strong melodies. It is perhaps the strength of those melodies which mislead those who listen on a superficial level, and perceive this as a simple, pop based collection.\"Crime of the century\" is a wonderful album best heard as a complete piece. I'll leave it to you to decide whether it's actually a concept album or not."
    },
    {
      "reviewer": "Chris S",
      "date": "Posted Monday, September 13, 2004",
      "rating": 5,
      "text": "Most people have already done the honours of giving this a five star rating. Let me just add it is Supertramp's most complete masterpiece. It is their strongest album even though there are other Tramp albums deserving of a five star rating. ' School'' Hide in your Shell', ' Crime of the Century' and 'Rudy' are all epic tracks. There is not a bad song on the album. ' Dreamer' has dated perhaps but still enjoyable and on here they at last found a solid line up which was to last until the release of Famous Last Words. Rick Davies is a genius as he displays on recent Supertramp albums but what had to be recognised from COTC onwards was the importance of all band members creating a lethal coctail of sound which was to establish itself up to the early 80's."
    },
    {
      "reviewer": "Guillermo",
      "date": "Posted Friday, November 12, 2004",
      "rating": 4,
      "text": "I don`t know if this album is a \"concept album\". I can`t see any \"connection\" between the lyrics of all the songs. And also with other \"much praised\" albums (like GENESIS `s \"The Lamb Lies Down on Broadway\" and YES`s \"Fragile\") I don`t consider this album as SUPERTRAMP`s Mastepiece. All the songs from this album, except \"If Everyone Was Listening\" were released in live versions in the \"Paris\" album, and I prefer some of those live versions than these studio versions, but I also could have prefered less songs from this album in the \"Paris\" album and more songs from other albums instead. Maybe the band considered in the seventies this album as their peak, but I prefer other albums by this band.Yes, it is a good album.Roger Hodgson`s vocals sound to me a bit different in comparison to other albums. I don`t know if other people thinks the same about this. \"School\" has good lyrics and a very good piano solo. \"Bloody Well Right\" is a song influenced by Blues with good guitars.\"Hide in your shell\" has interesting lyrics and it is sung by Hodgson with feeling.\"Asylum\" has funny lyrics about someone who doesn`t feel good and is considered as \"crazy\" enough by other people to be send to an \"mental asylum\". \"Dreamer\" is a commercial pop song which was a hit and I don`t like very much. \"Rudy\" is one of my favourite songs fom this album, with a very good piano and lyrics about a lonely man called Rudy (I prefer the \"Paris\" live version). \"If Everyone was listening\" is another of my favourites, with a very good orchestral arrangement. The best song in this album is \"Crime of the Century\", with very good lyrics about pollution (I think so), very good lead guitars and sax solo, plus a very good orchestral arrangement (I prefer the live version of the \"Paris\" album as it is more \"intense\" in feeling). Hodgson said in some interviews done in the 90s that this was the last album on which Davies and him collaborated very much to justify the \"Davies/Hodgson\" names in the joint songwriting credits."
    },
    {
      "reviewer": "Bj-1",
      "date": "Posted Monday, November 15, 2004",
      "rating": 5,
      "text": "Just to start off here; this album is by far NOT a crime in any sense as this quickly turned out to be a all-time favorite of mine ever since I heard it in it's entirely for the first time, and without ex-aggerating at all; it still is! This is a dynamic and progressive journey to me, a really unique album which changes moods by each track, nothing here is bad in my book, this is pure perfection both in compositional skills as well and technical competence from the band. The writing duo of Roger Hodgson and Rick Davies here is some of the best they ever did and each track is carefully constructed in such a way that they seems to never loose their wonderful approach. After all these listens I've given this album, I still can't find something I dislike about it and it never get's dull or tiresome to my ears. This was also a major leap from Supertramp's first two releases, featuring MUCH better production and more accessible without loosing it's interesting and unique style. The additions of John Helliwell, Dougie Thompson and Bob Siebenberg to the band was another proof that Supertramp really hit a strike with this one, giving the band an entirely new and much stronger backbone.Of course, this might not appeal to every prog head in the way I like this album, but I definitely recommend this album for a listen nevertheless. It's a masterpiece of progressive music, and music in general, In my opinion, and it surpasses albums like \"Foxtrot\" and \"Close to the Edge\" with complete ease. Maybe I sound like a fanboy now, but that's really how much I like this one. I would give this one 1000/5 if possible!"
    },
    {
      "reviewer": "Muzikman",
      "date": "Posted Thursday, February 3, 2005",
      "rating": 5,
      "text": "SUPERTRAMP Reissues Part II have many fond memories of SUPERTRAMP and their music. I remember it like it was yesterday when I first heard \"Crime Of The Century\". I was visiting my brother in Boston (at the time I was around 15 years old) and the guy next door invited me in to listen to this cool new band. He proceeded to roll up a big fat one and give the record a spin. I was amazed at how different the music sounded; I had not heard anything like it before. \"Bloody Well Right\" really stayed with me for a while after that virgin listen. Although I can recall fondly all the great music that would come after that, I never got into the band as I did others of that time. It is now 2002 and nearly their entire catalog is available in the remastered form. I feel more like the new audience rather than the old classic rock fan after hearing these amazing recordings with the crisp and pristine sound.The listeners that were previously gained prior to the impact of \"Crime Of The Century\" became disappointed with the bands more mainstream rock direction. I personally feel it made them a better band and allowed for more diversification, thereby reaching a much larger audience. \"Crisis? What Crisis?\" was an earful of the prog-rock-pop combination, and a very strong statement that could have easily gained some hardliner prog heads back and bring onboard some new fans as well. \"Sister Moonshine\" served notice that they were not about to rebuild their foundation just to make it commercially ... well, not yet. \"Even In The Quietest Moments\" started to hint around that they were beginning to soften up a bit and change direction with more acoustic guitar flavorings, although it was a very strong release and good follow up to the previous release. \"Fools Overture\" was a masterstroke of musical genius clocking in at over 10 minutes. In fact, there were so many great songs on these four albums it is hard to keep track of them all. Some tracks would be become FM radio staples (and remain so today) and others huge hits on the AM radio side of the dial. There was enough mixture of genres in their sound for them to satisfy a large mix of admirers. The usage of piano, acoustic and electric guitars, soaring vocals, and all-around outstanding musicianship is brilliant on all four of these albums. The sound has become simply phenomenal with the remastering process.The combination of progressive rock and pop would prevail over the course of the first three releases. When the multi-platinum (by the 90s 18 million units were sold) \"Breakfast In America\" was released they became a full-blown rock-pop sensation, leaving all of their progressive influences behind. The featured instrument was the keyboards, when previously the guitar and keys had an equal measure of influence on all of the other releases. Roger Hodgson and Rick Davies voices played off each other beautifully, and their harmonies were so sweet and melodic. I think that they reached their peak working together on this album.After the huge triumph of their most successful album, the aftermath would result in creative burn out. I can see how it would be difficult to match the string of successful albums that they produced over the course of a five-year period. They were a literal musical juggernaut, but all good things must eventually come to end. These four albums stand as the most prolific and significant of the group's catalog. Each album stands on its own as classic renderings of rock, progressive rock, and pop.SUPERTRAMP - The Supertramp Remasters - \"Crime Of The Century\", \"Crisis? What Crisis?\", \"Even In The Quietest Moments\", \"Breakfast In America\"Rating: 5/5 (all four)"
    },
    {
      "reviewer": "Marc Baum",
      "date": "Posted Friday, May 20, 2005",
      "rating": 5,
      "text": "I bought the digital remastered version of this album as I took notice of the high ratings here. It's truely a unbelievable masterpiece! The instrumental and vocal-arrangements through the whole record are brilliant, the album got a beautiful artwork, yes it's definitely Supertramp on their early peak, even if \"Even In The Quietest Moments\" and the multi- seller \"Breakfast In America\" are on the same high level. I recommed to getl these three records, you won't be disappointed! Song-oriented artrock on the highest level!"
    },
    {
      "reviewer": "Trotsky",
      "date": "Posted Thursday, May 26, 2005",
      "rating": 4,
      "text": "I don't expect to make this sort of discovery anymore, but back in the late 80s, I stumbled upon a dust-covered copy of this album among my uncle's collection. Short of a really lame Roger Hodgson solo track in which the protagonist \" wished he was in London and really missed the queen\" I knew nothing about Supertramp. And then I heard this ... a powerful, sweeping emotional work that has always stayed with me.Crime Of The Century has the feel of a concept album ... even if I haven't got my finger on exactly what the storyline is (but then again, how many concept albums are clear based on just the songs?). Seems to me like the story of a persecuted young lad struggling through his grim schooldays. Certainly I expect that the lyrics will resonate with angsty, disenfranchised teenagers. What's more, I'll swear that the band's sound on this album influenced certain parts of Pink Floyd's subsequent concept album The Wall!Supertramp's wonderful mixture of savvy pop and classically-tinged hard rock never reached greater heights than on pieces like School, Asylum, Rudy and the awesome title track, which has a lengthy outro (based on some simple minor key piano chords) that gets me all emotional every time I hear it. The (occasionally) hard-rockin' Bloody Well Right and Dreamer both have choruses that I'm still not fond of, but they are also excellent songs outside of that. Hide In Your Shell and If Everyone Was Listening are probably the tracks I enjoy least, but they work well within the context of this album.Along with the Alan Parsons Project's Turn Of A Friendly Card and Jeff Wayne's War Of The Worlds, this is one of my favourite progressive pop-rock efforts, and is surely the greatest of Supertramp's albums. ... 72% on the MPV scale"
    },
    {
      "reviewer": "Philrod",
      "date": "Posted Thursday, June 23, 2005",
      "rating": 5,
      "text": "This is definitely the album where progressive aspirations and popular music had the greatest fusion. Supertramp succeeded to make an album that pleased both worlds, and in style. 3 mega-hits, not a bad song, a nice feeling and great melodies. \"Crime of the century'' is Supertramp's magnum opus, a masterpice in 1974, and even if nowadays it lost some of its former glory. The first song is the success ''school'', where great melodies encounter an overall feeling wich lets you with goosebumps. The piano is abolutely gorgeous, and the bass, even if it is quite simple, stands out in a beautiful way.Then arrives ''bloody well right'', a funky, happy, joyful little song with a round rythm section that lets place for some funky guitar playing. The third and fourth song are the beautiful ''Hide in your shell'' and ''Asylum'', two mini-opera kind of songs. Some lyrics will stick with you, also. Then arrives ''Dreamer'', the biggest hit on the album and the song that is attached to Supertramp's image. However, this is probably the one song that is not in the overall fell of the album, and really to me it does not stand out. It has dated a lot through the years, and nowadays it does not sound that great. However, this was a pop classic, and is still played a lot on classic rock stations. After ''Dreamer'', it is ''Rudy'' , that is probably the only song that I love more live than on the original album. The two last songs are absolutely incredible, both songs are classics, moving and touching gems. And the end of the album is also one of the great in the pop world. All around, this is a masterpiece of both the pop and progressive world, and an album everybody needs to listen at least once in their lifetime. It grows on you after a couple of listen and become the best of supertramp's career. 5/5"
    },
    {
      "reviewer": "erik neuteboom",
      "date": "Posted Thursday, August 18, 2005",
      "rating": 4,
      "text": "On this wonderful album Supertramp proved that they were a progressive rock band. OK, their sound is far more accesible than YES, ELP or Gentle Giant but most of the compositions has many flowing and captivating shifting moods, featuring great pianoplay, strong vocals and sensitive electric guitar. Another strong point is their distinctive sound, so original, melodic and harmonic, this band deserves a place on the Prog Archives site just like early Queen because both bands scouted the borders between pop and progressive in a very unique way."
    },
    {
      "reviewer": "Tony Fisher",
      "date": "Posted Thursday, August 18, 2005",
      "rating": 4,
      "text": "This is a really fine album, nearly worthy of a masterpiece rating. From start to finish, most tracks are strong and often segue into one another seamlessly. The highlights are Hide in Your Shell, a great song about mental illness, and the title track, the outro of which is powerful and dynamic. However, almost everything is good and the only weak track is Bloody Well Right, too crude for a band of this quality and the reason I have stuck at 4*. The rhythm section drives everything along effectively, Dougie Thompson being one of the most underrated bassists in rock, and Hodgson, Helliwell and Davies weave impressive melodies over the top. My only regret is the sparseness of the guitar work; they are really a 2 keyboard + sax band essentially. I know that the vocals don't appeal to everyone but I find them fine.This is prog rock at its most commercial and accessible and some diehards can't accept that bands can release hit singles and sell bucketloads of albums and still remain prog. Well this was one of the biggest selling albums of the seventies and it is undeniably prog. Should be in everyone's collection, so buy it!"
    },
    {
      "reviewer": "Raff",
      "date": "Posted Saturday, November 12, 2005",
      "rating": 5,
      "text": "I can still remember when I first listened to this album, over twenty years ago. It literally floored me, and since then it's ranked among my all-time favourites. Supertramp may have the reputation of being somewhat 'prog-lite', but boy, could they play and write superb songs at the time! Even a really 'easier' album like \"Breakfast in America\" can still show many bands how to go about writing tracks which are at the same time catchy and musically complex.\"Crime of the Century\" is much darker than you could think, especially if (like me at the time) you first got to know Supertramp through \"Breakfast in America\" and hit single \"The Logical Song\". The album is a sort of concept, the lyrics dealing with such weighty topics as education, loneliness and alienation. The music is strongly keyboard-orientated, with a rich, almost orchestral feeling to many of the compositions. The two lead singers, helium- voiced Roger Hodgson (even higher-pitched than early Geddy Lee, but very effective throughout) and the deeper, gruff Rick Davies, complement each other perfectly, especially when singing different parts of the same song; they are also the main writers in the band.As to individual tracks, the only weaker links are the rather slushy \"If Everyone Was Listening\", where Hodgson's vocals sound a bit too plaintive for comfort, and the poppy \"Dreamer\" with its lame chorus. The other tracks are all very strong, but some stand out from the rest: the opening \"School\", building up slowly from its acoustic beginning to a middle section with wonderful, frantic piano by Davies; the lively \"Bloody Well Right\", sung by Davies in an almost aggressive way in order to complement the angry lyrics; \"Rudy\", sung by Davies at the beginning, with the two vocalists playing each other off and finally joining their voices in the urgent, almost frantic final section; and obviously the dramatic \"Crime of the Century\", which consists mostly of a haunting instrumental crescendo underpinned by J.A. Helliwell's mournful sax. Though this album is over 30 years old, it still sounds fresh and moving. I can't recommend it highly enough to all lovers of great music."
    },
    {
      "reviewer": "E-Dub",
      "date": "Posted Sunday, February 26, 2006",
      "rating": 4,
      "text": "This is such a great disc I don't even know where to begin. The leadoff track for starters almost sounds like something from The Wall; but, when \"School\" kicks in it's undeniably Supertramp. Hearing Davies and Hodgson interact is something I really miss on Brother Where You Bound.Scattered throughout are staples on classic rock radio (\"Bloody Well Right\", \"Dreamer\", etc.); but this album is full of great songs you NEVER hear on FM radio. \"Crime Of The Century\" and \"Asylum\" are dark and brooding and full of anger. Especially love the haunting piano outtro on the title track.This album is beautifully produced and arranged. Stands up very well today, which is a testament to Supertramp. The fact they are excluded from the Rock And Roll Hall Of Fame only proves what a fraud that establishment is."
    },
    {
      "reviewer": "ClemofNazareth",
      "date": "Posted Tuesday, May 16, 2006",
      "rating": 5,
      "text": "Full disclosure right off the bat– I totally love this album. I’ve read more reviews on Crime of the Century than I can count, and won’t even attempt to navigate through the mire of the argument as to whether Supertramp is a progressive band or not (don’t really care). I will say that the internet is littered with stories of folks who obsessed on this album, scored their first conquest, had an epiphany while listening to it, or otherwise claimed a life-changing experience as a result of hearing these songs. I won’t go that far.But I will say that I would trade any of the five-star rated albums on these archives for Crime of the Century without batting an eyelash, including those I have previously rated among my favorites. It’s that good.Some have said that Roger Hodgson copped Pink Floyd for much of the theme of this album, which is largely a loosely-themed album about insecurity and mental illness. Well, maybe - but this theme certainly found its way into the Floyd repertoire much later with The Wall, so who’s to say which band influenced which. I myself am working a theory that not all of what became the theatrical experience we know as Fish came solely from Peter Gabriel. Seriously, do the math – Fish was sixteen years old when this album released, nearly a decade before Script for a Jester’s Tear. It’s almost inconceivable that he didn’t hear it, or even own it. Like Hodgson, Fish began writing songs at a rather early age, and many of them are about very personal topics like addiction, anxiety, and social detachment. Fish has a penchant for adding spoken word and poetic passages to his music, something that Supertramp was well known for. And I personally can’t listen to the rhythm of “School” without inevitably calling up “He Knows, You Know” in the back of my mind – don’t know why, it just is.Anyway, that’s probably just me.Regardless, this is an album that a few have panned as dull, simple, unimaginative. But they are the very few. By and large most who have heard it readily acknowledge that there is something about it (probably many somethings) that just grab the listener in a very personal way. Part of it is the very intimate way that Hodgson and Rick Davies share the stories of marginalized youth, desultory and addled old men, and social outcasts as openly as if they were singing about puppy love. Part is the liberal use of minor chords in the complimentary (but not dominating) guitar work. And part is the ear- grabbing electric piano and keyboards Davies and Hodgson use to simple but stunning effect throughout. But mostly it’s just the combined effect of all of these on the overall musical experience.The opening harmonica of “School” sets a surreal mood that the listener can’t help but be drawn into. Hodgson’s voice, the same one that would crank out the interminable Breakfast in America pop mega-hits just a few years later, is hypnotic and at the same time engaging here. Bowie tried to achieve this level of connection with the disaffected youth of this same generation with “Changes” and “Young Americans”, but not anywhere close to this convincingly. You can’t help but shout out “damn right!” once and a while during this song. The piano solo may not be a complex arrangement, but it’ll raise the hair on the back of your neck –- every time. Some intense guitar riffs toward the end are very uncharacteristic of Supertramp, but really help to establish a mood of discord and anxiety, which is what this song is all about. We didn’t all glide through the grammar years singing school fight songs and dancing in the gym, and “School” lets us know we were not alone.Some more light and funky piano, accented with Davies’ organ-like keyboards to kick off the well-known “Bloody Well Right”. This was the b-side to the UK hit “Dreamer”, and it became a hit single in its own right in the US. Davies’ deeper tenor voice over the top of the leading guitar almost has the sound of some of the seventies redneck staples like Lynyrd Skynyrd’s “Don’t Ask Me No Questions” or “What’s Your Name”, but John Helliwell’s jazzy saxophone kicks in quickly enough to dispatch that comparison. This is the ‘go lay down by your dish’ song, catchy music but biting lyrics about social stigma and fleeting promises of a bright future, almost as if Hodgson were describing the departure of the guy in “School” out into the cold, hard world. Like I said, there’s a theme here, albeit a rather loose one.“Hide in Your Shell” is one of the darker songs on the album, and the emergence of the inner voices in our little demented protagonist. This is “Empty Spaces”, “One of My Turns”, and “Goodbye Cruel World” all rolled into one:“Hold yourself down, hold yourself down - why do you hold yourself down?Why don't you listen - you can trust me.There's a place I know the way to - a place there is need to feel, you feel that you're alone.Hear me - I know exactly what you're feelin', ‘cause all your troubles are within you.Please begin to see that I'm just bleeding too. Love me, love you, loving is the way to help me help you –Why must we be so cool, oh so cool? Oh, we're such damn fools…”Wow - nothing wrong with this guy!The next logical stage is “Asylum”, a quiet, brooding piano work where that chameleon Davies actually manages to give a passing resemblance to Billy Joel ala ‘Piano Man’. A few twangy guitar licks and drum rolls here and there, but this is pretty much the man and his keys rambling on about his tenuous grip on reality, fully accompanied by deranged cries and mangled notes scattered about. I don’t know where the violins came from – either from Hodgson’s keyboards, or I’m hearing things myself. Creepy!Then it’s on to “Dreamer”, the peppiest rant about madness you’re likely to ever listen to. By now the voices in his head are not only shouting, they’re rhyming and harmonizing as well. This was the American hit single, which goes to show that the theme part of this album was largely lost on the listening public some thirty-two years ago. We’re back to Hodgson’s singing here for some reason, probably because he sounds even crazier than Davies. Something about an alto male voice with a British accent – it’s like a recipe for foaming-mouth bat-sh!t crazy ramblings. But at least the pulsating keyboards and funky bass keep things moving along swimmingly.A comment here – I’ve read that the live version of this album is really a moving stage production, accompanied by animated cartoons on a backdrop screen, haphazard use of old movie clips and stills, and even seemingly choreographed movements of the players. Hmmm, where have we seen that – before and since?“Rudy” is the pinnacle of this album, no question, or the abyss if you happen to be Rudy, I suppose. Very somber piano and minor, depressing guitar chords set a nostalgic and brooding mood for the now man-child who’s wandering the city by train and seeking some sort of, I don’t know what – take your pick of emotional words: deliverance, redemption, or just plain release. The music here would make for some funky jazz if the topic were just a bit less pitiful. This almost borders on some of the earlier Chicago sounds, although certainly not as expansive. Again more background theatrics in the form of crowd noises, engines, and those damn violins again (who’s doing that anyway?!).“If Everyone Was Listening” is short, and signals the nearing end. Another sad tune that plays like the closing lines to a morbid musical – “oh no, please no – don’t let the curtain fall”!So what is the “Crime of the Century”? I don’t know, haven’t figured it out even with thirty-two years of listening to this classic. Maybe you can:“Now they're planning the crime of the century - well what will it be?Read all about their schemes and adventuring, it's well worth a fee.So roll up and see, and they rape the universe, how they've gone from bad to worse.Who are these men of lust, greed, and glory? Rip off the masks and let's see.But that's no right - oh no, what's the story?There's you and there's me - That can't be right.”……………Five stars.peace"
    },
    {
      "reviewer": "Alucard",
      "date": "Posted Wednesday, June 7, 2006",
      "rating": 5,
      "text": "'Crime Of The Century, 'Supertramp's third studio record, was released in 1974. Contrary to former and later Supertramp records it is very melancolic and bluesy giving the record a charme that most other Supertramp records unfortunately lack.The record starts with a slow blues : a harmonica opening, not unlike the lonely harmonica theme in 'Once upon a time in the west' , mournful vocals,clarinet ,guitar, a short break, followed by a midtempo groove with a funky guitar riff, an E-piano pattern, marimba counterpoint a piano solo .'School' is an excellent opening track.'Bloody well Right' lightens up the mood with it's major piano intro,before a funky guitar leads to a heavy rock riff, a honkytonk piano in the chorus and a sax solo ends another great track, followed by 'Hide in your Shell' a minor tune, that establishes a nostalgic ballroom athmosphere of days gone by.Side One ends with 'Asylum' a medium tempo Blues with a great arrangement for sax, organ and strings, and the nice piano melody of the beginning as a fade out: just perfect.Side two starts with a great Pop song : 'Dreamer' driven forward by piano block chords a great melody line and a great vocal arrangement.After the lighter side of 'Dreamer' another slow Blues 'Rudy' evolving into a light shuffle and climaxing into a heavy funk, with a great string arrangemnet, before fading out with a melancolic athmosphere , followed by 'If everyone was Listening' one more nostalgic medium tempo blues with clarinet and strings.'Crime of the Century' a brillant closing track starts as a heavy blues and leads into a long instrumental passage for piano and strings before a delicate echo of the opening harmonica closes the cycle of a perfect record.A perfect masterpiece of melancolic Bluesy Prog."
    },
    {
      "reviewer": "Certif1ed",
      "date": "Posted Tuesday, August 15, 2006",
      "rating": 5,
      "text": "A Masterpiece? Bloody Well Right!After a 3-year break from releasing studio albums, with their third line-up, Supertramp (aka Messers Hodgson and Davies) unleashed their third album on an unsuspecting world.Unsuspecting, because the first two albums had hardly been international hits, with the first receiving very little interest - and various band members simply left or had nervous breakdowns under the pressure.\"Crime of the Century\", then, was a less meandering and more professionally polished affair than its predecessors - less Progressive Rock and more Progressive Pop in feel, with a kind of loose concept running through the album, and a production that's slicker than slick.It would be a complete mistake to put this album down as some kind of elaborate pop record, though, because once you get past the accessible melodies and intricately layered arrangements, there are songs that defy standard songwriting stuctures with compositional techniques and musical developments that are truly up there with the Prog Rock greats.Full of DoubtLyrically, \"School\" reflects the doubt that was still inherent in the band members - and the fiery resolve not to follow the path from classroom to office. The dichotomy is well reflected in the music, with the melancholy harmonica giving a haunting blues train whistle, and a deep, dark organ subtly back-filling with a line that will be of more importance to the overall structure later in the piece.A picked guitar is soon joined by Hodgson's melancholy tenor as the first verse gets underway, a clarinet doing a passable imitation of a Cor Anglais. The verse ends mysteriously with guitar feedback sugueing into sounds of children in the playground and haunting atmospheric synth sounds. The feedback returns and intensifies, and a child's scream heralds the second verse - noting that there is no chorus in this song.The second verse sees the bass and percussion making their first appearance - over a minute and a half into the song. The flat four nature of this verse creates a simple but very satisfying texture - which is all broken up by the last line of the verse, as Hodgson howls the chilling line \"But you're full of dooouuuubt!\".An electric piano motif insinuates its way into our consciousness, the guitar feedback returns and other instruments pick up fragments of this motif, altering it, stretching it and generally playing mischievous games with it before joining forces for a bit of a boogie-fest that modulates smoothly a few times before diving into a dark and sensuosly heavy riff barking out the order \"Don't do this and don't do that...\"This piles straight into the final verse, in which the melancholy clarinet makes another appearance in the texture.\"Bloody Well Right\" comes as a bit of light relief after all that dark melancholy, with a jaunty little electric piano line leading the way to a \"talking\" guitar line over a solid bass pedal. This suddeny drops into a heavy riff that the Eagles may well have borrowed for \"Victim of Love\".Lyrically, the song is a continuation of the \"We don't need no education\" ethos of \"School\", and a bitch at the (over-)priveleged.Musically, it's a bit of a throwaway compared to the rest of the genius on this album - but the groove and sax solo are satisfying enough.\"Hide In Your Shell\", though, is where we get a bit more serious. The drama in the music is tangible as the lyrics unfold their tale of a paranoid mind, and the addition of the Theremin is simply spine-chilling. The contrasts between the various sections paints a dynamic picture full of lights, shades - and even colours, as various instruments shine through the texture, all expertly implanted in the correct place - but without any feel of surgical precision, rather a pure and organic unfolding and development of a brace of musical ideas, full of space where required, yet densely textured and richly musical.Above all of this, Hodgson sings with an impassioned, deeply soulful and emotional tone, without ever getting cloyed down with saccharine - his high tenor pushed to the edge of breaking in places, increasing in intensity as the song pans out, with intuitive backing harmonies.\"Asylum\" maintains this quality - the paranoid protaganist who was hiding in his shell now freaking out about the possibility of being locked up. The piano part plays like a simiplistic piece of \"Classical\" music, albeit with a soupcon of swing, and is quite intriguing to follow instead of the melody line - it's interesting to hear it develop and modulate underneath the vocals.As with School, at the end of the second verse, a new and darker musical idea threatens to break through - but Supertramp surprise us with music of an altogether more optimistic quality for something that sounds like a chorus in a big and massive sense - but quite clearly isn't!Also notable is the synth \"orchestration\", which is particularly artfully orchestrated. The bells in the final chorus really add a special something.The vocals get ever wilder and impassioned as the song progresses, and our \"hero\" appears to be losing his mind piece by piece - to the very final scream; \"Not quite right!!!!\".Really, this song justifies the pirce tag alone - but we get another side, pop-pickers!A chart hit, \"Dreamer\" does not let up on the musical quality for a second - despite the instantly accessible and insanely catchy melody and light bouncy electric piano, there's the slinky, sultry bassline and impossibly 1970s wah-wah to contend with - all fighting for a place in your awareness simultaneously, and when the lead vocals and harmonies get madly panned around the stereo picture, you just know that this song was made to be heard by an audiophile.See, it's not just a great and catchy pop song, it's an excercise in artful arrangements and wierd instrumental techniques - listen to the drums and the xylophone at the end.From here it just gets better. I won't cover anything in Rudy - just trust me, if you liked what you've heard (or read) so far, this one will blow your socks off.\"If Everyone Was Listening\" is a kind of respite of sorts from the onslaught of quality. The melancholy beginning gives way to optimism for a while - and the optimistic glow remains as a kind of halo around the ensuing song.The title track then closes the album with a bang - everything we've had so far, and the kitchen sink. The slow 6/8 feel of the piece gives it both a 3 time swing and a duple pulse that drives the Latimer-esque guitar solo to almost epic proportions - and then there's THAT piano fanfare and everything that follows it.Spine-chillingly good, prog-pickers!SummaryNo need to Summarise.It's an all-time great album. Buy it - don't muck about."
    },
    {
      "reviewer": "Seyo",
      "date": "Posted Sunday, August 27, 2006",
      "rating": 5,
      "text": "From the opening sounds of Rick Davies' harmonica and gentle vocal of Roger Hodgson in \"School\", until the fading out of the saxophone-driven, mystical and chilly atmosphere of the title track, \"Crime of the Century\" is a definite masterpiece, the best SUPERTRAMP album and one of the highlights of progressive rock! Nothing more to say, you have to go get it and listen..."
    },
    {
      "reviewer": "Cesar Inca",
      "date": "Posted Saturday, January 6, 2007",
      "rating": 4,
      "text": "Being my first prog/art-rock love, Supertramp has always preserved a special place in my melomaniac heart through all these years up until now. No wonder why their third effort \"Crime of the Century\", generally regarded as their finest hour, still sounds so great to me even in the new millennium. But my consideration for this album is not only from an emotional perspective, but also for a rational standpoint. This band really knew how to call for the listener's mind with their stylish well-constructed songs and the listener's heart with their candid, soulful musical invocations, and this dual quality finds in this album its ultimate expression. All the way from the opening harmonica lines of 'School' toward the fade-out of the somber yet majestic closer namesake track (which, by teh way, also includes a reprise of the harmonica lines), Supertramp leads the listener through a journey of beauty and emotion. Unlike the two posterior albums, this one keeps a very interesting and subtly disturbing depressive aura to it, and at the same time, it also bears a very majestic vibe, due to the moderately recurrent use of orchestral background and the predominance of keyboard input in the repertoire (at the time, Hodgson seemed really very enthusiastic about his new piano skills, so his guitarists' role was relatively subdued here). This album is so full of classics, consistent live staples until Hodgson left the band - the opener 'School' is one of them, providing a criticism of the schooling system within the grander scheme of modern society's rules. All three newcomers show their valuable input right away: Siebenberg displays his solid drumming and effective ornaments on various percussions, Thomson complements Siebenberg's work perfectly, and last but not least, Helliwell appropriates the song every time he does a sax or clarinet solo. His stage presence is nothing but an extension of his powerful instrumental skills. But perhaps this song's most famous solo is that on piano by Davies, adding a nice touch of subtle Latin-jazz flavors to the mid section. 'Bloody Well Right' displays a cynical second look at the schooling thing in a very Davies-esque manner: the sax solo at the end is awesome, elegant, constrained yet colorful. 'Hide in Your Shell' is one of the album's highlights, one of the most explicitely emotional compositions by Hodgson: a very haunting hymn to intelligent friendship, so candid, even naive to a certain degree, yet moving in a unique way like only a friend's love can move you. No friendship but lonelinss is what the old man protrayed in 'Asylum' has to endure: Davies finds a large room for his dark vision about humankind in this subject. The string arrangements help the song to get increasingly tight as it progresses. 'Dreamer' is the album's funny commercial tune, and let me tell you that it is less optimistic than it appears to be: a hit, and deservedly so. The last three songs epitomize so well the album's general dark mood that they might as well be considered as real samples. 'Rudy' is not related to funny moods, but to the troubles of the inner self in reclusion. This track is ambitious, majestic, solid across its mood and motif shifts, with a very passionate rocking climax and a most vulnerable second climax: arguably the best Davies composition ever. One of the least known Hodgson compositions, 'If Everyone was Listening' deserves more recognition among prog rock and Supertramp fans: one of the saddest songs ever written by Hodgson, it portrays a feeling of confusion and desolation with distinction and genuine emotion. The namesake closer is another gigantic Davies number, a mysterious, concise tale about the universal evil of man: Davies delivers his lines with a mixture of fear and seriousness, and later on, the piano recurrent motif displays a basis for the other instruments and the string section. The sax solo is haunting, like a psalm read in memory of the human race. \"Crime of the Century\" is an album in which musical intelligence and emotion are combined in a perfect marriage: not the only Supertramp good work, but definitely, their finest hour."
    },
    {
      "reviewer": "ZowieZiggy",
      "date": "Posted Sunday, February 4, 2007",
      "rating": 5,
      "text": "This was my entry album for Supertramp. I bought it on a school trip to London in February 1976. What a shock, my boy ! The fantastic pair of composers and singers are at their best. This golden era will last for about five years before the decline and the personal problems between Hodgson and Davies will take place. But let us start first with the positive side. Straight from the first notes of \"School\" you know that something big is going to happen. There is no crime to love this album. The harmonica (or mouth organ) intro � la \"Once Upon A Time In The West\" is just fabulous, as the whole track is. Vocals are superb, piano and background guitars are so right in tune. A marvelous song. One of my Supertramp fave, all time.The jazzy \"Bloody Well Right\" is a good transition track with good sax work. Rick wrote it on his Aunt Lillian's piano in Swindon. He originally learnt to play on this specific piano...It leads us to \"Hide In Your Shell\" which is a very melodious and passionate track. Vocal arragements are superb. The chorus with the sax in the background is a great moment in pop music. \"Asylum\" is a darker song about madness from Davies. It closes side one superbly.One of their best known song \"Dreamer\" opens side two and is again a wonderful pop song with fabulous harmonies, keys / piano playing. Even if this song has been aired regularly on the radio, I still like it very much more than thirty years later. It is the type of song which you love at first listening. The dream goes on ...\"Rudy\", another Davies track, is less pop and more sophisticated (probably the most elaborated track on this album). It has a rock-opera flair : rhythm changes, instrumental breaks, strange story. What a track !\"If Everyone Was Listening\" is a light and easy listening tune with beautiful vocal harmonies. According to Bob Siebenberg, the very first Supertramp material anyone from the band heard broadcast on radio. Bob and his wife were browsing in a junk yard close to the house the band were renting when a woman pushing a baby's pram appeared. As she passed by, they realised that she was listening to a little transistor radio slung from the handles. What's more it was on and she was listening to \"If Everyone Was Listening\"! They stood transfixed and listened as she faded off into the distance. Bob claims it as his favourite song - no wonder !It is a starter for the grand finale, the title track. Probably one of the less commercial of the album. It will close their concerts for quite a time with the final piano notes playing for ever (well, almost).Although very much acclaimed on this site, the record was not unanimously apreciated in the rock press at the time of release. John Mendelsohn, from the UK Rolling Stone will write : \"Virtually every track on this album seems to last twice as long as the actual music warrants, a vastly disproportionate amount of needle time seems to be devoted to pauses which, one guesses, the 'Tramps want us to find rivetingly portentous, but in fact are only tiresome. Because, in addition to appreciable instrumental dexterity, they seem to possess the rare ability to harmonize handsomely. One is rendered sleepless by the desire to lock them in a room with the first few Beatles albums until they're convinced that it's possible to be as dynamic and atmospheric in two and-a-half minutes as in five.They ought, in addition to instructing their tape-op to allow no single track to last longer than 200 seconds, concentrate more on melody\". I wonder how many stars this would have represented...My opinion is that there is not a single weak track, several great songs and a few masterpieces. What else than a five stars rating would apply ?"
    },
    {
      "reviewer": "Mellotron Storm",
      "date": "Posted Sunday, February 11, 2007",
      "rating": 5,
      "text": "Hodgson and Davies were like a Lennon and McCartney, each writing seperately and sharing in writers credit. Hodgson sings the songs he wrote, and Davies sings the songs he wrote. On this release they sing lead on 4 songs each. This album has been compared to \"Dark Side Of The Moon\" because of the subject matter, songs about everyday life and mental illness. I was in highschool in 1979 when I first got this record. I was listening to this at the same time \"Breakfast In America\" was out and I remember getting into an argument with a friend because I wanted to listen to \"Crime Of The Century\" and he insisted on listening to \"Breakfast In America\". The thing was, I never argued being a mellow person, but I was passionate about this (We listened to \"Breakfast In America\"). After all these years I still feel this album is far superior to \"Breakfast...\" as a matter of fact this album still sounds so fresh and current.Things get started with \"School\" and it opens with a mournful harmonica solo before Hodgson's vocals come in.The beautiful piano melody is the centerpiece of this song. Nice. \"Bloody Well Right\" opens with piano as the guitar comes in from Hodgson with an edge to it, quite aggressive at times. These guys had such a sense of humour as witnessed by this song (and look at the back cover of the album). There is a beautiful sax melody to end the song. \"Hide In Your Shell\" just touches my heart for some reason. This is such a gorgeous song. Hodgson's emotional vocals are outstanding.\"Asylum\" opens with some beautiful piano and is a theatrical song with some string arrangments.The song ends as it began with some nice piano. \"Dreamer\" is an uptempo song with good vocals from Hodgson and some good harmonies as well. \"Rudy\" has a jazz feel to it at times. I love the way Davies and Hodgson trade vocal lines. \"If Everyone Was Listening\" is a reflective song that looks at life as a play. There is an uplifting melody and some clarinet as well. \"Crime Of The Century\" is a classic ! With Davies on vocals this song has some good guitar, sax, piano and strings.This is an absolute masterpiece ! It's impossible to put into words how this album makes me feel."
    },
    {
      "reviewer": "Chicapah",
      "date": "Posted Monday, May 28, 2007",
      "rating": 5,
      "text": "It's extremely embarrassing to forget how overwhelming some classic albums can be but that's what has happened to me with \"Crime of the Century.\" I guess it's somewhat excusable considering all the music I've collected over so many years but rarely do I pull an LP out of the stacks and find myself going ga-ga over songs that are well over three decades old but that's the case here. These tunes are still as relevant and astonishing as they were in 1974 and that's no exaggeration.At that point in time progressive music (with the exception of the eternally popular \"Dark Side of the Moon\") had drifted off the radio play lists. ELP's \"Brain Salad Surgery\" had come and gone the year before and neither Yes' \"Relayer\" nor Genesis' \"The Lamb Lies Down on Broadway\" were exactly conducive to being heard on even the most liberal FM station. The atmosphere was ripe for something new that contained all the elements of the best bands and artists of the early 70s and Supertramp was there to fill that prescription. While some might argue that the total sum of the group's career output categorizes them as artsy pop, there's no doubt in my mind that this album in particular is nothing less than imaginative, progressive rock in its purest form.The soulful harmonica wailing over a very ominous undercurrent will make your prog antenna stand up straight as \"School\" starts things off perfectly. A well-timed, bone- chilling child's playground scream kicks the band into a driving rock beat that will dispel any notions that this is going to be lightweight fare. I'm not sure this really qualifies as a concept album but there is a theme of being introverted and \"different\" that runs through the majority of the songs and this is no exception. (However dark or depressing the lyrics may get at times, however, there is no sense of doom or despair manifested and that's one of its many charms.) Roger Hodgson's piano lead is exemplary and the song, like everything on this record, is a model of intelligent arranging.I can only speak for those of us living in North Texas in that era but, with \"Monty Python's Flying Circus\" TV show being all the rage (Dallas' PBS affiliate was the first to air it in the US), anything remotely British garnered immediate attention. That's just one of many reasons that \"Bloody Well Right\" was the right song at the right moment. For one thing, vocalist Richard Davies didn't try to suppress his accent and the undeniable, tongue-in-cheek irony of the song made it irresistible. You gotta love the clever electric piano intro and the fat horn section sound as well as the lumberjack chorus. John Anthony Helliwell's upbeat sax phrasing toward the end gives the tune a nice Traffic feel, too.I'm so enamored with \"Hide in your Shell\" that it's nearly impossible to describe it. I'll just say that it may well be one of the most melodic tunes you'll ever hear and if you can imagine a blend of Genesis and The Beach Boys you might get some idea of how great this song is. The superb dynamics written into this number keep the song from ever becoming predictable.\"Asylum\" starts with a simple piano and vocal, giving it a narrative quality that highlights the poignant lyrics. The singer pleads \"Don't arrange to have me sent to no asylum/I'm just as sane as anyone/It's just a game I play for fun, for fun.\" It has a palpable Elton John aura to it throughout that oozes class. (Don't knock Elton. His early 70s work bordered on prog from the get-go). Pay attention to Davies' vocal. It's both defiant and sympathetic at different junctures of the tune to great effect.I know many of you are tired of hearing \"Dreamer\" but when it first came out it put fresh back in the word \"refreshing.\" It was then and for all time to come an honorable single that avoids the hackneyed verse/chorus formula that characterized so much of Top 40 radio in those days.\"Rudy\" is a nice change of pace. It almost has a Billy Joel-like, contemporary New York feel to it (except that Mr. Joel was still in his \"Piano Man\" phase in 1974). This song, like the whole album, is a journey through varying musical moods and sequences but it's the incredible orchestral score that will demand your attention. It's out of this world.\"If Everyone Was Listening\" has a nostalgic air to it that brings to mind the Beatles mixed with Elton. I get the feeling that it's an ode to the failed utopian dreams of the 60s flower-power generation with lines like \"If only we had listened then/If we'd known just how right we were going to be/For we dreamed a lot/and we schemed a lot/and we tried to sing of love before the stage fell apart.\" This time Helliwell adds some cool clarinet to give it just the right feel. And I must mention the flawless rhythm section of drummer Ben Benberg and bassist Dougie Thompson. They are solid as granite from the first tune to the last.I can't decide if the apex of the album occurs on \"Hide in your Shell\" or on \"Crime of the Century\" but I know in my heart I'm leaning toward the latter. It's as challenging to the senses as anything from Pink Floyd (and that's a huge compliment) and the piano sound, as well as Hodgson's guitar work, is strikingly pristine. The subject matter of pinning blame for the pollution, corruption and unabated greed of the world on some imaginary, corporate \"men of lust\" when the trail ultimately leads right back to our own doorstep is eye-opening enough but it is the exquisite, gorgeous instrumental middle and end that will devastate you. I mentioned Elton's music earlier and it was the majestic orchestral scores supplied by Paul Buckmaster that elevated much of his music into the stratosphere and Richard Hewson does the same for Supertramp here. I actually get an emotional lump in my throat as it builds and builds to the dramatic climax. Unbelievable.Supertramp went on to become a hit machine and a lot of folks think only of those chart- toppers when they hear their name mentioned but make no mistake. In 1974 they created their masterpiece with this album and it still packs a potent prog punch today while sounding as high-fidelity as an Alan Parsons project (pun intended). And, while I mentioned several bands and artists of note during this review I hope you don't get the impression that the music is derivative. On the contrary. I dropped those names only to convey the lofty plateau these songs reside on. Now that I have re-discovered this gem I plan on putting it into heavy rotation on my listening schedule and I suggest you do the same. You won't regret it."
    },
    {
      "reviewer": "Queen By-Tor",
      "date": "Posted Sunday, August 26, 2007",
      "rating": 5,
      "text": "So begins the classic Supertramp era.While they may not be the absolute most conforming-to-prog band out there as others may (King Crimson, Pink Floyd, Ect.), Supertramp still delivers progressive flavored music that's accessable to many, and this album is no exception. Perhaps their best bunch of songs, Crime... is a delightful mix of serious topics with a kind of fluffy structure. I once went about thinking that Supertramps songs were merely fun and playful, and they are, but only in sound. If you've ever really listened to a Supertramp song, you'll find that many of the lyrics are actually quite heavy (ASYLUM and Take The Long Way home from Breakfast are a couple good examples.). Anyways, now that I'm done wandering away form my topic I'll start the review.Many of the tracks from this album you've likely already heard, with songs like SCHOOL, BLOODY WELL RIGHT and DREAMER being very radio friendly. This is for a reason, however, as DREAMER is quite catchy, while who could forget the magnificent piano solo in SCHOOL? Classic. Some of the best songs however are the ones seldom heard. HIDE IN YOUR SHELL is a particualr standout with a nice somber intro that quickly transforms (with a snap of the fingers. Literally.) to a hard hitting trip that features great vocals and all around instumentation. Another very often forgotten song is the title track, though slow and quiet, it features some very progressive progression and (again) instumentation. ASYLUM and RUDY are the two longer tracks that feature Davis as the main vocalist, and he does quite a job. Good enough, in fact, for those who dislike 80s 'tramp to forgive him of what he would later do.All around this is a great offering that demands visiting and revisiting. For those who doubt Supertramp's power as an album band or have only heard their singles I strongly recommend this album, you will not be let down. 4.5 stars (rounded up). An increadible album, and a great addition to any prog library."
    },
    {
      "reviewer": "Dim",
      "date": "Posted Friday, September 21, 2007",
      "rating": 4,
      "text": "A good piece of music if you are into any kind of artistic music at all! I've always found this band extremely fun, and never too serious to devote extreme concentration to. I honestly don't know what actually makes this album so good, but it is all the same. With two and a half lead vocalists and enough electric piano to make you go half insane, I have already laid down the basics to a good prog album. One thing that actually does stick out from the normal prog grup is the lack of synthesizers and guitar, most of this albums lead instrumentation is led by different forms of classical and electric piano's. Besides the lead instruments, the drumming is what I find absolutely great, because if there wasn't Benbergs typical rock beats, you wouldn't be sure if you were listening to jazz or swing. Anyways tha album...I find the openr to be one of the strongest and most experimental, opening with a mournful harmonica that you might here in a Zeppelin song... but good. Then comes the vocals with a little bit of electric guitar which explodes into an eerie muted wah part with some cool electric pianos and guitars harmonies while Hodgson sings about a boy who is not a big fan of school. This of course escalates to an awesome piano jam with everyone in sync with everybody perfectly, even with the odd jazz chords. The song reaches it' climax then quickly drops out to close. Bloody well right, the signal of the album is also another experimental song with some excellent electric piano in the beginning with tiny half second long bursts of horns. This leads on to a wah solo, and then drenched with saxophone and Hodgson and Davies singing some outrageously British lyrics about how right people are about the huge importance of money. A great fun song that's easy on the ears, but still very \"off the map\". I've nevr really connected with hide in your shell too much, it's not that is a bad song, it's a great song, but I personally don't attach to the song. With very melancholic lyrics and of course lots of electric piano. The Hodgson vocals are beautiful though, even with the apparent lack of range. Asylum is easily my favorite song on the album, with Davies belting out some awesome lyrics of a snobby man slowly losing his grip on reality and denying it, though he clearly sees it taking over. The song slowly climax's from piano and vocals to a huge crazy ending riff, sounding like a monster slowly creeping towards you. Dreamer, a very funny song, that some people would argue to say that it is too poppy or catchy to even be considered progressive, but I don't care it's hilariously awesome, with Hodgson talking about how much he hates the stupid dreamers he encounters every day. Rudy is a very crazy song, that goes from smooth and jazzy piano to a very rocky and spacey jam session, kinda like what they do on fools overture. The song certainly isnt epic, but the concept behind the lyrics and all the places the music goes definately does constitute one. If everyone was listening is another fun song, but with a more serious attitude about world wide problems or something in that side of the musical cosmos. I'm not sure what to say about this song musically, if you want me to be perfectly honest, I havent really studied this song nearly as much as the others. The title song and closer is obviously the one that has progressive written all over it, about some guys gossiping that the crime of the century is about to happen, and they are wondering how it's gonna go down. This is only about ten lines of lyrics, then the jam session to end all supertramp sessions, starting with simple crying piano chords, then immediatly builds to a simple rock beat, and of course builds on to huge layers of sounds and a million instruments. Then the album ends...I'm easily most impreesed with Davies masterful classical piano playing, which you can easily here some fiftees swing and jazz in it, which only lets the band experiment of genres while all under the huge umbrella of artistic rock. Hodgsons electric piano's are always great and his subtle guitar playing is that of which Hackett does with early Genesis, precise notes to be played at the perfect moment to fully portray the sound the band is trying to emit... or just get some wka chuks's going on with his wah pedal. The rest of the musicians are mainly just staying firm to their rolls as a rythm player, as I've already mentioned earlier, Benberg's drumming is what keeps supertramp under that \"rock\" umbrealla I talked about. Honarable mention to Heliwells excellent woodwind playing! Overall...4 stars"
    },
    {
      "reviewer": "Dean",
      "date": "Posted Friday, September 28, 2007",
      "rating": 5,
      "text": "Crime of the Century is a rare album in my collection, rare in the sense that it is only one (out of a couple of thousand) that I did not buy myself or have bought on my behalf with my prior knowledge. It was given to me by someone who just thought I might like it, without knowing whether I liked Supertramp or even if I wanted it and if they had asked beforehand, I would have probably said no on both counts. It was 1974, I was 17 and I was like that then. To say I looked perplexed would just about sum up the embarrassing wordless moment as I tore the gift-wrap from album and stared at the sleeve. What? A pop record? They even had a single in the charts, Dreamer, right? .Crestfallen is another word. The giver looked upset, the receiver smiled unconvincingly; there was mumbling, more embarrassment, averted eyes, another uncomfortable smile and a polite, mumbled 'thank you'.It wasn't even my birthday.Later, at home, I fell in love at the precise moment the stylus hit the groove, life is like that at times, rare, special times. That plaintive harmonica wail, like a warning in the fog; a shiver down my spine as the real music begins: a Wurlitzer piano, a subtle clarinet, a guitar, some children in a playground - a girl screams as the rhythm section enters and now it's popping, is that a chorus? Then slow again, haunting, taunting. I had left school the year before, was it like that? 'Yeah, right, you're bloody well right'. Too late, I was sucked in, suckered in, engrossed and enthralled, headphones on, lyric sheet in hand. This was Dark Side of the Moon part 2, and this time it was personal.Hide In Your Shell? Don't we all? But this was different, not introspective, it's reaching out a friendly hand; 'if I can help you just let me know.' and the lyrics are reaching out with the music as the tempo builds - 'Love me, love you, loving is the way to help me, help you.' (There was a click deep within my brain at that moment, not that I needed help, but. a gift and it wasn't my birthday. d'oh!) '.Oh we're such damn fools', but now you come to mention it, 'don't arrange to have me sent to no Asylum. I'm just as sane as anyone', it's true, don't get mad, just get even. This one builds and grows, slow-fast, soft-hard, another poignant mini-epic: strings, tubular bells, acoustic piano, saxophone, guitar, the kitchen sink. The side ends. Emotionally exhausted.Side two and a sharp intake of breath: Dreamer doesn't seem so poppish now, in context, where it belongs, it's just an observation, a comment, not a game of Simon Says 'Well, can you put your hands on your head, oh no!' There's a depth, the electric piano has a crunch that doesn't come across on the radio, and the helium vocals don't seem so high after all, the chukka- wah guitar not so funk as funky, 'far out, what a day, a year, a life it's been'. Far out indeed. Then there are some call and response vocals that blend into harmony over the insistent thrum of the bass as it kicks life into the final chorus that crescendos to a grand (piano) finale. Another epic, in just over three minutes, a micro-epic if you will and still a radio-friendly song that here is a preamble to the centre point of the album: and 'Rudy's on a train to nowhere, halfway on down the line'. The conceptual concept amid a sea of other concepts: alienation, depression, isolation, anger, a life lacking direction heads towards the big city. (Did I mention this is a concept album? I did not and it probably isn't, but it can be if you wish, so it probably is if you want it to be. I do). Paddington station. The realisation that Rudy's running away. but no not to 'cardboard city' of the destitute under Waterloo Bridge, only to the cinema - celluloid escapism perhaps, but possibly just time to brood and reflect. 'Sad but in a while he'll soon be back on his train'. And home.If Everyone Was Listening arrives like an monologue, a Shakespearian aside to the audience in stage-whisper - it's okay, it's only a story; however it's also a plea for the show to go on, for the story to finish. 'Who'll be the last clown to bring the house down?' But is this the narrative, the story within the story, the concept within the non-existent concept or is this real life as a play, all the world is a stage and Rudy merely a player? And if so, then he's only on Act II, a long way from the final scene, but when you're Rudy's age...'And then the whining school-boy, with his satchel And shining morning face, creeping like snail Unwillingly to school.' (Shakespeare - As You Like It)At the end of this record Supertramp sang of planning the Crime of the Century ('well what will it be?'), the crime was that they were to become more famous, richer and more popular, but never to be as innovative, never to touch upon the musical alchemy of the philosopher's stone that would blend the perfect proportions of progressive rock and popular music again. It is not even greater than the sum of the parts - it is the total sum of the parts, it is the precise summation that makes this a complete whole: every instrument, every note, every beat; every word, sentence and phrase exactly in the right place at the right time that makes this work - communicating and harmonising, counterpoint and balance. They had the ingredients before and after, but the cake would never be the same: either too sweet or too dry, the wrong flavourings or too much icing all spoilt the end products. But not here, because Crime of the Century was transitional, a way-station on route from progressive rock to radio-friendly pop, created at the precise conjunction of the two styles so that it was simply a product of the journey. Perhaps just maybe all great crossover albums are like that and eventhough Crime may not be the essential masterpiece of progressive music it is, without a shadow of doubt, the essential masterpiece of crossover prog. An unreserved 5-stars."
    },
    {
      "reviewer": "Tapfret",
      "date": "Posted Wednesday, October 3, 2007",
      "rating": 5,
      "text": "This is an album that I really did not think I would like when I first heard it. The name Supertramp always conjured up \"The Logical Song'. Yuck! But 'Crime of the Century' is a true musical adventure. Even songs that I did not enjoy on the radio, 'dreamer' and 'Bloody Well Right' became enjoyable when taken in context with the album. The album spans many emotional highs and lows with its mostly ballad driven themes. The closer, the title track, 'Crime of the Century' is one of those closing stanzas that is a perfect end to an album.This is probably the simplest album in the prog portion of my collection that I can give a full five."
    },
    {
      "reviewer": "Hercules",
      "date": "Posted Saturday, December 29, 2007",
      "rating": 3,
      "text": "Ah, Crime of the Century. That album that I loved so much in my student days, that we all used to listen to in my room and sing along to. But it occurred to me that I haven't played it for over 10 years and I couldn't think why not. So I took it out and gave it a spin and the reason became clear - it's not actually that great.Firstly the great prog debate - is it or isn't it? The answer is definitely yes - it's classic arty prog, full of keyboards and sax, driven along by some superb bass lines from Dougie Thompson. But they could do with more guitar to add variety - and Rick Davies isn't actually that good a guitarist - and the vocals are an acquired taste. To my ears, they're a bit strained and screechy.There are some great tracks built around the theme of madness and alienation. School, Dreamer, Crime of the Century and particularly Hide in your Shell are wonderful. But Bloody Well Right, with its sing along lyric is actually quite crude and doesn't fit the album at all and Rudy is pretty boring. So it's a bit of mixed bag. Sure, it's an astonishing improvement on their previous two offerings, which were dire. At one time, I'd have given this 5* without hesitation. Now, I realise its limitations and faults all too clearly and it doesn't even quite rate 4*."
    },
    {
      "reviewer": "CCVP",
      "date": "Posted Friday, May 9, 2008",
      "rating": 5,
      "text": "Crime of the Century, when pop and prog combines successfullyCrime of the century is sure some unique album for me. For the first time in my life i was able to listen a album that really is able to combine elements of progressive rock and pop rock with such perfection that this album does not sound as dated as regular pop albums. Of course that every song produced is a product of the time that it was produced and will represent that time, but good albums seem to never grow as old as regular albums (in this case pop albums) do. For pop that is even a bigger accomplish, because it is usually made for instant sale and consume and then to be discarded or be forgotten in the depths of the people's mind. Maybe the band once known as Genesis and today known as Phill Collins and friends could learn a thing or two about good pop with progressive rock influences with these guys from supertramp, but that is another story.Anyway, about the songs, musicianship and other features there are some thing i would like to state. Both sides have a very proggy song, a good pop song and 2 songs in between: proggy songs are School (this is the song that caught me on the 1st time i listened the album; great starting, great developing of musical ideas, ends pretty well and have just the right size) and the album titled song Crime of the Century (best song of the album, ending it just the way it should; here there are more ideas then on school, but they are very well put here, so it doesn't looks like being a song with a lot of ideas just putted together, they really fit in pretty well). The good pop songs are Bloody Well Right (good, pero no mucho) and Dreamer (nice song to be listened; silly but not dumb, it does the job of entertaining quite well). The four song in between are Asylum (very balanced song), Hide in your Shell (just like Asylum, a very balanced song), Rudy (not very balanced, since it tends to pop) and If Everyone was Listening (also not very balanced, since it tends to be more prog than pop, but that makes the song even better!!!!!).The whole album is piano driven, giving it a classic, cool feeling which is increased by the saxophones and clarinets. Another interesting feature here is that are two official singers that keep changing from one song to another: one songs the first song and the other sings the next one, besides the unison parts when the whole band sings.Another interesting thing i have noticed is that the album somewhat seems to have a storyline, at least on each side, like Aqualung. Maybe i am just being delusional and seeing things where there is nothing (just like Ian Anderson said to those who think that Aqualung was a concept album), but it just feels that there is something that links the songs that i can't just put my finger on.Grade and final considerations: Being the only album that can fit pop and prog so well and still sound so great, i think Crime of the Century deserves the masterpiece grade not for a terrific song or incredible musicianship, but for the whole and its final product."
    },
    {
      "reviewer": "Slartibartfast",
      "date": "Posted Wednesday, May 14, 2008",
      "rating": 4,
      "text": "Now they're planning the crime of the century Well what will it be?Well, personally, my crime was not discovering this gem in the last century. Sure it's not the epic and grandiose progressive music that I first fell in love with in the late '70's, but it's a great listen all the same. I have to think it was influential to some prog that came after it. In particular I think Pink Floyd expanded on some of the lyric themes in The Wall. Marillion's He Knows You Know has parts that sound like parts of School. I also hear some similarities to Kayak of the same era. Wondering who influenced whom or was it merely coincidental?These guys weren't really considered progressive or whatever the hell we were calling the really good music back then, primarily due to their hits on commercial radio. Seems Supertramp actually had its proggy moments, but I won't be rushing to acquire their whole catalog any time soon. Still, suspect there are some other nice surprises out there. I'm sure prog fans who know this band better would say \"quite right\"."
    },
    {
      "reviewer": "TGM: Orb",
      "date": "Posted Monday, May 26, 2008",
      "rating": 4,
      "text": "Review 44, Crime Of The Century, Supertramp, 1974StarStarStarStarThe two Supertramp albums I have, this and Crisis? What Crisis?, are surprisingly interesting. Most of the songs are somewhat poppish in nature, and I can't see much that would seriously offend radio play, but there is an inherently different sound to the band. The combination of saxes, clarinet, keys, violin, piano and guitar as lead, background and rhythm instruments at different times (as well as multiple vocalists) is pretty interesting in and of itself, and provides a range of sounds which are just not available to most groups. On Crime Of The Century, this range of sounds comes together with a loose concept (schooling and its results...) and good lyrics to produce an extremely good album. Dreamer, really, is the only piece I find slightly harder to love. Despite that weak point, the album as a whole is very good, and School and Crime Of The Century Itself are both 100% brilliance. Should be tried.A crooning harmonica solo introduces us to the album. The rhythm guitar, vocals and clarinet then come in, introducing the dark theme and friendly anarchist feel of the piece ('He's coming along'). A dominant bass guides us through the next section, and the drums come in to good effect. A brief, unusual guitar solo from Roger Hodgson with a couple of other additions and then a gripping piano takes us through the extended instrumental section. After a conversational vocal duet (something which'll appear in snatches throughout the album), a more punchy and vicious variation on the earlier 'After school is over' bit. A bluesy scaling up is used to end the piece. An extremely good song.An e-piano (if I'm right) near-solo leads us into Bloody Well Right, building up a contrast for the sax and guitar to kick in. A hard rock verse, with vicious vocals, chord guitars and bursts of soloing of the highest order bursts out of the woodwork with a definite force. The chorus is amusingly English, and fairly nicely handled, in my opinion. A set of handclaps and a sax solo brings us out neatly.Hide In Your Shell is a much bigger piece, with a Yes-like mass of lyrics (quantity, not quality) crammed into it. All of the possible elements of Supertramp, piano mostly excluded, are present somewhere in the song. The flow is pretty perfectly handled, and the vocals (except occasionally annoying faux-feminine harmonies) do match the song. We do get (around the five minute mark) a fairly interesting rhythm section, with a more worldy feel from the drumming and a squirming bass to match. Good.Asylum begins with another piano solo, and develops carefully to include Davies' vocals. The piano is a constant for the first couple of minutes, with a couple of subtle bass and organ additions before the piece's not-quite-chorus (organ, bass and drum driven, with a violin over the top) bursts out. The violins, a warm sax and all sorts of keys are laid over the next verse (even some tubular bells and guitar soloing on the next chorusy bit). Essentially, this is just taking a basic idea, and cleverly adding the band's rather large array of instrumentation over it, as well as being willing to break out of a song structure. Very well done.Dreamer was initially a huge annoyance, and has become simply not as good as the rest of the album. A fairly repetitive-sounding, but actually, not as poor as first impressions feel, keyboard, with some odder percussion and harmonised vocals in a rather pop-sounding set of harmonies. The final xylo-glocken-phono-spiel thing is a fairly nice touch to lead us up to Rudy, I admit. The problem with this song is that it's just not using the variety that makes the rest of the album great, and thus feels a bit out of place.Rudy is the third song of the album to begin with a piano solo, but it does develop quite differently to the other two. It does make use of a lot of the instruments available to the band, but rather more separately than, say, Asylum. We get a Hodgson-Davies conversation, superbly backed up by Helliwell's sax and the changing piano at one point. Lyrically, it's probably got the most awkward moment on the album, but the song does feature some brief soloing from the non-piano instruments, which isn't a bad change, and a darker texture at times. Again, an excellent piece of composition.If Everyone Was Listening is begun with more piano-vocal choices. Dougie Thomson's bass and Bob Benberg's percussion do get an opportunity to show their faces in the chorus. On the second verse, a nice clarinet (and also keys, and violin) supplement the piano. All of the song's basic elements are shown in the second chorus. A gorgeous piano-violin-bass-keys quartet leads us out. Overall, a very likable song.Crime Of The Century Itself is the album's near-indisputable highlight. A harder twist on the piano features, as does a surprisingly vicious set of keys, bass and drums, and the vocals (Davies) and lyrical themes do come to a head . The piece swells out into an amazing instrumental section, including a slightly Brian May-esque guitar performance, a very clever use of the piano and a lower clarinet as well as the hammond and a set of drums which echo one of the bursts on School. John Helliwell provides a lilting sax solo which is surprisingly refreshing, given how fond I am of a growling Collins or Jaxon sax. The violins and a harmonica guide us out. An absolutely perfect fade, and an amazing conclusion to the album.The net value of the album is extremely high. I do have a general preference for the darker, jazzier and more brooding sides of prog, but I nonetheless agree that this is a superb album, and shouldn't really disappoint anyone. But, enough yapping from me, the title track is available on PA as a sample (at the time of the review): give it a few listens, and if you don't love that track, don't bother with the album. If you do, then Crime Of The Century should be added to your shopping list post haste.Rating: Four Stars. Very interesting combination of sounds.Favourite Track: Crime Of The Century."
    },
    {
      "reviewer": "SoundsofSeasons",
      "date": "Posted Friday, June 13, 2008",
      "rating": 5,
      "text": "I wanted to review an album that won't take too much thought. Well...This is the easiest *5 stars* im likely to ever give... it is a freiking masterpiece. Yes, it is....and might i also suggest that you listen to this with some nice speakers or headphones, because you HAVE to hear everything going on, on each song. There are a butt load of reviews here, so look above for why this album is aMasterpiece. But really its the 'poppiness' (obviously not too much!), the wonderful saxaphones (along with great vibes and harmonica parts as well) and the wonderful vocals that make this a truly timeless album. The lyrics are fantastic, you simply must have them on hand when giving this a run through.and to think... 'Dreamer' annoyed me quite a bit before i knew of this album, let alone this band."
    },
    {
      "reviewer": "Sinusoid",
      "date": "Posted Thursday, August 14, 2008",
      "rating": 5,
      "text": "Don't ask me why, but I get this feeling that CRIME OF THE CENTURY sounds very akin to an everyday musical. It's very sing-a-long-able in parts (especially ''Dreamer'') and I can actually imagine the choreography in my head, no joke. The vocal lines are clever and memorable, and the alternation of Davies and Hodgson vocals spotlight the theatre aspect of CRIME OF THE CENTURY. If you don't believe me, take a listen to ''If Everyone Was Listening''.CRIME OF THE CENTURY fits nicely in any prog rock collection simply because of how well it stands up musically, particularly in the keyboard section. ''Rudy'' and ''School'' are fantastic mini-epics in their own right as both ebb and flow in their development. The electric piano is used to the fullest as the bouncy rhythm instrument in ''Dreamer'' and the solo instrument at the beginning of ''Bloody Well Right''. The title track is the best here with it's climactic instrumental ending that has to be heard to be believed.Theatrical and playful, yet subtly complex and artistic, CRIME OF THE CENTURY, while poppier than most prog masterpieces, sits nicely in any prog collection. The songs are all entertaining in their own right, but hear the album from end to end to garner its full value. It's a much better listening experience."
    },
    {
      "reviewer": "LinusW",
      "date": "Posted Thursday, August 21, 2008",
      "rating": 4,
      "text": "Supertramp is a band that's been part of my musical consciousness for quite a while now, with numerous background plays of many of the big songs from the band, and quite a few of the lesser known ones as well and still they never stirred up enough interest for me to acquire a full album. And due to a mere whim rather than any real interest Crime of the Century worked itself up to being one of my most intensely played albums ever.It is striking. Because in that lies much of the nature of Crime of the Century's success for me. In being one thing when only giving it a glance, and then changing kaleidoscopically into something a lot more interesting that just wasn't there before, when you finally decide to give it a closer look. And potentially 'dangerous' for the same reason, when blurring the already diffuse line that separates progressive music from non-progressive music.What first got me was the atmosphere on the album; bouncy, in an aesthetically stripped - almost cold - way that together with the sense of playful innocence adds up to a strange musical experience. The instrumentation also contributes with something of a stranger vibe. Clarinet, saxophone, percussion, harmonica, Theremin-like effects and pianos, pianos and more pianos (of both the acoustic and electric variants) enriches the more basic structures in that carefree, goofy style the band masters so well. Most of the songs really don't fit under the moniker 'intricate', but yet, via clever use of twists and tweaks the end-result should be pleasing for any progfan. Another brilliant example of aligning planets or pure skill that leads to this can be found in Pavlov's Dog's epic Pampered Menial - Crime of the Century can now join the illustrious bunch of records where musical micro-management is just as important as the bigger structural variations of the music.Guitar rarely makes any flashy appearance, content with providing effects, shy textures and a poignant chord here and there for most of the time. Naturally there are exceptions to the rule, like the rocking Bloody Well Right and some soloing. But a personal favourite will always be the gorgeous symphonic and string arrangements that sweep down through the rest of the music - forceful like a cavalry chock or smooth like a breeze - to a great dramatic effect, always accentuating more than dominating in spite of their inherent musical weight. Supertramp is first and foremost a crossover band after all.The lyrics are definitely of the darker sort, dealing with insecurity and instability in life. These dark lyrical themes quite frankly collides with the musically lighter side of some of the songs on Crime of the Century. But instead of destroying the experience, it enhances just what the texts are portraying, making it even more sinister and disturbing. In some way this duality is seen in the shared vocal duties of David Hodgson and Richard Davies as well. They have very distinct voices, full of power in their own individual ways, be it in a deeper, warmer tone or a higher, more fragile one.It's hard not to be impressed by this record and the ease by which it navigates through the popular music styles of it's time, incorporating all the pieces that fits and leaving out all that which doesn't. I believe that by accomplishing that it rises as a monumental album of the 70s, regardless of style, and thus one that should be in any collection even vaguely interested in capturing that period of time.A stunning display of a marriage between song writing prowess, wild ideas and mass appeal.4,25 (I know. Pfft!) stars, and would have been an instant 5 hadn't it been for Dreamer and parts of If Everyone Was Listening.//LinusW"
    },
    {
      "reviewer": "russellk",
      "date": "Posted Tuesday, September 9, 2008",
      "rating": 4,
      "text": "Despite a healthy respect for 'Bloody Well Right' and 'Dreamer' as a teenager, 'Crime of the Century' appeared very seldom on my record player in the 1970s. I was into fiery prog rock, and SUPERTRAMP's more gentle brand of art-rock, which seemed a thousand miles removed from prog, didn't hold my attention. Back then the music I listened to had to be full of drama, and I hated slick pop with a passion - exemplified, I thought, by the smooth saxophone that, along with the harmonica and piano, made up their trademark sound. To me they sounded like a poor man's PINK FLOYD, without the bite, perhaps a slightly more sophisticated 10CC. Or like an underdone ELTON JOHN, who, I thought at the time, was far more progressive than this lot. Faint praise.My thoughts haven't really changed much. I respect this album. I acknowledge the satisfying concept, and applaud the way they weave it through the music without battering the listener over the head with it. It's certainly a quantum leap ahead of the mediocre 'Indelibly Stamped'. I appreciate the dual vocalist approach - in my view, two singer/songwriters are far better than one. But, cold fish that I am, it simply doesn't move me.Perhaps this is illustrated by the fact that, despite owning this album since 1975, my favourite song remains 'Dreamer'. Not, I can assure you, because the other songs are beyond my grasp, but because there's a glorious kind of purity to the track, an ethereal quality apt to the lyrics, a great call and response section with a wonderfully stirring segue back to the main theme. They don't do pop like this nowadays, and I wish they did. I understand that proggers aren't supposed to like pop tracks, but dash it all, it's a thing of beauty. If I spy a shining diamond in a sea of gold, my eye is drawn to it. Other tracks, such as 'Hide in Your Shell' and 'If Everyone Was Listening' seem to be there just to make up the numbers. My frustration with this record was that the great ideas were underdeveloped. 'Bloody Well Right' was a fabulous intro crying out for a song. I imagined what a monster PINK FLOYD would have made of this album by deleting three or four of the tracks and expanding the rest. Sigh.As I decline from my pomp and enter my dotage, I begin to appreciate tracks like 'School', 'Rudy' and 'Crime of the Century', particularly the latter, with its clattering piano, immense percussion and staggering finale, though nothing will convince me that 'Asylum' is anything but schmaltz. Even so, I find the album falls well short of masterpiece status, though it does have a few impressive moments. Perhaps one day it will all 'click' for me, though after thirty-odd years I somehow doubt it.Pity me, friends."
    },
    {
      "reviewer": "Tarcisio Moura",
      "date": "Posted Wednesday, October 1, 2008",
      "rating": 5,
      "text": "My very first contact with Supertramp and, boy, what a original sound! Ok, you can say they are not really prog in that of the symphonic way. But, really, they were good, unique and very, very talented. And the music on Crime Of the Century is surely progressive in the very broad sense of the original word. Some of the arrangements are simply gorgeous and, once again, unique (the bass and drums parts are quite impressive and very underrated). The fact that this album (and those which susequently followed until the early 80�s) was a big seller tends to overshadow its greatness as an important piece of art rock. Their first two releases were rather tentative and sometimes derivative, but here they sound like no one else, even though their songs were very accessible. This, I must point out, is a rarety.This album has been a long favorite and, at the time it was released, one of the very few that was praised by nearly everyone I knew. Although it was the very first one with the classic line up, it is also their best ever. From the very first notes of the hauting harmonica of School to last the fading bars of the title track, this is a remarkable record. One that appears once in a lifetime. Ok, some songs are better then the others, but none is bad. In fact, it all comes down to personal taste, for while I never really enjoyed If Everyone Was Listening as much as the other tracks, my closest friend at the time considered it to be the album�s best tune.This semi concept album has too many great moments to tell them all, but I should mention some: the greatest piano solo I ever heard (on School), the fine sax fade out in Hide In Your Shell and the distinctive electric piano riff of Dreamer (saddly, this is a much overplayed track). With a very good production and fantastic cover, this CD is a must have for anyone interested in prog music. The swapping lead vocals, the great musicanship of all band members, the diverse and creative arrangements were key elements to the final result, but nothing would have worked so well without the songwriting skills of Roger Hodgson and Richard Davies. Even the lyrics are an importante part of the whole project and showed that rock music could be meaningful, intelligent and accessible. Few songwriters could deliver such classics with words that most of people could relate to so easily.Before I started writing this review I tried hard to find something to give it less then 5 stars, but to no avail. This is a damn good CD! I could keep on writing about it for hours on end, but I suggest you to put it on and just listen to it. Good trip.An essential masterpiece in prog music."
    },
    {
      "reviewer": "Ivan_Melgar_M",
      "date": "Posted Thursday, May 7, 2009",
      "rating": 3,
      "text": "Until today I avoided rating any SUPERTRAMP, album, even when \"Paris\" was one of the central moments of my musical youth, because I like the band so much but don't believe should be here.But if I want to remain objective, it doesn't matter how much their music meant to me or much I enjoyed their concerts, I have to be honest plus as objective as I can, and honestly, I never believed SUPERTRAMP is a Progressive Rock band or even related, but there are different opinions of persons I respect a lot, so I will make an effort and review it.The album opens with \"School\", one of the most Progressive, elaborate and well developed tracks from their career, everything is perfect, from the harmonica intro to the radical changes, frantic piano sections, vocal interplay, shouts Progressive Rock from start to end and is so well down to catch the mainstream public, incredibly solid opener.This is what I don't understand they pass from an almost masterpiece to \"Bloody Well Right\" a boring song, absolutely bland, repetitive, each time I play the album, I can't wait for this song to stop. The vocal section is a bit better, more rock and less soft Jazz, but they come back to that horrendous chorus, next time I will push the skip button.\"Hide in your Shell\" is much better than the previous, but without reaching spectacular levels, the composition is excellent, they manage to create simple but beautiful passages that flow perfectly from start to end, the calmed electric piano is a very high point and the soft changes are delightful, the choirs are still a bit too acute for my taste, they are quite enjoyable, this proves a song doesn't need to be frantic to be good.\"Asylum\" begins with a very nice piano section, soft and pleasant, maybe this piano is the trademark of the album, because it's present almost everywhere, for the first time I listen a very rewarding Mellotron interpretation, but there's a problem, the intro seems to never end....A soft drum explosion marks the end of the intro and a good vocal section enhanced by orchestral tones, but still something is missing, the song reaches a strong and dramatic conclusion, but never the climax, like a shuttle with the engines on that never laves the atmosphere.\"Dreamer\" must be one of the most paradoxical songs, every time I went to a SUPERTRAMP concert, this track was one of the highlights, it's well constructed, each instrument and section links perfectly with the others,...........But (There's always a but) the vocals are a torture, loud acute, out of place, that was the hook to capture new audience, but simply can't stand them, and the xylophone closing is simply horrendous, good on stage, terrible on studio.\"Rudy\" starts promising, with the mellow and dramatic piano intro by Roger, but suddenly mutates first into some kind of Proggy - Jazzy - Pop section with little interest for me and then comes he debacle, because they seen to get closer to Disco Music (Before Disco was even remotely popular) and a boring closing section that despite the orchestra touches induces to sleep.\"If everyone was Listening\" is what I call a filler, I find absolutely no interest, nothing relevant, just makes time to complete the album format until the fantastic closer comes, nothing to comment.Now it's time for \"La Piece de Resistance\", the title song, another close to masterpiece song from start to end, the correct voice and piano intro softly going \"in crescendo\" lets us know from the first notes that we are before something special.The drumming is outstanding, the spine that keeps the body complete, even when the guitar enters, Bob C Benberg manages to keep the coherence and the logic, and then the piano as announcing the good things to come create a sense of suspense and drama hardly ever reached by SUPERTRAMP that leads to a fantastic final section where band and orchestra hit us with everything the have. The band found the best position as closer, because people take the CD of the player with a good taste in the mouth..............FANTASTIC song.Now comes the problem, two great tracks out of 6 may justify a 3 stars rating some of the others take the rating to 2 stars that would be the fair rating, specially \"Dreamer\", \"Bloody Well Right\" and the anodyne \"If everybody was Listening\".Despite this fact, \"School\" and \"Crime of the Century\", don't deserve to be included in album rated with less than three solid stars, and that's my position, maybe not absolutely objective, but honest.....And it's not the case of a Prog snob (which I proudly am to certain degree) rating low an album because he believes doesn't belong to the genre, I would give the same rating in a POP or mainstream site."
    },
    {
      "reviewer": "Einsetumadur",
      "date": "Posted Saturday, June 6, 2009",
      "rating": 4,
      "text": "13/15P.:Grand, definitely grand, precise, innovative and touching in its empathic depiction of madness and isolation. One of the definitive masterpieces and key records of Art Rock, a reference in terms of sound and production and full of superb compositions. OnlyRudydumps the rating a little bit.ActuallyCrime of the Centuryisn't really the third album of the British art rock band Supertramp, but rather their second album. The excellent progressive/folk/blues-rock melange of the band's (cauli-)flower debut album has been produced by a - except for the constant band members Roger Hodgson and Rick Davies - completely different band than the group that recorded the decent blues/soul-orientatedIndelibly Stampedrecord which came out one year later. As the band didn't have any remarkable success with these LPs, they split up in 1973 and came together some months later when they recorded their third album,Crime of the Centurywith sort of the classic Supertramp line-up including singer Roger Hodgson on guitar and electric piano, singer Rick Davies on Hammond organ and piano, John Helliwell on woodwinds and occasional keyboards, Bob Siebenberg on drums and Douglas Thomson on bass guitar.The beginning of the album, the intro ofSchool, is probably one of the most memorable album starts that have ever been made: Rick Davies' blues harp plays a great a-capella melody until a softly flanged electric guitar comes in, accompanying Roger Hodgson's high tenor voice which recites yet quite mild instructions to a school-boy, what he has and what he is not allowed to do.Be like Johnny-too-good, well don't you know he never shirks, - hes coming along!. The rhythm guitar stops while menacing feedback sounds of the guitar come along, with the sound of children playing in the background. The next stanza is more upbeat, with lusty bass guitar as well as great percussive electric piano and guitar work while the instructions get more and more authoritarian. Shortly afterwards the guitar, the Wurlitzer and the xylophone commence a quiet fragile jam section with a monotonous shaker rhythm. Slowly the drums creep in again and the next section begins. Here they really rock off, a great acoustic (!) piano by Rick Davies brings in a cheerful mood, the very concise acoustic rhythm guitar by Hogdson is convincing as well. The finale gets really angry:Don't do this and don't do that, what are they trying to do? - make a good boy of you! - Do they know where it's at?, Davies and Hodgson throw angry lines at each other, cleverly using the (fairly new) stereo system in order to acuminate the situation. A fantastic wah wah guitar adds a percussive effect again until the song ends with a stanza sung by Hodgson and the shiveringYou're coming along. A fantastic and exciting opener, played very exactly and with a differentiated and yet warm sound that I wouldn't have expected in 1974.The next song,Bloody Well Rightis my personal highlight of the record, a musically light and lyrically ironic piece of blues rock. The beginning is played solely with the staccato electric piano by Rick Davies; sometimes the band puts in very exact 'shots'; finally, after 40 seconds Rick Davies starts playing legato when the whole bands, led by Helliwell's saxophone, play an outstanding blues riff that segues into a simple, but highly effective exceptional wah wah guitar solo by Hodgson - again with a perfect fragile electric piano. The first stanza, with Rick Davies' thundering blues voice, has a really fat guitar sound and funky electric piano which is in the background, but can be heard precisely. The refrain heads abruptly into the pop direction with bar piano and jovial vocals. An ace downward-progression with fluttering saxophones - hardly as great as the blues riff in the beginning - begins a heavy bridge with a totally contrasting feathery ride-cymbal rhythm by Bob Siebenberg (who calls himself Bob C. Benberg on this one). The next refrain, with a funny 'quite right' throw-in by John Helliwell, stays on the pop music line and fades out gradually with jazzy saxophone work. I believe that this song is pure perfection, blues rock music as it ought to be, and the sound gets more and more fantastic.Hide in Your Shell, the longest but one song on the record, is virtually as strong as its predecessor, although its balladesque concept cannot be really compared to the rock inBloody Well Right. Just like it is the case with every vocal part here, the singer is always the author of the lyrics and often also the composer of the piece; so, this one is by Roger Hodgson, and if you know the music he composed for Supertramp in the following years, this is also obvious: soft vocals, sometimes very odd chord progressions which sound great anyway and the glassy Wurlitzer electric piano. Approximately one minute into the piece, this instrument is sent through the wah wah pedal, and with the eerie multi-tracked vocals and dominant bass guitar this creates a quite threatening sound which fits well to the content of the lyrics: hiding in the own shell, losing contact to other people and getting insane. In the pre-chorus part the backing vocals are pitched down by manipulating the tape speed, and the accurateness of this recording process is admirable, as well as the studio effects that are somehow always in the rhythm of the song. The chorus is lighter again with a nice rhythm acoustic guitar, well-composed sax lines and a musical saw (=the howling sound in the background that I actually believed to be a Theremin synthesizer) that has been played by a street musician. The song goes on that way until after five minutes Hodgson segues the song into the finale with the monotonous \"I wanna know\"-section with a wry rhythm, later with ultra-fast wood block knocking; quite remarkable in my opinion. The last part, with Hodgson's vocal acrobatics and a female backing choir could be regarded as 'kitschy', but I think that this word doesn't fit in this piece about insaneness. Anyway, I like the song very much.Asylumis a masterpiece if you try to understand it, but it does need some time to get used to. This piece about madness is by Rick Davies this time and is mainly based on grand piano, some restrained Hammond organ and Davies' heartfelt vocals.I told em - look! - I said I'm not the way you're thinkin', Just when I'm down, I'll be a clown, I'll play the fool. Please don't arrange to have me sent to no asylum. It's just a game I play for fun. A somehow depressing text, and the quite serious music underlines this as well. After two stanzas the first refrain begins, with bombastic choirs and nice Leslie-d guitars.Will he take a sailboat ride? He is very likely to... Will he feel good inside? He ain't ever likely to... Will he tell you he's alive? He is always tryin' to... But nothin', no nothin' does he ever say. Afterwards, Davies and Hodgson start their question-answer-play again, a good contrast between the dramatic song and the soft and light Hodgson-throw-ins, now even with orchestra backing to make the piece even more 'operatic'. Yes, operatic might be the correct word - it's rather more broadwayish than bombastic. The finale drifts completely into madness with Davies' frantic cries, shortly reprising the piano beginning again before ending in silence.Dreameris the hit single of the record, again dealing with the topic of mental absence and disease. Mocking, high vocals by Hodgson and his electric piano create a somewhat childish atmosphere, the rhythm is completely made up with guitars and some muted tom toms. After just one and a half minutes the song leads over into a psychedelic and atmospheric part with hypnotic keyboard patterns and precisely coordinated multitracked vocals by Hodgson and some comments by Davies. Near the end a nice rhythm cristallizes itself out of this part, John Helliwell is now to be heard on backing vocals. A short reprise of the first stanza segues into the ending which consists of a strange glockenspiel melody. This is probably one of the best-known songs of Supertramp, but for a normal pop song it is much too complicated; probably the prototype of an art pop piece.Rudy, the longest piece of the record, starts as one of the typical Davies-pieces with a mixture of chanson, jazz and progressive rock, something which sounds very interesting, but doesn't impress me too much musically although the beginning works well as a story made to music. Still it's the only piece on this record in which my concentration always switches off. Again, the song is very piano-dominated and changes between emotional, chanson-like stanzas which feature some beautiful chord progressions and slow rock music in the choruses. Great is the instrumental part in the middle of the piece which begins with piano, good clarinet work by Helliwell and train station sounds to lay stress on the situation of the lyrics: Rudy seems not to be cared for by anyone and is now sitting on the train just to win time.Rudy thought that all good things comes to those that wait, but recently he could see that it may come too late.. Happiness isn't the topic of this record, but the melancholic and thoughtful mood of the songs is probably its recipe for the success, just likeDark Side of the Moonwhich is rather similar toCrime. Gradually, somePapa Was A Rolling Stone-funk-guitars add texture and a hectic rhythm to the music when suddenly furious orchestra melodys swirl out of the speakers. Hodgson and Davies now throw vocal lines at each other until an ascending interlude leads over into the wishful ending with soft piano, sounds from a city and vocals.Now hes just come out the movie. Numb of all the pain, sad but in a while hell soon be back on his train. Moving from the lyrical point of view, but musically slightly 'over the top'.If Everyone Was Listeninghas - just likeSchool, the two previous songs andJust A Normal Day- been composed and played live and on BBC in 1972, interestingly with the old Supertramp featuring Frank Farrell, David Winthrop and Kevin Curry. Unfortunately, these records have never been published officially, as well as approximately 31 other demo songs that have been recorded for the album in 1973/1974. This piece in any case is one of the Hodgson ballads, and an extremely nice one with wonderful chord progressions on the piano, some beautiful clarinet interludes, tasty orchestral arrangements and Hodgsons emotional lead and backing vocals which has been possible due to the overdubbing technics. The ride cymbal rhythm that can be heard at the beginning of every stanza always stops again after one verse, which makes it a difficult listen. It needs more than twenty listens to get used to it, but I cannot really guess why it appears. Whatever ... the piece itself is wonderful and doesn't lack any substance, even though it is shorter and more minimalistic than the other tracks here.The title trackCrime of the Centuryis another Rick Davies piece which begins rather commonly with piano, vocals, some drums and Hammond organ. The chorus, with shouted vocals and a fat rhythm is quite heavy for the means of Supertramp, and after another stanza and a great guitar solo the big crescendo of the song begins: an arrhythmic out-of-the-place piano melody sounds, later accompanied by odd timpani beats which become a rhythm, the orchestra adds texture to and around the music, the band gets louder and more dynamic. This fooling around with a rhythm would later be repeated inFrom Now Onin which the riff gets completely dislocated in the end. Over the minutes the band creates an enormous tension until a kind of finale is reached when Helliwell puts down a touching sax solo. Gorgeous, just like the lyrics:Who are these men of lust, greed, and glory? Rip off the masks and let's see. But that's no right - oh no, what's the story? Well, there's you and there's me, Davies sings in the beginning.All in all, this album is a masterpiece - even if only by a hairbreadth: the longest piece on the album is slightly boring at some places (Rudy), but apart from that: excellent music, excellent lyrics, excellent sound, excellent production (yes!) and excellent atmosphere. The band has been critized for this perfection because it reportedly sounds too sterile and mechanic, but - although I know this phenomenon of Gentle Giant studio albums - I can't agree with that since beyond this perfection there is also a lot of emotion which propelled the record, and the sound is very warm and \"analogue\" as well. So, 13/15 points from my side for an outstanding record that everyone interested in rock music should own: a really good 4 star rating overall, although 5 stars would be justifiable as well."
    },
    {
      "reviewer": "kenethlevine",
      "date": "Posted Wednesday, July 29, 2009",
      "rating": 3,
      "text": "Ah the year 1974, when album oriented FM radio was reaching its peak, when even the more pop-oriented groups dabbled in by-then mainstream progressive styles. Those were the days my friend, we thought they'd never end. But they did with a thud. Before that, SUPERTRAMP had shown that prog could be accessible and oh-so-hummable. While I am not familiar with their earliest or final albums, I feel assured that COTC is the best of their most popular period, and best produced, especially for its time, even if it shows ample signs of the effeteness that would follow.The only really exceptional songs are the opener and closer. \"School\" became a soundtrack for its time period by its blend of reflective acoustic instrumentation with post 1960s angst and disillusionment, before disco deemed that we could simply stomp our problems into the floorboards of the local club. The title cut outshines the group as well as anything else they ever did. Even allowing for the paucity of vocals, already a wise move where Supertramp is concerned, the splendid lead guitar solo leading to the layered instrumental interplay could go on 10 minutes as far as I'm concerned. Especially if \"Dreamer\" could be cut out in the bargain, in the running for the most irritatingly whiny song of the entire decade, and itself practically the crime of the century. It also apparently justified Supertramp's tendency to parlay any hook into a drooling mess for the next half decade at least.\"Bloody Well Right\" is instrumentally a fine swing jazz tune with as much verve as \"Dreamer\" lacks, but lyrically weak, and with a lame chorus. \"Hide in Your Shell\" has several worthwhile melodic themes that offset the repetitiveness. \"Rudy\", \"Asylum\" and \"If Everyone was Listening\" are all fairly tepid standard mid 1970s fare, with the former missing the mark in the epic sweepstakes of its time by a country kilometer.COTC is certainly the place to start your exploration of this group whose popularity began a steady rise in 1974, but, while the album is far from dispensible, to bypass it would be no more than a minor transgression. To phrase it in terms of Supertramp's sparkling studio precision, 3.000 stars, neither rounded nor truncated."
    },
    {
      "reviewer": "snobb",
      "date": "Posted Friday, October 9, 2009",
      "rating": 5,
      "text": "That album is the one fron a few from alltime Prog Golden Collection. Yes, you right, Supertramp isn't proggest band all around, and 'Crime Of The Century\" isn't their proggest album for sure.But common balance between fantastic melodies, perfect song wrighting , very competent musicanship and, most important, fantastic atmosphere of all album, is unbieliveable.Very acoustic, mid tempo, piano led soft-rock with some prog elements ( let use british \"art- rock\" name for that music) is similar to 10 CC or some Roxy Music albums. But in fact, no one of competitors never made so perfect album!And you have concentrated Supertramp there in it's best. No fillers, just perfect material, placed in perfect order. You listen this album as are watching really good movie - at the one breath!As I said before, there are more proggy albums in Supertramp discography: \"Even In The Quitest Moments...\" are more proggy and less pop-oriented, when their later \"Brother Where You Bound\" is strongly prog-oriented album with long compositions and sax solos. But \"Crime Of The Century\" is Supertramps flesh and blood. If you didn't listen it, you don't know nothing about art-rock of that time!"
    },
    {
      "reviewer": "Epignosis",
      "date": "Posted Thursday, January 21, 2010",
      "rating": 2,
      "text": "Don't get me wrong- a couple of these songs are among my favorite Supertramp songs, but I would be a liar if I agreed with the accolades this album (or even the band) has garnered. No, I don't find much of this album progressive, but it is a fun and decent quirky pop album- nothing more. I was never attracted by either of the main vocalists in this band, but years of growing up and hearing them occasionally on the radio has endeared them to me. Still, the songwriting is only okay and the album as a whole is one-dimensional, and it can even be downright grating at times. On more than one occasion I simply cannot shake the feeling that I'm sitting in the gallery of a theater containing the half-assed performance of a two-bit troupe.\"School\" Opening with a lonesome harmonica's wail, this first piece has a haunting feel with forlorn vocals that even an upbeat rhythm section cannot cheer. An ascending bass riff and bright guitar leads into a melodic piano solo backed by acoustic guitar. In a way, much of this song reminds me of Marillion's \"He Knows You Know,\" so that's no problem.\"Bloody Well Right\" This electric piano introduction is one I consider to be one of the premier examples of the instrument. The verse is shouted over a crunchy guitar, but the catchy chorus of this eccentric little thing is over light keyboards. This popular little tune is one of my favorite Supertramp songs.\"Hide in Your Shell\" The melodic opening is very memorable and enjoyable. This is almost something of a show-tune in places, but has a wonderfully approachable chorus. The bridge consists of whining that rather gets on my nerves, and the backup vocals can be a bit grating. Still, I quite like this song (I'm just not a Supertramp fan).\"Asylum\" A sprightly piano opens the fourth song. Generally it is a heartfelt one even as it grows fuller. Yet the shrieking and noise that consumes the second half is off-putting and nothing can stay my hand from reaching for the volume knob.\"Dreamer\" Rapidly pounded chords and one of the most annoying voices I've ever heard gives way to something of a choir. This is the sort of giddy pop music I can't stand. It brings me right to the front row of a production full of loud singing, little talent, and bad choreography.\"Rudy\" More light piano begins the lengthiest track, which is almost as awful to me as the previous one. Not only does it have a nauseating disco vibe throughout the middle, but the vocals are simply dreadful.\"If Everyone Was Listening\" That piano, with its simplistic chord work, returns. This song is very uninteresting musically, with it's dull format and lack of progression. It isn't a bad song at all, and it has a decent enough melody, but this is just something any songwriter with an hour on his hands and any musical skill whatsoever could put together.\"Crime of the Century\" Perhaps the most lyrically mysterious of all Supertramp songs, this has a haunting and enigmatic beginning. The dual guitar lead and subsequent piano are highlights of the piece, but it eventually sounds so dramatic that it begins to get bland very quickly."
    },
    {
      "reviewer": "poslednijat_colobar",
      "date": "Posted Monday, January 25, 2010",
      "rating": 3,
      "text": "Breakthrough albumCrime of the Century marks third different line-up of Supertramp, with only Rick Davies and Roger Hodgson being the same band members. It's one of a few albums to combine so strictly pop rock music with progressive rock music with a lot of success! And it's obvious in the importance of this album for the band. Crime of the Century is their breakthrough album after two unsuccessful attempts. The debut is their most progressive album and one of their best in the PA manner, but it remains very big disappointing. Crime of the Century doesn't contains any weak songs and probably wouldn't be in PA, if it was somebody else's album, but not Supertramp. The reason of that is the low quantity of prog moments. I think it would even hardly pass through the criterion of prog related album. It's very melancholic album with an artistic sense. But all these words are a trademark of Supertramp, so I shall continue with the next point in my review. Why I gave only three stars? It's because of the strong pop taste of the album. There aren't very sophisticated or deep themes here. If this site was pop one, this album, probably should top it, but it's not. It's very good album for the criterion of pop music. But prog demands more than just a simplified and nice tunes. The best song here is the homonymous Crime of the Century, which is one of the best songs I've ever heard.My rating shall be 3,25 stars"
    },
    {
      "reviewer": "progrules",
      "date": "Posted Thursday, January 28, 2010",
      "rating": 2,
      "text": "I'm really amazed to see so much praise for this band and album by so many prog reviewers. Not that this is a poor album by any means. But I would expect such scores on a similar site but then for pop albums. It's still beyond me what this band is doing on our site. I will not go into this too deep because that's against the rules but to me Supertramp is indeed a prog related band at best.And therefore I don't understand why our prolific reviewers get carried away by this release. I will go into the songs briefly and then mainly about their progressive content.School is actually one of the most popular songs ever in Holland if a top 100 of all time is played on the radio here. It's always there and sometimes even amongst the first twenty. But that's for at least 90% pop music, albeit the better pop music in history, I will not deny that. School is a very good pop song with prog leanings. But that's about it. 3*.Bloody well Right is a different ball game. This is plain pop to me. Maybe nice as well but where progressiveness is concerned this scores very low. 2* for PA.Hide in your Shell has a little bit of progressiveness in it but not much. Kind of catchy and nice for the ears but nothing groundbreaking. 2,75*.Asylum is a bit more suited for a progressive website but still it's miles away from what it should be. Well, at least it's not a downright chorus stanza chorus stanza song. I can't deny there's a certain class about this album but that't not enough I feel. 3*.Dreamer is the most poppy track on the album. Can't believe some give even this one the benefit of the doubt. Forgettable track. 1,5*.Rudy is the fourth track that deserves respect and belongs to the better half of the album. Good composition but still more like pop in Van Morrison style than prog. After 4 minutes one suddenly gets treated at Philly sound believe it or not. Versatile track but no more than 3 stars.If Everyone was Listening is a nice ballad but also here I fail to see where the prog is to be heard. So again just 2,5*.Crime of the Century. This title track is the only song I can understand why it's legitimate to call Supertramp at least somewhat progressive. This is one of my all time favourite tracks by the band . But even this can't be called a die hard prog song, just slightly. But it's very good at least. 3,5*.But it will not be able to save the album from a poor rating. For a pop site I could rate this 3 or 3,5 but if I realize this is progarchives I will have to round down I'm afraid. Good album though especially for their fans."
    },
    {
      "reviewer": "TCat",
      "date": "Posted Thursday, April 1, 2010",
      "rating": 5,
      "text": "This is keyboard-driven prog. This is also a prog-masterpiece in every sense of the word. The music here is exciting, innovative, beautiful, and awesome. Even though I love every one of their albums from the debut through \"Brother Were You Bound\" I still consider this their pinnacle. Ever changing tempos, rhythms, moods throughout this album. And believe it or not, with all of these wonderful elements, the album and the band were still amazingly popular in the late 70s and early 80s. Through those disco years, popular music still had promise in this band. Rodger Hodgson and Rick Davies pretty much shared the controls here, both of them alternating vocals and backing up for each other when they weren't leading vocally. Rodger's voice was probably the most radio friendly, but all of the music was excellent even if it was attractive to the public masses. Their songs usually had a very uplifting feeling, not in a spiritual way, but in a feel good way like \"Dreamer\" and \"Rudy\" and some were effectively dark like \"Asylum\" and \"Crime of the Century\". But the songs were always heart-felt, dramatic and beautifully put together. And talk about powerful, there aren't many artists that can do a piano-based ballad and make it sound as powerful as these guys did as in the beautiful vocals in the song \"If Everyone was Listening\" and also in the heavy, crashing and almost droning instrumental section of \"Crime of the Century\". This band proved that, even though they could use a guitar effectively from time to time, a piano-driven band can be just as powerful as any guitar-driven band. If you haven't really listened to this album yet, then it's time to do so. Definately a masterpiece of progressive rock music in every sense of the word!"
    },
    {
      "reviewer": "AtomicCrimsonRush",
      "date": "Posted Tuesday, April 20, 2010",
      "rating": 3,
      "text": "140th review of a classic Supertramp legendary album never lives up to the hypeSupertramp's 'Crime of the Century' is the piece de resistance as far as the band goes, reaching a peak in their career and becoming their one and only super smash hit, although 'Breakfast in America' made a huge impact with the smash hit single 'The Logical Song' (my absolute favourite).COTC features some of the all time greatest Supertramp blockbusters such as 'Dreamer' that is found on every compilation and features in many pop culture forms on TV. 'Bloody Well Right' is the angst driven rocker where we can't get that wretched chorus out of our heads. The music is infectious and catchy hooks are prevalent. Both are well known outside of prog circles of course, but does this album have anything to offer to the prog fan? The answer is very little. There is a kind of running theme on the ideas of education, loneliness and alienation. This is debatable and I see very little connection to the songs really. The lead vocalist Roger Hodgson is as high pitched as Jon Anderson, and he is balanced by Rick Davies. The keyboards are a main focus played deftly by Davies and there are some delightful soaring saxophone passages by Helliwell. The musicianship is very innovative and replete with driving rhythms and soft ambience interspersed in each track.Other highlights include 'School' and the majestic showstopper 'Crime of the Century' where Helliwell takes off in full flight on sax.Overall it is a solid commercial sounding album with great production and sound but it is not as good as hyped. It is not really prog though has elements in the crossover genre. This soft AOR rock never really appealed to me and although this is Supertramp's best album 3 stars is the most I can give this."
    },
    {
      "reviewer": "thehallway",
      "date": "Posted Monday, August 9, 2010",
      "rating": 5,
      "text": "Consistently brilliant, this album is the best example of catchy yet sophisticated pop-rock out there. And its prog leanings are more prominent then those groovy choruses will have you believe...Supertramp is a band that most music enthusiasts will encounter at some point, and those that don't fall in love with the tunes at least regard them with the respect they deserve. Everything is so well written, the lyrics are intellegent but accessible, the compositions are unconventional but memorable, and the chops are nothing ground- breaking, but above average. 'Crime of the Century' epitomises all of these skills in the form of a breath-taking concept album.'School', 'Dreamer', and especially 'Rudy' are my favourite tracks (they're probably the more prog-orientated ones too) but there isn't really a weak moment on the album, hence my rating. 'Asylum' and 'If Everyone was Listening' are perhaps not quite up to the standard of the other tracks, the former being a little too cheesey and soul- influenced, the latter just a mediocre composition. But even these add much to the flow of the record, and contribute to its principle themes. What's really attractive about 'Crime...' is the blend of consistency (in the lyrics and instruments) with diversity (the mood of each song, and the varying sections of epic, groovy, sad, rocking or theatrical qualities). Another almost unique bonus is the contrasting singers; we get two of them, and a big difference in range. Alternating between each song (and sometimes sharing parts) Hodgson and Davies perfectly compliment their own and each other's compositions. Perhaps the fact that both are extremely talented writers is why Supertramp had a 5 year period of almost continuous high-quality, with other pop bands peaking out or delivering hit and miss albums.Personally, I view the concept of this much-discussed album to be based around the huge flaws and cons that exist in race and society, which are the result of humanity's own problems and weaknesses. Supertramp observe the imperfect world we live in, and quite rightly blame each and every one of us for it (hence, \"crime of the century\"...). The songs on this album reflect different aspects of this idea, culminating in the epic finale that is the title track. I think it can be viewed both as a linear story and as a collection of different angles on a theme. In any case, the music is exceptionally listenable.'Crime of the Century' is essential to ANY music collection, not just a pop or prog one. It fulfils so many tastes, like a layered movie. Read all about their schemes and adventuring, it's well worth the fee..."
    },
    {
      "reviewer": "Rune2000",
      "date": "Posted Thursday, August 12, 2010",
      "rating": 5,
      "text": "The duo of Richard Davies/Roger Hodgson seemed to follow a similar path paved by Van Der Graaf Generator where the band was active in the early '70s but then took time off during 1972-73, i.e. the golden years of prog, only to regroup a few years later. Unlike Peter Hammill & co, Supertramp managed to overcome this misstep by creating gorgeously entertaining pop tunes which made their Art Rock styled approach style famous even to this day. Ultimately, we can only imagine what great wonders these two great collectives could have achieved if they kept their formations together during those highly creative years of music history.Fortunately for Supertramp, the band still managed to get some of the creative magic of the time by releasing their most ambitious album to date, just barely making the release date in time for the latter half of 1974. It would indeed have been aCrime Of The Centuryif the band postponed this album any longer since one of the record's biggest appeals is its rich early '70s sound, which to me is already worth the price of admission. Just add a bunch of excellent compositions into the mix and you get one of the masterpieces of progressive rock music!Unlike most fans, I happen to consider the first two songs to be the weakest of the bunch. Don't get me wrong,SchoolandBloody Well Rightwould have easily made it to a masterpiece status on most other albums, butCrime Of The Centuryis already a great album which actually makes these two compositions look slightly weaker in comparison. The real magic begins with my all-time favorite Supertramp composition calledHide In Your Shelland doesn't stop until the final notes of the title track. I'll restrain from going in detail about these compositions since many much more competent reviewers have done an excellent job of covering just that.I hope that my humble contribution will only add to the already established opinion about Supertramp's masterpiece calledCrime Of The Century. If you still haven't given it a chance then you're definitely missing out on some great moments!***** star songs: Hide In Your Shell (6:52) Asylum (6:30) Dreamer (3:19) Crime Of The Century (5:20)**** star songs: School (5:35) Bloody Well Right (4:26) Rudy (7:07) If Everyone Was Listening (4:05)"
    },
    {
      "reviewer": "Marty McFly",
      "date": "Posted Thursday, August 12, 2010",
      "rating": 4,
      "text": "Starting very unusually, with the sound of harmonica, but quickly turning in the direction where we're expecting it to be.Melancholically sad, melodically beautiful, if this is 70s advocate of Crossover Genre, then let it be a little bit poppy (seeds?), I don't mind, as long as we'll keep ourselves in the unwritten boundaries written by Art Rock borders. Strings are so sweet that some people's hair will turn grey instantly from pure sound of it (accompanied by suitably sounding piano and orchestra). But this can turn other way around as well and become the main advantage. It's pompous, it's grandiose, it's simply big.4(+), vocals in the beginning ofDreamersounds a little bit like Jon Anderson."
    },
    {
      "reviewer": "BrufordFreak",
      "date": "Posted Tuesday, November 23, 2010",
      "rating": 5,
      "text": "It's hard to believe I haven't reviewed this album yet. I only became aware of Crime in the spring of 1977. I had already been a big fan Supertramp, having been introduced to them through 1976's Even in the Quietest Moments and having proclaimed Crisis? What Crisis? my favorite album throughout the fall of 1976. I guess I was a bit resistant to the possibility that something could actually be better than Crisis or Quietest Moments. I got it. I liked it. I purchased Supetramp and Indelibly Stamped. Like them both. A lot. But by then I was into all of the back catalogue of Yes and Genesis and Renaissance and Focus and had very little time for the 'tramp. Then Breakfast in America came out. 79. An album full of very catchy pop songs (though \"Child of Vision\" and even \"Take the Long Way Home\" are excellent prog tunes.) I got tickets to a show on their Fall of 79 tour. GREAT seats! While they played nothing from Crisis or the first two albums, they played almost everything from Crime, Quietest Moments and Breakfast. But what occurred for me at this concert was a spiritual awakening; every, and I mean EVERY song from Crime of the Century was not only head and shoulders above the other albums' songs but were ten times better in concert than they were on the album. I mean, \"School\" and \"Bloody Well Right\" were of course great, but \"Rudy!\" \"Dreamer!\"--songs that I really didn't like before!--and the show-stopping finale, \"Crime of the Century,\" were (and still are) some of the peak concert moments of my life!Needless to say, I returned home to Crime of the Century with a newly found appreciation (call it 'reverence'), bought the Mobile Fidelity copy and immersed myself in the magic. I still listen with raptured awe, revisiting in my mind that concert, whilst listening to \"Dreamer,\" \"Rudy,\" \"Hide in Your Shell,\" \"If Everyone Was Listening\" and \"Crime.\" And \"School\" is just one of the all-time greatest songs ever written."
    },
    {
      "reviewer": "Finnforest",
      "date": "Posted Tuesday, January 4, 2011",
      "rating": 3,
      "text": "The real Supertramp debut\"Crime of the Century\" is really where Supertramp starts for many people and it's not such a stretch really. After line-up changes and some songwriting maturation, the band sort of reset with this album in 1974. For many people this is the pinnacle of Supertramp and I notice it is their highest rated album both here and at RYM. For me it sits behind Breakfast and Brother although I still think it's pretty good. Despite the fact that I really dislike both of the popular US radio singles on this album, the rest of the disc has some stellar moments. \"School\" is a real favorite with those cool guitar parts in the beginning while the kids voices are heard, then it slips into a really warm, organic 70s groove, followed by some nice twists and the ever present piano. Great opener. \"Asylum\" is another Davies classic, with his barroom vocal and the powerful section that feels like Billy Joel's \"Captain Jack.\" (Tramp often reminds me of Billy Joel, both mix different styles of music with piano-heavy rock, the dynamics of their bands not so far apart.) The closing title track is also quite lovely with great piano and nice electric guitar leads, certainly not lacking in mood or componsition. There's just a little touch of where Dire Straits would go with \"Love Over Gold\" in the feel of this one. Not a masterpiece by any stretch, but this is a solid rock album with some proggy overtones and should be considered one of the recommended Tramp titles."
    },
    {
      "reviewer": "lazland",
      "date": "Posted Tuesday, June 7, 2011",
      "rating": 5,
      "text": "This the album by the band who, probably more than any other, defined the sound and feel of pop-prog. Following two relatively lacklustre albums, this released in 1974 was a monster smash, and became a template for the albums and singles that followed propelling the band into super stardom.Having read recent interviews with Roger Hodgson, quoting himself on tour as the \"Voice of Supertramp\", extremely angry that the band continued to play his smash songs following his bitter departure, and of the opinion that the \"public\" really only want to hear the hits he wrote, I felt it was time to revisit one of the bands I fell in love with in the 1970's. Is he right? Was it, to all intents and purposes, a \"one man band\", with the rest chipping in? I do not believe so.There are on this, as with all other albums they did together, Hodgson & Davies songs. Although jointly credited on the albums (a move which Hodgson states he bitterly regrets to this day), the contrast between the two styles of writing and singing is stark, the glue holding them together being one of the finest \"backing\" bands the world of music has produced.There is not one weak moment on this album. The tracks hold every emotion known to man; joy, sadness, depression, madness, happiness, it has it all. And whilst the wider public would probably recognise certainly Dreamer as the epitome of the album, and, to a lesser extent, School, Hide In Your Shell, and If Everyone Was Listening as representing the definitive sound of Supertramp, i.e. Hodgson tracks, this, to my mind and ears, is exceptionally unfair to Rick Davies, who utterly excels here.The title track contains one of the finest finale build up's known to prog, and, yes, it is pure prog. Never, I think, has a simple plinky plonk piano sounded so grand and emotional, and the sax played by Helliwell is simply sublime. An utter classic, rightly lauded.Bloody Well Right is a joy, a massive mickey take of simple, basic, human interactions and relationships. If it was a \"throwaway\" or \"filler\" track, then it is up there with the best.Rudy is a sublime study of a deficient human being, one yearning, yet utterly unable or incapable, of reaching his aspirations, and the upbeat music rather belies the emotion behind the lyrics.However, the highlight of the album, and, in my honest opinion, of the entire band catalogue, is Asylum. Here, Davies completely blows away the myth that has grown up that Hodgson, and Hodgson alone, could do emotion and scale the human heights. The story of a man descending into utter madness and psychotic behaviour is heart rending, and, throughout, Davies manages that rare trick - you actually believe that it is he who is the subject of the song singing. The finale is compelling and so emotional that it leaves me completely exhausted every time I hear it.So, does that make the other songs bad? Not a bit of it. I love all of Hodgson's tracks. Dreamer is pure pop prog heaven, wonderfully catchy. School is great fun, and takes you back to your own youthful days, whilst Hide In Your Shell proved that Hodgson could also do \"serious\" as well as whimsy. The grandiose performance on if Everyone Was Listening is exceptional.This is a wonderful, historical, album, one of the few that deserves its place in the pantheon of absolutely essential. A work of art that not only should all prog fans own, but all lovers of well performed and emotional rock music. It is also, I venture to suggest, one of those albums that blows away the myth that a marriage of commercial tendencies and prog music must be bad. It isn't - it is the exact opposite.Five stars, without hesitation. Virtually a work of perfection."
    },
    {
      "reviewer": "Evolver",
      "date": "Posted Saturday, June 25, 2011",
      "rating": 5,
      "text": "Supertramp found their sound on this album, as well as their most successful lineup. It's with this formula that they would become one of the major acts of the seventies.This album is the moct consistent of the group, balancing proggy pop with powerful ballads. And the two most famous tracks,Bloody Well RightandDreamer, as good as they are, are actually some of the weakest material on the album.Special mention must be made for Rick Davies'Asylum. The song begins as if it's going to be just another maudlin ballad, but builds with such intensity that it becomes the most powerful piece on the album.While Hodgson and Davies came close to the majesty of this album with some other songs, they never created an entire album like this again.4.5 stars, rounded up."
    },
    {
      "reviewer": "Gatot",
      "date": "Posted Wednesday, June 29, 2011",
      "rating": 4,
      "text": "A classic album that I did not quite pay enough attention by the time it was released because there were many other challenging albums that worth listening than this one like Yes \"Relayer\" or Genesis \"Selling England\" even though the years were different a bit. At that time the prog music was quite dominated by symphonic prog so Supertramp was considered too poppy and not considered into prog scene. I have to admit that almost all tracks - except the boring one \"Dreamer\" - are well crafted compositions combining good melody, harmony, change of style and structural integrity.I think the strongest point of the album is on its melody ' i.e. the degree to which the main melody of the song is constructed from a combination of notes. You will find that each track has a well-crafted notes that make you enjoy each song. I like the way the opening track \"School\" moves its segments with a very nice melody. The album title track \"Crime of The Century\" is also having a solid melody. The solid melody moves in good harmonies ie. how each instrument contributes in creating sounds and notes. The most appealing thing is the unique piano work and great vocal quality Hodgson. In some segments of the tracks there are also string section that blend nicely into the music, combined also with the saxophone work.I don't think this album offers complexity as most of track are quite simple composed and easily digested by the listeners Third is the complexity of the arrangement i.e. the degree in which the instrument (including vocal) being played by the musicians and how they generate a piece of music stream or segment of the music. There were also changes of style as the music flows but they do not move quite offensive so that the changes do not seem to exist. Tht also represents how the band compose the music beautifully.Despite its solid melody this album has another strong point: structural integrity i.e. the degree to which all musical segments, including changes of style, form a cohesiveness of the music as a whole from start to end.Overall, this is an excellent album and it deserves a four star rating. Keep on proggin' ...!Peace on earth and mercy mild - GW"
    },
    {
      "reviewer": "Warthur",
      "date": "Posted Sunday, September 11, 2011",
      "rating": 5,
      "text": "After the lacklustre Indelibly Stamped, Supertramp's lineup disintegrated for a second time, leaving Davies and Hodgson with the unenviable task of rebuilding the band from scratch for the second time in as many years. In doing so, the pair clearly seem to have given some thought to the band's musical direction, and after a few years honing their craft and cooking up no less than 42 songs - the cream of which were selected for the album - they came out with the brilliant Crime of the Century.Most important to the album's success is the brave step taken by the duo in deciding not to go for an all-out prog rock approach; they would take lessons from prog, but rather than trying to imitate their heroes they would craft their own mainstream-friendly sound and bring in prog-like instrumentation and complexity only when they felt that the material truly demanded it. As a result, each of the songs on Crime is a perfectly crafted pop-prog gem, undeniably catchy but at the same time with enough art rock twists to be of interest to prog fans.Granted, the lyrical theme of \"modern life is rubbish\" might be a mild rehash of Dark Side of the Moon, but I'd say that the emotional arc described by the lyrics is a lot more coherent than Pink Floyd's classic, so the band do at least have something new to say there. And when faced with compelling songs like Hide In Your Shell, Rudy and the title track, even hardened avant-garde fans may find themselves warming to Supertramp's crossover magic. The band's masterpiece by a mile."
    },
    {
      "reviewer": "friso",
      "date": "Posted Monday, October 3, 2011",
      "rating": 2,
      "text": "Supertramp - Crime of the Century (1974)A became interested in the band Supertramp after I started listening to the Crisis album, which I really liked. The band has a crossover sound, combining pop as sweet as the sweetest of Beatles songs and intelligent song-writing and composition of the progressive movement. The arrangements are slightly symphonic.'Crime of the Century' is often perceived as their best offering, as if it were their Dark Side of the Moon. In fact, both albums have a lot in common. Both are extremely accessible and have blow-away productions that are simply brilliant. I know a lot of people will disagree with me, but I think of this as the main reason why both album became such classics. Of course Supertramp got to be a major radio band with hits like School and Dreamer.Let us call this a great pop record, but I'm baffled by how high this record ended up in our progressive rock charts. It isn't progressive at all and I can't say the musical style of Supertramp is brave, provoking or that sticky. The songs are all quite catchy and the sound is professional, but in the end it hasn't much more depth then one can expect from standard radio-rock. Furthermore, the kitsch vocal arrangements can be quite problematic and often I feel like Supertramp infests a lot of time in sounding silly.Conclusion. This is a great pop album and the recording is plain brilliant. I myself am going to head on with albums that are more relevant for the progressive genre."
    },
    {
      "reviewer": "Isa",
      "date": "Posted Tuesday, November 1, 2011",
      "rating": 5,
      "text": "|A| Supertramp's beautiful, creative, timeless, diverse, brilliant masterpiece of artistic popular music.Crime of the Century is widely considered by prog listeners and commercial musicians alike to be one of the greatest classic works of art-rock ever created. Many prog listeners believe that artistic integrity and commercial appeal and their audiences are inherently incompatible; this is an album, along with Moving Pictures and OK Computor, that turn that assertion completely on its head, creating radio-friendly music that is simultaneously so creative that it endures the test of time. In fact, I'd say as a musician that it is probably one of the most creative and brilliant albums in my entire collection.The music here is comprised of delicately assorted combinations of rock, jazz, funk, blues, pop, and classical music, utilizing and blending sounds and musical devices from all of those genres to create a completely unique sounding work of art. As well, one of the things I appreciate most about this album is the variation with which these influences are mixed for each track. I don't think there is an album I have where the tracks have such huge differences in their overall sound between each track. And yet they all indeed sound like they're from the same band, same musicians and everything. There's so much depth to listen for in the band's orchestration of parts, especially now that I can hear it with a musician's ear, it's almost scary. Most of the harmonic structure is jazz-oriented, to my liking.I'll give a description of the musical and instrument devices in the first track School, just to give the reader an idea of the diversity they are in for: the opening track School starts off with a bluesy harmonica solo, with a haunting bass figure in the background. In comes the verse with chorused wah-guitar and atmospheric keyboard pads. Then an over-driven guitar rings out a high ringing harmonic drone, which crescendos to lead into a funk driven tutti section. This leads back into a soft jazz-organ playing haunting arpeggios (similar to what the chorused wah-guitar was playing previously), topped with a quick over-driven guitar duet. After the duet fades out, we still hear the soft jazz-organ atmosphere (now joined by the guitar) that is occasionally interrupted by a quick bass/tonal percussion arpeggio figure. The drums sneak in with a flam figure, which crescendos to an exciting tutti latin-jazz felt piano solo, the harmonica coming in the background a little. This leads into the chorus, which has a phat saxophone heavy jazz-funk sort of rock sound. This leads back into the verse, with the vocal melody used during the soft section earlier in the song, only this time with the driving Latin-jazz feel that had been established before the chorus. This climaxes with the singer suddenly by himself singing on the word \"way\" which fades out, and he says by himself, \"you're comin' along.\" Then the instrumentalists all hit a phat last note with a little improv from the drums, guitar, and keybaord. The guitarist finds himself the last playing, ringing out his over-driven stuff again (not as high this time), which decrescendos... very much a concert sort of ending. But, just before the guitar is about to completely fade out, the second track begins with a bang.And this is all done in five and a half minutes.Indeed, the whole rest of this album carries out this sort of creativity in different ways. These guys are obviously incredible musicians and composers, and maybe some of the only true professions in the rock industry (as in knowing this much about music and conveying it so incredibly subtly in their work). This is the kind of album where I notice something I never noticed before in the music, even after listening to it for over half of my life. And if you had it on score, you could analyse the hell out of it for days and always find something incredible that you missed before.One of the glorious recordings of modern artistic music from the last century. Everyone who listens to any form of rock, jazz, pop, ec. should have a copy of this album in their home. And everyone who chooses to go into the music business related to those genres should have it as well. A staple work of progressive rock for the ages. Period."
    },
    {
      "reviewer": "rogerthat",
      "date": "Posted Saturday, January 14, 2012",
      "rating": 5,
      "text": "There are bands who have that one (or maybe a couple) incredible masterpiece that attains classic status to go with a solid and sumptuous back catalogue. Pink Floyd is a classic example of a band with multiple classics. King Crimson is another that delivered on more than one album. On the other hand, you have the likes of Supertramp who got it together on one album and hit the bigtime and...that's it! I am not sure how strongly I would recommend their other albums but Crime of the Century is a bonafide rock classic and especially should belong in the collection of those who love 70s prog and/or art rock. It is not always prog 101, but at times is and is generally a gripping masterwork.In some ways, on Crime of the Century, Supertramp anticipate the direction of rock music in the 80s and onwards. They have that 'big' sound already; just substitute gated drums and you'd be there. The lazy, noodly flavour that say Led Zeppelin were known over and which can be observed in a lot of 70s prog is also absent in their music, which is generally very tightly arranged with barely an extra note. Most striking, though, is the absence of a particularly striking compositional style or gambit that you could pinpoint as uniquely Supertramp. While yet the music does not really sound derivative or generic. It, at least to my ears, sounds distinctive and fresh. Beatles or The Who could be identified by some favoured motifs and likewise Genesis and Yes also have some compositional traits that give them away. I cannot pick up something so striking in Supertramp's music. There are one or two aspects that can be observed consistently that I will come to, but the music is largely influenced by Pink Floyd, Beatles and The Who and doesn't step out of their shadow much. This is a trend one finds with later bands more and more; a distinctive sound without necessarily a distinct compositional idiom.But they have also learned their lessons well from especially Pink Floyd. The studio album format is languishing today as artists attempt to fill disc space with their favourite licks, their favourite styles. Supertramp grasped what Waters and Co seemed to have even earlier: that a studio rock album must have something to say, musically and, if possible, lyrically, if it is to offer a fresh experience to the listener. That is what makes Crime of the Century an engrossing experience. It is just such a focused and intense effort of studiocraft that it commands your attention for at least that reason. It also helps that it is superbly produced, certainly one of the better rock productions of the 70s.One aspect, though, where they trumped even Waters is in understanding their demographic. They understood that rock's biggest audience is youth and their chosen themes reflect careful attention to topics that would interest youngsters. At the same time, they avoid the tendency of 70s Rush to get a bit gee-whiz and somewhat older audiences may also find something to like in the album. Songs like School, Hide in Your Shell among others found and still find an eager audience in college goers and young adults. Roger Waters, of course, implemented all of this on a grand scale with The Wall, an album which to date never fails to draw in young audiences. I cannot really say if it was very intentional or just a fluke as Supertramp followed their heart. But they certainly hit the bulls eye here and the canny Waters eventually cottoned onto it.Supertramp are also a little more sympathetic in their approach, if I might put it that way. The concept here as such is very loose and never overpowers the music. Each song is also capable of being enjoyed on its own steam and not necessarily in running order of the album. Davies and Hodgson's contrasting influences, vocal styles as well as different lead instruments (keyboard and guitar respectively) makes for a lot of variety. Davies and Hodgson's compositions are bound together because both have a knack for writing good pop and there is no let up in the focus and catchiness of the music irrespective of which of the two is dominating the proceedings.Davies has a big, gruff tone but is kind of bland. By himself, he might struggle to hold one's attention for an entire album. Hodgson is (very) high pitched and much more expressive but can get a bit grating at times. In tandem, they are a superb vocal duo, not the best of singers in their individual right, but a very effective combination.Supertramp's music sort of reflects the contrast between Davies and Hodgson. Their mastery of contrast defines the album and accounts for its emotional power. This is particularly noticeable on Asylum but also very effectively used in Rudy. Davies and Hodgson also pace the music impeccably. In spite of the fact that barring one section in Rudy, the album hardly has a really rocking moment, the music somehow never feels plodding or stodgy. Throughout, it is a gripping experience and plenty of drama and tension is beautifully balanced out with Supertramp's mastery of light and shade.And with that I come to the one compositional gambit that Supertramp can be recognized by and are arguably notorious for. The loopy coda. The title track closes with a hypnotic set of piano repeating over and over, with slight variations and giving way to some tearing saxophone. It is so effectively executed here that it sends shivers down my spine. But it is obviously a rather limited trait to define the entire output of a band and Supertramp would struggle to match the quality of this release in subsequent releases.In summary, then, perhaps the only essential Supertramp album for a general collection though others have their stellar moments for the fans. But one that really does belong in a 70s rock collection."
    },
    {
      "reviewer": "GruvanDahlman",
      "date": "Posted Monday, April 29, 2013",
      "rating": 5,
      "text": "Growing up I had the good fortune of having a father not only being a musician but also in possession of a quite extensive music collection, I was exposed to A LOT of really good music. Going through his collection one day in my early teenage years I came across a single with a group called Supertramp. The single contained two songs - \"School\" and \"Bloody well right\". I fell for the first track at an instant and no sooner than I had listened to that song over and over again I discovered the flip side and was equally amazed at what I heard. Since then Supertramp and \"Crime of the century\" has followed me along life's path, always making me feel at home and thrilled with it's magical contents.It is, in fact, a question of everything coming together, which it sometimes do every 1000 years or so. The stars are aligned, there is water in the well and the tax return makes you giggle with contentment. When Supertramp sat down and recorded this amazingly brilliant piece of vinyl everything came in place. I cannot stress just how brilliant an album this is. From the very beginning of the first second to the last, trembling one the music is perfect in every sense: the lyrics, the vocals, the instrumentation, the order of the songs, the cover and even the price tag is flawless.I will not go into the tracks one by ne, since there is no point when every song is as perfect as it is humanly (or outworldly) possible. There is jazz rock in the vein of Chicago about the same time but proggier, more tender and harder than they were. The music is a perfect mix of everything you could imagine in the world of prog. I'd say there is more jazz rock than actual prog but then again what does that mean? I honestly don't know. Supertramp is not Yes, if that's anything to go by, but the structures of several songs are clearly progressive.The point is, however, that the album \"Crime of the century\" is flawless. I could go on about it's qualities forever, raving like a mad man but I won't. I'll end this review before I fall to pieces with excitement and beg you, if you haven't already, to listen to the thing and hopefully you'll get my drift, my point and justmaybe share my obsession with it. Supertramp were never better than this and frankly I wonder if music ever was. I know I'm raving but that's the beauty of it all, you're allowed to when music is as brilliantly conceived as this. I guess the divine forces of our universe had a hand in the making. They had to have been."
    },
    {
      "reviewer": "Magnum Vaeltaja",
      "date": "Posted Saturday, October 3, 2015",
      "rating": 3,
      "text": "A classic album that, for me, is split about 50/50 between masterpieces and misses.As far as a general idea of the sound of the album, one can expect emphasis on soft, tender keyboards, dramatic vocals, occasional jazz influences and the album's mood can change from lush and serene to chaotic quite quickly. Supertramp's performance on this album could be compared in a sense to early King Crimson (i.e. Court, Wake of Poseidon) but much more controlled and having a much heavier pop appeal. That isn't to say that it's a pop album, or boring, though; it definitely has its moments.The stronger tracks on the album are the opener \"School\", its follow-up \"Bloody Well Right\" and the finale title track. \"School\" is an incredible odyssey of sounds starting with a bleak harmonica intro giving way to haunting verses and featuring impeccable piano melodies. Definitely a top notch song. \"Bloody Well Right\" is a great jazz and blues-fused rock song and \"Crime of the Century\" is a powerful, haunting finale. A great start, a great finish. What lies in between these stellar bookends is not quite of the same caliber, though.The remaining two songs from side A, \"Hide In Your Shell\" and \"Asylum\" are good but non- essential listening. \"Asylum\" in particular is probably the most dramatic song on the album. Most of side B is expendable, with the poppy \"Dreamer\" and the ballad \"If Everyone Was Listening\" making me sleepy; \"Rudy\", though, is at about the same standard as the material on the album's first side.Overall \"Crime Of The Century\" is a work that features some incredible moments and would not be out of place in any prog music collection."
    },
    {
      "reviewer": "FragileKings",
      "date": "Posted Thursday, June 9, 2016",
      "rating": 4,
      "text": "Supertramp is a band I've known about since I first became interested in pop music. I can recall visiting a friend's house while still in elementary school and he let me listen to Black Sabbath's \"Iron Man\". I saw the album cover for \"Crime of the Century\" and never forgot it. Supertramp, however, were not my taste in music. I remember hearing songs like \"It's Raining Again\" (catchy chorus but nerve grating vocals), \"The Logical Song\" (pretty good actually), \"Bloody Well Right\" (kind of good), \"Give a Little Bit\" (kind of catchy), and \"Dreamer\". That last song there was the reason why I never got into Supertramp. To me it was one of three most annoying songs on classic rock radio, along with War's \"The low. Ry. Duh. Is a little lower\" (like who the fudge cares?!) and that song that went, \"Blinded by the light / Wrappped up like a douche / Another runner in the night\". What were these people thinking to write such tripe like that?Strangely enough, I always associated Supertramp with Pink Floyd in my late elementary school days. Perhaps it was because \"Money\" and \"Another Brick in the Wall Part 2\" and \"Bloody Well Right\" and \"The Logical Song\" seemed to have been concocted by the same cultural views of the same culture. The big difference was that by the time I was 16, I loved Pink Floyd but still wouldn't go near Supertramp. It would not be until 2016, when I had reached the ripe old age of 45, that I would finally permit a Supertramp album into my music library (three albums in fact as I ordered two more soon after). The change came after I went through a period of fascination with French Canadian 70's prog and I read that many English prog bands had achieved their first success in North America in Quebec. Bands like Genesis, Camel, Gentle Giant, Yes, Pink Floyd, King Crimson and Supertramp were popular among the Quebecois. I had albums by all except for Supertramp and so I decided to give the band a try.\"Crime of the Century\" is the highest rated Supertramp album on PA and so I figured that was the best place to start, though I was soon dismayed to discover that the dreadful song \"Dreamer\" was on this album. The order arrived and I brought the disc home, plugging it into my iTunes library and dumping it onto my phone. Thus the journey began.I was surprised to recognize the first track \"School\". I had heard it before and perhaps it is the laughing, playing children that reminded me of \"Another Brick in the Wall Part 2\". That and the theme of the English school system. The song certainly goes beyond the standard pop song, sometimes sparse and atmospheric, sometimes building towards a jaunty pop segment but then dropping abruptly into sparsity and quietude again. It's very well arranged and from this it's already easy to understand why Supertramp would be considered progressive.\"Bloody Well Right\" turned out to be my favourite and that darn chorus jammed itself into my brain for days. The song is the only one to feature a hard rock guitar sound and that's probably why I can take to this song so easily.\"Hide in Your Shell\" begins so candy pretty like that I get turned off right away each time it begins. But it does pick up and become more interesting as the music develops. My least favourite song on the album but still not a total write off. I much prefer \"Asylum\" which, like \"School\" reverts to quiet piano whenever the music builds to a climax. Richard Davies insane howls and hollers at the end fit right in with the music.I'll have to admit that listening to \"Dreamer\" on the album is not so bad and in fact the song goes through some twists and changes so that the annoying \"Dreamer / Your nothing but a dreamer\" is actually a small part of the song. The middle part where Richard Davies sings is much more enjoyable and more in tune with what Supertramp seemed to be trying to do with their music at the time. There's also a lot of subtle instrumentation I can hear on the CD that I missed by walking away from the radio every time the song came on at work back in the 90's.A word of mention should go towards \"Rudy\", which starts off pretty quietly but builds again in a beautiful fashion and really hooks me when the 70's strings come in in the last 3 minutes or so. When Davies and Hodgeson trade vocal lines the song really reaches its apex.The album overall intrigues. It's not highly technical prog nor is it really very rock-like except for that guitar in \"Bloody Well Right\". There's a lot of piano and organ and not much guitar. The drums and bass also are pretty standard for the day and neither would make it to a list of top ten for the instruments. But the song-writing, and the musical construct shows great creativity and attention to detail. Supertramp show that they can alternate between the loud and the soft within a single song. The whole band can come in to hit a single note and then drop out, leaving just the piano or organ. There are rises and swells, peaks, and sudden punctuations of silence. The songs are not entirely predictable and tease by going toward straightforward pop but only briefly. It's an album for those who can appreciate very fine song writing and crafty music that doesn't aim to be loud and technical but rather cleverly creative and full of poignancy and emotion.The eight songs on the album alternate between Roger Hodgeson's and Richard Davies' lead vocals. I personally enjoy Richard Davies songs more but not so much more. I just prefer the timbre of his voice more over Hodgeson's. The piano parts are often skillfully composed and sometimes a stand out feature in a song, like the closing of the title track.I will admit that because the music doesn't rock out except for on \"Bloody Well Right\", Supertramp don't appeal to me as much as the other bands mentioned above. However, that doesn't stop me from appreciating the artistic merit and musical talents on this album. I'll give it a solid four stars, hesitating with that one extra star."
    },
    {
      "reviewer": "VianaProghead",
      "date": "Posted Wednesday, June 14, 2017",
      "rating": 5,
      "text": "Review N� 124'Crime Of The Century' is the third studio album of Supertramp and was released in 1974. It's the first Supertramp's album to feature its classic line up and was co-produced by Ken Scott, an English experienced record producer and recording engineer, who previously worked with other famous artists and bands like David Bowie and The Beatles.The line up on 'Crime Of The Century' is Roger Hodgson (vocals, guitar, keyboards and pianos), Rick Davies (vocals, keyboards and harmonica), John Anthony Helliwell (vocals, saxophones and clarinets), Dougie Thompson (bass) and Bob Siebenberg (drums and percussion). The album had also the participation of Christine Helliwell, Vicky Siebenberg and Scott Gornham (backing vocals) on 'Hide In Your Shell', an unaccredited and unknown street musician (musical saw) on 'Hide In Your Shell' and Ken Scott (water gong) on 'Crime Of The Century'.While not properly a conceptual album, there is much recursion and referencing among the tracks. Lyrically, many of these tracks deal with themes of youth, isolation, loneliness and mental stability, leaving many to initially compare the group to Pink Floyd. So, we have education with 'School', dream with 'Dreamer', love with 'Rudy', shyness with 'Hide In Your Shell' or authority with the title track. However, the musicianship and style of Supertramp is obviously distinct, which has become evident over the past four decades. Every track is instantly recognizable as Supertramp, and the album, as a whole, runs together perfectly well, as we can expect from all the greatest albums.'Crime Of The Century' has eight tracks. All songs were written by Hodgson and Davies. The first track 'School' has lead vocals by Hodgson and Davies. It's an amazing and fantastic song to open the album. I always loved this song, and as far as I can remember this was the first song I heard from the group. For me, it's one of the best songs composed by this fantastic duo. The second track 'Bloody Well Right' has lead vocals by Davies. It's the second song of the album released as a single, after 'Dreamer'. For the type of music of Supertramp, we may say this track is almost a hard rock song with a little funky rhythm. Despite be a very good song, this isn't one of my favourite songs on the album. The third track 'Hide In Your Shell' has lead vocals by Hodgson. This is without any doubt one of the highest points of the album, and consequently, it's one of my favourite songs too. This song is a real masterpiece of the melodic progressive rock with a supreme musical melodic structure. It's one of the best progressive melodic songs ever made. The fourth track 'Asylum' has lead vocals by Davies and Hodgson. It's an interesting and nice melodic song mostly performed on piano. It's a song very well composed with good orchestration, but like 'Bloody Well Right', isn't also one of my favourite songs on the album. The fifth track 'Dreamer' has lead vocals by Hodgson and Davies. It's the song chosen to be the hit single of 'Crime Of The Century'. It's an irresistible melodic song that became a big hit, reaching the top of the charts. Its impact was so big that we can say that 'Dreamer' was one of the most popular singles made by any progressive band. It only can be compared with 'Money' of Pink Floyd. It's the pop touching on the album. The sixth track 'Rudy' has lead vocals by Davies and Hodgson. It's another great song and it's the lengthiest too. It's one of the most progressive, sophisticated and elaborated songs on the album. It has rhythm changes and instrumental breaks, which makes of it a fantastic progressive track. The seventh track, 'If Everyone Was Listening' has lead vocals by Hodgson. It's probably the most melodic and beautiful song on the album. It has a light and easy listening tune and beautiful vocal harmonies. The orchestration is also really beautiful. It's the living proof that it's possible compose very beautiful songs with great quality. The eighth track is the title track, 'Crime Of The Century'. It has lead vocals by Davies. It's the song which closes the album, perfectly. This is another highlight on the album and it's also one of my favourite songs. For many, this is also its best track. It's the magnum opus of the album. It's a wonderful song with an orchestration completely divine. This is one of the best final tracks I've ever listen on any album. What a song!Conclusion: As I said before, 'Crime Of The Century' was my first introduction to Supertramp. It's a great progressive melodic album where many of the songs have some complex structures with strong melodies. 'Crime Of The Century' is without any doubt one of the most progressive albums of the group and it's also one of their best musical workings. It's one of the landmarks of the 70's and is among some of the best progressive studio albums ever made. The sound of 'Crime Of The Century' just takes you into another world. It's one of the few albums I know that perfectly combines catchy songwriting with the epic darkness of the progressive rock music. I don't think any of Supertramp's other albums come anywhere close to this. I love some of their other stuff too, but there is just something special about this album. It isn't simply a progressive rock album. It's a piece of art. This is really why I like progressive rock music.Prog is my Ferrari. Jem Godfrey (Frost*)"
    },
    {
      "reviewer": "jamesbaldwin",
      "date": "Posted Wednesday, June 10, 2020",
      "rating": 5,
      "text": "After the first two albums, often underestimated, and the dissolution, \"Crime of the Century\" presents us the classic Supertramp line-up, and songs that have made history.Side 1 1. School (5:35). The opening song of the album features Davies' very poignant country harmonica, followed by Hodgson's voice, which can create problems for various listeners due to the high pitch and at times shrill. Then the piece has an almost syncopated rhythmic progression, in blues style, where Hodgson proves that he has learned to play the electric guitar well. Finally comes the jazz piano interlude, which sees Davies in great dusting, and then comes the fourth phase, the best, with the alternating voices of Davies and Hodgson, very convincing. In the end the blues piece returns with only Hodgson to successfully conclude this piece, in fact a mini-suite that best expresses the syncretic ability of the group - as well as their ability, taken by the Beatles, to create a refined song for arrangements and musical styles but very usable, very commercial, also suitable for supermarkets. Rating 8,5.2. Bloody Well Right (4:26). The piece starts with a jazzy piano, very emphatic and winking, then Hodgson's hard- rock guitars arrive. When Davies starts singing, it seems almost heavy metal, for a few moments, but then the beatles-style pop choirs come to remind us that this is always happy and playful music, even when it wants to be bad, angry or dramatic. Finale with sax solo. Original song for Supertramp, which combines jazzy piano with almost heavy metal guitars. Simpering. Rating 7,5/8.3. Hide In Your Shell (6:52). Melodic pop song in retro style, almost like a Broadway musical from the Fifties, daughter of the most cheerful and with choirs Beatles songs (It Wont Be Long or Hold Me Tight). Hodgson's voice is overpowering and shuffling and the choirs make it worthy of the Bee Gees and of the soundtracks that will be the setting for John Travolta's films. The three verses are almost melancholy, then in the choruses the song comes alive and Hodgson's high tones become shrill, and they may like it or not. But in the progression that reaches the chorus the song seems like the soundtrack of a Broadway musical. Rating 8.4. Asylum (6:30). Davies' piano ballad that begins as a song by Elton John, flat, easy, without jolts, only that Davies' voice is not as clear and melodic as that of Elton John. Then the ballad warms up, the drums arrive, the electric guitar arrives, and also the string arrangements arrive, which weigh down the piece. There are also interludes for dialogue with Hodgson's falsetto voice. Production and sound are not working at their best, and the performance is also not perfect. Pleasant song, very pop, very theatrical musical for teenagers. In two words: overproduced and kitsch. Rating 7+.Side 2 The beginning is marked by 5. Dreamer (3:19), short song, commercial, all shrill voice of Roger Hodgson and electric piano played percussively. Brilliant in its own way. Song in three phases: initial exalted piece, reflective piece in the middle, with Davies' voice to give a more baritone and cavernous tone, then return of the initial exalted piece, with greater emphasis and percussion. Repetitive text with phonetic rather than semantic value, aimed at amplifying the sound of music. Rating 7,5/8.6. Rudy (7:07). In my opinion it is the masterpiece of the album. Excellent jazz piano beginning, Davies' voice accompanies a music suspended between jazz and boogie which gradually becomes more rock and roll, but always with very catchy sounds (guitars and keyboards). The hard rock guitars played by Hodgson are as tacky as those of Queen, and the atmosphere becomes emotionally intense only when the piano remains. Supertramp always struggle to have a \"serious\" sound, everything in them tends to become comics or musicals, but here they strive to give it a lot, and so comes a very pressing orchestral piece where the alternating voices of Hodgson and Davies give the best of self in being up to the dramatic tone, and perhaps their best vocal duet ever comes out, concluded in the final by Davies alone, finally intense and convincing. French sentimental film ending. Rating 8.5 / 97. If Everyone Was Listening (4:05). This is the only song on the album that has not become a classic of their discography and concerts. Initially we hear Hodgson, how strange !, singing on the low notes in what is a piano ballad, which soon goes upbeat, on the major key. It is the only song with a little catchy melody, but well arranged and all in all not very playful. It is certainly a true songwriting, almost a solo piece by Hodgson, where Helliwell's clarinet stands out and the arrangement of strings towards the end. It is one of the most serious songs on the disc, which continues the seriousness that began with Rudy and which ends with Crime. Rating 8.8. Crime Of The Century (5:20). Final piece among the most epic of the group's discography. Almost dramatic beginning enshrined in Davies' voice, neutral (we are used to hearing it sarcastic and grotesque) which, however, does not touch true heights of pathos. Then an instrumental variation starts based on a piano motif that becomes more and more emphatic, up to paroxysm, thanks to the orchestration and the final arrival of the saxophone: at that point yes the music touches the dramatic, intense climax which it sought, worthy of a movie. Rating 8+This is not prog. It's symphonic pop, heir to the Batles, with a touch of jazz, a touch of country and hard-rock, based on the melody, very easy listening, with vocal parts worthy of a Broadway musical. But the mix of this music is original, very usable, and certainly creative. It is syncretic music, with the ability to make commercial, accessible to all elements of various musical genres. The same qualities as the Beatles. Small masterpiece.Medium quality of the songs: 8. Rating: 9. Five stars."
    },
    {
      "reviewer": "A Crimson Mellotron",
      "date": "Posted Sunday, February 20, 2022",
      "rating": 5,
      "text": "A timeless classic for a reason! There are bands that at a certain point in their career release albums that simply go on to transcend their age or just define their entire body of work with the sheer excellence and apex creativity, pieces of work that mark the pivotal point in which the stars align and a group of immensely talented musicians go on to create something with a seemingly divine touch, something that sounds strikingly good in any decade - Supertramp's 'Crime of the Century' is one such album, recorded and released in 1974, this is the band's third studio LP, one of the most comprehensive and cathartic albums to have ever graced the ranks of rock music.Whether you are in for the pop-tinted sing-along pieces of Roger Hodgson, or the heavier prog-infused compositions of Rick Davies, this album will certainly satisfy the needs of even the most pretentious of rock connoisseurs with its mind-blowing musicianship, the fantastic, intellectual and sometimes provocative lyrics, the graceful songwriting and the unforgettable suspense of the longer songs, alongside the moments of joyous climaxes, present in numbers on this record. As for the songs on 'Crime of the Century', we can safely state that the album is packed with 70s classics - opener 'School' is one of the most recognizable songs by Supertramp, a beautiful build-up at the beginning leads to the vibrant verse, with Hodgson's fabulous singing impressing all along the way; 'Bloody Well Right' is another more accessible number, this time having Davies singing the leads; we could say it is his attempt at writing an upbeat pop hit. Then things become a hair more serious with the 7-minute 'Hide in Your Shell', a gorgeous philosophical exploration with dreamy keyboards and stunning musicianship. Side one concludes with Davies' 'Asylum', a very strong prog rocker, absolutely theatrical and contrasting starkly with the more lightweight tone of the previous songs.Side two opens with 'Dreamer', a song that needs no introduction. Then comes the fabulous 'Rudy', probably the best song on the whole record (this is an entirely subjective statement, of course) with the jazz-tinted playing of Rick Davies, and the gradual unfolding of the whole composition into a cinematic prog rock fiesta that could easily rival the strongest moments of Yes, King Crimson or ELP. 'If Everyone Was Listening' is a lovely Roger Hodgson piece, a bit more mellow that the rest of his songs on this 1974 classic album, and finally there is the title track - a wholesome ending to a very otherworldly listening experience, and another very strong example of these musicians' impeccable abilities to write engaging, magical songs, full of essence and charming charisma.I firmly believe that everything about 'Crime of the Century' has already been said; What is left for us now is just to embrace its qualities, and praise the immense beauty of this 44-minute stellar release that showcases how intense and flamboyant the crossover between prog rock and pop could be - intricate, layered, suspenseful, melodic and maybe happily melancholic, this album is one of those very special LPs that could be tagged 'perfect', depending on how you perceive it and how open-minded you are."
    },
    {
      "text": "Why do I have to rate this three stars... Why do I have to rate this three stars... Why do I have to rate this three stars... Wow, I mean, this could have been one monster of an album. As it is, it's still a great entry and, in my not so humble opinion, ranks as one of Steve Hackett's best albums. But didn't he 'proofread' or, at the very least, get the inkling that maybe, just maybe, some of the 'vocals' on this album needed 'improving'? I very much enjoy his singing. His vocals are very sincere and heartfelt. But sometimes he delivers a very weak vocal. Now this album ain't what you would necessarily call full on 'prog', it's sort of a mongrel mix, with almost half the album being progressive rock instrumentation, with three intrumentals and two songs that are half instrumental (like the Genesis SONG Abacab, the second half is all intrumental). The remaining four and two-halves seems dedicated to 'stadium-rock' or the like, which was popular at the time. 'Give it away' - wow, this sounds JUST LIKE Boston, complete with Tom Scholz style guitar and Steve's vocals even sound a bit Brad Delp. Sure, we ain't talking about prog, I get that, but this is ONE BLISTERING rock n roll cut that would have made any AOR band mighty proud. 'Wieghtless' - this is a far more laid back song and feels nice. I don't know exactly what to compare it to... it could be a complex ballad for an AOR band or someone like 10 CC, but I just know it's really nice... 'Cell 151' - sadly, this is the closest thing Steve ever got to a 'hit', It'd have been great if he'd had a few hit singles. The best things about this song are the second half full of excellent, progressive rock instrumentation (including a brief snippet of what would become 'Matilda Smith Williams') and Steve's dedicated vocal delivery. The main part of the song is VERY MUCH like Trevor Rabin territory. Then, there is of-course, the three instrumentals 'Hackett to pieces', 'Always somewhere else' and the best one, 'Group Therapy', all worthy songs, though not as hard-edged as, say, 'Please don't touch' or 'Slogans'. Everything seems fine, so why oh why was I complaining before about giving this album three stars? A bunch of great rocking songs, progressive enough when it needs to be, top notch songwriting, surely it's worth at least a four. Well, 'Walking through walls' is a fine, shuffling rocker' with insistent beat, good to sing along to the chorus, but the vocal is very weak and ruins the song. 'India rubber man' is a truly second rate track. The title might or might not be a reference to the famous Ritchie Havens song 'Indian rope man'. The comes the most frustrating song 'Camino Royale'. It's not only the most progressive sounding vocal track here, with some mesmerising instrumental sections, but it's also THE MOST CATCHY. The chorus is dang infectious 'Only the fool / learns to get through' (I think that's what Steve says). But a rather weak and mumbled vocal delivery, and buried under instruments, ruins the thing, rather than shining and making it probably the best song on the album. So, it's a semi-spoiled prog meets arena rock masterpiece. Three stars Brendan | 3 /5 | 2013-12-2 MEMBERS LOGIN ZONE As a registered member ( register here if not), you can post rating/reviews (& edit later), comments reviews and submit new albums. You are not logged, please complete authentication before continuing (use forum credentials). Forum user Forum password Social review comments Review related links Send comments to Brendan Report this review (#1084231) Buy STEVE HACKETT music online with PA partners Show all STEVE HACKETT MP3/Stream Go to STEVE HACKETT page for videos, full discography with ratings, reviews and much more Go to Highly Strung page for more details, where to buy and ratings/reviews Search the Forum for STEVE HACKETT related discussions",
      "reviewer": "Brendan",
      "date": "2013-12-2",
      "rating": 3
    }
  ],
  "source_file": "album9b25.html",
  "last_parsed": "2025-05-18T00:09:22.073894"
}